{
  "reportId": "14814",
  "title": "Father and son nighttime roadside sighting in the Wet Mountains southwest of Pueblo",
  "date": "1998-07-25",
  "timestamp": 901324800,
  "observed": "In late July of 1998 my youngest son (who was 18 then)and I lived in Western Arkansas and took a week-long camping trip to the Wet Mountains in Colorado west of Pueblo.  I had done most of the driving to get there and we arrived there well after midnight searching for a place to camp and fish.  My son does not enjoy crowds when camping so we looked for some place \"out of the way\" yet not too remote.  We drove up a forest service road near Ophir Creek looking for a campground we had seen a sign for.  As I recall it was probably three or four in the morning.  I know it was still dark outside.  We located the campground, but unfortunately it appeared to be operated not by the Forest Service but by a private individual who had very opposing views to the government and authority in general, as evidenced by a very descriptive sign at the entrance to the \"campground\".  My son and I continued on up the forest service road toward a place we later found to be Blue Lakes near Greenhorn Mountain.  As we were driving up this road which wound in an out of pine trees and open meadows we came to a long straight stretch of road.  As I approached this straight part of the road I notice a small \"pocket\" of trees illuminated by my headlights on the left side of the road.  The trees bordered the road there, but it was open meadow leading up to the pocket of trees.  In the center of the stand of trees I saw an orange light that I at first took to be a reflector on a pole or stick marking the road. As I got within twenty or thirty yards of the trees I seemed to notice movement and thought someone was walking in the trees and smoking a cigarette and I was seeing the \"cherry\" at the tip of the cigarette.  I still felt no cause for concern and remember thinking facetiously that it was one of the \"Ophir Creek Campground Wackos\" out for a four in the morning recon. I continued to drive up the road and watched the orange light fade as the lights no longer shined directly into the trees.  As we rolled by my son said \"Dad?\" in a questioning tone.  He had seen the orange light/reflection also and was pointing into the trees to the left.  I noticed a large rock in the periphery of my headlights and something standing behind the rock turning it's head to follow the movement of my truck as we drove past the trees at the edge of the road.  It was probably ten to fifteen feet off the road.  I started to brake but something inside said don't stop so I didn't.  What I saw in those few moments was definitely humanoid or bipedal, whatever you want to call it.  It was standing perfectly erect, not slumped and was definitely watching my pickup and turning it's head and upper body to keep my truck in sight.  The large rock hid the lower half of the body but I could see a vague outline of it's torso (from about where the navel would be on a human being), shoulders, and head as I passed.  I do not recall seeing any distinct outline of arms in the very brief time this happened.  I would say the whole incident took 15 to thirty seconds to transpire.  I drove on up the road watching my mirror but saw nothing in the red glow of my taillights.  I looked over at my son whose only comment was, \"did we just see what I think we saw?\"  I told him \"yes, I think we did.\"  We drove on up to Blue Lakes and talked about what we had seen and then took a short nap (with the doors locked) waiting for daylight so we could set up camp.  Later that morning after daylight had come and we set up camp, we drove back down the road to the stand of trees and got out to look around.  The ground was covered in pine needles (except the road area and a creek bed about twenty of thirty yards away.)  We both stood by the large rock and realized the \"creature\" had to have been 7 to 7-1/2 feet tall because the top of the rock was at the level of our chests  (he and I are 5'10\" tall).  We found one spot in the edge of the road where it appeared something had come down off the hillside on the right side of the road.  There were no distinct tracks in the packed gravel of the road, but there were two spots where small rocks (maybe thumbnail size) had been disturbed and pushed from the roadside toward the hillside (90 degrees from the direction of normal vehicle travel).  I took several photos of the stand of trees, the large rock, the marks on the roadside and an indistinct depression in the moist edge of the creek.  There was nothing that specifically proved it was a Bigfoot standing in those trees watching us drive by, but my son and I have no doubt that it was.",
  "classification": "Class A",
  "county": "Custer",
  "state": "Colorado",
  "latitude": 38.0654,
  "longitude": -105.1137,
  "location": "-105.1137,38.0654",
  "location_details": "I don't recall the number of the forest service road, but if you drive west on S.H. 165 and go past Lake San Isabel, it goes to the left off the highway and then heads west and south back toward Greenhorn Mtn to the Blue Lakes.  This sighting took place shortly after the private Ophir Creek Campground which was also on the left side of the forest service road.",
  "temperature_high": 78.61,
  "temperature_mid": 70.125,
  "temperature_low": 61.64,
  "dew_point": 59.52,
  "humidity": 0.77,
  "cloud_cover": 0.56,
  "moon_phase": 0.07,
  "precip_intensity": 0.0116,
  "precip_probability": 0.51,
  "precip_type": "rain",
  "pressure": 1015.59,
  "summary": "Rain starting in the evening.",
  "uv_index": 10,
  "visibility": 9.08,
  "wind_bearing": 288,
  "wind_speed": 0.66
}