{
  "reportId": "21674",
  "title": "Man describes incident in teen years: Daylight encounter by two young men in the Green Valley area",
  "date": "2007-10-10",
  "timestamp": 1191974400,
  "observed": "First, as a matter of background, I want to tell a little about myself. It will help explain the delay in ever having reposted this incident. The sighting occurred about three months prior to my entering the United States Army. I served for three years as a Paratrooper with a Top Secret Clearance. After my time in the service, I became a Los Angeles Police officer. I did that for thirteen years and am now a Federal Agent, working for an O.I.G. out of Washington DC. With that background, you can probably understand my reluctance to discuss this sighting with too many people. It really boils down to a potential career killer. That being said… the incident DID occur and I remember it vividly. Many many years after the event, I reconnected with my friend (the witness) and asked him to tell ME the story as he recalled it. I wanted to check my memory and see if his matched mine. It did…. To a T! Only a few months ago, I spoke with my brother in law, a witness after the fact. I asked him if he remembered the event…. He did. It should be known that he is not the kind of person that would \"buy into\" such a story, had he not been semi involved. Anyway, this is what happened: My friend Craig and I were both 17 years old and waiting to leave for Army Basic Training. He was due to leave in June and I would go in August of 1980. We were staying with my Sister and Brother in Law at the time. They lived in a cabin in Green Valley California. Craig and I enjoyed our last months as civilians in that area, and used it to train for the difficult training ahead of us. We ran every day along the mountain roads and hiked the hills, trying to get into prime shape. In May, we decided to test ourselves and camp out for a full seven days. We knew the perfect place for this would be what we called \"The old campground\" because of its isolated surroundings and terrain that would be perfect for climbing and hiking. So, we packed up a weeks worth of supplies and, though my sister Cindy and her husband Tom offered to drive us, we decided to act like soldiers and walk to the location. We did this with full packs. My sister and Tom advised us that they would check on us at least every other day and that they would bring us food and lemonade and such. Tom also, offered to provide us with two weapons to be used for protection against any strangers that may try to harm us. After all… this was before cell phones and we would be on our own big-time. There was also a heavy rattlesnake threat in that area, so we happily took him up on the offer. Tom met us at an area near the mine shafts later that day and gave us an M-1 rifle and a 12 gauge shotgun, with ammo for both. The dirt trail that leads off of the main highway goes very far back into the mountains. In fact, were you to traverse it to its end, you would end up on top of what is known as Grass Mountain. Craig and I decided to get about three miles in and away from the highway, which was about a mile past what once was an old 1920s campground, and live deep in the bush like soldiers would. We found a great spot, next to a clear running creek and set up our tent in the clearing that was there. This clearing was completely surrounded by thick woods. Then…… night fell. As we lay in our tent talking by the light of flashlights, we both heard the very loud snap of deadfall in the woods behind the tent. We sat up, frozen and listening. We heard what sounded like a very large and heavy person, slowly walking around our site, making no effort to conceal his presence, judging from the loud sound of breaking sticks and brush. We were both scared believing that someone was out there. We exited the tent, Craig with a shotgun and me with the M-1. I started yelling very loud. \"Hey! We know you are there. We have guns and will shoot!\" Again, we heard the sound of someone walking slowly but methodically around from our left to right. We shinned our lights in the direction but could not see anything but the trees and brush. We talked amongst ourselves, wondering if it could be a bear or something, but we decided that it was a person and not an animal. After much yelling and warning that we would shoot, I decided to fire a few rounds in the direction of the noise (how crazy that sounds now) and I did just that. I fired about three rounds into the trees and the sound was unbelievable. The weapon blasted and the sound echoed into the night, roaring into the canyons and fading off into the night air. We stood in silence. To our utter disbelief and eventual horror whatever it was, began to move again, still left to right, in a circle around us. What we both thought and discussed later, was that NO animal would have stuck around after the horrific noise of the M-1. Most normal people would not have stuck around either! Whoever or whatever was out there not only stuck around, but appeared, from the casual sound of the slow walking, to be less than concerned about our weapons. We made a decision to vacate the area post haste! Grabbing our coats, we climbed the embankment up to the dirt road, and carrying our weapons, we ran the entire way, about three miles more or less, back to the main highway, San Francisquito Canyon Rd. We spent a very long night, curled up in a concrete drainage ditch, waiting for the sun to rise. Every hour or so, a lone truck would come by and the sound of that brought us comfort. Again, it was a long night! The next day, we hiked back to the site, expecting to find our tent and all of our supplies missing. To our surprise, everything was as we had left it. Nothing was out of place. We gathered our things, and hiked back to the open area of the old campground. We decided not to sleep in the tent because it limited our vision, and instead, laid our sleeping bags out in an open area, above the creek. After a day of climbing cliffs and cooking and such, night fell again. That night, just as the sun set and darkness was beginning to fall, Craig and I were walking in the direction of the main road. We were looking for rattle snakes, because we had shot one earlier on the dirt road in the same area. As we walked side by side with me on the left, both holding weapons, we saw it. Standing just on the dirt road, facing us was a Bigfoot. There can be NO DOUBT at all about what it was. We could see it very clearly. He was about eight or nine feet tall and stood with his left shoulder even with the edge of the trail. He was covered with dark hair and had long arms. We did NOT smell anything unusual, as I have since read about other sightings. The strange thing about him was the absolute indifference in his expression. He did not look threatening. He did not look scared. He just stood there looking at us….almost bored. I instinctively brought my right hand up against Craig's chest and we both stopped dead in our tracks. We never took our eyes off of the Bigfoot as we spoke. I said, \"Do you see that? Are we seeing this?\" Craig said, “What do we do”? “What should we do?\" We both started to walk backwards as we spoke, very slowly and involuntarily. The Bigfoot just looked at us for a few moments. Then, and I will NEVER forget the detail of this…… he just slowly and very casually turned to his left, and began to walk into the forest. When he did that, Craig and I stopped and started talking over each other. \"Do we shoot it? Should we shoot it? What do we do? Do you want to follow it?\" As we talked, we heard a sound that we both immediately recognized from the prior night, the sound of the Bigfoot slowly walking deeper into the woods, breaking deadfall, twigs and branches as he went. We never did fire a shot or follow him. We stayed up late and slept in shifts at the campground and did not hear from the Bigfoot again. The next day, Tom came up with food and supplies. We ran to him and told him the details of what had happened. It was very clear by his expression that he did not believe us. We took him to the exact spot where we saw the Bigfoot and we discovered a trail of giant footprints leading from the trail into the woods. Tom smiled and told us that we did a good job making them. We were so frustrated and begged Tom to follow the tracks with us. We all followed them and they went into and across the creek. On the other side, we found a large red ant hill with a footprint right on top of it. I asked Tom, how could we have done that? He just shook his head and smiled. We followed the tracks to a point where two large hills formed a valley that sloped upwards into the mountain area. The ground turned rocky and the prints stopped. That is what happened. I have lived with this memory for many years. I am now Forty Five years old and am less concerned about what people think of me in terms of this incident. It is a fact and because of it, I know for sure that Bigfoot lives or at least once lived in the area of Green Valley California.",
  "classification": "Class A",
  "county": "Los Angeles",
  "state": "California",
  "latitude": 34.6167,
  "longitude": -118.4333,
  "location": "-118.4333,34.6167",
  "location_details": "Going North from Santa Clarita, get onto the San Francisquito Canyon Rd. for approximately fifteen miles, then take the dirt road on the left which would be the South Portal Canyon Rd. which is just a couple miles before you get to the Green Valley turn off. Take the dirt road (it’s a fire road that leads to Grass Mountain) for about 3/4 of a mile. You will pass an old church camp on the right...keep going. Start looking for two old mine shafts...one on the right and the other on the left. You are now in the right area.",
  "temperature_high": 71.68,
  "temperature_mid": 60.41,
  "temperature_low": 49.14,
  "dew_point": 38.8,
  "humidity": 0.46,
  "cloud_cover": 0.03,
  "moon_phase": 0.99,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.79,
  "summary": "Clear throughout the day.",
  "uv_index": 6,
  "visibility": 9.96,
  "wind_bearing": 238,
  "wind_speed": 7.42
}