{
  "id": "33908",
  "title": "Woman drives car over subject lying on road near Everson",
  "date": "1995-07-05",
  "timestamp": 804902400,
  "observed": "I was driving home with my baby girl late after visiting her grandma one July night, I think it was the 4th of July weekend. I was coming up on a corner with a guardrail to my right, there is a gully with a creek at the bottom, and a telephone pole about 3 feet from the end of that, I was going 35 mph. When I was almost arond this corner my lights started hitting something that I thought was a telephone pole or a guardrail at first but I knew that it was something crouched down on the last cement guardrail post as I got closer. When I got closer the thing stood up from almost sitting on it's heels and jumped into the middle of my lane and threw it's hands up in the air, I'm thinking about 8' total from a crouching position, I think trying to make itself look bigger. I think it was only around 7 feet tall, it didn't seem that much bigger than my stepdad and brothers who are 6'2\"-6'4\". I was so shocked, I could not believe what I was looking at, totally stunned. It was all black and definately not a bear, I've seen a black bear and it was definately not that. It's arms stretched high like a man's not like a bear and I didn't see a longer nose like a black bear has, it was like a man not a dog's face. I think as soon as it realized I wasn't stopping it laid down on the road right in front of me and I ran over it with my little Honda Civic sedan. My drivers side tires went over its head and it was a very loud boom boom as I rode over it with all four tires. I immediately started thinking about stopping and seeing if it was still alive but all I could think is that if I got out it might come after me and then my daughter woudln't have me anymore. I thought what if it did damage to my car and I got stuck out there with it and my baby. I cried the whole way home thinking I had just killed the only Bigfoot there was, and still there is no doubt that's what I saw. When I got home my family had left a note saying that they had gone up to Canada to go to a wave pool and there was no way to get a hold of them so I thought about what I should do for about half an hour or so. I put my daughter in bed right away. I decided to call 911 and tell them that I had hit a bear and I was worried that it was injured and would go after some of the young children who lived down a private driveway just across from where I hit it. I said I was also worried that it might cause an accident because it was in the road if it was dead. I wanted them to find it on the road, I wanted someone to discover it so I wouldn't seem crazy. As soon as I got off the phone with 911 I went out to the car to see what the damage was to my car. Amazingly I only noticed one thing, my license plate holder with the dealership's name was broken in half and the bottom half was gone and the whole license plate was bent under the car. I bent it back and noticed some hair hanging from the license plate bolt. My dogs were circling and circling the car and wouldn't leave it alone. I grabbed the hair and thought maybe it would help if I got the hair off the car. I was thinking the whole time I was throwing the hair into our garbage that I should maybe keep it but decided against it because I figured that no one would believe me anyways, my lab mix's hair was very similar in color, DNA testing was announced on the news only months later, can you imagine how mad I was that I didn't keep it. It was dark brown with sort of reddish highlights to it. It was wirey feeling. When my family got home they did not believe me, my brothers to this day still tease me a little about it. I thought there was only one way to prove to my brothers and parents that I wasn't crazy, call 911 and check out what had come of my call. When I called them the next day they had no record of my call, even after I told them the exact time of my phone call they couldn't find it. So I decided to take one of my brothers with me to the place where I hit it and show him the evidence on the road, surely there would be some left over from the night before. There was nothing on the road, no hair, no blood, no nothing. I just realized a couple months back there should of been one thing for sure, the other half of my license plate holder but it wasn't there. I looked everywhere but I didn't spot anything. It hadn't rained, it hadn't even been 10 hours later on a very lightly driven road, at the time. My brother thought I was insane. I've only told a few of my close friends and family over the years but only a few even think that what happened to me is possible, most of them just think I'm telling a joke. I sometimes hear the cry late at night that could only be a Bigfoot but I haven't seen one again. The only reason why I'm coming forward now is because I never knew there was any organization for this sort of thing and I want my brothers to apologize for teasing me for all these years, I won't be holding my breath though. Thanks for reading this, I appreciate it. I'm sorry my sighting was so long ago but I hope others may have seen something in this region more recently.",
  "classification": "Class A",
  "county": "Whatcom",
  "state": "Washington",
  "latitude": 48.92928,
  "longitude": -122.2638,
  "location": "-122.2638,48.92928",
  "location_details": "South Pass Road just after crossing breckenridge creek bridge and the road climbs up and to the right, at the end of the guardrails to the right, North Pass Road is off to your left just ahead.",
  "temperature_high": 70.42,
  "temperature_mid": 62.315,
  "temperature_low": 54.21,
  "dew_point": 52.84,
  "humidity": 0.69,
  "cloud_cover": 0.62,
  "moon_phase": 0.25,
  "precip_type": "rain",
  "pressure": 1017.12,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 9.58,
  "wind_bearing": 235,
  "wind_speed": 4.84
}