{
  "id": "3002",
  "title": "",
  "date": "",
  "observed": "My mother, brother, and I had recently moved to a secluded community on the outskirts of land known as White's Woods. We moved in September, and it wasn't until that summer that strange noises were heard. In July of '96, at around 2:30am, no earlier than 2, never later than 3am, strange whistling could be heard from the woods at the fringe of the neighbourhood. It sounded like \"whooooOOOPPP, whooooOOOPPP,\" with the rise at the end of the whistle. It was a very high, shrill sound. My family and I are not outdoorsman, so I assumed it was a bird. It happened always in the early morning, several hours before dawn and always from the same location. We simply assumed it was a bird. The following year, from July to August, always at the same time and in the same location, the whistles could be heard. This time, branches could be heard snapping. I went to school at the University of Pittsburgh. On campus, there lives a peregrine falcon, and I was lucky enough to see it take two pigeons, and there was a commotion when this happened. Assuming an owl took a rabbit, I took these occurances as eery yet explainable. However, what happened the following year is what gives me pause. My brother and I, having put up with these sounds for two years, thought we would investigate if anything happened the third year. Sure enough, at 2:30am, in July of the third year, the whistler returned. My brother and I are fit men. He was 28 at the time and I was 30. We play a lot of baseball, so we grabbed our bats and headed out. there are no streetlights in the area. And once outside, the whistling seemed to fill the air. It was very loud and quite easy to pinpoint. About 100yds from our house, something was whistling amid the brush and trees. The height of the sound was about 7ft (high off the ground yet discernable to know it wasn't coming from the trees). My brother and I investigated, baseball bats in hand. About 25yrds from the whistling, something strange happened. The whistling continued in it rhythmic, rising cadence, but as we approached, something growled underneath the whistle. I don't know how else to discribe it. The whistle continued with a growl at the same time. The growl sounded wet and we were so close we could actually hear it take in air. The whistle growl sent us, baseball bats in hand, running for home. The whistler returned the following year, but only once. We did not investigate. It hasn't returned since. After the pre-emptive investigation, it came back only rarely. And now it seems to be gone.",
  "classification": "Class B",
  "county": "Indiana",
  "state": "Pennsylvania",
  "location_details": "If you find Indiana, White's Woods is the largest hill and woods in town.",
  "summary": ""
}