{
  "id": "546",
  "title": "",
  "date": "",
  "observed": "I am recalling this story that I was told by my sister-in-laws father. He and I were working together on a job in Georgetown, SC in 1983.  On Friday evenings he usually left work to drive to his home in Upstate South Carolina, about 3 hours away.  His journey took him through isolated areas with dense forest.  One particular Friday evening he left on his trip a little later than normal.  He told me that it had been raining earlier and was slightly foggy.  There was very little traffic on the road this night.  As he was driving through one of the more densely wooded areas he came up behind a car that he followed for a couple miles.  This is where the event took place.  He told me that as he was following this car, that suddenly the car swerved and skidded off the side of the road.  He did not know what had happened due to the road was unusually straight and no other traffic was in the area.  He at the time was a volunteer rescue worker and knew someone might need medical help.  He quickly pulled his truck off the road behind the car and went to see if anyone was hurt.  He found two older ladies in the car, quiet shaken up but unhurt.  They were very excited and asked him if he saw the thing that had run in front of their car.  He did not know what they were talking about.  They said that a deer first crossed the road in front of them and then a large black-haired creature almost ran into their car.  It appeared to be chasing the deer.  They swerved to avoid hitting whatever it was.  He had not seen the animal they described, but offered assistance in helping get their car back onto the road.  Since it had been raining they couldn't back up in the wet grass. He told them he had some rope and would pull them with his truck. As he went around to the back of his truck to get the rope to pull their car with, he walked straight into whatever it was that was chasing the deer.  He said it was just over six foot tall, with dark wet long hair and much wider than an average man.  He told me that it smelled like stinking raw meat and had fiery red eyes.  It was standing immediately behind his truck and as he rounded the truck he walked right into it. He stood his ground not sure of its intentions. It turned and walked a short distance to the edge of the woods and stopped again.  It made a sort of low growling noise. Then it slowly turned and walked into the woods.  Shaken, he helped the ladies with their car and continued on his journey.  He admitted that it didn't really dawn on him what he had just seen, until he was back in the truck driving again. He had to pull over and settle himself.  When he returned to work on Monday, he asked if I had also traveled home that weekend.  I told him that I hadn't.  He was very hesitant to tell me about his encounter, thinking I would tell others and have people think he was off his rocker. I could tell that whatever he had seen had surely upset him.  He was very emotional telling me about his encounter, which has stuck in my mind ever since. I've only shared this story with a couple of people over the past 17 years.  Most people think you're nuts when a grown man starts telling Bigfoot stories.  After seeing your website I decided that I should share this with the experts.",
  "classification": "Class B",
  "county": "Kershaw",
  "state": "South Carolina",
  "location_details": "I don't remember exactly, but somewhere between Camden and Liberty Hill on Hwy. 97-North.",
  "summary": ""
}