{
  "reportId": "23314",
  "title": "Late night roadside sighting by motorist on Hwy. 917 south of Mullins",
  "date": "1998-09-01",
  "timestamp": 904608000,
  "observed": "The year was 1998, September.  I was in the Air Force, stationed in Sumter, SC (Shaw AFB) and was traveling home to N. Myrtle Beach, SC with my two young sons (7 and 5)--they were asleep in the back seat.  I had worked that day and had spent time with my neighborhood friends after work.  I was a single parent and my children hated to ride in the car, so I had intentially started my trip very late--about 11pm.  Trip was pretty much uneventful (as always) until about 1am.  As I was traveling one of the many shortcuts I had found (hwy 917) and just passed the Little Pee Dee River, I noticed what I thought was a dog in a ditch.  As I approached, the animal turned and looked at the car and I immediately knew that this was no dog.  It was stooped over in the ditch, maybe eating a deer carcass or some other road kill.  When it turned there was a couple of things that I noticed first...  It's face almost looked like an orangutan's, there was no fur on the face and it had lips that had no real shape to them, the mouth was wider than a man's, the lips were pursed together and very narrow.  It's head seem to be wider than normal with scraggely fur on top.  The fur had an orange-brown tint to it (thus the thought that it was a dog).  It was in the process of standing straight up when it turned to look at me, almost picking itself up in the process.  Therefore, I know that it was not an animal that I had ever seen before.  I did NOT get a chance to look at it in it's full length since I passed and could not see it in the mirror.  It did not appear to have a neck, and was much broader in the shoulder and chest area than it initially appeared.  Again, I did not notice much about the legs since I did not see much of them--I will say that the chest was MUCH larger than the mid (and butt) section and it never turned fully around--but what I did notice was the arms.  They were very long and what appeared to be fingers were curved up into it's palms (not a fist)--therefore, making me believe it was some sort of ape--that maybe it mostly walked on all fours like a chimpanzee). It was covered from head to toe (with exception to the already mentioned facial area in the orange-brown fur...It had two apparent arms, I never really saw the legs since they were underneath the animal and hidden by the ditch and was much larger than I had initially thought.  The ditch was probably 3 to 4 feet deep and the animal (stooped or bent over) rose above the ditch about 4 to 5 more feet.  Another reason why the dog scenario did not fit the bill.  The reason I knew the animal was stooped or bent over was because when it turned to look at me, it had to push itself up out of the ditch with it's arms (hands, I assume) and turn around--it was initially facing in the direction I was driving (SSE) and was apparently standing, still slightly stooped over, when I passed.  It was a very dark night and I could only see the animal with the headlights.  I was driving about 65 and when I saw the animal, I slowed down--thought it was going to run out in front of me--I had deer do that to me before... When I passed I looked in the mirror, but it was too dark to make any discernable shape in the ditch.  I certainly did not stop as I was sort of tripped out and I had my two young sons in the car with me.  I retired from the Air Force in 2007 and have only told a very few people this story thinking they would believe I was crazy! I live in Texas now and have never seen another thing like that.  I am looking for any explanation that you may have for this.  I have perused your website, as well as others, and have not found any in the area that I had my sighting.  Any explanation would be greatly appreciated.",
  "classification": "Class A",
  "county": "Horry",
  "state": "South Carolina",
  "latitude": 34.08725,
  "longitude": -79.1246,
  "location": "-79.1246,34.08725",
  "location_details": "The location of the incident was just past the Little Pee Dee River on Hwy 917 between Marion and Mullns, SC",
  "temperature_high": 89.11,
  "temperature_mid": 80.195,
  "temperature_low": 71.28,
  "dew_point": 71.43,
  "humidity": 0.8,
  "cloud_cover": 0.29,
  "moon_phase": 0.33,
  "precip_intensity": 0.0102,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1010.48,
  "summary": "Rain starting in the afternoon, continuing until evening.",
  "uv_index": 9,
  "visibility": 4.78,
  "wind_bearing": 261,
  "wind_speed": 0.66
}