{
  "reportId": "27012",
  "title": "Witnesses tell of a sighting they had as teenagers outside Jackson - w/sketch by artist",
  "date": "1979-10-10",
  "timestamp": 308361600,
  "observed": "Me and three of my friends were on county line road west, between watkins dr and hanging moss road in Jackson ms. We were at a small pond just off the road,doing what you did back in 1979,drinking a few beers ,well we had the radio going pretty mellow for the day,when my friend Tim, whose car we were in said,did you hear that?We turned the radio down and rolled the windows down a little,listened ,nothing, so we turned the radio back up and in a few minutes We did hear something,it was a pretty loud growl,not like anything i'd ever heard before,we were on the north side of the pond and it was on the south side,there were cattails that were at least 7 foot tall on that side of the pond,Tim turned on the headlights and across the pond there was a huge hairy ape it looked like,with huge green eyes,and it was turning its head slightly from side to side,blinking its eyes,which were green only because of the headlights of course,well that got all of our attention real good, I remember asking everyone if they saw what I did,and we all agreed that bigfoot was on the other side of this real small pond,it had to be at least 8 feet tall,and had a very cone shaped head, just like a silverback gorilla,and was black as far as I could tell,it was making some grunting sounds every now and then,we cut the headlights off and cranked ths car,which chose to take a very long time to fire up,when the animal let out the most spine tingleing roar i've ever heard,kind of like a lions grunt but much louder and longer,the car fired up and we got out of there ,when the headlights came back on it was still there,I have to say it scared us so bad we didnt tell many people,but it has remained in my memory all these years,I can still hear that roar,its quite distinctive,I grew up in those woods since I was 7,always felt like something was watching me,from bicycles to dirt bikes we would ride those trails. At the time of the sighting the area was being developed into a industrial park,and hwy 220 bypass was in its first stages,we really were on the edge of Jackson at the time it was good bigwoods,with streams and ponds here and there. thanks for letting me tell this,as i'll never be able to forget.I moved from MS. in 1996,and never saw tracks or any sign of bigfoot,although i did know about it,and did look for tracks pretty much whenever I was in the woods,which was very often.Thanks.",
  "classification": "Class A",
  "county": "Hinds",
  "state": "Mississippi",
  "latitude": 32.40191,
  "longitude": -90.19371,
  "location": "-90.19371,32.40191",
  "location_details": "area now is all developed,lakewood industrial park ect. on the south side of west county line road",
  "temperature_high": 62.42,
  "temperature_mid": 51.97,
  "temperature_low": 41.52,
  "dew_point": 43.63,
  "humidity": 0.75,
  "cloud_cover": 0.68,
  "moon_phase": 0.67,
  "precip_intensity": 0.0059,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1018.06,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 8.51,
  "wind_bearing": 12,
  "wind_speed": 7.47
}