{
  "reportId": "12929",
  "title": "Daylight encounter with firefighter near Skykomish",
  "date": "2005-11-03",
  "timestamp": 1130976000,
  "observed": "The year was 1993. I was employed with the US Forest Service in Skykomish, WA on the Mt. Baker Snoqualmie NF. I was part of a wildland firefighting crew on the Skykomish Ranger dist. I should point out that I grew up in mountainous regions and did lots of hunting and hiking all my life.  My father was a hunting guide when I was a young boy and I'm very familiar with all species of Northwest wildlife, tracks, sounds, smells, etc. On the night of the 22nd of July, the district encountered many lighting strikes. The following morning we (firefighters) met with officials to determine what areas were hit and to find out who would be going where. We split-up in teams of two. After reaching the end of the Beckler River drainage  I saw the smoke and the area of concern which was high on a steep, thick, north facing hillside.  Me and my partner geared up and started climbing the mountain. The terrain was VERY rugged, steep, rocky, and thick with Devil's Club & Salmon Berry brush.  After hiking approx 2 1/2 to 3 hours through this terrain, moving slow due to the steepness, we finally reached the fire.  We worked on the fire for about 2 hours then started our decent back our truck.  We took a slightly different route than the way we came up. We were about 200 yards down from where we had been working when my partner (Joe) slipped and dropped his shovel, it slid down the steep hill about 100 feet or so.  I offered to go down and get it for him.  When I climbed down to the shovel, it had landed on a rocky outcropping and I had to carefully scale the terrain to get down to the ledge. When I got the shovel, I noticed a small cave entrance that had brush surrounding it.  As soon as I got closer to inspect, I could smell a foul odor coming from inside.   I shined my light inside the cave and could tell it was larger inside.  I wasn't able to see how deep it went back with my light.  The odor kept me from going any further in. I had heard of the foul odor associated with bigfoots and immediatley became uncomfortable.  It was an overall eerie feeling. I yelled up to Joe that I had found a cave and it really stunk.  He seemed to just want to keep heading back to the truck so he continued down the path we were on before I climbed down for the shovel. I was looking down the mountain to see how I was going to get down off the ledge and connect with the trail we were on before.  As I was standing there, I saw out of the corner of my eye, a bowling ball-sized boulder came flying from over my head.  It crashed and rolled into a ravine about 10 or 15 yards downhill from me.  I yelled back up the hill to Joe, \"Did you throw that!!?\".  When he said \"No!!\", I realized that he had already walked away from where he had been and was now way to the left of my location. It was at that moment I realized that rock COULD NOT have been thrown by him, nor did it roll down the hill because I would have heard it crashing down from above me.  I then looked back uphill from where the rock had come from just in time to see ANOTHER rock coming from above me.  The second rock hit the ground more to the left and below me.  I was visually scanning the area where the rock had come from when I heard movement in the brush.  I crouched down and watched the area.  I then saw a dark, hairy figure walking upright along the side of the mountain, away from me.  It was always partially obscured by brush and trees so I couldn't really tell color or exact heighth, but I would guess about 7-9 ft. tall. I watched it for a few seconds then yelled to Joe \"I see it!\", I think I said \"I think it's a bigfoot!\".  As soon as I yelled that, I looked back up and it was dead still and silent.  I felt like it stopped and hid when I yelled because I didn't see or hear anything else. At this point I really wanted to get out of there so I side-hilled over to Joe and we quickly decended back to our vehicle.  We were both very freaked out and talked about it all the way back to the ranger station where we reported the incident to our wildlife biologist and other officials at the ranger district. I was later contacted by someone at the U of W who wanted to interview me and have me take him to the site.  I moved from the area shortly afterwards and I never took him there.  Which is why I'm submitting this report.  I want people to know my story.",
  "classification": "Class B",
  "county": "Snohomish",
  "state": "Washington",
  "latitude": 47.79222,
  "longitude": -121.1958,
  "location": "-121.1958,47.79222",
  "location_details": "[Beckler River Road area ; Internal database (FLATS) has more specifics.]",
  "temperature_high": 44.96,
  "temperature_mid": 43.075,
  "temperature_low": 41.19,
  "dew_point": 39.89,
  "humidity": 0.86,
  "cloud_cover": 0.82,
  "moon_phase": 0.06,
  "precip_intensity": 0.0198,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1002.84,
  "summary": "Light rain until afternoon.",
  "uv_index": 1,
  "visibility": 7.97,
  "wind_bearing": 158,
  "wind_speed": 8.39
}