{
  "reportId": "36647",
  "title": "Campers disturbed by approaching vocalizations and unseen visitor off the Mtn. Loop Highway",
  "date": "2012-08-25",
  "timestamp": 1345852800,
  "observed": "Me and my girlfreind went camping up in the MT. Loop area in snohomish county and when we got to our campsite, we saw a couple large footprints along the side of the dirt road next to were we parked, i immediately disregarged it being a bigfoot and figured that it was someone with enormous feet running around barefoot prior to us getting there. as it started to get darker we both had heard what sounded like someone yelling in a deep voice then turned into what sounded like a low tone groan and then stopped, this happened at about 9:30 pm. my girlfreind started to get scared so i told her it was probably just a bear making its sound and i lit a fire and we sat around the fire and talked for a few hours. once we we wanted to go to bed, we climbed into the back of the jeep and as i was closing the back door we heard the same sound again but allot closer to our area. after the noise stopped and about an hour went by we had heard loud rusttling sounds in the bushes on the upper part of the hill on the other side of the road and very loud footfalls and we also heard something very large splashing in the river which was i would say 30 feet from our jeep. we both shined flashlights out the windows but couldnt see anything, as we were doing that a vehicle came down the road and slammed their brakes on just passed our camp site. we heard them get out of their vehicle and started talking so i got out and went to them and asked if everything was okay, and their response to my question was that some massive hairy thing ran across the road right infront of them which they almost hit. they said oh it could of been bigfoot jokingly until i told them the sounds that we were hearing all night and they said that we should probably go then cause that sounds really creepy and that theyve heard of reports in the area of a \"bigfoor\" in the past. now thats kind of the breif rundown of what happened that night, but i am still a skeptic about it but anything is possible, i am millitary i serve in the US army and have seen allot of crazy things so it wouldnt surprise me that its real, but im still a skeptic. The last incident that ive had with a \"bigfoot\" which im not the only one who saw this, but we were out doing a bradley gunner at a range on base, and a bradley IFV has very detailed thermal scopes on it for night shooting, and we all saw what appeared to be  a very large person running at the very far edge of the range which is almost 2 miles away, i saw it, and 3 other people in three other vehicles saw the same thing, so we asked range control if anyone was down there were we were shooting and they said there shouldnt be and sent someone down to check it out but there was nothing to be found.",
  "classification": "Class B",
  "county": "Snohomish",
  "state": "Washington",
  "latitude": 48.04725,
  "longitude": -121.4469,
  "location": "-121.4469,48.04725",
  "location_details": "MT loop is right outside of darrington washington, very easy to find, follow the signs all the way up till you hit dirt road. and fort lewis, you would have to contact me about that incident",
  "temperature_high": 70.53,
  "temperature_mid": 61.7,
  "temperature_low": 52.87,
  "dew_point": 48.95,
  "humidity": 0.67,
  "cloud_cover": 0.06,
  "moon_phase": 0.3,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1012.07,
  "summary": "Clear throughout the day.",
  "uv_index": 6,
  "visibility": 9.89,
  "wind_bearing": 337,
  "wind_speed": 4.68
}