{
  "reportId": "43399",
  "title": "Scientist skeptic has early morning encounter behind gas station near Las Vegas, NM",
  "date": "2013-10-18",
  "timestamp": 1382054400,
  "observed": "My wife and I were driving home from Denver, Colorado to Albuquerque, NM and stopped at a gas station in Las Vegas, NM (I believe it was a Philips 66) at approximately 0100 on 10/18/2013.  We pulled off of I-25 Southbound into the gas station parking lot.  When we were driving down the frontage road towards the gas station, we saw a few vehicles on the far end of the parking lot with 3-4 people talking and a NM State Police cruiser was leaving the lot, however, upon parking in front of the gas station, we discovered that it was closed.  I needed to pee rather urgently, so I ran around to the back of the station to find a dark place to do my business.  I walked about 15-20 meters behind the gas station to be out of sight of the occupied vehicles in the gas station lot.  As I was urinating I began to feel...uncomfortable.  I was peeing in open ground and initially thought somebody was walking up behind me (probably to do the same thing).  I craned a looked around and saw nobody and no animals; just a blanket feeling that somebody was very near me.  As I finished peeing, I turned and began briskly walking back towards our vehicle.  As I was hurrying back I turned to look behind me; and that is when I became a believer. Before I continue, I would like to preface my anecdote by alluding to my high-level of academic credentialing alongside my occupation as a healthcare executive.  I also provide executive and technical advise to elected and appointed officials; I have worked very hard to become an expert based on empirical analysis and studied fact.  I did not believe in Bigfoot, ghosts or another unexplained anomalies.  I believed in results, hard work and, well, results.  My perspective is now very different. As I turned and looked over my left shoulder, I saw an enormous, lurking animal.  The animal was crouched over, almost as if taking cover in the sparse and cold vegetation.  In fact, I think the creature watched me the whole time, and did not make so much as a noise.  However, the creature noticed when I saw it.  The creature stood up, and quickly lumbered into the dark away from the direction of the parking lot.  The one attribute of the creature that resounded with me was how heavy the footfall was.  It sounded like somebody dropping a sack of potatoes over and over again.  And it was fast.  I observed the creature for about 8-11 seconds, from the moment it realized I saw it, to watching the animal dart into the wood line.  Due to radiant light from the parking lot, I could make steady detail of the fleeing creature.  Here are the salient points from my memory (aside form the footfall): 1) The creature was approximately 8-10 feet tall.  I am 6\"2 and this animal would have towered over me ( I observed it on flat land lending to my estimation). 2) The hair on the creature was matted, like dogs that live outside.  The coloration was dark brown. 3)  The creature had a defined gait.  It took strides that I would estimate to be 3-4 of my strides per 1 of it's strides. 4)  The creature had massive, human like hands. 5) The creature was very skittish, not moving until realizing I was observing it, lending to a higher intellect that a brown bear.  I believe the creature may have even fled in fear. 6)  I did not make eye contact, but noticed a massive brown and defined jaw and cranial structure. There is one other trait that I have since read about that may allude to this being a New Mexico Bigfoot.  The air was rank with what I thought was the dumpster behind the gas station.  However, this may be the \"musk\" eyewitnesses have reported in the past.  I cannot be sure, but it was very powerful, and somewhat reminiscent of what I perceived to be urine. This incident was fearful and moving.  I was unable to sleep for days and could not even bring myself to tell my wife until recently.  Due to my profession and reputation, I have extreme, extreme reluctance about openly sharing my encounter.  However, I have personal visual evidence of a so-called mythical beast, and I do not know what to do with it. Another fact: I have a concealed carry handgun license in the State of New Mexico and was carrying a 1911 .45 at the time of incident.  I was so scared that reaching for my weapon would have been an afterthought.  I was actually scared stiff.",
  "classification": "Class A",
  "county": "San Miguel",
  "state": "New Mexico",
  "latitude": 35.52162,
  "longitude": -105.2526,
  "location": "-105.2526,35.52162",
  "location_details": "It is the Southernmost gas station off of I-25 from Las Vegas, NM.  It is a large service center.",
  "temperature_high": 51.05,
  "temperature_mid": 37.665,
  "temperature_low": 24.28,
  "dew_point": 21.57,
  "humidity": 0.49,
  "cloud_cover": 0,
  "moon_phase": 0.49,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.38,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 10,
  "wind_bearing": 18,
  "wind_speed": 2.08
}