{
  "id": "29704",
  "title": "Memory told of a possible encounter while camping with friends near LaFollette",
  "date": "1995-06-24",
  "timestamp": 803952000,
  "observed": "Let me first say I'm glad you folks are out there and believe as truly as I do that bigfoot is real. Back in the summer of 1995 myself and four friends were camping at the base of a mountain in our town in east TN. Normal night with our friends until the campfire died down. We were on an old road bed and had been breaking all kinds of dead trees for a fire and as we were doing this a lost hunting dog came up to us. When it did we gave it some peanut butter and the poor starving thing ate some then carried of the plastic jar we didn't think anything else of him until a few hours later. The fire started dieing down and me and 3 of my friends were sitting leaning against the embankment as the dog came running back to us shivering. We were all kinda like what the hell \"I'm getting chills as i type this\" we were looking in the direction where the dog cam from and we saw a large, dark shadow just out of the light, just out of our clear vision from the fire. Me and my friends froze. The dog was whimpering and that's not normal for a coon dog. We saw the shadow turn towards us and all we saw were the reflection of its eyes. It paused to look for all of 45 seconds and then, like it was shot out of a cannon this loud sound like it was running through the woods, breaking trees at this point. Fear had overwhelmed all of us. We had been in this area of the woods many times over the years we built the fire as large as we could and none of us slept the rest of the night. When we saw what we considered to be a bigfoot there was this terrible wet animal smell that was unmistakable. To this day I've never smelled an animal like it since. Approximately 3 or 4 years later me and one of the guys were at the top of the mountain not far from there at a large natural sand cave and a large waterfall. We got bored as people that age do and and went on top of the sand cave to sit at the edge of the waterfall. As we climbed up to the top we had that same smell hit us and the same type of destruction was present. Trees about 3.5 to 4 feet up were just broken off like the first time we encountered this. We looked around and followed the path as far as we could until it ran out. We all still talk about this to this day and we all get cold chills when we do. I'd love to be able to speak with one of you or all. If you think this is worth your time, me and those guys would be willing to speak to you about this.",
  "classification": "Class B",
  "county": "Campbell",
  "state": "Tennessee",
  "latitude": 36.4583,
  "longitude": -83.92841,
  "location": "-83.92841,36.4583",
  "location_details": "Travel from Knoxville TN north on I-75, take exit 134, go right continue east on highway 63 approximately 15 miles on the left side of the highway at the large bend in the mountain",
  "temperature_high": 81.12,
  "temperature_mid": 72.745,
  "temperature_low": 64.37,
  "dew_point": 64.52,
  "humidity": 0.79,
  "cloud_cover": 0.64,
  "moon_phase": 0.9,
  "precip_intensity": 0.0116,
  "precip_probability": 0.42,
  "precip_type": "rain",
  "pressure": 1011.45,
  "summary": "Rain in the afternoon.",
  "uv_index": 9,
  "visibility": 6.57,
  "wind_bearing": 200,
  "wind_speed": 1.56
}