{
  "reportId": "27089",
  "title": "Nighttime sighting at City Lake Park outside Sullivan",
  "date": "2009-10-15",
  "timestamp": 1255564800,
  "observed": "This past October I was walking along Mattox Dr, by City Lake Park in Sullivan Missouri. It was around 11, 11 20 PM on a Thursday night and the park is remote and empty on a night like that. I am 29 and stand 6 foot 6 inches. My vision is 15/20 in my left eye, better than normal. As I came around the curb, I had the National Preserve, Meramec State Park to my right. As I looked ahead some 70 to 100 feet and I saw this tall monkey with long legs go by under one of the lights. I immediately looked to my right at the three line as fear overwhelmed my body. I turned around, pacing myself back towards town, trying to make sense of what I saw. It stood about 7 feet, and it was hairy, the hair of the arms was hanging 3, to 4 inches, it was the only part of the silhouette that was clearly hairy and I could notice clearly that it had ape like hairy arms. I went back to the house and researched the subject on you tube, but most of the videos showed a much heavier set creature. A lot of people that I talked to just can not believe me. Last night I came across the Jacobs video and the similarity struck me. I know that is hard to believe what I saw and I myself was a skeptic of this phenomenon, until it happened to me. Now I know that the creature in cause exists. Do we know why it is so elusive? It seams that it was leaving the park when it saw me? Why would a creature so large be scared of a human? I have no intention to gain any benefit from my experience. Thank you.",
  "classification": "Class A",
  "county": "Crawford",
  "state": "Missouri",
  "latitude": 38.2081,
  "longitude": -91.16042,
  "location": "-91.16042,38.2081",
  "location_details": "The park is right off the second Sullivan exit. Is called the City Lake Park, and it is near heavy forested areas like the Meramec State park, and Mark Twain National Forrest.",
  "temperature_high": 48.44,
  "temperature_mid": 46.195,
  "temperature_low": 43.95,
  "dew_point": 43.87,
  "humidity": 0.91,
  "cloud_cover": 1,
  "moon_phase": 0.91,
  "precip_intensity": 0.0063,
  "precip_probability": 0.94,
  "precip_type": "rain",
  "pressure": 1013.34,
  "summary": "Overcast throughout the day.",
  "uv_index": 2,
  "visibility": 7.68,
  "wind_bearing": 345,
  "wind_speed": 4.45
}