{
  "reportId": "15895",
  "title": "Possible vocalization heard in Marion, Illinois",
  "date": "1977-12-31",
  "timestamp": 252374400,
  "observed": "In 1977 my family and I were visiting my grandmother in Marion, IL (Williamson County) for the Holidays during what was called \"the blizzard of '77\". This being my first experience of heavy snow I was amazed at how hushed and insulated it felt outside and was pleased when the forecast called for more snow since I was fascinated by the intense quiet. As a 10yr old boy, I warrented my own bedroom in the front of her small house with my parents staying the back bedroom and my grandmother in the middle room.  Several hours after going to sleep (2am-ish?) I was  awakened by the most blood curdling scream that I could (and still can) imagine.  In thinking critically about what I heard the most shocking aspect was it's volume and duration.  Waking in the middle of the night to such a scream produced a sense of \"nightmare\" and confusion, but I was distinctly aware of direction/location of the source, which was outside the window to which my bed abutted (and not under the house).  I was petrified and stayed quiet and frozen in my bed for several minutes listening for other sounds.  Hearing none, I ventured out to see if others heard this and found my parents and grandmother awake and confused but still in bed.  It is worth mentioning that my parents were very sound sleepers and since my grandmother was prone to nightmares we were accustomed to her yelling out from time to time. (odd, I know)  After recounting what I had heard to my parents, my (our) fears were immediately dismissed by the idea that it was most likely a cat giving birth in the crawlspace under the house, under my window, and that the duration and change in timbre was blending of the cat noise into the howling of the wind. There are several points to which I offer conflicting evidence.  The night in question was very quiet and though it was snowing heavily the snow was falling vertically and the same intense muffled quiet was present.  Secondly, I repeatedly listened for any further noise from the crawlspace (movement, meowing, etc) for the duration of our trip and heard nothing. Subsequent questions to my grandmother about \"the cats in the crawlspace\" yielded only quizzical looks.  The next summer, I accessed the crawlspace through the opening under my window and found no evidence of a cat bedding there, only rubble.  Additionally, if I were a cat looking for a secure den to birth in, there would have been many other more desireable locations further from the opening and closer to the furnace and hot water heater which were at the other end of the house. Lastly, the morning following the incident I went out to examine the area outside my window and found only inches upon inches of new snow. I do not know what screamed outside my window that night but know that it matched almost exactly the  screams and low trailing off that I have heard on variuos recordings of vocalizations.",
  "classification": "Class B",
  "county": "Williamson",
  "state": "Illinois",
  "latitude": 37.72735,
  "longitude": -88.9487,
  "location": "-88.9487,37.72735",
  "location_details": "NW corner of 511 S. Second St in Marion, IL.  A neighborhood of homes built in the mid-50s.",
  "temperature_high": 41.15,
  "temperature_mid": 36.97,
  "temperature_low": 32.79,
  "dew_point": 36.09,
  "humidity": 0.92,
  "cloud_cover": 0.98,
  "moon_phase": 0.69,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.27,
  "summary": "Foggy starting in the evening.",
  "uv_index": 1,
  "visibility": 2.64,
  "wind_bearing": 92,
  "wind_speed": 3.75
}