{
  "reportId": "11911",
  "title": "Campers have lengthy nighttime encounter near Seneca.",
  "date": "1983-07-23",
  "timestamp": 427766400,
  "observed": "The following phone interview was conducted by Stan Courtney on the 13th of June, 2005. The witness does not have a computer or internet access so the information was entered with his permission. The first names of the two witnesses have been changed. John:  A friend said he wanted to go camping. He had a black powder .45 and I had a single shot .22 with me and we walked out into the woods, which was quite a distance that we walked to get back to where we were at. My wife dropped us off so that nobody would know that we were there and we hiked all the way back.  We took machetes with us and we cleared out an area, and a good little area, I would say 10' by 10' area, you know, that we cleared out, so we made quite a bit of noise, is what I'm trying to say. Anything out there is going to be gone [due to] the scent of a man first of all and all that noise that we made. Then we gathered firewood, but we were a distance out that no one else would be around. I do mean quite a distance out, and then we started our fire up. That was around 8:45 p.m.  That is where we had our first encounter of it. Something was walking as Chad and I were talking. Something was walking and it [was] walking directly towards us. It started a half moon around us. Now it was a very dark night, it was really hard to see even a silhouette of the trees with the skyline, let alone anything else out there plus we had the fire going so it was even harder to see even if you had one eye closed you know. It was moving around and we also smelled it.  It had a very musky smell. It smelled a little bit like garbage, a little bit like musk cologne, you know. It had a little bit of weird smell, one that I won't forget, but that's the kind of smell it was. It kept going back and forth and it did this for hours. That's when Chad got a little panicky about it.  I wanted to stay there 'til morning to see what it was and Chad wanted to get out of there. Chad says \"Well if it continues\" he goes, \"we're getting out of here no matter what.\" I asked him where his .45 was and he said \"over in the bushes\" which is where it was walking at.  I said “I will keep you covered.” and I had my .22 and it was at my side, so I had my .22 out. Well, I knew it was not a guy, not this late at night, this went on to, you know, 1 o'clock in the morning that we kept hearing it around there and it was only a few yards out from us. He rushed over there and got his .45 and then he announced out loud \"that we were both scared and we [were] both armed we were going to start shooting.\" So, anyone out in the dark like that would first of all have a flashlight. This was walking upright, it was not an animal, you could tell the difference, Chad and me are both very experienced and this was not an animal. You know, it was walking upright. This would have to be a totally insane person to be approaching two people armed in the middle of the woods at dark, you know, so we knew it wasn't a person. It continued this, back and forth, and finally it started going away at about 75 yards away from us by the sound of it, I'm estimating. It turned and ran as Chad was putting the fire out and [Chad] said \"Let's get out of here.\" and as he put the fire out it turned and ran, and came within camp with us. It was standing right within that 10' by 10' area. You could hear it breathing quite well, and Chad wanted to get up and I grabbed him and pulled him down and said \"No, stay down towards the ground. Your silhouette, it will see you. Stay down.\" so that is when we started crawling out of there, but it followed us out. I did see before Chad put the fire out where it was circling back and forth.  I did see it in the opening as it went by. I could tell that it was quite a bit taller than me, and wider. Stan:  So, you did get a visual on it then? John:  I got a visual, and Chad got a visual as we got down to the road, it crossed the road in three steps. Stan :  Was there moon that night? John:  No, it was a very dark night. The only time I got that visual was when it crossed right directly towards where you could see into your fire, you see the light. Stan:  So, you saw it in the firelight? John:  Yes, and I got to see it there and I could tell that it was quite a bit taller than me, it had to be two foot taller than me and quite a bit wider.",
  "classification": "Class A",
  "county": "La Salle",
  "state": "Illinois",
  "latitude": 41.295,
  "longitude": -88.595,
  "location": "-88.595,41.295",
  "location_details": "This is on private land.",
  "temperature_high": 87.43,
  "temperature_mid": 76.925,
  "temperature_low": 66.42,
  "dew_point": 71.2,
  "humidity": 0.74,
  "cloud_cover": 0.69,
  "moon_phase": 0.46,
  "precip_intensity": 0.0028,
  "precip_probability": 0.36,
  "precip_type": "rain",
  "pressure": 1010.96,
  "summary": "Light rain starting in the afternoon, continuing until evening.",
  "uv_index": 6,
  "visibility": 7.01,
  "wind_bearing": 296,
  "wind_speed": 4.89
}