{
  "reportId": "5620",
  "title": "Black bigfoot observed from highway by route driver and son",
  "date": "2003-10-20",
  "timestamp": 1066608000,
  "observed": "Hello,I drive a delivery truck to Kansas 3 times a week.On the day of this sighting I had taken my 12 year old son with me on my route.As we turned onto Highway 10 from Highway 75 I told him to watch for deer on his side of the truck and I'd watch on mine. This road has had several deer killed from vehicles and I didn't want to hit one.As I drove we watched and seen no deer along the 6 miles stretch to Wann.As we rounded the curve on the east side of Wann it turns back into wheat fields, so we resumed watching for deer.As I started to watch on my side of the road I looked out across a winter wheat field (which is green this time of year)and noticed about 200-300 yards away a HUGE black figure bent over. I slowed the truck down to get a better look when my son turned to look at what I was looking at and he said,\"Dad,is that a Bigfoot?\"and about that time it stood upright and looked at the truck.I replied \"I think so.\"I would have to say it was about 7-8 feet tall and about 300-500 pounds with jet black hair and a cone shaped head and very well proportioned. As we watched it for about 2 minutes it just stood there and watched us while it ate something it was picking off of a small branch it held in its right hand. (berries perhaps)The wierd thing about it it never ran or walked away.As we drove on it turned its whole body to watch us drive off not just its head. Now when I drive that road I carry a digital camera with me to get a picture if I happen to see it again.",
  "classification": "Class A",
  "county": "Nowata",
  "state": "Oklahoma",
  "latitude": 36.91528,
  "longitude": -95.80417,
  "location": "-95.80417,36.91528",
  "location_details": "Directions are:From Highway 75 North of Bartlesville, Oklahoma take Highway 10 East about 6 miles to Wann,Oklahoma.Once you pass the convenience store in Wann the field is just outside of the city limits on the North side of the road.",
  "temperature_high": 87.97,
  "temperature_mid": 70.085,
  "temperature_low": 52.2,
  "dew_point": 54.83,
  "humidity": 0.65,
  "cloud_cover": 0.03,
  "moon_phase": 0.82,
  "precip_intensity": 0.0002,
  "precip_probability": 0.13,
  "precip_type": "rain",
  "pressure": 1016.99,
  "summary": "Clear throughout the day.",
  "uv_index": 4,
  "visibility": 9.88,
  "wind_bearing": 198,
  "wind_speed": 6.91
}