{
  "reportId": "27819",
  "title": "",
  "date": "",
  "observed": "Year: 2010 Season: Spring Month: May Date: 5/12 State: California County: Siskiyou Directions to location: edited out, per request of the submitter. Observed: This trip was, in actuality, an expedition my brothers and myself had planned into the mountains of Siskiyou county. Our rationale came from an obscure Californian document called which records one of the earliest Sasquatch encounters in the state as having occurred in this area.  In addition, the book also goes on to note that it was well known amongst the locals at that time that these creatures wintered in the caves, \"makes winter quarters in some of the caves of the Marble Mountains\".  We also felt that since we would, in all likelihood, be the first people into the backcountry this early in the season it would increase our chances of encountering some sort of activity. An early scouting trip on 5/10 supported our suspicions. Late afternoon on Monday, May 10th, we left our hotel in Yreka and headed out into the mountains to familiarize ourselves with the trailhead we would be using early the next morning for our hike into the valley. The weather was quite raw, chilly with cold rain. At approximately 4 pm, as we were winding up the forest service road, we came to what may be described as an overlook or turnout. We decided to pull over and get our first real look at the mountains we would be hiking into the next day. We stopped the Jeep and my two brothers bounded out of the front and began taking pictures. I was just opening the rear door on the passenger’s side when I suddenly heard what I can only describe as a loud and prolonged, “AHHHHH!,” coming from my 11 o’clock from a low hill roughly 400 yards away. It was a very strange sound and completely unlike anything I had ever heard in the woods before. (I live deep in the High Peaks of the Adirondacks, so I am no stranger to backcountry sounds.) It sounded like a man sort of yelling but it had a deep, animal-like quality to it. I asked my brothers if they had heard the sound, but they said that they hadn’t. In fact, I believe that they thought I was joking. After a few more minutes of snapping pictures, glassing the slope and waiting around to see if whatever had made that sound was going to make it again (it didn’t) we piled back into the Jeep and continued up the mountain. We followed this road all the way to the trailhead (one of our two options for tomorrow’s hike) without incident. Coming back down the mountain, we now turned left onto another forest service road to reconnoiter the second trailhead. Conditions immediately went from raw to terrible. This forest service road is unpaved and the cold rain now changed to snow the higher we climbed. (Our elevation at this point was somewhere between 3,500-4,000 feet.) There had obviously been snow at some earlier point because the road had roughly an inch to an inch and a half of old snow scattered on it and piled up on the sides in patches. My brother suggested that we might want to get out of the Jeep and scan the side of the road in order to see if we could come upon any kind of tracks. We were not thinking “Bigfoot” at this point, we were just trying to get an idea of what kind of animals we might be encountering in the next few days. Almost immediately, we found some large and clear bear tracks. These were good-sized tracks and I would guesstimate that they were from some 300-500 lb. animal. (Again, I live in the Adirondacks and we are well stocked with bears.) I mention these tracks because as we were following them up the hill we came across a very different set of tracks. At approximately 4:45 pm we encountered a second set of tracks crossing the road. These tracks were moving perpendicular to the bear tracks we had been following and were clearly NOT bear tracks. The first track was approximately 17-18 inches long and 6 inches in width. It looked exactly like a naked human footprint, but there was little visible arch. In other words, it was rather filled in where you would expect the arch indentation to be. The print appeared to be from a right foot and a clearly defined big toe was visible. It also seemed as if the bear we had been following had stepped directly into this track but it in no way obscured what we were looking at. These two types of tracks were directly before us so that I can say, as far as comparisons between the two, this new set of tracks had come from some completely different animal. Following the track, a 2nd track was discernable roughly 4 to 4 ½ feet from the first track across the road. This track was much more degraded than the first track but appeared to be from a left foot of consistent dimensions with the first. The conditions wouldn’t allow for any casting and, besides, we had left nearly all of our equipment back at the hotel. This was supposed to have been an in-and-out scouting run and, consequently, we were poorly prepared to document any findings. The spotty snow and the lay of the land discouraged our finding any more tracks and so, snapping too few pictures, we continued up the mountain to the junction near the lake. I must add, at this point, that our finding of these tracks in no way involved any skill on our parts. This was an instance of pure “DUMB LUCK.” If we had arrived any later, the quickly deteriorating weather conditions would have destroyed these tracks without our ever having found them. We were extremely lucky to have come across them when we did. It must also be noted that there were no signs of anyone else having come into that area before us. The only tire tracks in the mud and the snow on that road had come from our Jeep. Until we had gotten there, everything seemed to have been completely undisturbed. Further up, the road splits with the right fork heading toward a camp and the way ahead leading toward a lake. To our left was an animal corral and a short road leading to a dead end in a gravel excavation. These details would be important later but, for the moment, we decided to try forging up the road toward the lake. The way soon became impassable with snow and, having gotten the Jeep stuck a number of times, we turned back to begin our return to Yreka. Returning down the FS road we were approaching the overlook/turnout where I had heard the strange, “AHHHHH!” We were discussing this sound when we decided to enter the turnout again, being much more focused and alert this time, to see if it would repeat itself. At 5:35 pm, we put the windows down, turned the Jeep off and coasted into the turnout. Almost immediately the same prolonged, “AHHHHH,” came from the same direction from which I had heard it the first time. My brother in the front seat said, “I heard that!,” and we all got out of the Jeep. It was deathly quiet after we had gotten out, but two of us had definitely heard the sound this time as we had entered the turnout. After waiting a few minutes for a repetition of the noise and getting nothing but silence in return, my first brother asked my second brother to “Whoop” at the hill which the sound had seemed to come from. I was returning to the Jeep when my second brother let out a bone jarring, “Whoop!” (a skill he apparently learned on two previous, official BFRO expeditions.) I did not hear it, probably due to my position in the Jeep, but my first brother said that within several seconds of my second brother’s having “Whooped,” 5-6 hard wood knocks suddenly came from the same hillside where he and I had heard the strange vocalization. We are all very clear on what happened next. We were all out of the Jeep now, straining to hear if we could catch any more wood knocks when a blood-curdling scream suddenly came from our 2 o’clock. It was a very high-pitched, prolonged, almost feminine sounding scream that seemed to be coming from a fairly good distance away. (I don’t want to speculate on exactly how far.) The scream did not in any way sound like any type of big cat or some kind of bird. It sounded like a loud, human scream. It was startling and more than a little unnerving. My second brother gave another loud, “Whoop,” but we got no further responses. After the scream, the woods remained quiet. With absolutely nothing happening, being a little rattled and with evening closing in, we got back into the Jeep and drove to Yreka for the night. May 11th, weather conditions were beautiful as we drove into the camp trailhead early in the morning to begin our hike into the valley. Temperatures were expected to be near the 70’s and the sky was bright and clear. We thought that we would be able to hike the roughly 7 and a half miles into the valley in about 5 hours. 60 lb packs and much more snow than we had anticipated quickly put an end to that idea. We decided to retreat to our fallback position and attempt an entry from near the lake. We knew from the night before that road directly to the trailhead soon became impassable for the Jeep a short distance beyond the camp junction, but it appeared from our map that it would be a relatively short hike in to the trailhead from where we would have to ditch our vehicle. While we had encountered snow up from the junction, we hoped that it was just a bad patch and that the snow would break and the hiking would be easier once we got through that particular area. Again, that proved not to be the case. Stuck now and wondering just how we were going to get into the valley, we realized that we were going to have to make a choice. We could either scrap our idea of getting into the valley from these approaches, take the long drive into Eureka and attempt an entry by going up a creek, or make camp somewhere in the immediate area and attempt a dash into the lake area with extremely stripped down daypacks. Hating the idea of another long car ride and of wasting another day without getting into the woods, we opted to find a spot close to the camp / lake junction. Driving the Jeep up the dead end road, past the animal corral, we set up camp in the old gravel pit. Our camp was situated in a flat, roughly 50 yard in diameter hollow, ringed by rough mounds of rock and gravel. Our GPS indicated that our base camp was sitting at 4,862 feet. Aside from having to hike a short distance downhill for water, our camp offered us a relatively protected haven on the mountaintop. I want to make our situation clear in light of subsequent events. We did not intend to be where we were. We were forced to make last minute decisions if we were going to try and stay with our original plans of getting into this specific valley. Our position wasn’t ideal, but it did provide us with a moderate degree of comfort and a footing for making a dash into the desired area. We settled into our camp and the rest of the day passed uneventfully. After a dinner of some MREs, we passed a very quiet and bitterly cold night. The morning of May 12th couldn’t come too soon. The night before had been almost too much for the gear (20 degree bags and a couple of three season tents) we had with us. I woke up at about 6:30 to winter cold and an icy tent. My second brother was already up while my first brother appeared to have retreated to the Jeep sometime during the night. He had gotten his feet wet before climbing into his bag and had been forced to use the heater in the Jeep to stop his feet from freezing. We decided to leave him in the Jeep and let him sleep. At around 8am, my second brother and I decided to gather some snow to make coffee. As the gravel pit was entirely snow free, we had to walk down past what we had nicknamed the “OK Corral” to the junction, where there was still plenty of snow. Off to our left, a couple of hundred feet down a very steep decline from our camp, we could hear the fairly loud rushing water of a creek. As neither of us relished the idea of trying to work down that decline and then struggle back up just to get some water, we were going to make do with the snow at hand. We were just beginning to gather some snow when we suddenly heard the sound of rocks being banged together in the creek bed below us. It was very clear and very distinct. The rocks were being banged together in series of threes. Bang-Bang-Bang. There were always three bangs with equal intervals between strikes. To me, these bangs sounded entirely deliberate. After the first three bangs, I said to my brother, “Did you hear that?” He was replying that he had when the rocks banged again. Thankfully, I had brought a Handy Cam with us and I now started shooting. My brother decided to try another of his “Whoops” to see if we could get any response from whatever was banging rocks together in the creek. He let out his “Whoop” and after 5 seconds we suddenly heard four loud bangs from down in the creek bed. Again, these were very loud bangs and they were clearly being made by whatever was down in the creek smashing stones together. This last series of four bangs were clearly picked up by the Handy Cam. After the last series of bangs, there were no more sounds from down in the creek. Excited and a little flustered, we rushed back to the camp to wake up our brother in the Jeep. After getting him up, we told him what had happened when we had gone to gather snow. He was excited, but said that he had been sleeping and that he hadn’t heard a thing. A Zoom H2 that we’d had running at the time may have picked up the banging in the creek but hasn’t been properly reviewed as of this writing. At roughly 9am, my second brother and I were sitting around drinking coffee and getting things ready for our attempted dash into the lake area. My first brother was walking toward the steep slope on the edge of our camp that lead down into the creek when suddenly a very loud, canine bark startled all of us. The bark sounded like a large dog’s, “Woof.” The sound had come from close below us, somewhere back in the direction of the OK Corral. We all looked up and I fully expected to see a big dog come running into camp being followed by a ranger. No such dog or ranger appeared. In fact, we looked everywhere to find the animal that had made that sound but nothing was moving on that mountain. I have heard deer and elk “bark” and this deep “woof” was nothing like that. It sounded exactly like the biggest dog in any suburban neighborhood. While that sound wouldn’t seem out of place back in civilization, it seemed entirely out of place and strange in our isolated setting. It was so out of place that we all noted it. Unfortunately, I had already packed up the Zoom for our hike and completely missed catching the sound. Cleaning up and shouldering our packs, we struck out for the lake. We started walking up the forest service road, making for the trailhead. From the trailhead, it would be what we had read was a comparatively easy, little over a mile hike in to the lake. From this lake, we would be within striking distance of a second lake, which figured into two sightings reports from last year (2009). It seemed pretty straightforward. It wasn’t. As the road rose up from the junction, the snow got worse. We would go through large patches that would come almost to our knees only to break through to long stretches of bare earth. It was slow going, but doable. If we had known that we would encountering so much snow, we would have been better prepared with snowshoes, poles and full winter gear. As it was, we were going through terrain in conditions we probably had no business to be attempting with woefully inadequate gear. No one said we were smart. About three miles in, we encountered a cinnamon bear. Off to our right, coming up quite a steep slope through a section of burn-out, a small to medium (about 200 lb) bear was lumbering towards us. The bear was about 30 yards away and, at first, didn’t see us. We stopped and, not relishing the thought of a closer encounter, we caught the bear’s attention and began to “identify” ourselves. The bear stopped and a tense five-minute stare down began. The bear seemed to be standing it’s ground and didn’t particularly appear to want to back down. We yelled and tried to make ourselves look bigger, but none of this seemed to impress the bear. I make these points because before me, at relatively close range, I was able to observe a native bear in the wild and to see how this bear would move through these woods. This becomes important later. After yelling and waving for what felt like a long time, a can of Counter Assault was produced and we got ready for the bear. Suddenly my first brother, having had enough of this war of wills, shouted an expletive and began throwing rocks at the bear. This did the trick and the bear took off at a run back down the slope. I say this again to emphasize that I had before me a living example of how a bear looked running through those woods. We continued trekking into the trailhead, coming across deeper and deeper patches of snow, until we finally reached the true start of our hike at about 2 o’clock. Post holing now into snow at times up to our thighs and waists, it became pretty clear that the inner valley was effectively sealed off. Even though the temperature was in the low 70’s and it was a bright, sunny day, the conditions were just too much. We decided to make some lunch and then begin the hike back to base camp. We made a small fire and had some MREs. It was after 2:45pm when we started our return to base camp and the going wasn’t any easier on the way back. Later, my first brother confessed that he had begun to feel uneasy at the snowed-in trailhead. He had said nothing to me at the time, but he later told me that he had confessed to our second brother that he felt like we were being watched from the moment we’d gotten there.  Much later, after we’d returned home, he said that, at points, while we had been working our way back down the FS Road from the lake, he had had the strangest sensations. He said that he could feel a prickly feeling along his scalp and that he could literally feel the hair standing up on the back of his neck. He said that he’d never felt anything quite like this before and that it happened twice on our return trip. Subsequently, he began lingering behind my second brother and I and videoing longer stretches of the return hike. Neither my second brother nor I experienced this uncomfortable feeling of being under observation. Things continued like this until a point approximately 2 miles from the camp /  lake junction on the FS Road. At approximately 4pm, I was actually bringing up the rear. We were a little tired by this point and we had grown quite loud, laughing and talking. I was raising my hand in a sweeping gesture to finally point at the ridiculously steep grade of the ridge on our right which we were in the process of traversing. As I raised my hand, pointing and making some stupid joke, something suddenly moved on the slope in front of me. From about 30 yards up the slope, something suddenly darted out from behind a tree and ran up the slope to a second group of trees. My first impression was the size of the object. It was big, at least 6 to 6.5 feet tall. My second brother is 6’2” and it was just about his size, if not a little bit bigger. It was bulky and muscular, and I immediately thought of a jacked-up football player. I could only see it from the waist up, due to foliage on the slope, but what I could clearly see was an upright muscular form running for the trees. I will elaborate more on this figure in a moment. My second impression was the speed at which the figure was moving. Whatever it was, it was moving over impossible terrain at a FRIGHTENING speed. I immediately thought that nothing that big should be able to move that fast. It was moving from left to right from one tree up a very steep angle of ascent (I guesstimate a 60 degree incline) at an angle to a second V-shaped group of two trees. It covered 10-15 yards in no time, moving over ground that we would have had to have climbed almost on our hands and knees. Once it reached that second group of trees, it was gone. I do not know what it did or where it went after it reached those trees. I also noticed that, whatever this was, it did not bob as it ran. It looked almost as if the figure were gliding up the slope on a track. I can say with utmost certainty, IT DID NOT MOVE LIKE A BEAR. This upright figure was nothing like the bear we had seen earlier. Whatever this was, it was unique and I have never, before or since, seen anything like it. My last impression was of its color. The figure appeared to be covered with a uniform coat of hair that was 2-3 inches in length. This hair was primarily of a coyote or burnt sienna color but there was also a lot of grey mixed in. Its fur looked almost brindled, meaning that there was almost as much grey as brown. If it hadn’t of moved, I never would have seen it. Standing still, the animal blended perfectly into its background. All of this transpired in the seconds it took this animal to travel the 10-15 yards between the trees. Looking back on the figure I had seen, I can say that its form was basically that of an upright human, but there were definitely some “gorilla-like” characteristics as well. I saw the animal primarily from the side with a great deal of back and shoulders being presented, as if it were turning away from me. It ran with its right arm folded across its face and seemed to be looking over the top of its arm as it moved. I could see no features because of this arm covering its face, but a conical head and the edge of what appeared to be a crest were visible. The animal displayed a pronounced musculature, and I was particularly struck by the sheer size of the bicep, its back and the massive traps. Like a gorilla, I could see no neck. As already stated, the foliage obscured the rest of the animal. I immediately shouted something like, “Over there!,” but by that time it was too late and whatever it was was gone.  I cannot stress enough to any one who has never seen an animal like this how profoundly disturbing the speed at which this animal is capable of moving is. I had been holding a Handy Cam on standby and ready to go and I was never able to get off a shot. I believe this is exactly why more of these animals haven’t been filmed: they just move too fast.  All I could do was stand there pointing with my mouth hanging open. My brothers asked me what was going on and I tried to tell them. I know that they did not believe me at first. I kept insisting that I’d just seen a “Bigfoot” run up the side of the mountain and, gradually, they started to realize that I wasn’t joking. We stood there for a few minutes, gawking and staring up the side of the mountain into the trees, but there were absolutely no sounds or movement coming from the direction in which the creature had gone. My second brother went so far as to try using some “samurai  chatter” in hopes of eliciting some response from the animal if it were hiding close by, but there was no response. After about 10 minutes of nothing, we decided to continue on our way back to camp. I know that this was a decision that will frustrate many people who might read this report and it deserves a word of explanation. On my part, the thought of climbing up that slope to search for prints, hair, or possibly even another look at the animal did not even enter my mind. I must stress that the thought was never there to be dismissed. It was inconceivable. Now, I equate it to sitting in a small boat fishing when, suddenly, something large and unknown cruises under your boat. You do not think of jumping into the water to see what that large thing was. This is not fear. From my brief experience, all I can say is that you do not naturally want to move closer to one of these animals. The reason is as simple as that. Ironically, although my brothers hadn’t seen the animal, they didn’t discuss going up that slope either. It just didn’t feel “right.” From that point on, although we were all keyed-up and anxiously waiting for something else to happen, we returned to base camp without further incident. It was now sometime after 5pm and we had some decisions to make. Basically, we debated whether or not we should stay or, in light of that day’s activity, pull out. We opted to break camp and spend the night in Willow Creek. This decision also deserves a word of explanation. Our first consideration was the extremely difficult weather conditions that we had been enduring from the start of the expedition. We had been in snow and facing below freezing conditions that we had not been prepared for. The thought of another icy night in the tents or, worse, all of us crammed into the Jeep trying to stay warm were hard trials to think about. While the daytime temperatures were mild and pleasant, the nighttime almost 5,000 feet up in a gravel pit on the top of a mountain was brutal. In this regard, we were not being smart. Our second consideration was the thought of the animal we had just encountered, both directly and indirectly, paying us a visit in the darkness. While my brothers were game for such an encounter, I most definitely was not. This was not coming from fear on my part; I will argue that it was just good common sense. It was definitely going to take me some time to adjust to what I had just seen. In the end, my brothers gave in to my desire to pullout. I am grateful to them. I still don’t regret our decision. Feeling pretty damn happy with everything we’d accomplished already, we ended this leg of our expedition. Having had some time now to mentally digest what had happened during our short stay in these mountains, my brothers and I have put together some ideas concerning the activity we observed: 1. We definitely feel that whatever was making those “AHHHHH!” calls on our first day was acting as some sort of sentry or lookout. Whatever was watching the road only called out when we came into view and its position allowed it an excellent opportunity to monitor all possible human traffic into and out of those valley access points. (We did not hear it during our final departure from the mountains but it was getting quite late by then.) 2. Based on the fact that something screamed from a second position in seeming response to the first caller’s woodknocks, there was definitely more than one of the creatures in the area. 3. Based on my brother’s intuitions, my sighting, and a subsequent development, we feel that we “picked up” something at the snowed-in trailhead and that this something was trailing us from higher up on the side of the mountain during our return hike to base camp. 4. I believe that my sweeping/pointing gesture caused the animal to believe that it had been observed and that this caused it to break and run for new cover. This is the only reason we even knew the animal was there. I also would like to add a final observation concerning the creature I observed. One of the names the Native Americans of Northern California have for this creature is Tintah-k’iwungxoya’n, which translates into something like “Boss of the Mountain.” I can think of no better name for the animal I saw. This animal seems perfectly suited for its environment. It can blend into and move through its terrain at will. Its size suggests a lot of power and its speed is startling. It outclasses us in the backcountry in every possible way. This animal could have, if it had wanted to, taken us at any time and there would have been very little we could have done about it. It definitely deserves our respect and protection. I would also like to add two postscripts to this report: 1. On May 13th,  we stopped by the China-Flat Museum to see the Bigfoot wing. While we were there, we were talking to Peggy McWilliams from the museum about what we’d experienced during our short stay in those mountains. After some interesting comments on her own part about those caves near the rim, she called our attention to a gentlemen who was just entering the museum. This gentleman turned out to be Al Hodgson. After some brief small talk, we told Mr. Hodgson about our recent experiences. He was quite interested and, at several points during our story, actually made the comment, “That sounds about right.” We showed him the pictures of the tracks and these also seemed to intrigue him. When all was said and done, he very kindly asked us for our names and our contact numbers. As he was leaving, he turned to me with a smile and said, “In forty years, I’ve never seen one.” He was a  gentleman from beginning to end, fascinating to talk to and a genuine pleasure to have met. 2. On May 25th, my second brother was reviewing the footage from his video camera. We had been shooting with two cameras and we had well over 12 hours of footage to go over. While reviewing footage we had shot on May 12th, he came to a portion that he had filmed after our return to base camp from our hike back from the lake trailhead. This footage was shot just as we reentered camp and were facing back toward the mountain and the junction. While it will never convince the skeptical, the video shows something large moving through the trees until it comes to a small clump. The object ducks down and then what appears to be a head pokes out on one side, facing in the direction of our camp. The shot ends after about 40 seconds. None of us had any idea at the time that the figure was there. It’s an intriguing end to a very intriguing experience. I am extremely happy to have some evidence to support my sighting. In retrospect, I am even more glad now that we didn’t attempt climbing up that slope after the running figure. This video seems to suggest that whatever it was, it never moved after it hid behind those trees. If we had climbed that slope, I now believe that the animal I had seen would have been waiting there. In all likelihood it would have run again, but I really would hate to think about having an up-close, face-to-face encounter with whatever was on that mountain. In addition, in light of the fact that this video was shot almost 2 miles further down the FS Road from where I had initially seen the creature, I now believe that this animal waited for us to move and then continued tracking us all the way back to our camp. While I don’t in any way feel that we were in serious danger from this creature, I feel even better now about having spent that last night in Willow Creek.",
  "classification": "Class A",
  "county": "Siskiyou",
  "state": "California",
  "location_details": "Please edit out location specifics.",
  "summary": ""
}