{
  "reportId": "18361",
  "title": "A group of four-wheelers experience a barrage of rocks and limbs on a late-night ride near Meldrim",
  "date": "2007-03-24",
  "timestamp": 1174694400,
  "observed": "While riding 4wheelers my wife and I and another couple decided to follow the railroad tracks to the next town. It was about a ten mile treck that goes through swamp and none of which is developed. I have never followed it before at night. At about halfway to the other town (Meldrim,Ga.) it looked as though the light at the far end of the tracks was getting brighter.We pulled off the side and backed up to the ditch that parallels the railroad bed to wait to see if the light got brighter.While waiting my wife and friends sat and talked and I climbed back onto the tracks on foot to watch the light. The plan was to wait ten minutes and if it didn't get brighter it was possibly a light from another source. After about five minutes my wife and her friend heard something moving progressively closer in the woods. Then large objects began falling around us. I looked at everyone asked had they heard it , then there was no doubt. Larger objects started coming down -large rocks ,large limbs. Many were landing in the water, not all in the same place , not all the same size, making huge splashes like bricks would make or larger. One then two,then multiple large things landing on both sides and on top of the tracks. Everyone with me by then was right beside me and none of them were playing a joke. Something was throwing stuff at us from the woods. I kept shining my flashlight but never saw what. These were big objects and there is no way any animal I am familliar with could have done this. I have hunted all my life and stay in the woods all the time but this truly freaked me out. As a side note when I used to stay with a friend at his house near the tracks on the Bloomingdale end his grandad used to tell us of howls that came from the woods down the swamp that he couldnt explain. He said they would sound like screaming I've always been skeptical of that but now I am not so sure.",
  "classification": "Class B",
  "county": "Effingham",
  "state": "Georgia",
  "latitude": 32.13781,
  "longitude": -81.34159,
  "location": "-81.34159,32.13781",
  "location_details": "On the only railroad track from Bloomingdale -Meldrim   This occurred between the two",
  "temperature_high": 78.64,
  "temperature_mid": 68.31,
  "temperature_low": 57.98,
  "dew_point": 57.15,
  "humidity": 0.73,
  "cloud_cover": 0.09,
  "moon_phase": 0.21,
  "precip_intensity": 0.0001,
  "precip_probability": 0.14,
  "precip_type": "rain",
  "pressure": 1025.88,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 8.31,
  "wind_bearing": 141,
  "wind_speed": 2.47
}