{
  "reportId": "9872",
  "title": "Sisters have nighttime sighting near Buckley.",
  "date": "1998-08-10",
  "timestamp": 902707200,
  "observed": "In August of 1998, my younger sister and I were on our way back from the hospital, she was about 20 yrs. old, I was 23. It was probably around two or three A.M. when we finally hit County Line Rd. outside of where my mother lives. We were both staying with her at the time of the sighting. My mother lives in Buckley, about six miles down County Line Rd, once you turn off the main highway (can't recall the name of the highway at the moment.) We were about a half a mile or so down County Line Rd when we were talking, making jokes. We were both very tired. I turned to say something to her and when we both looked back strait ahead on the road ahead, I saw a tall \"thing\" literally take two steps and it was accross the road. It stood aprox. seven or eight feet tall. (my husband at the time was six five so it was easier to make out the difference) as soon as we saw it, we both jumped and said \"did you just see that!?\" We emediaitely knew what we both saw and I raced back to my mom's house. once we were back home, we recalled the details. We were finnishing each other's sentances which was very disturbing KNOWING we recollected the same thing. It still seems funny to think about but the \"thing\" had long flowing fur. It actually looked GROOMED! The hair was all over it's body and it was brownish with silverish tips. The arms were very long hung down just above it's knees. The head was hunched down and we did not see the face. We laugh about it now and still get chills especially when we both recall how the thing was walking like it had someplace to be. It was the strangest thing. We both agreed that it was walking in haste not as if it were trying to get away from something or someplace, rather, almost like a person would walk hastily on a city street when they are late for a job or an appointment or something like that.",
  "classification": "Class A",
  "county": "Benzie",
  "state": "Michigan",
  "latitude": 44.51436,
  "longitude": -85.82096,
  "location": "-85.82096,44.51436",
  "location_details": "County Line Road - CR 602 - west of Buckley.",
  "temperature_high": 81.71,
  "temperature_mid": 73.195,
  "temperature_low": 64.68,
  "dew_point": 63.79,
  "humidity": 0.73,
  "cloud_cover": 0.25,
  "moon_phase": 0.59,
  "precip_intensity": 0.0003,
  "precip_probability": 0.62,
  "precip_type": "rain",
  "pressure": 1013.45,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 7,
  "visibility": 6.99,
  "wind_bearing": 327,
  "wind_speed": 4.57
}