{
  "id": "9555",
  "title": "Retired Law Enforcement Officer Has Daytime Sighting",
  "date": "2004-08-16",
  "timestamp": 1092614400,
  "observed": "First of all I am a 55-year-old male former Marine, fireman and state police officer just recently retired. I have been all over the world in the military and an avid camper. I have often heard of big foot and thought possible not likely. Although I didn’t believe they existed I kept an open mind. I have seen many things in my time that were hard to explain but were not as vivid as the following. I was driving on Rte 80 e/b in California at 14:30 hrs. on 08/16/04 and I had just passed the truck inspection station and State Work yard which was west of the Donner Pass. As I was crossing over a bridge which crossed over a ravine with a river through it I looked down into the ravine and saw what looked like (about 7 to 8 foot tall) broad shouldered possibly male, all black from head to toe form stepping from the tree line on the west bank approx. 300 to 400 yards south of the bridge. I immediately pulled over to the side of the roadway on the bridge and slowed so that I could see it better (traffic was extremely light -two other cars.) When I looked down I was able to see that the form had no identifiable clothing or demarcation lines or hat. It then was walking in a lanky movement with arms swinging as it crossed the stream/river. I then noticed a slightly smaller (6-7 foot tall)(pos male due to no obvious breasts or femine movements) come out from the tree line behind the other male trailing him by about 30 feet and slightly south by about ten feet. They both continued across the stream and into the tree line on the east side and disappeared. I sat there trying to evaluate what I had seen. I then concluded that these forms were not any animals I've ever seen. They were one solid color from head to toe with no discernable clothing. They had nothing in their hands or on their feet. I could not come up with any possible concept as too why these individuals would be out there. The temperature was extremely warm so the clothing if it was clothing was way too much. Their faces and hands were the same color as the body. I then proceeded e/b with no further sighting.",
  "classification": "Class A",
  "county": "Nevada",
  "state": "California",
  "latitude": 39.31917,
  "longitude": -120.3275,
  "location": "-120.3275,39.31917",
  "location_details": "As you pass through on the east bound side on Hwy 80, just before Donner Pass, there is a truck inspection station. Approx 1 to 2 miles east of that is the first bridge.  There is a large ravine with a river through it. This is the spot. They were 300 to 400 feet south of the bridge they crossed over west to east in a straight line. I could return and show you the exact location.",
  "temperature_high": 85.57,
  "temperature_mid": 69.35,
  "temperature_low": 53.13,
  "dew_point": 48.07,
  "humidity": 0.51,
  "cloud_cover": 0.28,
  "moon_phase": 0.02,
  "precip_intensity": 0.0001,
  "precip_probability": 0.31,
  "precip_type": "rain",
  "pressure": 1015.3,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 9,
  "visibility": 9.99,
  "wind_bearing": 195,
  "wind_speed": 2.81
}