{
  "reportId": "24529",
  "title": "Tall hairy figure leans out from behind a tree to observe woman outside San Antonio",
  "date": "2008-09-15",
  "timestamp": 1221436800,
  "observed": "My wife and I had been working as the cleaning crew for a new housing development displaying various model homes on the edge of the city for a couple of months. As part of our contract we were required to clean a trailer used by the construction workers as an office, the trailer itself was at the bottom of a hill at the back of the development with a road coming down to it and turning to the right making a wide U. One night my wife and I had just finished cleaning and were getting ready to load all of our equipment back into our car, when my wife walked out of the trailer carrying supplies and looked off to her right to a shallow clearing near the trailer. She claims she saw a tall hairy figure with a pointed head watching her from behind a tree with Y shaped arms surrounded by small brush in the middle of a small clearing about 25ft. from us. She immediatly froze and watched it for 2-3 min. where she claimed it leaned to the side to look at her from around the tree, she then got upset and ran back in. I was rolling the cord to a vacuum when she told me of what she had seen, we turned off the lights because she felt we were being watched and I walked outside looking at the area she described but saw nothing so we ran to our car which was parked an equal distance in the other direction facing the area and turned on the headlights. We saw nothing when we did so we left the lights on and ran back in to finish locking up and then got back in the car, before we left we turned the car off and sat in the dark for about 10 min. hoping to catch a glimpse of whatever she saw. The following day we showed up early while there was still daylight and looked at the area, we were quite familiar with the immediate area and could not find anything nearby that she could have missidentified, nor did we see anything that may have been placed there the night of, the tree itself was about six feet up untill the arms split, and what she saw was a good shoulder profile. We followed several paths in the area that all lead into a thick wooded area with no housing behind it but found nothing before turning back.",
  "classification": "Class A",
  "county": "Bexar",
  "state": "Texas",
  "latitude": 29.56835,
  "longitude": -98.68465,
  "location": "-98.68465,29.56835",
  "location_details": "Outside I-10 between the Silverado theatre and Bandera Rd. at the far back of a newly developed housing area with light residential activity. The road that lead through the are had populated houses then unoccupeid houses followed by homes under construction before becoming wooded and finaly getting to the clearing where the trailer was at the bottom of the hill.",
  "temperature_high": 77.33,
  "temperature_mid": 68.46,
  "temperature_low": 59.59,
  "dew_point": 49.94,
  "humidity": 0.45,
  "cloud_cover": 0.37,
  "moon_phase": 0.51,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.85,
  "summary": "Partly cloudy throughout the day and breezy in the morning.",
  "uv_index": 7,
  "visibility": 9.99,
  "wind_bearing": 31,
  "wind_speed": 9.9
}