{
  "id": "31933",
  "title": "Hunter experiences dusk encounters in Goethe State Forest",
  "date": "2012-01-08",
  "timestamp": 1325980800,
  "observed": "I never got a visual. I was hog hunting/scouting an area with fresh activity. The first thing I noticed were some unusual scrapings on some tree's, higher up than any animal found here. Really paid little to no attention to that until after the fact. I went further into a game trail and I heard a noise as if someone, or something was flanking me. It moved when I moved. As it grew darker I changed my direction and then began hearing a screech/growl that I was unfamilar with. Raised the hairs on my neck and I got out of there. I went home and told my wife and we laughed it off. I studied the satellite imagery for the area and chose a close by location for the following day. The following day I enetered thick brush on a game trail working my way back to a dried up lake with a clearing. The brush on either side of me was so thick you couldn't enter if you wanted. I heard, again, something walking with me, and another audible screech/growl, followed by what sounded like a large stick hitting a tree several times. I exited the area fastly. I went to another area 1/2 mile away and walked a horse trail. I experienced the same audible noise and then the tree hitting again. As I approached I felt the ground as it seemed as tho something were stomping or pounding it just off the trails edge. Then a rock was thrown in my direction followed by that screech/growl and then I could hear all hell break loose into the woods. As I was exiting the trail I came across a HUGE track that I took pictures of in comparison to my size 14 shoe it was nearly twice as long and wide. There were no prints in the footprint, like what my shoe left behind. I could make out the heel,ball and toes. I am a skeptic myself, but I'll be damned if I can explain this, and I know I will NOT be going back to that area alone.",
  "classification": "Class B",
  "county": "Levy",
  "state": "Florida",
  "latitude": 29.32605,
  "longitude": -82.61581,
  "location": "-82.61581,29.32605",
  "location_details": "Black Prong trails Goethe State Forest",
  "temperature_high": 73.94,
  "temperature_mid": 60.725,
  "temperature_low": 47.51,
  "dew_point": 49.66,
  "humidity": 0.77,
  "cloud_cover": 0.08,
  "moon_phase": 0.48,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1023.12,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 4,
  "visibility": 8.69,
  "wind_bearing": 103,
  "wind_speed": 1.47
}