{
  "id": "10783",
  "title": "Motorist has nighttime sighting of animal near Smyrna.",
  "date": "1988-08-15",
  "timestamp": 587606400,
  "observed": "I was coming home from work one night in the summer of 1988 or 1989.  It was about 8:50 PM, dark and there was a heavy fog on the ground.   I had my low-beams on be better see through this ground fog which was about 1 to 2' deep in most places.  This area around Percy Priest lake was sparsely populated at that time.  There were no homes and no street lights.  It's 6 miles from the nearest town.  My place was one of a few homes along this stretch of road. As I turned down my road, going around 35 mph in this fog I saw something move on the right hand side of the road, about (I'm guessing here) 150' from my driveway, which was on the left.  The area this movement was seen was by a fresh clearing in the woods where a new home was to be built later that year.  Having seen deer cross this road at night I thought it was a deer about to cross so slowed down and prepared to stop.  When I was perhaps (guessing again)  100' to 125'  from it I hit the brakes hard - terrified to see a Bigfoot / Sasquatch stepping out onto the road. He (?) looked towards my car for no more than a few seconds, then proceeded across the road at a walk.  He went down the slight embankment where there were felled trees, rock rubble and other things on the ground from the construction crew.  This lot on the left hand side and was in the process of being cleared for another home. It adjoined my property.  I watched, in utter shock, hands shaking and unable to move as he simply vanished into the fog and darkness.  He had to be able to see in the dark to negotiate that partly cleared lot.  He never looked back.  He made no threatening moves.  I got the impression he just wanted to go his way and be left alone. I sat there for some time before the shaking stopped enough for me to drive.  No other cars passed.  When I was calm enough I drove down my driveway and parked there, window open a bit to listen.  It was silent except for the usual crickets.   I saw nothing moving around my home.  The outside light was on and my two dogs, as usual, suddenly appeared out of the darkness to greet me.  I got the car as close to the front porch as I could, got my key ready and ran up the steps as quickly as I could to get inside.  Once inside I closed and locked every window, bolted the door and waited for my room mate to get home.  Although this creature was not at all threatening I couldn't shake the fear that it would come looking for me.  I had never heard of one of these animals harming anyone but the fear lingered.  It was a truly terrifying experience.  For weeks I couldn't sleep at night.  I would fall asleep at dawn and wake up in time to go to work. His description:  This creature was no more than about 6' tall, fully covered with a reddish brown fur (hair?) including it's face.  It was not built like the Sasquatch pictures I have always seen on TV or in the papers.  It was more slender and manlike, not apish at all.  From that distance I couldn't see it's facial features except to see the face was covered in fur.  Since there were no prominent breasts and the genital area was covered with long hair, I'm assuming it was a male. I still live in the same place and have never seen this creature again.  The area is much more built up now so they may have moved on to a less populated area around the lake.",
  "classification": "Class A",
  "county": "Rutherford",
  "state": "Tennessee",
  "latitude": 35.988,
  "longitude": -86.5101,
  "location": "-86.5101,35.988",
  "location_details": "",
  "temperature_high": 96.9,
  "temperature_mid": 85.04,
  "temperature_low": 73.18,
  "dew_point": 70.11,
  "humidity": 0.65,
  "cloud_cover": 0.26,
  "moon_phase": 0.1,
  "precip_intensity": 0.0002,
  "precip_probability": 0.11,
  "precip_type": "rain",
  "pressure": 1016.96,
  "summary": "Humid and partly cloudy throughout the day.",
  "uv_index": 8,
  "visibility": 9.04,
  "wind_bearing": 105,
  "wind_speed": 2.7
}