{
  "reportId": "18050",
  "title": "Series of loud vocalizations from two sources heard in the Yellowjacket Mountains.",
  "date": "2000-08-01",
  "timestamp": 965088000,
  "observed": "Let me start by saying I'm a non believer in Bigfoot, but what my Uncle and I heard and smelled one camping night I can't explain. My uncle and I spent 12 years exploring the back country of Challis, Salmon, and Stanley, Idaho. Our ultimate goal was to find a way to drive into a chain of mountain lakes called Hat Creek lakes at the base of mount Tayler. We decided to do some exploring past Yellowjacket mine on FR 112 rd. We camped at the end of the rd. at a very small hunters camp at Middle Fork Peak in the Yellowjacket Mts. We set up camp that evening and was just getting ready to fall asleep when the most hair raising howl, scream, grawl I ever heard in the wild. I asked my Uncle if he heard that and his eyes were wide open with a quick \"yes\". Then suddenly the same scream came from the oppisite direction of our camp only a little more distance. These screams continued as if whatever was making them were talking to one another from one ridge to another staying the same distance away. This went on for several minutes and the whole time my Uncle and I were trying to figure out what was making these erie sounds. We both have spent most of our lives in the wilderness and heard all the wild life sounds, elk bugle, coyotes howl, wolves howl, bears grawl, moose ect. but never heard anything like this before. It made the hair on the back of my neck stand up. While we were talking about what it could be, in the tent, after they quit screaming, we decided it was some kind of owl although in the back of my mind an owl could never make this sort of scream. I could just tell whatever was making this scream had huge lungs. We talked for several minutes afterward then started to try to go to sleep when I started smelling a foul odor. My uncle looked at me as if I farted and I told him \"it's not me\". The smell was awful like decomposing, rotting corpse, maybe a hint of a skunk, and a touch of landfill. During this time the forest was completly silent. We decided the breeze shifted a bit and we was smelling a dead carcass nearby, deer, elk, bear ect. The smell went away and soon after we fell asleep. The next morning we packed up camp to explore somewhere else. To this day them screams is etched into my mind and have never heard anything like it to this day. I have kept this to myself until now after finding this site. My Uncle passed away in 2001 at the age of 65, but he said he never heard anything like them screams either.",
  "classification": "Class B",
  "county": "Lemhi",
  "state": "Idaho",
  "latitude": 44.9625,
  "longitude": -114.655,
  "location": "-114.655,44.9625",
  "location_details": "W. of Yellowjacket mine on Forest Service Rd. 112 to the end of the road, small camp site. Turn off Panther Creek to Big Horn Craigs and Yellowjacket mine.",
  "temperature_high": 92.1,
  "temperature_mid": 73.21,
  "temperature_low": 54.32,
  "dew_point": 48.18,
  "humidity": 0.42,
  "cloud_cover": 0.27,
  "moon_phase": 0.06,
  "precip_type": "rain",
  "pressure": 1014.19,
  "summary": "Partly cloudy until evening.",
  "uv_index": 9,
  "visibility": 9.9,
  "wind_bearing": 341,
  "wind_speed": 2.01
}