{
  "reportId": "2382",
  "title": "Man fires shots at an unidentified man or animal near his back porch. Later he finds frozen meat littered about his back yard",
  "date": "1980-10-11",
  "timestamp": 340070400,
  "observed": "Unidentified Intruder or Unexplained Hominid Witness: J.L.Tumey Location: Fairview, Kentucky (Fleming County) Investigators: Ron Schaffner (Ron@bfro.net), John Dailey and Doug McGill Case Data: Mr. Tumey was sitting home watching the baseball game when he heard a strange noise originating from the back porch. Thinking that a prowler was present, he retrieved his pistol and went around back to investigate. He saw what looked like a large dark man-like entity running towards the woods. he fired shots at it, then ran back to his trailer for more bullets. He then saw it again by an old stable. He fired at it again, but missed. Tumey discovered that the freezer on the back porch had been broken into and some frozen chicken was removed and scattered outside. He also found some unusual white hair and impressions on the ground. Tumey told the Flemingsburg \"TIMES DEMOCRAT\", \"It was very dark, so I really could not tell exactly what it was. It stood up like a man, but it was so dark, about all I could see was a huge shadow. It made a thumping noise as it ran away.\" Mrs. Tumey arrived home and when her husband told her what had happened, she immediately called Sheriff G.W. White. Deputies arrived along with a group of locals who had heard the complaint on police scanners. The entire group searched the area until 3:00 AM, when the deputies found the scattered meat. The next day, more tracks were discovered by a gully. Evidence indicated that something had slid down the embankment. Other prints were found in wet sand and were estimated to be between 12 and 14 inches in length and 6 inches wide. Unfortunately, the prints were not clear enough to establish whether it was a man's print. More soft evidence was discovered, as Tumey found long white hairs on the door knob of the freezer. Conclusions: Evidence indicates that something entered the back porch and robbed the freezer of chicken, hot dogs and bread. Tumey's reputation is without question, just as Charles Fulton. Let us for a moment believe it was a prowler, rather than a hairy hominid. Police reports show that they were receiving calls about a strange blonde haired man seen roaming about over the past few weeks. The white hairs found at the sight were forwarded to the Kentucky State Police for analysis by the crime lab. A week later, the results were back and it was determined that the hair was of human origin. The state police concluded that the hair was light brown, blonde and white - from a Caucasian. Mr. McGill learned from the local police that they possibly had a subject in mind. There was a white male, who was a former mental patient who had been seen by others in the area. This man was described as having long blonde hair and a beard. However, this is circumstantial and to the best of our knowledge, nobody was ever charged. In a later interview, McGill told us he was not convinced that the subject seen at Tumey's was a human. Sheriff White told him that they discovered the remains of packaged meat and bread that had been ripped open and consumed in a frozen state. The Sheriff said that if the meat had thawed, there would have been signs of blood. No blood was found. Hair analysis can be inconclusive and it does take longer than one week to fully complete the comparison testings. The prints could have been weathered. Eating frozen meat is not a human tendency, so this case is still up in the air, although the evidence does weigh towards the prowler theory. However, Mr. McGill feels that there is an unknown creature roaming the area based upon the information he has uncovered. For additional reports during this time frame in eastern Kentucky, see Mason County",
  "classification": "Class A",
  "county": "Fleming",
  "state": "Kentucky",
  "latitude": 38.45795,
  "longitude": -83.9311,
  "location": "-83.9311,38.45795",
  "location_details": "",
  "temperature_high": 63.24,
  "temperature_mid": 52.28,
  "temperature_low": 41.32,
  "dew_point": 38.45,
  "humidity": 0.49,
  "cloud_cover": 0.36,
  "moon_phase": 0.08,
  "precip_intensity": 0.0001,
  "precip_probability": 0.18,
  "precip_type": "rain",
  "pressure": 1011.48,
  "summary": "Breezy in the afternoon and partly cloudy starting in the afternoon.",
  "uv_index": 3,
  "visibility": 9.68,
  "wind_bearing": 281,
  "wind_speed": 9.48
}