{
  "reportId": "51847",
  "title": "Hikers have possible daytime encounter on state's highest peak, Mount Greylock",
  "date": "2016-04-30",
  "timestamp": 1461974400,
  "observed": "My wife and I started to make our descent from the summit of Mount Greylock during a morning hike.  Approximately half a mile on the Cheshire Harbor Trail, close to Rockwell Rd, my wife and I heard a clapping sound.  We stood in place for a few moments, listening to the sound.  The \"clapping\" was non-rhythmic, sometimes there was one or two, other times there were many \"claps\".  In between the \"claps\" there was sounds of something walking, breaking fallen branches as it moved.  The sounds were about a distance of 100 feet from our position on the trail, within a thicker patch of woods.  We listened for almost a full minute and then decided to continue on the trail, moving closer to the source of the sound.  When we reached the area where we believed the clapping sound to be coming from we listened again and heard nothing and had seen no movement.  Further down the trail I attempted figure out the sound.  I did some tree knocking and banged rocks together, but only when I clapped my hands did it most closely match the sound my wife and I had heard.  It was a sound that I have never heard before and it has sparked my interest into figuring out what animal made this noise.",
  "classification": "Class B",
  "county": "Berkshire",
  "state": "Massachusetts",
  "latitude": 42.63678,
  "longitude": -73.16617,
  "location": "-73.16617,42.63678",
  "location_details": "Mount Greylock State Reservation, Cheshire Harbor Trail off West Mountain Rd, Adams, MA, heading southeast toward base of trail. Adams, MA.",
  "temperature_high": 63.35,
  "temperature_mid": 54.75,
  "temperature_low": 46.15,
  "dew_point": 35.56,
  "humidity": 0.53,
  "cloud_cover": 0.13,
  "moon_phase": 0.77,
  "precip_intensity": 0.0001,
  "precip_probability": 0.03,
  "precip_type": "rain",
  "pressure": 1021.53,
  "summary": "Clear throughout the day.",
  "uv_index": 9,
  "visibility": 10,
  "wind_bearing": 228,
  "wind_speed": 3.4
}