{
  "reportId": "17551",
  "title": "Daylight sighting by a couple, on a frozen lake near Centerville.",
  "date": "2000-02-21",
  "timestamp": 951091200,
  "observed": "February 2000 my wife Jean and myself went for a walk with our 2 Labs. Something got our attention to look out across a small lake with an Island on it. Crossing the frozen lake was a tall man like person walking at a fast pace. Body was dark in color, almost black. Head was a lighter color brown with hair coming down to his shoulders. When we first seen him he was about 350 yards away. He walked into cattails about 150 to 175 yards away. At time we could only see his shoulders and head. 2 Geese flew over honking and he turned his whole upper body to look at the Geese. He went into a wooded area and I lost sight of him. I wanted to get a closer look but my wife was frightenned. So she went back to the truck. The really odd thing is my dogs would not go with me. I'm a avid hunter and my dogs are with me always, but not now. I went to the area of cattails but could not see over them. I'm 6' tall. The snow and ice were hard pack and I couldn't see prints. When Jean talks about it, it raises the hair on her neck. She didn't want me to report this for the safty of our visiter. But Its somthing I'll never forget.",
  "classification": "Class A",
  "county": "Anoka",
  "state": "Minnesota",
  "latitude": 45.1836,
  "longitude": -93.06226,
  "location": "-93.06226,45.1836",
  "location_details": "A small lake north of the Twin Cities Metro Area. This lake contains a large wooded island, and a large track of marsh/swamp land near-by.  A nature park is located on the Western shore of the lake.",
  "temperature_high": 41.46,
  "temperature_mid": 34.705,
  "temperature_low": 27.95,
  "dew_point": 26.07,
  "humidity": 0.83,
  "cloud_cover": 0.11,
  "moon_phase": 0.58,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.58,
  "summary": "Clear throughout the day.",
  "uv_index": 2,
  "visibility": 5.9,
  "wind_bearing": 138,
  "wind_speed": 6.29
}