{
  "id": "3964",
  "title": "Wooded, rural, lake house scene of late night encounter",
  "date": "2002-04-29",
  "timestamp": 1020038400,
  "observed": "We were at my lake house where we were living for the past 3 months. We had returned to get some things that we wanted at our other house so we spent a couple of hours gathering stuff up and cleaning a bit. I went out side looking for the cat then my wife followed. I was in the front yard yelling \"tiger\" \"tiger\"! My wife went to the back yard and started yelling. Then out of nowhere she hears a hoot owl. \"hoo, hoo hoot\" it was loud. it sounded close to me and i was in the front yard. but she said it came from not more than 10ft from her. she stoped startled. Then another one went off from the other direction even closer. She comes runnin to the front yard.(we werent more than 15yds. apart to begin with and i kind of met her 3/4 of her way at the front corner of the house) Shes like \"Oh my god did you hear that. two owls right there above me\". Doesnt sound that creepy butin the middle of the night in the middle of nowhere with no flash light it will startle you. I said \"yea i heard it what was it?\" she said \"they sounded like owls but owls are territorial and are never that close unless they are mating.\" Just as she said that every where around us started \"hooting\" 20 to 30 differernt ones. Loud to like stereo turned up all the way in your car loud. And then some of the calls turned in to jungle noises. Like monkeys and tookans all kinds of noises, and in the middle of some of the calls it in a way sounded almost like human laughing but kind of like in an insane way. It just kept getting louder and louder until it was almost ear piercing and then there was complete silence..... The crickets and bugs started back in and i heard a twig \"snap!\". We hurridly got in the car and put it in reverse. Then peeled out (if you can do that in dirt). On the way down the drive way not more than 20yds from our house. I saw the out line of some thing big and dark colored. But the what I remember the most is the eyes they almost glowed.",
  "classification": "Class A",
  "county": "Caddo",
  "state": "Oklahoma",
  "latitude": 35.10278,
  "longitude": -98.34056,
  "location": "-98.34056,35.10278",
  "location_details": "10 miles sw of caddo jake bridge (canadian river)on my land",
  "temperature_high": 80.05,
  "temperature_mid": 71.8,
  "temperature_low": 63.55,
  "dew_point": 58.05,
  "humidity": 0.77,
  "cloud_cover": 0.38,
  "moon_phase": 0.6,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.12,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 8,
  "visibility": 9.57,
  "wind_bearing": 72,
  "wind_speed": 5.78
}