{
  "reportId": "8978",
  "title": "Boys are chased on way home from bow hunting",
  "date": "2001-09-15",
  "timestamp": 1000512000,
  "observed": "My nephew and I were out bowhunting for deer in the early season. The area I hunt in is 2 or  mile hike from behind our ranch. We went out late in the day to catch the deer bedding down. we set up in front of a well used deer trail. W waited for some deer to come nto our shooting lane for around 2 hours, but nothing happened. After 3 hours it was getting dark, but i was very determined that day. i happened to glance up on the hill above me, which is 500 yards to the top, and i saw a tall black somthing walking around, but i didnt pay any attention to it, i figured it was my eyes playing tricks on me. Soon after that somthing didnt seem right about the where i was at, i felt like i was being watched, my nephew told me he did to, so we headed home, which was a 2 or 3 mile hike downhill. We were probably only 3/4 of a mile away form home when we heard a big crash in the brush behind us, i never run from anything, but i ran from that crash, whatever it was. and as we ran, we could here somthing running behind us, i didnt look back, i just ran faster. this thing chased us for at least 1/2 a mile. when we saw the gate to the pasture, we jumped it,cleared it. we ran a little further and than stopped and turned around. what i saw still gives me goosebumps. standing behind he gate was a massive creature, 6 1/2 to 7 feet tall. icould see it was hairy form the backround of the sky, but it was too dark to see any facial details. When i saw it, my shoulder blades and spine tingled, this tngle went al the way down to my feet, and i could not move a muscle. The creature and i studied each toher for at least 30 seconds, maybe shorter,maybe longer. it did look massive and broad,but it still was to dark to make out a lot of detail. After 30 seconds, it just tunred around and walked off on to legs. the shoulders were indeed broad, i could make that out when it walked out from under the tree it was under . it walked like a human,not a bent walk. about that time i came to my senses,my nephew came to his, and we ran all the way back to the house. Before this sighting happened, i always believed there were bigfoot up in the woods behind our ranch. every summer i would hear them scream and moan at least twice a month, i also heard sounds that sounded like the recording Del Norte recording. I've also heard them since. the last experience i have had at night was a few nights ago, putting up the dogs, and i heard wood knocking, but only from one loaction, there were also twigs snapping up in the woods, not 40 yards from the dog house. i've also heard strange laughing sound, chukling would be a better word, like a human laughing, but much much deeper, and very loud. i have also found some footprints, but never got around to taking pictures of them, except for one that i found after my sighting, and it might not be one it just had the general shape. i have had one rock chucked atme.",
  "classification": "Class B",
  "county": "Jefferson",
  "state": "Washington",
  "latitude": 47.9237,
  "longitude": -122.8531,
  "location": "-122.8531,47.9237",
  "location_details": "I'm 17, my family has had some bad experiences with people over the internet, i have to respect there rules, and i cant give the exact location. but my sighting was near tarboo lake, a lake that isnt well known, but it does have alot of activity.",
  "temperature_high": 65.71,
  "temperature_mid": 58.285,
  "temperature_low": 50.86,
  "dew_point": 52.59,
  "humidity": 0.86,
  "cloud_cover": 0.25,
  "moon_phase": 0.94,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.22,
  "summary": "Partly cloudy in the evening.",
  "uv_index": 4,
  "visibility": 7.33,
  "wind_bearing": 284,
  "wind_speed": 4.89
}