{
  "id": "6194",
  "title": "Two decades separate sightings of father and son at farm",
  "date": "2003-04-11",
  "timestamp": 1050019200,
  "observed": "On 4-11-03 my son came running to the house screaming let me in..let me in. He was shaking and very upset. He said the woods monster was going to get him. I asumed his older brother had scared him. I confronted his brother and told him to quit scaring his brother. He said he was not even near him and wanted to know why he was crying in such hystericks. When I asked my son again he said it was not his brother...it was the woods monster. I went outside to the back yard, our house sets at the edge of a big woods just up from a river. I smelled something musky, I then had a good idea what he might have seen. My son is 5yrs old, He knows nothing of bigfoot other than the monster truck. When asked again he said it was just looking at him, I asked was he small or...before I could say anymore he said no, he was big like this...pointing to the ceiling in our livingroom. My wife asked, why do you say he...my son replied..he's just like us only bigger. Then I asked him if he smelled anything. He said yes it stunk like a skunk. We laughed at what he said and decided to drop it so he could calm down and sleep that night. The next morning he came to our bed, I asked him if he was going outside today...he said no..then said if he did he would not go near the woods. My wife asked if he could draw what he saw. He said yes. He took a piece of printer paper and got his crayons. He dumped out the crayons and after a second or so said Do you seen the brown crayon. I told him it was still in the crayon tin. He first drew a big rectangle and colored it brown. Then he took the red and drew arms and legs and head. He also drew some squigly line around it, those were the branches he was looking through. Then I got on the computer, I found the picture of the Patterson film. As soon as the picture materialized on the screen my son backed up and said THATS IT. I beleve my son 100% because abot 20-21yrs ago I seen something similar not 200yrds in the same woods. And in 1975 my now brother-in-law saw the same thing not 10 miles or so from here. I just found out today that some people not more than 3 miles from here had some kind of an incident the night after my son seen what he saw. If interested in the other stories you may contact me. I wished that my sons encounter not list any names due to ridicule from people in the area. Myson had to many right answers to what he saw for someone who didn't even know this thing exists. I dont talk about my encounter, and never have around my sons. And we monitor what they watch on tv. He had all the right answers. A 5yr old doesn't just pull things like that out of his imagination.",
  "classification": "Class A",
  "county": "Gasconade",
  "state": "Missouri",
  "latitude": 38.28,
  "longitude": -91.6253,
  "location": "-91.6253,38.28",
  "location_details": "Withheld by request.",
  "temperature_high": 71.98,
  "temperature_mid": 57.78,
  "temperature_low": 43.58,
  "dew_point": 34.46,
  "humidity": 0.51,
  "cloud_cover": 0.02,
  "moon_phase": 0.31,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.7,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 9.72,
  "wind_bearing": 323,
  "wind_speed": 1.76
}