{
  "reportId": "7827",
  "title": "Two hunters recount late morning sighting near Hotchkiss",
  "date": "1994-09-15",
  "timestamp": 779587200,
  "observed": "In the fall of 1994 I was hunting deer with friends north of Hotchkiss, CO. This area was called Wolf Park. I had never hunted this area before but my friend had grown up in the area. It was the September muzzleloading hunt which runs from the second to the third weekend of the month. We had drove in quite a ways. We hunted the morning and I had seen nothing. About 9 or 10 am I had spotted a bear up higher so I figured we had better move to a new location, for the bear may have spooked any deer in the area. We walked down the trail to our truck and left the area. The time from seeing the bear until we left was about 20 minutes. The bear was heading north-east. We drove south-west down the mountain about 30 to 45 minutes. When we came around the corner of the road, it overlooked Wolf Park and a hill on the south side. My friend and I saw them at the same time. He slammed on the brakes and we bailed from the truck. We both started glassing 2 of the creatures standing in an opening. They turned and started looking at us. That amazed me because of the distance. It was quite a distance away. With the naked eye you could make out the size of the creatures, which - between that and the fact that they were standing up -  made us stop. We looked at them about 3 to 5 minutes and then 3 small ones walked out of the draw the parents had come from. They were about half the size of the parents. The creatures were jet black and you could see the arms and legs, torso and head. They started moving back to cover when a white pick-up came out on the road below us which was about 75 to 100 yards from where the largest one was. The truck came to an quick stop for 10 to 15 seconds,  and then took off like a bat out of hell. The creatures disappeared into the brush. We drove to the spot we had seen them and looked at where they had gone. The slope was pretty steep and real loose. The dirt was so loose you could see that with each step they slid so I could not find a real good print. I had to jump in order to reach from one step to the other. The brush was thick in this draw were they had gone so we did not go looking for them. We left and went home. We talked about it for a week or two. It had gotten us excited but we never told anybody about this. I tried to bring it up one time a few years ago in conversation to my friend but he avoided the topic. The only other person I have told is my wife till now.",
  "classification": "Class A",
  "county": "Delta",
  "state": "Colorado",
  "latitude": 38.875,
  "longitude": -107.7084,
  "location": "-107.7084,38.875",
  "location_details": "Sighting location was near an area called Wolf Park near Hotchkiss.",
  "temperature_high": 64.9,
  "temperature_mid": 51.26,
  "temperature_low": 37.62,
  "dew_point": 30.71,
  "humidity": 0.5,
  "cloud_cover": 0.27,
  "moon_phase": 0.37,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.38,
  "summary": "Partly cloudy until evening.",
  "uv_index": 6,
  "visibility": 10,
  "wind_bearing": 129,
  "wind_speed": 1.28
}