{
  "id": "7483",
  "title": "Morning daylight sighting around rural homes near Kent",
  "date": "1986-12-25",
  "timestamp": 535852800,
  "observed": "Christmas Day, 1986. Fifteen years old at the time, I was staying at my uncle's house near Kent, WA. At the rear of the house is a forested area. Around 7 or 8 am on Dec.25, 1986, we were all leaving to visit other relatives and I realized that I had left something inside the house, so went around to the rear entrance and was fumbling at the lock when I heard a tremendous crashing coming towards me through the forest. The oddest thing about the entire incident was my reactions - completely different to what one would expect. Hearing the crashing coming towards me I didn't (as you would expect someone to do) turn around to see what was happening - I felt a tremendous feeling of dread which certainly didn't help my efforts at unlocking the door. Whatever it was that was coming through the forest was making a LOT of noise and sounded BIG. The noise came closer until it was just approximately 30 metres behind me just inside the woodline and to my left, at which point I very slowly turned around (again it is impossible to convey just how frightened I felt) and I saw a creature standing upright and looking at me. It was tall and bulky but definitely not a  bear standing upright because it didn't have the sloping shoulders of a bear but rather looked like a tall, bulky person in a cheap ape suit. I was genuinely paralyzed with fear and could neither make movement nor sound. The hair or fur was dark brown/black/reddish tints but mostly dark from what I could see. It was, as I mentioned, standing just inside the treeline, so the lower legs were hidden from view - only from about midthigh upwards was visible and definitely looked humanlike but with a pointier head than a normal human. I had the feeling that the exchange of looks lasted quite long but probably only lasted a few seconds before I was finally able to move, at which point I raced back round the front of the house and jumped into the car with the rest of the family, who remarked that I looked like I had seen a ghost. I never told anyone about what I had seen because growing up in the Pacific Northwest, one learns to laugh at the nutcases who claim to have seen bigfoot, and I certainly participated in the ridicule until that day. I only ever went to my uncle's house one other time after that day and sometimes now wish I had been brave enough to have looked in the forest for footprints later but it was simply impossible to have done at the time.",
  "classification": "Class A",
  "county": "King",
  "state": "Washington",
  "latitude": 47.39,
  "longitude": -122.2187,
  "location": "-122.2187,47.39",
  "location_details": "Hilltop Avenue, dead ending side street going north from E. James St.",
  "temperature_high": 43.48,
  "temperature_mid": 42.625,
  "temperature_low": 41.77,
  "dew_point": 37.76,
  "humidity": 0.86,
  "cloud_cover": 0.96,
  "moon_phase": 0.8,
  "precip_intensity": 0.0291,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1017.11,
  "summary": "Rain starting in the evening.",
  "uv_index": 1,
  "visibility": 7.74,
  "wind_bearing": 155,
  "wind_speed": 5.05
}