{
  "reportId": "10407",
  "title": "Journalist and investigator have early morning sighting in Sam Houston National Forest",
  "date": "2005-01-28",
  "timestamp": 1106870400,
  "observed": "Mike Hall and I had just wrapped up night operations with TBRC/BFRO on that Saturday night, we hiked out of our area and met with Daryl Colyer, Alton Higgins and other members of the group at the forest service road where we had parked Mike's Jeep. We loaded our gear in the back and headed back to base camp as the others left to go back into the woods to do some further research. Interested in getting back to base camp and getting warm, and much needed sleep, I was concentrating on watching for animals in the roadway, as I didn't want us to hit something and be stuck out there in the cold. Mike was driving and there was no conversation until we topped a hill in the road, and I saw something moving in the same direction that we were in the middle of the road. I pointed and asked \"what is that?\". Mike slowed and asked \"what is what?\" and I answered \"that thing in the road just beyond the headlights.\" Mike looked and said \"holy s---!\" and I said \"whatever it is don't hit it.\" What we saw was a large dark upright moving creature walk in the middle of the road. It was about 5 1/2 to 6 feet tall, moving upright, in the same direction that we were traveling. It had noticeable hair and its head seemed domed and no neck, as if its head rested right on its shoulders. It was very very broad at the shoulders and thick (massive). It never turned to look at us, so I don't know what the face looked like. We have no recollection of its hands or lower body, our focus was on how wide it was and how smooth that it moved. It was amazing, just very graceful. No jerky movements, very fluid in its movement. As we neared, it moved to the side of the road in a smooth motion then stepped off into the ditch and into the woods to the right side of the road. Then Mike realizing what we were witnessing, stopped the jeep and grabbed the gun and flashlight and jumped out to look for tracks. I stayed in the jeep not believing what I was seeing with it running. As mike scanned the woods following sounds he was hearing, he motioned for me to cut the engine and waved for me to get out an join him. I did both reluctantly. As I got near Mike he asked for me to look where he was shining his flashlight and to tell him what I saw, to my utter disbelief I saw a large shape of head and shoulders move quickly between two trees and disappear. I must have blinked because it was there one second and gone the next. We scanned the woods and the road for any signs but couldn't see anything, we also listened for movement but it was dead quiet. We then moved back into the jeep and just sat there, amazed at what we had just witnessed. There was no odor and no sound, other that what Mike had heard before I got out of the jeep. In reflection on the event I did have the feeling that we were being watched. Mike was so excited over this he could hardly think, so I grabbed a pad and pen and said to him, \"Here let's write down what we saw.\" He was so shaken that he couldn't even write, so I took over and had him dictate what he saw and added what I saw. Not having any way to communicate with the others in the woods, we didn't know what to do. Not thinking clearly because of the excitement and lack of sleep we drove back to base camp, where we were headed in the 1st place. Upon reaching camp, I just couldn't face another cold night on the ground and begged Mike to take me into town to a nice warm hotel. The next day we returned and reported the incident to Daryl Colyer and the rest of the group.",
  "classification": "Class A",
  "county": "Walker",
  "state": "Texas",
  "latitude": 30.6,
  "longitude": -95.63,
  "location": "-95.63,30.6",
  "location_details": "Near Lake Conroe, several creeks in area that we were scouting around.",
  "temperature_high": 50.38,
  "temperature_mid": 48,
  "temperature_low": 45.62,
  "dew_point": 42.57,
  "humidity": 0.88,
  "cloud_cover": 0.99,
  "moon_phase": 0.6,
  "precip_intensity": 0.0211,
  "precip_probability": 0.96,
  "precip_type": "rain",
  "pressure": 1019.75,
  "summary": "Rain in the morning.",
  "uv_index": 2,
  "visibility": 8.23,
  "wind_bearing": 12,
  "wind_speed": 4.88
}