{
  "id": "410",
  "title": "",
  "date": "",
  "observed": "I was bike riding at roughly 10:30 AM on Saturday, September 30th.  While riding on Marsh Road from Route 223 toward Chemung, I suddenly smelt a very rancid, decaying type of smell.  I thought what I smelt was a large roadkill, so I scanned the road to the right and left of me looking for a deer carcass or the like.  As I turned me head from right to left I caught a glimpse of large patch of what appeared to be brown fur about 15 -20 yards ahead of me and roughly six feet off the ground. The fur seemed to be moving back into the woods as though it was approaching the road and then suddenly decided to reverse direction.  Nothing had crossed the road in front of me.  I rode past the area where I had seen the fur and looked back into the tree-line for the white tail of a deer or to hear the sound of something moving through the woods.  I saw or heard nothing.  I then realized whatever I saw was VERY far off the ground, and probably not a deer.  It was about this time I also noticed a dog, chained in a yard across the road, that was barking in the direction I was looking and seemed extrememly agiated.  Being a pretty consistent bike rider I could tell too that the dog was showing not interest in me.  Taking into account what I did, and did not see, combined with the smell, I thought I may have had a sasquatch sighting.  I decided to ride further up the road, turn around, and ride back trying to notice the smell again.  The second time past the area there was no smell at all, which surprised me because it was EXTREMELY strong when I first rode through.  I can't really claim a sighting, but it seems either I can claim a smelling, or at least a series of brief events (all of this probably happened in less than 10 seconds) that when put together point toward me running across something in the woods that doesn't fit a schema of anything I have seen or noticed before.",
  "classification": "Class B",
  "county": "Chemung",
  "state": "New York",
  "location_details": "Route 13 to Route 223 towards Breesport. Go to end of route, take a right on Marsh Road. About 1 mile up the road.",
  "summary": ""
}