{
  "reportId": "5552",
  "title": "Youth bicyclist has daytime sighting near Gravois Mills.",
  "date": "2004-11-20",
  "timestamp": 1100908800,
  "observed": "I was living at in Missouri at the time, about a mile from where my sighting took place. I was on my way home from a friends house on my bike about to head up the hill. I heard something off in the woods to my left and looked to see what it was. I was very used to being in the woods, having grown up around them all my life. I expected to see a deer or some other type of wildlife that I was so familiar with. But, I turned and saw what I still believe was bigfoot. It was a little less than a hundred yards away, and walking perpendicular to me. The strides that it took were amazing, so fluid. There was no real bobbing of the head like I have heard of from other sightings, and the arms didn't swing out as much as others have reported, it was very human like. It's body was covered in a brown hair, not a very dark brown though. It was more the color sandstone, that's the best thing I can think of to compare the color. I watched it walk for about a minute, I was to scared to move at all, so I was just kind of frozen there watching it. Then it stopped right beside a large birch tree. I was afraid that it had seen me and didn't know what it would do, so I turned to look up the hill and contemplate running up the hill towards my house or to turn and run back to my friends house. I decided that I was going to leave my bike and run back to my friends since it wasn't up hill to his house. I turned to look back and see where the creature was at and couldn't see it anymore. I believe it hid behind the large birch that it stopped beside. That's when I ran, I was so scared I just ran to my friends house and didn't even knock, I just ran inside and told them what had happened. I made his dad drive me home, we picked up my bike on the way. I never went down that road again on my bike, I never had the nerve to.",
  "classification": "Class A",
  "county": "Morgan",
  "state": "Missouri",
  "latitude": 38.3085,
  "longitude": -92.8254,
  "location": "-92.8254,38.3085",
  "location_details": "I can't remember the exact road name that I spotted it from. But I do know that it was right next to \"The Captians Fancy\" a resort that my mother was the manager of at the time, that's where I lived at. It was about a mile away from there.",
  "temperature_high": 50.59,
  "temperature_mid": 45.88,
  "temperature_low": 41.17,
  "dew_point": 44.64,
  "humidity": 0.86,
  "cloud_cover": 0.93,
  "moon_phase": 0.3,
  "precip_intensity": 0.0012,
  "precip_probability": 0.62,
  "precip_type": "rain",
  "pressure": 1020.28,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 9.13,
  "wind_bearing": 335,
  "wind_speed": 4.35
}