{
  "reportId": "14854",
  "title": "",
  "date": "",
  "observed": "I'm not entirely sure if what lives in our woods is a bigfoot. All I can say is that as long as I can remember there has been something there. If you take walks at night along the woods line you can hear something walking beside you in the woods but it never comes out. There is sometimes an awful screaching noise as well. One night me and my boyfriend were outside and we heard something walking in the woods (our house was about 20 feet from the woods line) and we stopped to listen. It sounded like something scared whatever it was because it sounded as if something large holding a 2x4 horizontally went crashing through the woods. It was so loud and moving fast. A few weeks later we were outside and we heard some cracking in the woods and then it sounded like whatever it was stepped on one of those old glass coke bottles and broke it. Now a woodland animal wouldnt be able to do that. It's been reported around our area that there are \"monkey people\" living out in the woods. Many people have come back with tales of seeing strange ape-like creatures while hunting. My mother and sister went outside one night and saw 2 big red eyes sitting under the apple tree they have near the woods. It took off running and my mom said it looked ape-like. She even says that she was driving home one day and looked off in toward the ditch and saw what she claims was a large silver looking ape-creature. She said she was too scared to stop so she kept going. I'm not sure what it is but I know that since I was a little girl we'd hear things out there. My dad is a sceptic and even he admits there's something there. People come over late at night to just walk the woods line to see if they can hear anything. We've thought about putting up a motion camera but somehow the idea of actually knowing that it might be something really strange is worse than not knowing at all.",
  "classification": "Class B",
  "county": "Iosco",
  "state": "Michigan",
  "location_details": "Southwest Iosco County",
  "summary": ""
}