{
  "reportId": "31122",
  "title": "Fishermen have possible late afternoon encounter on Black Creek",
  "date": "2011-11-20",
  "timestamp": 1321747200,
  "observed": "A friend and I had been on Black creek in Clay county for a few hours bass fishing with absolutely no luck.  Working the last stretch of bank before we called it a day when I heard something walking in the woods.  I could hear large footsteps and something that sounded like it was scooping water or slapping water, I really can't describe the sound. Now I know this particular area and the wildlife that inhabits it pretty well I think, It is full of deer, wild boar, turkeys, a few black bears, and the rest of the small woodland critters.  And this sound was way too large to be any of them. Back to my story, after we heard the noise I motioned to my friend to be silent so I could trolling motor over to the bank so I could try to get a look.  As we were silently getting closer it seemed like the creature must have noticed us because we stuck out like a sore thumb against the back drop of the creek, while it stayed perfectly camoflauged in the wood.  We sat there for a few moments hoping it would move and reveal itself to us which it never did. So, as the sun was dropping we had to get back to the boat ramp, we quitely circled away from the shore.  Just as we got away from the tree line something landed in the water about 50 or so feet from the boat. It was a loud splash like a rock or heavy object was thrown because it hit about 15 feet from shore.  Both startled we put out life jackets on and got ready to leave when we heard the footstep start back up, and they sounded as if they were running away at a brisk pace and it sounded like it was a long stride. Jokingly we said we had just encountered a sasquatch just like every other time I heard something unusual on that body of water.  But as we made our way back to the dock I noticed we were within half a mile from powerlines.  And were within a mile of the county dump that I know for a fact is a popular spot with the local whitetail deer population.",
  "classification": "Class B",
  "county": "Clay",
  "state": "Florida",
  "latitude": 30.0809,
  "longitude": -81.7624,
  "location": "-81.7624,30.0809",
  "location_details": "250 yards west of the train tressel on the north bank.  Only access is by boat or to walk the tracks, which is highly illegal.",
  "temperature_high": 78.22,
  "temperature_mid": 68.07,
  "temperature_low": 57.92,
  "dew_point": 62.11,
  "humidity": 0.83,
  "cloud_cover": 0.22,
  "moon_phase": 0.83,
  "precip_intensity": 0.0071,
  "precip_probability": 0.31,
  "precip_type": "rain",
  "pressure": 1025.92,
  "summary": "Partly cloudy until evening.",
  "uv_index": 3,
  "visibility": 7.59,
  "wind_bearing": 79,
  "wind_speed": 3.59
}