{
  "id": "23695",
  "title": "",
  "date": "",
  "observed": "My 7year old daughter and I decided to take my girlfriend out camping on the 4th of july weekend of 2007.My girlfriend had never been camping before and I wanted to give her the full effect. I live in Warren Pa and that is in the Allegheny Forest. We decided to camp out near the resivior by the Kinzua Dam. That first night, we were alone. Onebody near our site for atleast a quarter mile or more. Kat(my daughter) fell asleep and the two of us sat up and chatted. Off behind the tent, about 100 yards maybe closer, I heard a thud like a stick smacking a tree. Our yorkshire terrir heard it too. Then it was louder, more distinct like a base ball bat hitting a tree. My girlfriend was nervous, I could tell. I told her I had heard such a noise on a tape of Big Foot. She didn't like that I said that and got alittle scared. I told her it would be ok and that whatever or whoever would not come near the firelight. She still was uneasy. We heard it for about 15 miinutes as it got further away from us.I thought I heard a weird howling too but I just chalked it up as a coyote or wolf. Though I have heard big foot howls and this did sound similar. I still wasn't sure. All in all I figured it was telling us that this was his place and that we should not be here. I had to lie to my girlfriend so she could sleep and said it was most likely a skunk or racoon. Though I know niether of those could hit a tree like that. The next morning, I decided to look around and went out into the forest about 75 yards or more from the camp. I could still see the tent through the trees. I found afew old logs broken over.A few trees in the distance looked bent over as if someone had done it by hand(typical sign of big foot markings) but I never told my girlfriend. We stayed another night there but we had very noisy campers about 80 yards up the road trying to fight with another camper about the noise they were making. This was last year. Now, I went on google earth and was looking at The Kinzua Dam In Warren Pa. I noticed an orange dot near the dam just passed it to the east I believe. I clicked on it and it said 1999-10-?? I tried the link and WHOAH!! was I excited... A big foot sighting right there!!! I loved it. I am thinking on going back to the same place to camp this summer. Just myself, my girlfriend, my daughter and our dog. I love it out there. even if it does creep my girlfriend out lol.. There is something about big foot that makes me want to hear or see more. maybe even capute it on film or video.",
  "classification": "Class B",
  "county": "Warren",
  "state": "Pennsylvania",
  "location_details": "",
  "summary": ""
}