{
  "id": "8785",
  "title": "Family has series of experiences north of Steubenville off of State Route 213",
  "date": "2004-05-01",
  "timestamp": 1083369600,
  "observed": "Hello,  I live in Huntsville, Al. I have a friend who lives near Steubenville, Oh. She has told me that she has found large human-like footprints on her property several times over the past few years. Her son and nephew had a sighting of a Bigfoot a year ago. Now, she says that over the past week and a half or so, she has been experiencing some things. One of her sons and she went out in the woods behind her house 10 days ago or so, and she felt like she was being watched. Shortly afterwards, she smelled something that she described as \"rotting garbage.\" Then, she heard a loud knocking noise nearby. She described it as sounding like a log being banged against a tree. She noticed leaves stripped off trees that were out of her reach. And, she said to me that the sounds, and the feeling of being watched have continued to the present time. I asked her if it was OK that I contacted you, and she said that was fine. I then asked her if she would be willing to talk to someone about these happenings. She said yes. But, she feels a little uncomfortable about this, and wants me to be sort of a liaison. I told her I would email this in, then you can contact me, and I'll keep her updated. I wanted to tell you ASAP, in case you had an investigator who could run by there before these happenings quit. I'm not sure at this time, but I think if the investigation was discreet, she would allow one on her property. I'll have to talk with her some more about that. Or, if she's comfortable, maybe I can arrange for one of you to talk with her personally.",
  "classification": "Class A",
  "county": "Jefferson",
  "state": "Ohio",
  "latitude": 40.42591,
  "longitude": -80.6616,
  "location": "-80.6616,40.42591",
  "location_details": "North of Steubenville off of State Route 213.",
  "temperature_high": 76.65,
  "temperature_mid": 59.465,
  "temperature_low": 42.28,
  "dew_point": 57.51,
  "humidity": 0.75,
  "cloud_cover": 0.61,
  "moon_phase": 0.38,
  "precip_intensity": 0.0088,
  "precip_probability": 0.56,
  "precip_type": "rain",
  "pressure": 1014.71,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 8.95,
  "wind_bearing": 202,
  "wind_speed": 6.83
}