{
  "reportId": "9313",
  "title": "Vocalizations heard near Rockingham",
  "date": "2004-09-12",
  "timestamp": 1094947200,
  "observed": "Audio Experience only: Whoop, whoop, whoop, whoop, whoop, wooo.... Sunday, September 12, 2004 at about 03:00 AM I was woken up from a sound sleep by a very loud noise.  I listened for a while and tried to figure out what could make such a loud, repetitive noise.  It wasn't a coyote howl or fishercat screach, didn't sound like any owl I know of, wasn't a raccoon or tree rodent...  After 15 - 20 minutes, I went to sleep. My dog woke me with frightened barking at 4:00 AM when the sound was twice as loud and I knew the critter was within 100 feet of the house.  Also, there were two responding calls, one sounded fairly close and one was in the distance.  I got up to make sure the sheep were OK in their pasture with an electric fence around it and there was nothing by the barn where the goats were.  I flashed the light over to the chicken coop and nothing was there either.  I flashed the light throughout the yard and into the trees to see if there was any clue or any danger to the animals.  I saw nothing and while I shone the light, the calls ceased. All day I asked EVERYONE if they knew of any local animal that made the noise and repeated it all day long.  A friend suggested that I look it up on the internet.  I listened to all sorts of animal vocalizations with no luck.  When I finally typed in the words of the actual sound it was an identical match to this site!!!  I'm not saying I had a bigfoot encounter, but I definately encountered whatever the campers up in Lincoln, NH encountered last summer!!!  There may be a rational explaination and someone may know of an indigenous animal that makes that sound -- and trust that I will still try to find out what it is... but the sound will resonate in my memory -- as it was like no other animal/bird I've ever heard.  It was not too fast, nor garbled, it was incredibly loud and clear.  The dog was very nervous.",
  "classification": "Class B",
  "county": "Rockingham",
  "state": "New Hampshire",
  "latitude": 43.05,
  "longitude": -70.93333,
  "location": "-70.93333,43.05",
  "location_details": "I would rather not give details as it was my home.",
  "temperature_high": 73.95,
  "temperature_mid": 64.955,
  "temperature_low": 55.96,
  "dew_point": 52.04,
  "humidity": 0.76,
  "cloud_cover": 0.21,
  "moon_phase": 0.93,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.97,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 5,
  "visibility": 9,
  "wind_bearing": 202,
  "wind_speed": 2.84
}