{
  "reportId": "34485",
  "title": "",
  "date": "",
  "observed": "On March 4, 2012 at approximately 8:30 AM I had a visual sighting. It was cold, snowy, a bit overcast and a bit windy and approximately 28° to 30°outside.I was sitting in my mother’s apartment on the fourth floor watching TV and I happened to look out the window and I counted 15 full-grown turkeys moving down the hill adjacent to her apartment building. They were not running but they were not taking their time either. I would like to say this moment is not unusual to see two or three turkeys at a time coming down the hill but 15 were out of the ordinary. A short time later three deer came walking down the hill in the same manner as the turkeys, not actually running but not walking either. I did not think anything unusual was going on but I was surprised at the number of turkeys at one time. I asked my mother who lived there for several years if she had seen that many at one time and she said no. My mother who is 80 years old, my wife who is 38 years old, my son who is 11 years old, and I (53 years old) watch the turkeys walk across the parking lot and out of sight down by the church. I did not summons my family to see the deer as three deer were no big deal. Less than five minutes after the turkey and deer left the area I was still sitting in my mother’s room watching TV when I caught a glimpse of something out of corner of my eye and I looked and I saw a very large, very hairy animal that is unknown to me near the top of the hill. The animal was on all fours and near the top of a hill and took about three strides before it got to the top of the hill stood up and made a right and ran (on 2 feet) into the forest part of the field. It did not stand fully erect but like two thirds erect. The total time I had eyes on the creature was approximately seven seconds. Since that day I have tried to figure out in my mind what it could have been and I have no answer, honestly, the best I can say is that looked like a gorilla. Please understand that when I was younger I was a hunter. I did a lot of deer hunting and bear hunting in the Allegheny Mountains and seen a lot of animals but never seen anything like this.  I was a police officer for over 20 years and have been trained in observing my surroundings and articulating reports. South Park is not far from my mother’s apartment building and is full of wildlife and trees. In my mind I feel as though the creature was responsible for chasing the turkey and deer out of the woods, may have been very hungry and chase them too far not realizing that it had made its way into a populated area and when I saw it, it was trying to get back to the forest.",
  "classification": "Class A",
  "county": "Allegheny",
  "state": "Pennsylvania",
  "location_details": "PLEASE DO NOT POST THIS INFORMATION, THIS IS A SECURE RESIDENCE FOR THE ELDERLY.",
  "summary": ""
}