{
  "reportId": "25432",
  "title": "Man relates a series of encounters with a white bigfoot near Obion",
  "date": "1978-06-17",
  "timestamp": 266889600,
  "observed": "Well this is going to sound strange but, here it goes. I grew up in a small community were something else lived. I have talked to people from that area from three generations that have seen this thing. If you have never seen it most of the people that have won't tell you much, they do not want anybody to think they are crazy!! I even knew one man who, is dead now that had a relationship (fed it and it was not afraid of him)it. Any way I seen it 3 times during my childhood 1 time from about 200 yards with 2 other people. The other 2 times I was alone. One of those times I was maybe 40 yards away coming home and it was in my back yard by a fence. But the last time was very intence, I was walking home from town (about 3 miles away)and it was pretty dark so I was looking down most of the time. I was about a quarter of a mile from home and I turned onto the street that led to my house. I walked about 30 feet and there it was. It was about 10 feet in front of me. It was down on it's hands and feet doing something! It saw me at the same time I saw it, it stood up and we looked at each other for a few seconds (it seemed like forever) then it ran one way and I ran the other way. Now we always called it the White Thing. It looked like what most people think a big foot looks like except it is an off white color, it is about 8-9 feet tall. My father always said all of us kids were \"seeing things\" untill he found tracks while hunting. I know 30-40 people who have seen this thing.",
  "classification": "Class A",
  "county": "Obion",
  "state": "Tennessee",
  "latitude": 36.26451,
  "longitude": -89.25397,
  "location": "-89.25397,36.26451",
  "location_details": "Off of Interstate 155 at the Obion exit, turn west (away from town) go about 2 miles and Glass is the first Community you come to. It has been seen over about a 3 mile radius to my knowledge.",
  "temperature_high": 91.92,
  "temperature_mid": 83.735,
  "temperature_low": 75.55,
  "dew_point": 69.03,
  "humidity": 0.63,
  "cloud_cover": 0.26,
  "moon_phase": 0.38,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.11,
  "summary": "Partly cloudy until evening.",
  "uv_index": 9,
  "visibility": 7.2,
  "wind_bearing": 187,
  "wind_speed": 11.91
}