{
  "id": "20802",
  "title": "Woman picking berries with family has daylight sighting near Clark Fork",
  "date": "1985-08-15",
  "timestamp": 492912000,
  "observed": "My story is less threatening having witnessed \"Sasquatch\" in the middle of the afternoon while picking huckleberries twenty miles up Lightening Creek out of Clark Fork, ID. He/she came waltzing over the top of a knoll on the steep incline of a clear cut on a brilliant summer day in late August. It stepped over stumps with ease and at 100 yards distance picked up my scent, taking notice of my presence. In the midst of full stride turned and looked full into my face, then continued its course down the incline out of sight. It seemed that it was on a trajectory course, not to be deviated from its purpose. The creature was very tall, even at this greater distance. It seemed to only take notice that we were there, but didn't stop to inquire or access. It appeared very tall and covered with dark brown hair. No other animal would go down such a steep and brushy incline on its back legs or with such ease.  Its arms swung from side to side like any human walking in stride. I carried a 44 magnum with me at the time as I had my two small children with me. My husband and I had walked in two miles from a Forest Service road for the choicest late-summer berries. I felt no fear from the creature.  It was just paying attention. If it had been a bear I would have felt more threatened. I do know the reported screaming of these creatures unravels emotions. Miners up by Mullan in the 19th Century reported the screaming as well. Of course Native peoples knew all about it and that's where the original legends began, according to accounts as you have included in this website. I suspect if the creature had stopped and screamed I probably would have engaged my firearm due to my instinct to protect my two small children. We might have had a body as I was a pretty good shot, but as I mentioned above, I felt no intimidation at all and it was gone as quickly as it had appeared. I might add here that I did have a sense of some \"other\" presence which was the reason for my looking out across the landscape, otherwise I would have stayed focused on picking and watching my children who were by my side. I told my English teacher at North Idaho College (who was also a founder of the Cryptozoology Club, which I joined instantaneously)about my siting. He took my eye witness report and sent it to Grover Krantz, a professor at Washington State University in Pullman, WA who was gathering stories about Sasquatch sitings. One late afternoon in spring we Cryptozoology students, with our Club teachers gathered to drive up to an old mine out of Mullan. Our intent was to follow up on the old miner's stories that reported the nightly screaming of some \"terrible creature\" throughout the woods. We brought along tape recorders and stayed the night hoping that perhaps a Sasquatch just might find its way back into the area. It seems that the creature comes with an element of surprise to its witness. It appears that nobody is really looking for \"Big Foot\" when one crosses their path. The scientific search for the Loch Ness monster proved to provide no evidence for Nessie; that seems like an easier enterprise, using sophisticated sonar imaging. I can only suspect going out into the forest to find Sasquatch (as we did that night)is a much more difficult enterprise. According to some stories here on your website,we might just as well as parked along a roadside such as a major highway or rest stop. We did not hear any unusual forest sounds or saw anything out of the ordinary that night. If there are more stories of people actually trying to find Big Foot I would be most interested. It would certainly be interesting to dig into Grover Krantz' archives! I just never have. I am sure there are many collected sitings. I'm happy to see, after 22 years that you have provided this website for we believers. It may help convince those not priveledged to witness such a thing that sitings abound in spite of the lack of forensic evidence, even though I certainly hope we do get it sometime soon. We who are witnesses are part of the priviledged few, but ...where do they go and live? Maybe they're a part of an underground society.",
  "classification": "Class A",
  "county": "Bonner",
  "state": "Idaho",
  "latitude": 48.255,
  "longitude": -116.1475,
  "location": "-116.1475,48.255",
  "location_details": "Drive east on Hwy 200 to Clark Fork, Idaho. Turn up Lightening Creek just before crossing the bridge into the town. Drive approximately 20 miles up into the mountains. I'm not sure which Forest Service Road or old logging road that we followed to get to the clearcut at the top of the mountain.",
  "temperature_high": 67.84,
  "temperature_mid": 57.805,
  "temperature_low": 47.77,
  "dew_point": 46.07,
  "humidity": 0.57,
  "cloud_cover": 0.68,
  "moon_phase": 0.97,
  "precip_intensity": 0.0014,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1010.91,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 9.69,
  "wind_bearing": 8,
  "wind_speed": 5.12
}