{
  "reportId": "29409",
  "title": "Woman remembers childhood sighting near Rogers City",
  "date": "1967-05-17",
  "timestamp": -82944000,
  "observed": "Hi! My name is Gabe.  This is the first formal report I have ever made on this. It's a good one.I remember it as clearly as if it just happened.  It happened in 1967. That's a while ago but it left an unremovable memory on my \"read only memory.\" A permanent part of my memories. We lived in Rogers City Michigan.  Located in Presque Isle county.  At this time the town was small and had various thickly wooded lots here and there right inside city limits.  We were used to wild animals and many of the neighbors were regular hunters.  The serious type, with dogs and all.  I haven't been to Rogers City in quite a while so I don't know how much it has grown and I'll bet the forested lots are gone by now.  Across the street from our house was one of these lots.  It was so thickly wooded that a person couldn't see into it.  We (and the neighbors) kept hearing blast horn howl moaning type sounds.  These sounds are exactly comparable to the Ohio Howl (the ones with the dog barking in the background).  The lot was next to a cemetary on the left side as we faced it.  So to my older sister and me, we thought the sounds were attributable to a haunting.  The sounds had a terrifying ring to them as no one knew exactly what they were.  No dogs or people would dare go near the thicket.  Between the woods and the cemetary was a narrow road...half gravel and half crusher run.  We used to ride our bikes down this road as it was a short cut to friends houses.  My mom said \"it was very lonely down that road and stay away from there.\"  But we (sister and I) snuck down it anyway..real quicky on our bikes.  One sunny early spring afternoon, the snow had melted enough to bring out the bikes.  My older sis and I were on our way home...down the forbidden road.  She happened to look into the thick forest. She stopped and I did too...we both looked.  She said \"look, over there towards the middle of the lot...what is that!  It looked like a black burned out stump. It was the only thing on the lot that looked like that so we thought a tree had been struck by lightening and burned black.  Then the breeze blew.  Long black hair fluttered in the wind off the stump!! Then sis said that it looked like an old Indian sitting cross legged and covered with black long hair.  I could see a funny flat face (no snout, this was not a bear, it looked apelike..we had seen bears playing in the city dump so we knew what they looked like) with a pug nose, a low forhead, arms that looked long (resembled a praying mantis) and long legs crossed like people sit cross legged. The stump had a domed top and was at least 5 to 6 feet (in the sitting position)tall. Sis looked at me, white faced and terrified. She said I want you to get on your bike and peddle as fast as you can to the house.  What ever you do, don't stop and don't look back.  I'm going to do the same.  So we hopped on those bikes and peddled for our lives.  Sis had an English made touring bike that could really put on the speed.  I had an ordinary bike but I kept up with her.  To any one looking my feet would have been a blur.  This was REAL scary.  I can still feel the fear an see sis white face.  When we got home we threw the bikes in a heap in the garage and dashed inside the house.  Mom saw the fear and asked what had happened.  We told her about the big hairy black stump with a face.  We were grounded when we told her where we had been.  She believed us..I don't know why..she picked up on our fear and knew that we had seen \"something.\"  It was a long time til we rode those bikes again and we never went near that road or the thicket again either!!!",
  "classification": "Class A",
  "county": "Presque Isle",
  "state": "Michigan",
  "latitude": 45.40985,
  "longitude": -83.85985,
  "location": "-83.85985,45.40985",
  "location_details": "It has been many years since this happened.. I was eleven years old...Sis was thirteen...I guess Larke Avenue was off of main street at that time.  It ran parallel to a road that made the main highway and I don't remember the number of that.",
  "temperature_high": 57.54,
  "temperature_mid": 48.38,
  "temperature_low": 39.22,
  "dew_point": 26.88,
  "humidity": 0.47,
  "cloud_cover": 0.62,
  "moon_phase": 0.27,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.31,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 10,
  "wind_bearing": 335,
  "wind_speed": 3
}