{
  "reportId": "28936",
  "title": "Daytime sighting by a motorist east of Seneca",
  "date": "2009-06-24",
  "timestamp": 1245801600,
  "observed": "Ok,  first off, I am not a skeptic nor am I what people consider a loon. After hearing about the investigation a few years ago near Seneca. I found little interest in the story of the DuPont Monster, having lived around this general area most of my life urban legends are just that. Well after the story of the investigation had settled into distant memories in the summer of 2009 I was returning from Morris along Old Stage Rd on the north side of the river, about two and a half miles east from town after the houses end and the thick woods along the river gather, there is an old camp on the south side of the road and on the north there is an old abandoned tree farm. Dense overgrowth on both sides of the road basically. Now it was approximately 3:45 pm - 4:30 pm in afternoon about 60 - 80 yards ahead of me while talking on the phone with my wife I seen the most amazing sight. A 7 foot+ \"creature\" crossed in front of me into the old tree farm entrance at a casual pace, clearing the road surface in three steps. I immediately stopped at the entrance and figured if it wasn't in a hurry I would catch a glimpse, I was mistaken. All that was left was questions and a pungent smell of a wild animal, kind of like a bear unclean and musky. ",
  "classification": "Class A",
  "county": "Grundy",
  "state": "Illinois",
  "latitude": 41.33018,
  "longitude": -88.53889,
  "location": "-88.53889,41.33018",
  "location_details": "On the north river bottom road  - Old Stage Rd",
  "temperature_high": 91.82,
  "temperature_mid": 82.705,
  "temperature_low": 73.59,
  "dew_point": 68.5,
  "humidity": 0.65,
  "cloud_cover": 0.08,
  "moon_phase": 0.07,
  "precip_intensity": 0.0007,
  "precip_probability": 0.16,
  "precip_type": "rain",
  "pressure": 1011.78,
  "summary": "Clear throughout the day.",
  "uv_index": 10,
  "visibility": 9.9,
  "wind_bearing": 271,
  "wind_speed": 4.14
}