{
  "id": "7967",
  "title": "Boaters on the Deschutes hear loud scream from bank",
  "date": "1990-07-15",
  "timestamp": 648000000,
  "observed": "It was mid summer, probably July.  A friend and I were fishing from a boat on the Deschutes River above Pringle Falls near LaPine Oregon.  We were floating down stream very slowly around 10:30 am.  It was a very nice sunny day and very peaceful.  You really couldn't ask for a better day. As we were floating slowly downstream, we were heading toward a big dirt bank where the river did a 90 degree turn.  I remember picking up the stringer of fish to show my friend.  I was talking to him about our nice fish when something out of nowhere yelled at us.  It was terrible sounding!  Never in my life had I heard something like this. It started at a low howl and went up about two to three octaves and then back down again. It was so loud!  I am sure you could have heard it a mile upstream.  It also lasted a long time (maybe 10 seconds). It sounded more like a person than an animal, but it didn't sound like a person, either. I believe that it came from the top of the 30 foot tall mud bank we were heading towards. The dirt bank was around 100 yards away. We decided to investigate and found nothing.  The ground was nothing but pine needles so it would be hard to make a footprint.  We were right where we thought we heard this thing.  But we saw nothing.  I wish I could say I did see something but I can't. What makes this episode strange is that I talked to another friend of mine and told him about what happend.  I tried to give him a demonstration of what the thing sounded like.  He looked at me and said that I heard bigfoot.  Now I thought he was kidding but he said that he had a recording of one.  He also told me that his uncle was one of the big Bigfoot explorers.  His uncle even made a movie about them.  This was news to me.  He found this recording on a old record that he had and let me borrow it.  What I heard on the record sounded exactly like what I heard.  I mean exactly!  I later found this recording on the internet and it is called \"Howl\".  That is what I heard. Now I don't even know if I believe in bigfoot, but what I heard sounds like what you people believe to be a true recording of one.  It is a sound I will never forget! ",
  "classification": "Class B",
  "county": "Deschutes",
  "state": "Oregon",
  "latitude": 43.7151,
  "longitude": -121.6347,
  "location": "-121.6347,43.7151",
  "location_details": "The dirt road is called 4370.  It goes right along the river.",
  "temperature_high": 94.2,
  "temperature_mid": 74.895,
  "temperature_low": 55.59,
  "dew_point": 49.07,
  "humidity": 0.42,
  "cloud_cover": 0.02,
  "moon_phase": 0.76,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1011.38,
  "summary": "Clear throughout the day.",
  "uv_index": 10,
  "visibility": 10,
  "wind_bearing": 342,
  "wind_speed": 6.48
}