{
  "id": "19910",
  "title": "Nighttime sighting by property owner near Kishwaukee River.",
  "date": "1994-10-22",
  "timestamp": 782784000,
  "observed": "someone should call me about this....i have a great deal of information to relate.....autumn night....weather was warm but very foggy....area was at my house which was in a glen near the kishwaukee river.  very dense forest area within a couple hundred yards.  figure DID NOT look like a big hairy ape.....very tall, slender and very large eyes...color appeared simialar to a local deer. was hiding behind tree watching me...i have extremely good hearing and night vision.  it made noise as i was getting into a car.  with the door of the car open i reached in and turned on the headlamps.  it was peeking around a tree....it froze in the light but recovered quickly.  we made eye contact which it held for several long seconds.  it then turned and ran...within 3 or 4 strides it was able to hurdle a 5-6 foot fencing without breaking stride.  i was able to watch it run for several hundred feet, although my vision was hampered by the fog.  at that time i worked from home in my garage often at night and had heard many odd things before and after.  contact me for further information...i believe this creature to still exist and i plan on looking for it this summer.  I would be pleased to talk your organization, however i would prefer not to have this sighting listed just yet.",
  "classification": "Class A",
  "county": "Winnebago",
  "state": "Illinois",
  "latitude": 42.1846,
  "longitude": -89.022,
  "location": "-89.022,42.1846",
  "location_details": "Near the bridge where Interstate 39 crosses the Kishwaukee River.",
  "temperature_high": 71.43,
  "temperature_mid": 56.445,
  "temperature_low": 41.46,
  "dew_point": 45.81,
  "humidity": 0.7,
  "cloud_cover": 0.34,
  "moon_phase": 0.6,
  "precip_intensity": 0.002,
  "precip_probability": 0.85,
  "precip_type": "rain",
  "pressure": 1009.69,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 9.47,
  "wind_bearing": 207,
  "wind_speed": 4.77
}