{
  "id": "8843",
  "title": "Vocalizations heard and tracks found at Salt Fork State Park",
  "date": "2004-04-17",
  "timestamp": 1082160000,
  "observed": "I woke up on the morning of April 17, 2004, at about 5:45 AM and made my way out of the tent to make breakfast (I was on a camping trip with my father). As I got breakfast ready, I sat down to watch the water boil when I heard a loud scream/howl sounding very much like the Columbiana County, Ohio recordings on this website. As soon as I heard this I ran down a hill from my campsite to the North bank of Salt Fork Lake. On my way down I heard another howl. Both were slightly shorter than the Columbiana recordings but still the same sound. I know that they came from the southern bank and I would guess that they were most probably a mile or so away. I only heard the sound twice. I was still a little shocked and didn't tell my father until a few hours after he got up. The howls didn't wake up any campers that I know of. The two days before this incident I was walking on a trail and found a series of human-like footprints leading down the trail in the same direction I was traveling (west). I found one to still be in good condition so I cast it. It was of a left foot. It measured slightly over 12 inches long and was 5 1/2 inches wide.  It had three well defined toes, one that was barely pressed down, and one toe that is missing, although there is a space for a toe in the area in question. Other, less defined prints were found. They were in about 4 - 4 1/2 ft. strides.",
  "classification": "Class B",
  "county": "Guernsey",
  "state": "Ohio",
  "latitude": 40.0799,
  "longitude": -81.49697,
  "location": "-81.49697,40.0799",
  "location_details": "It was on the northern bank of Salt Fork Lake at Salt Fork State Park, which is just off State Route 22 in Guernsey County, Ohio.  I was staying in the \"F\" loop camp area.  I do believe I was staying in the camp plot \"25.\"  The call was heard right from the site and a little down the hill leading to the lake and the footprint was cast about a mile down the trail from the campsite on a trail touching the lake.",
  "temperature_high": 77.78,
  "temperature_mid": 68.68,
  "temperature_low": 59.58,
  "dew_point": 49.36,
  "humidity": 0.58,
  "cloud_cover": 0.22,
  "moon_phase": 0.94,
  "precip_intensity": 0.0041,
  "precip_probability": 0.71,
  "precip_type": "rain",
  "pressure": 1021.29,
  "summary": "Light rain overnight.",
  "uv_index": 8,
  "visibility": 9.7,
  "wind_bearing": 214,
  "wind_speed": 8.56
}