{
  "reportId": "11295",
  "title": "Coon hunters hear vocalizations and footprints found near Burlington.",
  "date": "1984-11-17",
  "timestamp": 469497600,
  "observed": "This happened in the early winter of 1984. A friend and I decided to go out shining coon; we had a warm spell and we thought the animals would be out. We headed back to the woods about 11 pm, and after spending almost an hour, we couldn't figure out why we didn't see anything. I was around 19 at the time, and my friend was about 21. We were not drinking, or using drugs, period. We made our way to the back of the woods, and decided to sit on a big log and have a cigarette. We sat there for about 2 minutes, talking quietly, when something screamed behind us. This was like no other scream we had ever heard before; it scared the crap out of us. It sounded like it was about 50 feet away, and you could hear the huge volume it created from it's lungs, almost like from there, and not its throat. I have hunted and trapped my whole life, camped out in the woods a lot, and I couldn't imagine what would have screamed like that. It wasn't like a person would scream, or any animal I've ever heard of. We were both armed with .22 rifles, and my friend was a Harley biker. He was really freaked out, and wanted to leave immediately. I was scared but curious at first, until it screamed again, and something answered it, from maybe a half mile away. We left immediately. We didn't tell anyone besides my mom that we were going out that night, and there were no houses close by. It wasn't until a few years ago that I heard a sasquatch vocal on a website, and my hair stood up because the vocalization sounded exactly like what I had heard that night.",
  "classification": "Class B",
  "county": "Kane",
  "state": "Illinois",
  "latitude": 42.075,
  "longitude": -88.53872,
  "location": "-88.53872,42.075",
  "location_details": "Lenschow Road intersects between Hampshire and Burlington, by French Road. Go east on Lenschow about 1/2 mile to the woods on the right.",
  "temperature_high": 41.61,
  "temperature_mid": 38.215,
  "temperature_low": 34.82,
  "dew_point": 22.05,
  "humidity": 0.62,
  "cloud_cover": 0.72,
  "moon_phase": 0.81,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1024.13,
  "summary": "Overcast throughout the day.",
  "uv_index": 1,
  "visibility": 9.51,
  "wind_bearing": 222,
  "wind_speed": 6.45
}