{
  "id": "16204",
  "title": "Repeat visitations described near rural home",
  "date": "2006-10-08",
  "timestamp": 1160265600,
  "observed": "My name is Helen and I live in West Virginia. It's hard to explain what I've seen. Me and my husband think we have seen a family of bigfoots. The most recent sighting was 10-8-2006 and I'm telling you it was 7\"2 and huge, with big yellow eyes. It was watching my husband put our puppies in the fenced in dog pen. I just grabbed my 3 year old son and slowly walked to the porch. My husband didn't even know at that time that he was being watched. Later on that night he seen something very big and he heard it walking closer to him.... He ran inside and we locked the door. He advised to me that it was no bear that could stand that tall, walk on hind legs! The time we had seen 3 of them was at the beginning of September. I left rotten chicken outside and from the look of the leftovers it couldn't be a small animal. The next morning about 5:00am we heard something big walking on the porch. then we heard the van door slam. My husband loaded the gun. We looked out the window, very quietly opened the front door. we heard a yelling noise and footsteps. There up in the woods across the road was 2 of them. they we're standing side by side. one looked young and scared and hid behind a tree but the older one looked viscous and not afraid. He stood out in the open. my husband did fire a shot in the air to scare it away, which worked because  they ran.",
  "classification": "Class A",
  "county": "Hampshire",
  "state": "West Virginia",
  "latitude": 39.5226,
  "longitude": -78.49429,
  "location": "-78.49429,39.5226",
  "location_details": "Route 29 (Edited for privacy)",
  "temperature_high": 67.6,
  "temperature_mid": 57.8,
  "temperature_low": 48,
  "dew_point": 51.13,
  "humidity": 0.83,
  "cloud_cover": 0.41,
  "moon_phase": 0.56,
  "precip_intensity": 0.0001,
  "precip_probability": 0.1,
  "precip_type": "rain",
  "pressure": 1026.63,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 4,
  "visibility": 8.26,
  "wind_bearing": 66,
  "wind_speed": 0.25
}