{
  "id": "5519",
  "title": "Man recalls childhood encounter with sasquatch",
  "date": "1972-05-15",
  "timestamp": 74736000,
  "observed": "I was a boy of about 12 years of age camping on my parent's land.  We had a house atop a hill that sloped down an acre or two, leading to Bear Creek, which is where our property ended.  The land on both banks of the creek was thickly wooded and our land was not cleared all the way to the water.  Three of my friends and I had built a fire and unrolled our sleeping bags about a hundred yards or so away from the house in the direction of the creek.  One of the younger boys was not permitted to stay all night and as he left to go home, two of us were shining our flashlights at him and teasing him about a boogey man getting him.  He was probably about twenty yards or less away from our little campsite, walking throught the tall (2-3 ft.) grass.  In the dim light of the flashlights at that distance I saw a few yards behind him and walking in the opposite direction a form that looked like a large biped.  My best estimate would make it 6' 5\" or taller.  What I saw was from halfway between the elbow and shoulder to about halfway between the knee and ankle, so my height estimate is quite rough.  It took about three strides before it went from on side of the light to the other, the strides were long and smooth, not at all jerky, and it looked like the knees remained bent as if it was not standing straight upright but slouching somewhat, and the arms swung low.  Under the poor lighting conditions I could not tell what color it was, it looked gray in the shadowy lighting, and it looked furry or hairy.  Had I thought of it, I would have tried to follow the form with my falshlight, but the first thing I did was look at the boy sitting on the ground next to me, who was also holding a flashlight, and he was already looking at me very wide-eyed.  He asked \"Did you see that?\" and I stood up and called for the departing boy to come back.  He returned and when we told him what we had seen, neither he nor the other boy there believed us.  He went home and the two of us who had seen it, not venturing far from the fire, looked around with our flashlights but we didn't see anything unusual.  Neither of us would admit we were afraid so we stayed all night (but didn't sleep much)  The next day I looked for footprints or disturbed soil or grass and found nothing.",
  "classification": "Class B",
  "county": "Bay",
  "state": "Florida",
  "latitude": 30.32305,
  "longitude": -85.4427,
  "location": "-85.4427,30.32305",
  "location_details": "The parcel of land is located where North Bear Creek Road converges with South Bear Creek Road, approximately 1/4 mile from U.S. Hwy 231.",
  "temperature_high": 80.5,
  "temperature_mid": 73.845,
  "temperature_low": 67.19,
  "dew_point": 68.09,
  "humidity": 0.79,
  "cloud_cover": 0.71,
  "moon_phase": 0.09,
  "precip_intensity": 0.1,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1013.18,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 8,
  "visibility": 9.79,
  "wind_bearing": 229,
  "wind_speed": 4.21
}