{
  "id": "496",
  "title": "Campers see large figure cross river in moonlight",
  "date": "1977-08-15",
  "timestamp": 240451200,
  "observed": "The sighting occurred sometime afer dark.  I was in my sleeping bag sleeping on a sandbar with three other guys on the Meramec River after an afternoon of canoeing and fishing.  I was awaken and was looking upstream into a beautiful bright, full moon.  The light being given off was so bright, that you could read by moonlight alone.  Suddenly about 20 yards upstream to my left, a very large, very massive creature walking on two legs, stepped into the river to cross.  It appeared to have a very massive upper body.  Because of the moonlight and angle I could see that its body had a very \"furry\" appearance to it. When it walked, I could see its arms sway and its knees bend with every step.  I also noted a very pronounced crest on the top of its head and a very pronounced ridge on its eyebrow line.  I was on my back looking upstream and propped myself up on my elbows for a better look.  As I did this, Greg who was off to my left propped himself up also and said out loud, \"What the hell is it?\".  I answered, not taking my eyes off the creature, \"I don't know, must be somebody ripping off cabins.\" Implying a human form.  Immediately upon Gregs words, the creature turned at the waist and looked at us only taking its eyes off us to look at the other bank when it exited the river.  When it looked at us, its face blacked out due to turning away from the moonlight.  I remember hearing the creature cutting the water, which was about 3 feet deep, as it walked.  The water flow was very fast and no man could have crossed this area and remained standing for very long.  The water came up to the creatures knees.  I could see its knees bend as it lifted them to walk. It exited the river on the right side and we lost sight of it.  This sighting lasted only about 10 seconds, but lives vividly in my memory.  The next morning when Greg and I recalled what we had seen to the other guys, we were severely ridiculed.  Because of this, we didn't go and check for tracks or other sign.  We both agreed that what we saw was not human and far too tall and massive to be a person or bear.  We both then agreed that it had to be a Bigfoot we had seen. I do recall that the draw that the Bigfoot had come out of prior to entering the water was very dark, with thick brush and a spring fed creek in it.  As we were floating by,  I remember having a very uneasy feeling about it as I was looking at it and would not have gone into it.",
  "classification": "Class A",
  "county": "Crawford",
  "state": "Missouri",
  "latitude": 37.8597,
  "longitude": -91.432,
  "location": "-91.432,37.8597",
  "location_details": "We had put in our canoes at the Highway 19 bridge, floated north about 4 or 5 hours before camping before nightfall.",
  "temperature_high": 89.23,
  "temperature_mid": 81.94,
  "temperature_low": 74.65,
  "dew_point": 71.07,
  "humidity": 0.77,
  "cloud_cover": 0.36,
  "moon_phase": 0.02,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.18,
  "summary": "Partly cloudy until evening and humid throughout the day.",
  "uv_index": 7,
  "visibility": 6.52,
  "wind_bearing": 143,
  "wind_speed": 6.39
}