{
  "reportId": "664",
  "title": "",
  "date": "",
  "observed": "I was driving home to Bend near sunset, just south of La Pine on US Highway 97, on Nov. 5th, 1996 when a hawk was flushed from the treeline ahead on my right.  It flapped vigorously, headed southward directly  toward my car, crossed over it and kept going.  It was not gliding, it was accelerating. Seconds later, I saw a tall, rangy figure suddenly emerge from the cover of the treeline, about 150 feet ahead on my right, and stride determinedly toward the road across a grassy fringe. As I slowed and closed the distance to  within 50 feet, the figure with no hesitation, stopping neither to look in the direction of my approaching car nor to gauge the speed and distance,  glided across the two lanes in  four strides and kept going directly into the cover of the pines on the other side of the road. I asked my wife if she had seen the 'person' crossing the road.  I wanted her opinion of what had transpired before expressing my own suspicions. Unfortunately,  she said no - that she had been trying to follow the flight of the hawk behind the car. On immediate reflection, I realized I had seen something unusual but could not say what exactly I had seen. Nor can I say now what it was.  But if it was a human being,  it was a strange one. The figure seemed not just tall but VERY tall - I would estimate close to 6'8\" to 7' tall (based the figure's height relative to roof of my car). The length of stride required to cross the road in just four strides would be quite large. Its actions did not seem typically human. It did not wait for its chance to cross at the roadside - it waited hidden in the treeline.  When its chance came, it never slowed until hidden in the pines on the other side of the road. It didn't even turn toward me, though its efforts indicated it was aware of and concerned by our car's approach. It didn't run or jog as a human might who is caught crossing the road in front of an approaching car. Its step was a well articulated (almost thoughtful) full heel to toe stride with a vigorous push off. It moved briskly with a long swinging arc of the arms, a slightly stiff body-lean with the head and trunk bent forward from the waist.  The head was not bent at the neck; I saw no neck; the whole upper torso was bent from the waist. I have thought about the 'clothing'. During the brief seconds, I had seen the figure, the clothing appeared to be completely and uniformly DARK - top to bottom - without distinguishing characteristics. I could not identify the articles of clothing - jacket,jeans, boots, gloves etc. with one exception.  The one article of clothing that I might have noted was perhaps a peaked lumberjack's cap with a fuzzy tassle. On reflection, I wonder if it might instead have been the oft-reported pointed head or skull. Please do not put my name or contact information on the public site.  You may make it available to researchers if requested.",
  "classification": "Class A",
  "county": "Deschutes",
  "state": "Oregon",
  "location_details": "On US Highway 97, north of the Highway 31 intersection and south of La Pine",
  "summary": ""
}