{
  "reportId": "9038",
  "title": "While hunting in Sabine River bottoms, two boys have daytime encounter",
  "date": "2004-08-16",
  "timestamp": 1092614400,
  "observed": "Today I accidentally found your site looking for something that had nothing to do with big foot. I had no idea anyone else in my area had ever seen or reported any stories of a big foot. I never told anyone about what I and my friend seen hunting after school one day. I don't remember me and him even talking about it very much. It was in 1987 it was hunting season I'm not sure the month. The two of us were walking along a dirt road in the Lockerplant river bottoms. Not sure which of us seen it first but definitely caught our attention.We were looking down a right of way when this large figure walked out of the trees. It walked along the tree line for several seconds going back into trees. At first we thought it was one hell of a big man or maybe someone hauling a deer across there shoulders. I remember asking [my friend] if that guy was wearing a fur coat. We knew what it was and it was not a man. The thing was at least 7 foot tall and covered in hair. It seemed to walk like a person, it was too far away to notice any details about face, hands or feet. I'm not sure but think it noticed us and that was the reason it never crossed the right of way. We knew what we seen and even with guns in our hands we both ran all the way home.",
  "classification": "Class A",
  "county": "Gregg",
  "state": "Texas",
  "latitude": 32.51667,
  "longitude": -94.9,
  "location": "-94.9,32.51667",
  "location_details": "Gladewater. Hwy 80 east to Lockerplant Rd. Follow into river bottoms approx.1.5 miles.",
  "temperature_high": 88.2,
  "temperature_mid": 76.72,
  "temperature_low": 65.24,
  "dew_point": 59.47,
  "humidity": 0.58,
  "cloud_cover": 0.19,
  "moon_phase": 0.02,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.77,
  "summary": "Partly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 10,
  "visibility": 9.9,
  "wind_bearing": 124,
  "wind_speed": 3.72
}