{
  "id": "50025",
  "title": "",
  "date": "",
  "observed": "I was returning from one of my research areas in the Pine Barrens with a friend of mine. We had spent a few hours out in the forest on this cold and damp night trying to illicit a response from a Sasquatch. We had zero activity, and due to the declining weather conditions, I decided to wrap it up for the night around 12:35am. We packed up our gear, and began the drive homeward. We had just crossed a main road entering back into civilization, and were discussing music - when something came charging out from the front right side of the road. I was traveling at around 50mph, and got on my brakes hard. Luckily I had anti-lock brakes and avoided skidding, and I barely missed hitting the creature. My friend was holding a bottle of water between her legs, and when I braked - she slid forward and the water sprayed all over her. She said \"What was that?!\" And I replied \"Deer\", and she said \"No it wasn't!\" I then realized that what I had just seen was not a deer, or a dog, bear, or human dressed in a costume. It had no muzzle, tail, or pointy ears, and the legs were thicker than mine. It ran hunched over, and appeared to propel itself faster by pumping its arms. Just as it looked like it was about to be hit, it turned its upper body, and looked at us with an expression of shock as if it knew it had messed up. It never broke stride, and continued running across the road and into the woods across the street. I slowed my vehicle and made a U-turn returning to the spot. I got out of my car and tried to listen to hear anything moving through the brush. I didn't hear anything, and I couldn't smell anything either. I checked for tracks alongside of the road, but did not see any.",
  "classification": "Class A",
  "county": "Burlington",
  "state": "New Jersey",
  "location_details": "This road leads home from the Pine Barrens. The location was near high tension pole lines, and nearby developments. Keep exact location details private.",
  "summary": ""
}