{
  "reportId": "28873",
  "title": "Motorist recounts daylight sighting on her property east of New Waverly",
  "date": "2007-11-15",
  "timestamp": 1195084800,
  "observed": "Where:  San Jacinto County, Evergreen, TX When:  My incident happen in November 1997, Thanksgiving week on Monday at about 11:15 am. From New Waverly driving east on SH150, turning on to FM  1725, one and ¼ mile in the Hillcrest Subdivision on Gale Haven Road. Gale Haven Road is a little road curves and it runs next to our property goes down to a dry creek bed as you come up out of the creek bed the road started to curve again in sort of an S shape. The weather was cool and sunny there were thick woods on both side of road. On the passenger side there was a dip for runoff and the property was fenced, the owner has longhorns on that property but the property was wooded.  On the driver side the woods were very thick and there was a deeper runoff, there were downed trees on the edge and no fence.   The fastest you could drive on this road was about 20-25 mph. I was driving a 1993 Saturn that was a standard transmission, I had let my daughter sit in the back with both of her friends and they were being laughing and talking enjoying the last few minutes before I took them home 20 miles away. They were around 15 at the time, I had to have them home by 12:00 noon thats why I remember the time.  At this location I can see our property in my rear view mirrow. As I came out of the dip the road curves to the passenger side and before the road curves to the other side.  I am facing the road and looking into the thicket ahead,  and  60 to 80 feet from my car in the thicket I see what I first thought was the haunches of a horse moving around I could only see the top part.  What I saw had shinny reddish hair and was like 7 to 8 feet high.    Then I remembered I didn’t see a tail.  As I go up this curve toward this thing I start to look at it a little closer and then this thing, that I thought was a horse, turns around and looks straight at me then crouches down and tries to hide behind a little tree and it’s sitting there looking at me.  The only thing that I clearly remember is that the eyes were big and black.  The expression on it’s face was surprise and the eyes followed me and I drove within 15 to 20 feet of it, as I drove by I turned my head and looked out the window.  I did see it in a crouched position and its head looking in my direction.  I don’t remember skin color and I looked  to see it crouching there, big thick arms, legs and a look of surprise.  I couldn’t have been driving more than 15 mph and I did not stop, I kept going. I honestly do not know what I would have done if it had sprang to its feet (I get scared really easy). I was so scared that I didn’t even stop at the stop sign and I was also scared I would flood the car since it was a standard.  The girls looked up and I couldn’t talk and I was finally able to talk I asked them if they had seen anything and they said no and I told them I thought I had seen something in the woods, then  I decided not to describe what I saw, I told them  it was nothing.  But I did see something there and it saw me.  If I had persisted with my daughter, she would have gone nuts, we would have never been able to live there ever again.  Later that day I told my husband about it and he didn’t believe me.   He started telling me he saw a ghost dressed in blue in the front yard when he went to work in the mornings.  So I didn’t mention it again. He would ask me about it from time to time and I stuck to my story and he stuck to his. After that I didn’t go into the woods anymore.  We had 2 ½ acres, we had cleared about 1 acre of our land and I wanted to clear all of it.  I used to work to clear little by little, my husband stopped helping me because the more I cleared the more he had to mow.   I didn’t like the woods that close to the house I wanted to see what was out there. Needless to say, my clearing days ended after that. I started closing the curtains at night, put lights all around the house.  When I drove home I would turn on the high beams to make insure that there was nothing out there on our property. Our land was not fenced.  And I know what is out there deer, hogs, I have chased billy goats and those longhorns out of my yard before and I know what they look like up close.  We now live in west Texas since 2007, and I have no regrets. We were located at the top of a little hill, the back part of our subdivision is lower and there are creeks and ponds in the back, and there were some parts that have really thick woods.   About a mile down FM 1725 there is another road called Dabney Bottoms that when it rains a lot, that road floods bad, you cannot drive thru there, even the road is unpaved thru that part.  Another 2 miles down the road on FM 1725 the Sam Houston National Forest starts, my husband use to hunt there, he said there was places on the Dabney Bottoms side of the forest that were really deep and very thick that you almost couldn’t hunt there.  He also said he had been in an area back there where he come across a place that smelled really bad and it looked like a place where several big things slept there, all the brush was flattened out. He just remembered smelling that smell at other times and always wondered what that was. I started asking the neighbors and they said they started getting their chickens killed or missing but they thought it was a skunk or fox.  I never even considered that it would have been a bigfoot, never entered my mind.  Then one day in February of 2009 my husband asked me to describe what I had seen a long time ago.  Then he asked me to read some of the articles on a bigfoot website and the same fear came over me and couldn’t believe other people were describing what I saw back then.",
  "classification": "Class A",
  "county": "San Jacinto",
  "state": "Texas",
  "latitude": 30.31363,
  "longitude": -95.17966,
  "location": "-95.17966,30.31363",
  "location_details": "Driving East from New Waverly, Texas about 7 miles on SH 150, then left on FM 1725 go 1 1/2 miles on the left is Hillcreek Subdivision, turn right on Gale Haven Road passed Sandy Creek Rd.",
  "temperature_high": 66.02,
  "temperature_mid": 53.225,
  "temperature_low": 40.43,
  "dew_point": 28.03,
  "humidity": 0.33,
  "cloud_cover": 0.17,
  "moon_phase": 0.18,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1025.64,
  "summary": "Breezy and partly cloudy in the morning.",
  "uv_index": 4,
  "visibility": 9.9,
  "wind_bearing": 0,
  "wind_speed": 11.93
}