{
  "reportId": "7473",
  "title": "Family finds tracks and has close visual encounter.",
  "date": "2003-11-29",
  "timestamp": 1070064000,
  "observed": "My family resides close to Norman, Oklahoma, and from 1976 to the present, there have been numerous incidents revolving around Bigfoot, including two sightings in 1976 and one in January 2003, footprints in both mud and snow, several incidents where vocalization was heard, and numerous other accounts of stones being thrown, foul odor being smelled, fruit being taken off of trees, etc. Back in 1976, Bigfoot researcher Bob Stamps and his partner took several plaster casts of footprints and interviewed family members who had heard and seen the creature. The most recent sighting happened in January of this year. My 61-year old brother-in-law was chopping wood and breaking kindling approximately 40 feet from his house near the edge of the woods. It was early evening and he was just about to finish when he happened to look up and caught the sight of the creature out of the corner of his eye. At that point, the creature was approximately 15-18 feet away from him, standing in enough of a clearing so that he could see him from the waist up (due to thick underbrush he could not see any further down). He estimated the creature to be 7-8 feet tall with a slight hunch.  He froze for a minute and then dropped the wood that was in his hands and ran inside of the house. By the time he entered the house he was visibly shaken and according to my sister, he was \"as white as a ghost.\" The hair on his arms were standing on end caused by physical reaction of goosebumps due to the state he was in. He was having difficulty breathing and therefore was having a hard time speaking. All he could say was \"Buh...buh...buh...\" My sister and niece thought he was having a heart attack and were fearing for his life. When he was finally able to calm down, all he could get out was \"Bigfoot.  I just saw Bigfoot.\" Since my brother-in-law was snapping kindling over his knees, we have come to the conclusion that it was this noise that drew the creature to him.",
  "classification": "Class A",
  "county": "Cleveland",
  "state": "Oklahoma",
  "latitude": 35.27639,
  "longitude": -97.33528,
  "location": "-97.33528,35.27639",
  "location_details": "",
  "temperature_high": 64.05,
  "temperature_mid": 53.015,
  "temperature_low": 41.98,
  "dew_point": 20.42,
  "humidity": 0.38,
  "cloud_cover": 0.08,
  "moon_phase": 0.21,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.19,
  "summary": "Breezy throughout the day.",
  "uv_index": 2,
  "visibility": 9.32,
  "wind_bearing": 189,
  "wind_speed": 15
}