{
  "reportId": "5817",
  "title": "Woman recalls childhood encounters.",
  "date": "2003-02-11",
  "timestamp": 1044921600,
  "observed": "We were walking down the road enjoying our summer vacation.  When one of us noticed that there was something walking in the pasture North of where we were standing.  It was close to 7 feet tall, had long white hair (at least a foot), was walking on two legs.  It stopped when it noticed us standing there watching it.  Actually we were almost too scared to run.  Anyway it acted like it was going to come our way so we took off for a little ways then stopped to look again.  Everyone knows that a fence with 6 strands of barbed wire is at least 5 feet tall right.  Well, it stepped over that like it wasn't there and kept on going to the East taking long strides and swinging its arms back and forth while it walked.  A few days later we were in the same general area and noticed some long white hair hooked on the top wire of the fence.  We took it home to prove our story we told the day before.  We called it a Honka.  Have to say that we were more careful about how late we stayed out from that day on.  Always made sure we were home before dark.  Until the moment we saw it we had heard lots of stories but never believed them.  Seeing is believing.  If you can talk to anyone in the Dustin area you will be told of several sightings of this nature and also will be told about what everyone called \"The Light\"",
  "classification": "Class A",
  "county": "Hughes",
  "state": "Oklahoma",
  "latitude": 35.27056,
  "longitude": -95.97,
  "location": "-95.97,35.27056",
  "location_details": "it was about 3 miles east of hwy 84.  not too far from the mountain.  There was creek that ran through the pasture.",
  "temperature_high": 59.12,
  "temperature_mid": 45.605,
  "temperature_low": 32.09,
  "dew_point": 29.1,
  "humidity": 0.6,
  "cloud_cover": 0.06,
  "moon_phase": 0.32,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.44,
  "summary": "Clear throughout the day.",
  "uv_index": 4,
  "visibility": 9.78,
  "wind_bearing": 46,
  "wind_speed": 2.33
}