{
  "reportId": "41265",
  "title": "Possible sighitng at dusk by father and daughter riding an ATV near Bartow",
  "date": "2013-05-16",
  "timestamp": 1368662400,
  "observed": "May 16, 2013: I live on the border of Highland City and Bartow. Our neighborhood borders a series of orange, grapefruit and tangerine groves that are all adjacent to landfill and mining property.  Around 7:30 pm my daughter asked, as she does typically, \"dad, lets go look at the pigs\". About three to four times a week we ride these groves on our four wheeler and survey for wild animals. We've seen bobcat, coyote and pigs. In the past two and a half months we have been following a family of pigs which when we first sighted them had around 15 piglets about a month old. So we have been spotting them to see the growth of the piglets who are about 40 lbs now. After making our normal rounds around a few sections of groves we had not spotted the family. After riding slot down one of the main grove roads she spotted a big boar and we kept moving. The four wheeler was giving us some problems so I ran up through the gears to maybe clean the carb a little which put us about a quarter of a mile down this main road further back into the groves. We then turned around and returned to the spot where she had seen the big boar, well a few rows of trees short, where we slowed our pace to view this pig. Sure enough he was there. Three rows of trees past this location was the intersection of another heavily traveled grove road where we slowed down and turned the four wheeler off to listen for any more pigs. Just after shutting the four wheeler off a smaller boar crossed the adjacent main road....and then another, another and another. Three boars crossed. Immediately after seeing the boars, in the opposite direction we both heard four simultaneous noises. Now I consider myself an avid outdoorsman, hunting small and large game and also fishing for the last 25 years. I've seen and heard just about every animal in the local ecosystem and still hunt alligators yearly. After hearing these noises my immediate thought was...\"what are people doing out here\", when my daughter asked what was that dad? If you've ever heard a panther cry in the wild, than that was the closest animal sound I could explain to my daughter that we might have heard. Immediately after telling her that I heard her take a quick deep breath and quickly looked in the direction she was when I saw what I cannot describe as any animal I have seen in 25 years. I saw something dark brown, upright and moving very quickly across the row between the trees. My daughter asks \" dad, what was that\" when I replied \"I don't know\". I kill 10 to 13ft alligators for sport and am not easily frightened. This animal made the hair on my arms stand on end and chills run down my body. After studdering in my nervousness, we finally got the four wheeler started and sped off to our house. On the ride home, after i had in my own mind dismissed all other possible animals, told my daughter that I believe what we saw was a Sasquatch. The next day after work my dad, daughter and I went back to the location to look for hair, footprints or any other signs of the animal with no results. The sand was too soft to even make out the pig tracks. I did however stand with my daughter and have my dad walk to where we saw this animal and do a size comparison. We estimated it to be between 7 to 7 1/2 feet tall and 2 feet wide. Pigs and other 4 legged animals are low and long so I know for sure that's not what this was. So after hearing these sounds and seeing what we saw, the only animal that I can compare to it was a Sasquatch.",
  "classification": "Class B",
  "county": "Polk",
  "state": "Florida",
  "latitude": 27.93531,
  "longitude": -81.87347,
  "location": "-81.87347,27.93531",
  "location_details": "",
  "temperature_high": 85.51,
  "temperature_mid": 74.915,
  "temperature_low": 64.32,
  "dew_point": 58.5,
  "humidity": 0.6,
  "cloud_cover": 0.07,
  "moon_phase": 0.21,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.74,
  "summary": "Clear throughout the day.",
  "uv_index": 12,
  "visibility": 9.72,
  "wind_bearing": 124,
  "wind_speed": 4.24
}