{
  "reportId": "50837",
  "title": "Motorist has early morning sighting outside Anitgo",
  "date": "2016-01-12",
  "timestamp": 1452556800,
  "observed": "I was on my way to the vet and on highway 47 as I came over a hill and Crested the top of the hill I saw a Bigfoot standing on the shoulder it was the only thing in my entire viewing area besides woods on each side it was dark brown in appearance it had two legs and one arm as I saw a profile view it jumped off into the ditch line and went into the woods. I immediately thought of what I just saw & my conclusion was a bigfoot. It was vertical & on a slight angle as it was ready to go into the woods. It was heading g north. I could see the width of legs & its body shape only but I was at too far a distance to make out hair or face. There  was nothing to abstruct my view because what was in back of him was shoulder and the road that continued West which also went up to a hill I only saw it because I crested over the hill it was plain as day what it was until he disappeared into the woods. I immediately called my husband and he got to the site I described approximately 45 minutes later. He reported seeing something had jumped and made a clearing into a small snow bank and also reported seeing some sort of tracks going along a deer trail which led to a deer carcass. The deer also had no front legs they were snapped off at the knees",
  "classification": "Class A",
  "county": "Langlade",
  "state": "Wisconsin",
  "latitude": 45.05855,
  "longitude": -89.08323,
  "location": "-89.08323,45.05855",
  "location_details": "I was traveling west on Highway 47 in between County Highway W going west to highway 45. It happened on highway 47 approximately 125 yards east of trout road Bigfoot was going north",
  "temperature_high": 5.15,
  "temperature_mid": -1.92,
  "temperature_low": -8.99,
  "dew_point": -6.91,
  "humidity": 0.7,
  "cloud_cover": 0.14,
  "moon_phase": 0.09,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.14,
  "summary": "Clear throughout the day.",
  "uv_index": 1,
  "visibility": 8.89,
  "wind_bearing": 298,
  "wind_speed": 10.12
}