{
  "reportId": "41621",
  "title": "",
  "date": "",
  "observed": "I have had bigfoot sightings and experiences since 2010 in a rural area between NM and Lubbock, TX with the latest experience occurring last Sunday.  I would like to write my experiences in full detail but time will not let me, so I will only say that last Sunday I was near land that is owned by my father-in-law and we were looking for deer in tree area of a draw.  I noticed a tree close to the road had tumble weeds all around it and up to the top of where limbs begin. I noticed the tumble weeds were a muddy tan color like they had dried mud on them.  I saw that they were that way because there was something dark sitting there facing towards the draw away from the road.  Once looking through binoculars and going back and forth in the vehicle to observe, I noticed that the dark hairy creature kept moving around the tree to make it look like there was nothing there.  Got a little further south of the tree and looking back through binoculars I saw a hairy head with matted fur bobbing up with eyes peering over a branch and then moving its head down or to the side so it was unseen.  This was in the morning around 10:00 am.  It was a beautiful day and not too hot.  The area is marshy with water reeds growing and when we backed the vehicle north and looked saw that the creature had moved to another tree behind the marsh reeds staring toward the vehicle but still secluded for the most part by the reeds and underbrush and the tree.  Saw a deer walk through the side of this area and a wild hog.  I never felt alarmed but would not let husband go and look further because this is a rural area and phones do not always work and not sure what I would do if anything happened to him.  My husband does not think I saw anything but he could not see what I saw through the binoculars.  He saw a blue bird that morning which I did not see even though I looked so we both had different vantage points from where we were sitting in the car.  I would really like to share all of the incidents that happened to me with the creature in 2010 but will need to do that at another writing when I have time.",
  "classification": "Class B",
  "county": "Lamb",
  "state": "Texas",
  "location_details": "We might give location in private to investigator with permission of land owner.",
  "summary": ""
}