{
  "reportId": "13717",
  "title": "Possible vocalizations heard by staff at Redfish Lake near Stanley",
  "date": "2001-09-01",
  "timestamp": 999302400,
  "observed": "About midnight on a September evening I was walking across a 100 yard expanse between the shower facilities and my cabin when I was halted mid-step by an awful sound.  The hair stood up on the back of my neck. It was a low growl that progressed to a loud inhuman scream that was higher in pitch than the first of the growl/scream.  I remained motionless.  The sound came from a creek bed about 300 yards from my location. After a few moments I heard it again.  I speculated that it could be some drunk person screaming his lungs out but the timbre was not human in its low or high end of the auditory spectrum. In fear I ran to a neighbors cabin and banged on the door.   I wanted someone else to hear this sound! The call was repeated approximately 10-15 times and the location of the source grew nearer and farther while traversing from side to side.  Neither I nor my neighbor could determine what type of animal could produce such a peircing and bone-chilling sound.  The total elapsed time from first hearing the sound until the last was about 15-20 minutes.  This places the calls at about 1-2 mins apart.  After the last growl/scream had faded in the distance, I went to my cabin, latched the door, and put my axe  and rifle within a moments grasp. Upon relating this story to others in the area I was informed that a group of 3 individuals---one being my brother---had been walking down a road in the area a few nights earlier and had heard something scrambling along the top of the ridge adjacent to the road and about 100 yards up from their location.  They told me they had seen a dark object moving in the shadows and were frightened that it could have been a black bear sow with cubs. I have spent many nights in the forest and I am conversant with all big game species in North America.  NOTHING I have seen or heard before could have produced this sound.",
  "classification": "Class B",
  "county": "Custer",
  "state": "Idaho",
  "latitude": 44.14765,
  "longitude": -114.9221,
  "location": "-114.9221,44.14765",
  "location_details": "200-300 yards directly behind the employee housing complex in the direction of Fish Hook creek by Redfish Lake in Stanley, Idaho.",
  "temperature_high": 80.32,
  "temperature_mid": 59.9,
  "temperature_low": 39.48,
  "dew_point": 36.66,
  "humidity": 0.5,
  "cloud_cover": 0.03,
  "moon_phase": 0.46,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1010.38,
  "summary": "Clear throughout the day.",
  "uv_index": 7,
  "visibility": 9.94,
  "wind_bearing": 223,
  "wind_speed": 2.38
}