{
  "reportId": "30526",
  "title": "",
  "date": "",
  "observed": "Early one morning while scouting for mule deer and elk, I had also been hoping to fill my bear tag at the same time, as bear season was open. This area is not well known for black bear activity - but they are present. I was tipped off by a neighboring camper a few nights earlier, of a watering hole in a clearing a few hundred yards from camp and assure I would see plenty of elk and mulies. I was looking forward to snapping some pics with my new camera as well as having a shot at a black bear. I woke up well before the sun, gathered all my camera gear, rifle, pistol, and chair and headed out. Just inside the clearing, there is a grove of trees providing perfect cover for an 80 yd shot at the watering hole. Just beyond the watering hole (approx. 30 yds further) is the other side of the opening where the forest begins, and a massive game trail - like grand central station for the critters. I hunkered down and was immediately attacked by mosquitoes - like flies on sh*t. I couldn't let the constant squeeter slapping blow my cover so I cut two holes in my stocking cap, pulled it over my eyes and zipped my coat up over my neck. This helped, and I did not move a muscle for the next 30 minutes. Facing east, I was staring straight at the game trail entrance as the sun had just started coming up beyond the trees. Then, out of nowhere - just to the left of where I was patiently watching - it moved into view. According to google earth it was 110 yds away and all it did was stand there, full-frontal and facing me. \"I'm looking at bigfoot. I'm looking at bigfoot.\" - must have repeated a thousand times in my head. As I mentioned earlier, the sun was just coming up, and it glimmered off its fur perfectly in the dark woods. I could see its full outline from the elbows up, as it was standing behind a fallen tree that was still hanging on to its roots a few feet off the ground. There was enough light that I could barely make out the shadow of its jaw line and chin - well below its shoulder line. And the hair - its hair was beaming with light from behind. I could not tell what color it was for sure, with such a contrast of color between dark woods and brilliant sunlight beaming off it, but I will forever remember the outline of its body and long hair. So many things ran through my head, during the (approx.) 45 second encounter - with a camera on my left, and two firearms on my right - I could not gamble making a move for my camera, and I have NO reason to shoot a squatch. There was no threat, and through all the racing thoughts I came to the conclusion that this may be the last encounter I ever have. I soaked in every second. Though I knew beyond a shadow of a doubt what I was looking at, I waited to see if it was just a reflection of trees and shadows moving with the rising sun - but as soon as this thought had come to mind, the creature moved like a ghost behind a large tree and out of view. I waited a couple hours longer, and two mule deer bucks came running from the north and stopped at the watering hole - between me and the edge of the trees where I had seen the squatch. Still eager to get a photo of the deer, I stood up to get their attention and snapped a few pics of them both looking at me. I got a few nice pictures before they took off towards the area I saw the squatch. Just before before they reached the treeline, they stopped dead in their tracks, sniffed the air, looked at me, stomped their feet, sniffed the air again, and looked back in my direction, before cautiously entering the woods and out of sight. At this time, I grabbed just my pistol and camera and proceeded across the opening to the area of the sighting to gauge the height of the fallen tree from which behind I saw the squatch. I am 5'10\", and when I stood behind the fallen tree, the top of it came to my shoulders. This is the height at which I saw the squatch from its elbows up. With my camera in hand, and my pistol holstered, I did not feel any threat - but I really didn't want to stick around much longer either. I searched briefly for footprints, but there was so much grass, weeds, and pine needles I just assumed it was better to head back to camp and reflect. I am looking forward to another opportunity to observe.",
  "classification": "Class B",
  "county": "Yakima",
  "state": "Washington",
  "location_details": "Cowiche Wilderness - I'd rather not say exactly where - I like this area and want to keep the traffic down during hunting seasons.",
  "summary": ""
}