{
  "reportId": "7709",
  "title": "Close roadside encounter of juvenile biped animal near South Haven",
  "date": "2005-01-27",
  "timestamp": 1106784000,
  "observed": "This is the story my son's best friend (Ben, not his real name., age 19) told me the day after the occurrence. My son and a friend were in the same car traveling south on I-35, in Sumner County, Kansas, returning home for the weekend from college in Kansas City, MO.  Their classmate, Ben, was traveling in front of them, alone, in his own car.  It was after dark and was in the Spring of 2003. The leading car (Ben's) had a flat tire & pulled over on the highway shoulder; my son's car passed it and attempted to pull over to the shoulder, but could not do so, as there was an overpass or bridge Kansas 166, so he drove to the south side and pulled over (the area was described as 4 miles from the N border of Oklahoma). Both of the two drivers had a long-distance walkie-talkie, upon which Ben contacted my son to confer about what they should do; as the moon was very bright & visibility was good, Ben decided to walk along the highway to my son's car (about 1/4 mi. south of his, on the S side of the overpass).  Not wanting to walk directly on the highway over the overpass, he began walking down the slope bordering a pasture, along a (cow?) fence, planning to walk up the other side back to I-35. As he approached the bottom of the slope he saw what he thought was a large pile of trash & continued to walk toward it.  When he was about 6 ft. from it, he noticed that it was moving, squatting down and digging around in the dirt.  He stopped walking, and the thoughts went flying through his mind.  He thought it was a female child in a (white)fur coat, squatting down to urinate (this was not logical to him, as it was warm outside & a child would not be alone in this area); then he thought it must be a farm dog & began to get frightened.  Only a second or two passed when the thing glanced at Ben and began to stand up, groping very slowly for the barbed wire fence beside it.  Ben stood frozen, realizing that this was neither a child nor a dog, as the thing began slowly shuffling sideways away from him along the fence line (on two feet) & holding on to the fence. Ben described it as about 3 to 3 1/2 feet tall, covered with white or light gray hair, with a darker (gray), triangular patch of fur on its chest.  Its face was shaped like a human's, although covered with hair, and its nose was not large (like a dogs's would be); he could not see visible ears.  It's arms were too long for it to be a human and it's gait was more like a human's than a primate (which would walk with knees bent & legs open), although he only observed it walking sideways. (I have hand-drawn pictures Ben created the day after the occurrence). Ben then began backing away from it and turned & ran (all the while he was talking to my son on the walkie-talkie) back the way  he had come to his car.  He glanced over his shoulder once or twice; saw the 'thing' on the first glance & at second glance, it was gone, under the overpass, he assumed. My son said he could hear Ben yelling & cussing but only between steps, as the walkie-talkie apparently lost reception each time Bs foot came down.  Ben was yelling \"YETI, YETI!  A yeti is going to kill me!\"  When Ben got back to his car he locked himself inside & told my son over the walkie-talkie what had just happened.  Ben also phoned AAA for help with his flat tire. My son drove to the very next exit, and crossed to the E side of I-35, where there was a convenience store & a auto repair or auto tow-truck station ajacent to one another (where the flat tire was eventually fixed).  A day or two later, I told this story to a personal friend of mine who immeidately got goose-bumps & told me that a friend of hers had, not two weeks before, told her a similar story, with a 'thing' fitting the same description.",
  "classification": "Class A",
  "county": "Sumner",
  "state": "Kansas",
  "latitude": 37.0581,
  "longitude": -97.3374,
  "location": "-97.3374,37.0581",
  "location_details": "I-35, Under an overpass wherein the very next (southbound exit) has a convenience store and tow-truck station (east side of I-35)",
  "temperature_high": 38.69,
  "temperature_mid": 36.2,
  "temperature_low": 33.71,
  "dew_point": 28.78,
  "humidity": 0.78,
  "cloud_cover": 0.69,
  "moon_phase": 0.57,
  "precip_intensity": 0.0002,
  "precip_probability": 0.35,
  "precip_type": "rain",
  "pressure": 1026.85,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 8.73,
  "wind_bearing": 81,
  "wind_speed": 8.45
}