{
  "reportId": "13141",
  "title": "Possible vocalizations heard by camper near Tygart Valley River",
  "date": "2005-05-30",
  "timestamp": 1117411200,
  "observed": "I am a carpenter, self-employed; at times my job will be many miles away from my home. When I take one of these it fits my life style perfectly because I enjoy camping, so there is a perfectly good reason to be in my favorite place the great outdoors. This summer while at my tent home there was many times this strange sound could be heard. It was not like any I had heard before. The sound would awaken me, always after midnight. My camp sight was in a low part of a meadow. When I was awakened by the moans, I noticed the sound was one following the next ( moannnnnnn -- 1234-- moannnnnnn --- 1234 --- moannnnnnnn. The long hours I worked kept me from looking for any tracks, the weather had been very dry this summer. The camp was hidden under four trees in which had low hanging branches. Near by perhaps three hundred yards was a large forest. One day I went down a near by road which took me to the Tygart Valley River, nearly two miles away from camp. This was new to me. The forest and large rocks were on both sides of the road. There were no sounds during the day. A number of times there would be walking sounds near camp at night. I saw nothing with my flashlight.",
  "classification": "Class B",
  "county": "Barbour",
  "state": "West Virginia",
  "latitude": 39.05,
  "longitude": -79.98335,
  "location": "-79.98335,39.05",
  "location_details": "Rt. 250 north between Belington and Philippi, Two miles from US 250",
  "temperature_high": 66.9,
  "temperature_mid": 57.485,
  "temperature_low": 48.07,
  "dew_point": 48.79,
  "humidity": 0.75,
  "cloud_cover": 0.36,
  "moon_phase": 0.75,
  "precip_intensity": 0.0012,
  "precip_probability": 0.61,
  "precip_type": "rain",
  "pressure": 1016.02,
  "summary": "Mostly cloudy starting in the afternoon.",
  "uv_index": 8,
  "visibility": 8.82,
  "wind_bearing": 251,
  "wind_speed": 0.38
}