{
  "reportId": "30159",
  "title": "Recollection of a possible nighttime encounter on a four-wheeler near Sullivan",
  "date": "1989-11-18",
  "timestamp": 627350400,
  "observed": "It was winter of 1989.  What I saw scared the **** out of me.  Me, my sister and her friend found the keys to my brothers 4-wheeler and decided to sneak it out @ approx 10:30 pm on a snowy winter night. Nobody knew we were going to do this, so there is no way anyone could have been waiting for us in a costume or anything.  Plus nobody knew I even knew how to operate a 4 wheeler (including myself).   We headed out to the woods behind our parents house and half way down a steep hill the 4 wheeler took off flying and when I figured out what gear to put it in the 4 wheeler stopped and my sister and her friend jumped off.  I recall smelling something \"dead\" then I heard something that sounded like Monkeys (yes multiple) fighting.  When I looked towards the trees I see this huge monster walking out.  This thing was at least 7.5 or 8 ft tall and standing straight up with huge long arms and legs. As it was walking towards us it made a deep growling angry noise.  I took off on the 4- wheeler and my sister and her friend were running as fast as they could to catch up.  I looked back a few times and recall thinking- this thing is walking but one of it's steps was equal to 20 of mine.  We were in a panic we were all screaming and the louder our screams the deeper it's growl got. By the time my sisters friend had grabbed her arm and yanked her onto the 4 wheeler, it was within it's arms reach of us but never tried reaching out to hurt us. It was obvious he or she wanted us out of there.  I was only about 13 at the time so I wasn't wise enough to call someone to come research it.  I believe our parents just thought we were making it up.  And of course, I was way to scared to go back and track foot prints or anything.",
  "classification": "Class B",
  "county": "Washington",
  "state": "Missouri",
  "latitude": 38.11468,
  "longitude": -91.06547,
  "location": "-91.06547,38.11468",
  "location_details": "Do not post this information.  My parents have since sold a portion of this property and we do not want the new owners to be bothered.",
  "temperature_high": 40.9,
  "temperature_mid": 36.305,
  "temperature_low": 31.71,
  "dew_point": 14.35,
  "humidity": 0.48,
  "cloud_cover": 0.23,
  "moon_phase": 0.7,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1026.39,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 2,
  "visibility": 9.47,
  "wind_bearing": 293,
  "wind_speed": 0.96
}