{
  "reportId": "26850",
  "title": "Forestry Worker Observes a Sasquatch in Clear-Cut Near Feather River",
  "date": "1993-09-30",
  "timestamp": 749347200,
  "observed": "The whole story begins several years ago, 1993 to be exact. At the time I worked for the US Forest Service, Plumas National Forest. At that time it was called the La Porte Ranger Dist. Long before this as a young youth my father had taught me to hunt, fish and trap. I made my spending cash in junior high and high school by trapping and like most young men thought I was Mr. Outdoors. I was in reality, a very good outdoorsman with several mountain lion sightings in my hunting and working career (16). Many were at very close range, within a few yards - much too close, but onto my only bigfoot sighting. It was late September and after working as a firefighter for years, I had moved to Silviculture where I had been working for about 5 years. My tasks included overseeing contracts for reforestation of clear cuts including the marking and measuring of unit, overseeing contracts to clear the brush, plant, brush suppression and thinning of units, testing tree planting and counting trees per acre as well as identifying tree species. I had two jobs slated for the day. The first was to meet a contractor and show him his work site and then I was to proceed to far end of Watson Ridge which drops off into the Middle Fork of the Feather River in Northern CA out of Oroville. This is a very remote area designated a wild and scenic waterway. The site I was heading for was a set of three small clear cuts setting within a few hundreds of yards from each other. We referred to them as the Mountain Lion clearcuts because a lion lived in the area and between 4 of us, it had been seen 5 times in 3 months. The clearcut I was going to was the northern most which was about 12 acres. It was basically a square shaped clearcut that sloped gently up a hill. In the lower NW corner was a patch of forest that was not cut about 20 feet circumference and located just a few yards into the clearcut from where you would park. I arrived at the site at about 11:20 and decided to eat lunch before I got started and though I would get into the uncut area while I ate to see if the lion would come by. I ate lunch and took and additional 30 minute break being very still and quiet to look for the lion. He never showed and I had work to do. This day I was counting the number of trees in the clearcut that had been planted in spring. Doing this meant that I would start by placing a spike through the open end of a tape measure so I could pull out the tape and measuring 10 feet. Then I would start moving one direction and count every tree that fell into the 20 ft circumference. Each one of these was called a plot. In every third plot I also identified the types of trees. Then taking a compass, I would walk approx 120 yds and start the next plot repeating the process. I had left the brush and completed two plots and started walking to the third plot when I heard loud noise ahead of me at the edge of the clearcut. The noise was so loud that I assumed it was a cow and I did not even look up. After a few more steps, more noise and this time I instinctively did look up to see a large creature walking up the edge of the brush line about three feet out of  the clearcut. It was about 110 yards away. The creature was walking North away from me at a 90 degree angle on two feet. I stood very straight up and down while walking. It only walked a few feet and then stopped, leaned over slightly and rested its forearms on a tan oak that was bent and facing horizontally in the air about 4 1/2 ft high. At this time, it was no further than 125 yards away. It remained there for about  45 seconds with its head turned over its left shoulder looking at me, It’s head or chin did not set or rest on its shoulder as it did not seem possible for the creature to do so but it’s entire face was visible except for the lower mouth and chin. The creature was oriented so that I could see the entire left side from head to leg to about one foot from the ground. In addition, I could see its entire back and the back of the right leg from head to ground.  I could not see any of the right side or the front of the creature. It stood about 6’6” to 7 ft tall. It was very lean and I would guess its weight at between 350 to 400 lbs. It may have been heavier; it is hard to determine that without ever seeing the front of the creature. Its legs, although a little longer than a mans, seemed proportioned to a mans in shape. From the waste up however, the creature was very very large. I would guess about 40 to 45” waste but 80 to 90” around the shoulders. It seemed very man like, covered in two to three inch hair that was red brown on the legs.  It got somewhat darker to a browner as it went up its back. The hair was much shorter and thinner around the butt got longer and thicker as it went up its back. The hair on its back was not as long as on its leg but by the time it got to its shoulders, it was longer again and brown to dark brown. The hair coming down the arm from shoulder to elbow was red and 2” long. At the elbow, the hair end and the actual elbow was covered with skin like leather that was black. Oddly enough, this is the feature that stands out the most still to this day. The head was not as visible but human like. Hair longer on top and shorter around the sides with no hair from lower forehead to mouth. The hair on its head was dark brown to light black if such a color exists. For some reason, I never really focused on the face as it was shaded. I spent more time looking at the entire size of the creature and the bare elbow facing me. It was very calm as was I and I never felt any danger or anxiety from fear. I differently remember thinking that it is tripping on me and checking me out as much as I was tripping on it. As I stood there in the open, I had a strange since of peace. After a minute, the creature lifted up off the tree, turned away slightly and took two steps and I never saw it again. I did not go look for tracks which still seems strange to me even now. Even after the creature left, I was not scared and continued to take plots for several hours. I was anxious to return to the office and tell my friend but within an hour of work, I had talked myself out of telling this story to anyone at work. I did eventually tell two or three other co-workers. I have not shared this story with many but now am 50 years old and don’t really care what people believe or think of me. Sorry for making he story so long. I’m sure I could find the exact site of this encounter again but being many years old, it probably would not help.",
  "classification": "Class A",
  "county": "Butte",
  "state": "California",
  "latitude": 39.705,
  "longitude": -121.18,
  "location": "-121.18,39.705",
  "location_details": "Leave Oroville CA up Olive Hwy. Turn on Forbsetown RD. 8 miles up turn on Lumpkin Rd. Take through Feather Falls then turn on Mill RD. Once you pass Fall River, take next right, road 21N25. It is several miles to the site on road 21N25.",
  "temperature_high": 88.51,
  "temperature_mid": 73.165,
  "temperature_low": 57.82,
  "dew_point": 44.4,
  "humidity": 0.39,
  "cloud_cover": 0.03,
  "moon_phase": 0.49,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.55,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.91,
  "wind_bearing": 220,
  "wind_speed": 2.1
}