{
  "reportId": "1368",
  "title": "witness saw man-like creature covered with dark red hair while hiking in the extreme eastern part of Dinosaur National Monument.",
  "date": "1991-07-02",
  "timestamp": 678412800,
  "observed": "I saw what appeared to be a person walking near the edge of the deep canyon of the Yampa River (crawling, climbing, scrabbling might be more appropriate) The terrain is very rugged and the proximity to the cliff edge makes it dangerous--the rock is very weathered. I had made my way toward a rock promontory which lay NE of my camp which lay north of the old Mantle Ranch road. I was greatly surprised in that in all the many years that I had been in this area I had never before seen anyone else--the closest being rafters far down on the Yampa River or an occasional vehicle on the old ranch road. This is a remote and extremely hot arid region and people casually hiking in is not common. What I first thought to be a person was coming toward me along the edge of the cliff from the direction of the promontory and was about 100 feet away. I didn't get a long look because it saw me too and fell back into the thick juniper and pinon but I saw it clearly enough to realize it was no hiker. It made a lot of noise at first--scrambling to get away I suppose. It appeared to be man-like and covered with dark, reddish brown hair. I would estimate its height to be maybe 6 foot. I did not really get a good look at its face but it gave me the impression of being ape-like.",
  "classification": "Class A",
  "county": "Moffat",
  "state": "Colorado",
  "latitude": 40.45418,
  "longitude": -108.5417,
  "location": "-108.5417,40.45418",
  "location_details": "Dinosaur National Monument",
  "temperature_high": 84.2,
  "temperature_mid": 66.77,
  "temperature_low": 49.34,
  "dew_point": 33.69,
  "humidity": 0.33,
  "cloud_cover": 0.06,
  "moon_phase": 0.67,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.51,
  "summary": "Clear throughout the day.",
  "uv_index": 12,
  "visibility": 10,
  "wind_bearing": 349,
  "wind_speed": 2.26
}