{
  "id": "2848",
  "title": "Large  humanoid figure seen at night near beach",
  "date": "2004-11-07",
  "timestamp": 1099785600,
  "observed": "First of all, I am a 57 year old H.S. & College Psychology and Humanities teacher with a background in phenomenon reasearch. I have two Masters degrees and  I have often been nicknamed the \"resident sceptic\" because I demand scientific principles in real time for all observable data. I despise hoaxes. My wife and I were standing on a boardwalk on a bright, moonlit night around 11:30 p.m.  I was looking north when I first saw it at about 100 yards.  At first, I thought it was just a late night jogger.  After it got about 50 yards closer I alerted my wife to \"turn around\" because I realized that this was not your \"average jogger.\" It walked with a smooth, long stride with arms swinging about two feet in front and back.  It was a uniform, solid black or brown (\"shadowy\") in color; no light face, hands or shoes. We watched it walk south right at the edge of the surf, southward until it disappeared down the beach.  And I am quite sure that it saw us. I thought about yelling or \"encountering\" it but that thought lasted just for two seconds.  This thing was walking fast, with a deliberate stride and a slight forward stance.  It was \"on a mission, as it were. There were no footprints because it was walking slightly into the water. I KNOW what I saw; my wife and I were in complete agreement on all of the details. I guess this is another incidence where I can only REPORT the data.  There seems to no way to research it; unless someone else happened to see or confront it.",
  "classification": "Class B",
  "county": "Volusia",
  "state": "Florida",
  "latitude": 28.98195,
  "longitude": -80.86715,
  "location": "-80.86715,28.98195",
  "location_details": "It was walking down the driving area of the beach southward toward the wildlife preserve...",
  "temperature_high": 75.53,
  "temperature_mid": 64.45,
  "temperature_low": 53.37,
  "dew_point": 53.59,
  "humidity": 0.66,
  "cloud_cover": 0.09,
  "moon_phase": 0.83,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.9,
  "summary": "Clear throughout the day.",
  "uv_index": 4,
  "visibility": 9.43,
  "wind_bearing": 341,
  "wind_speed": 4.91
}