{
  "id": "9113",
  "title": "On the way to work, motorists have morning road-cross encounter near Eglin",
  "date": "2000-06-01",
  "timestamp": 959817600,
  "observed": "i had a sighting of what i belive to be a bigfoot. on the way to work,myself and onther were in a truck. we took a short cut through the eglin res. and got on the wrong road. so not to get lost ,theres alot of dirt roads in there.we cept folloing the road we were on .we were prety deep in when we stoped to to relive myself.when i got back in the truck i looked up the road .and thats when something came out of the tree line on one side and crossed to the other side. IT TOOK THE DIRT ROAD IN 3 OR 4 STRIDES! and looked our way not stoping while it walked we were kind of far away we were on one side of a gully it was on the other. it was about 6:30 to 6:45 in the morning. the bottom of the gully has a creek that leads in to the river. the dir, it was heading.it was dark colored, to far away to see a face. id say it was realy big! when we got to the other side of the gully we stoped i got out. there was a stink in the air i tryed to see if i could see it again but it was gone .i walked the road from one side to the other it took me about 7 or 8 strides to get to the other side.im 6,1 .the area is very woody scrub oaks and tall pine. a lot of creeks and a couple of rivers. it happend in 2000 june i think . i started reading up on it on your site.after i saw it. and tho its problly nothing. ive herd of 3 derr kills in the area from my soon to be broter in law.he found behind his land at the bottom of a hill.near a creek .young deer, one was a spike they were very close to one another like a pocher but nothing was taken like meat or the head. i didnt see them .but he said ther were no bullet wounds. he found them in the winter. just north of crestview. my sighting was south of crestview closer to santa rosa .south of i 10. eglin is huge and no one around for miles. in okalosa county. the pan handel.fl",
  "classification": "Class A",
  "county": "Santa Rosa",
  "state": "Florida",
  "latitude": 30.56775,
  "longitude": -86.6913,
  "location": "-86.6913,30.56775",
  "location_details": "go down 85 south turn right on dirt road it goes straight to 87 thru eglin res.",
  "temperature_high": 86.16,
  "temperature_mid": 77.41,
  "temperature_low": 68.66,
  "dew_point": 66.52,
  "humidity": 0.71,
  "cloud_cover": 0.21,
  "moon_phase": 0.97,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.36,
  "summary": "Partly cloudy until evening.",
  "uv_index": 10,
  "visibility": 7.91,
  "wind_bearing": 172,
  "wind_speed": 3.14
}