{
  "id": "25559",
  "title": "Exec on business trip has sighting from balcony of hotel near Huntsville",
  "date": "2009-02-24",
  "timestamp": 1235433600,
  "observed": "I was staying at the Marriott hotel 6th floor in Huntsville Alabama at the Space and Rocket Center-At 5:40am on Feb 24th 2009 I went on the balcony to drink my coffee as the room was too stuffy and hot.  I was out there just thinking and staring off at the woods when something caught my eye--after refocusing on it I realized there were legs, then arms, then I could clearly make out his face.  The creature stood 6-7ft tall and was staring directly back at me-it seemed to have fine hairs all over -grey color hair that got more black as the hair got closer to the skin--the tips of the hair were much lighter--the face (lips, eye lids, etc) were more of a very dark brown-it stood very erect, was very muscular, and did not seem to have the apelike protruding mouth and nose but more flat faced human like--after 30 seconds he started rocking back and forth--I then realized this was moving and could in no way be mistaken for a dear or bear or anything else--this was a fully erect apelike animal that seemed to want me see him --he was rocking back and forth from side to side.  After the initial 30 seconds he rocked for about 10-12 seconds then stood and stared at me --I was on the 6th floor about 120 yards away in decent lighting due to hotel lights and street light behind loading area of hotel-he then would stare back then he would remain face forward with feet only about 2 feet apart would lean over to his left with his right arm would start pulling bark off a very large pine tree--it looked as if someone were in a sawing position--then he would stand up stare at me then rock and then pull bark--this was done in that order 3 times over a 5-6 minute period--after five minutes of re-verifying what I was looking at I felt this creature was docile and smooth moving--I decided I would try and get a closer look--as I opened the sliding glass door he stared and I stared back--I ran out of the hotel room and there was security in our hall laying the morning news at the hotel room doors--I asked him to come with me and asked for back up since he had no gun--we ran around the corner outside - as we were running I Finally got the nerves to tell them what I saw--we get to the reference points I had chosen and there were a lot of fresh bark removed from the large pine tree--I tried to pull bark from it to no avail -- it was too hard--I am 6'4\" 300 lbs.  I went back after 7am (light) -- I did notice what looked like scat --it took the form of explosive diarrhea and looked like a hundred birds had pooped in a small area--like in a shotgun pattern-heavy in the middle and lighter to the outside perimeter-I put a large handful in a Marriott laundry plastic bag--It looks like feces and digested berries and seeds. (It was dry although it had rained the night before)  One of the Marriott employee's saw two large footprints --more like deep indention's in the pine straw--I took off my shoe and placed my foot in it and there was about a one inch area all the way around my foot in order to fill the indention--Something very heavy had to make these indention's--I tried and I am 300lbs and could not.  I am 100% positive of the above discription--I watched this clearly for 5-6 minutes!",
  "classification": "Class A",
  "county": "Madison",
  "state": "Alabama",
  "latitude": 34.71139,
  "longitude": -86.6575,
  "location": "-86.6575,34.71139",
  "location_details": "I was on 6th floor of Marriott Hotel facing the Rocket Center--(room 614)--creature was 30-35 yards from parking spaces where the loading docks and dumpster area is if you are facing hotel it will be the area to  the left where there is a walking trail",
  "temperature_high": 55.93,
  "temperature_mid": 49.485,
  "temperature_low": 43.04,
  "dew_point": 24.35,
  "humidity": 0.55,
  "cloud_cover": 0.47,
  "moon_phase": 0.99,
  "precip_intensity": 0.0017,
  "precip_probability": 0.63,
  "precip_type": "rain",
  "pressure": 1028.05,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 9.32,
  "wind_bearing": 115,
  "wind_speed": 4.04
}