{
  "reportId": "22570",
  "title": "Family hears loud whooping for three consecutive nights near Drain.",
  "date": "1977-07-01",
  "timestamp": 236563200,
  "observed": "The incident occurred while my cousin and I were returning from a hike near our family home. The area we lived in at the time was fairly remote and we lived at the end of an old logging road. We often hiked the forest behind our homes. As we were nearing our home we heard a very unusual \"whoop\" sound coming from the top of the mountain above us. The sound was loud enough it echoed throughout the canyon. It was a sound unlike anything we had ever heard before and caused us to stop in our tracks. We were very familiar with the area and the local wildlife new it was not a coyote or cougar. We waited a very short time and heard the \"whoop\" again. At this point we both broke into a dead run for our home. As we ran for home we continued to hear the \"whoop\". Once we arrived at my home we immediately informed our parents of what we had heard. My mother, who had lived her whole life in the area, told us we probably heard a cougar but went outside with us to listen. After hearing the \"whoop\" herself she called my father out to hear it also. Both adults agreed it was like nothing they ever heard before and I remember telling them it sounded like a monkey or gibbon I had heard once at a zoo. The \"sound\" continued for two nights and my mother called a county trapper to investigate. The trapper investigated the area but did not find anything.",
  "classification": "Class B",
  "county": "Douglas",
  "state": "Oregon",
  "latitude": 43.6744,
  "longitude": -123.2675,
  "location": "-123.2675,43.6744",
  "location_details": "Drain Oregon near Laurel Hills Drive.",
  "temperature_high": 75.97,
  "temperature_mid": 62.65,
  "temperature_low": 49.33,
  "dew_point": 50.44,
  "humidity": 0.64,
  "cloud_cover": 0.67,
  "moon_phase": 0.53,
  "precip_intensity": 0.0029,
  "precip_probability": 0.36,
  "precip_type": "rain",
  "pressure": 1014.51,
  "summary": "Light rain in the morning.",
  "uv_index": 6,
  "visibility": 8.53,
  "wind_bearing": 340,
  "wind_speed": 7.35
}