{
  "reportId": "28308",
  "title": "Man has a close encounter with a large, upright creature in a swamp near Big Lake",
  "date": "2009-06-15",
  "timestamp": 1245024000,
  "observed": "I fished till dark then headed to my truck. Threw my float tube in the back and cruised over to a nearby swamp to change out of my fishing waders and eat a snack. I sat for awhile listening to the frogs, they were so loud you couldn't hear yourself think. I was enjoying a Washington summer night. Out in the dark swamp 6 feet below me about 35 yards away I saw a pair animal eyes moving towards me. I thought I would let this deer just pass and even got excited for a second. As it came near I saw that it would eventually pass my location so I sat and watched. At around twenty yards or less I noticed from the blue/clear eyes that the deer was walking strangely. I got a little nervous and whistled to let it know of my presence and that is when I realized this set of eyes are connected to an animal walking on two legs! After the whistle the animal looked at me and walked off slowly looking over its shoulder. It tripped while looking over its shoulder, I could see the eyes go down then slowly get up again all the while watching me and walked off into the swamp looking over its shoulder. I was honestly freaked. I got out of there and didn't go back for quite some time. Before the incident I doubted the possibility, now I have no doubt of the existence of Sasquatch.",
  "classification": "Class A",
  "county": "Skagit",
  "state": "Washington",
  "latitude": 48.308,
  "longitude": -122.215,
  "location": "-122.215,48.308",
  "location_details": "Pilchuck tree farm. Near Centennial Trail. Lake McMurray side.",
  "temperature_high": 65.83,
  "temperature_mid": 57.94,
  "temperature_low": 50.05,
  "dew_point": 50,
  "humidity": 0.75,
  "cloud_cover": 0.41,
  "moon_phase": 0.75,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.2,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 7,
  "visibility": 9.77,
  "wind_bearing": 237,
  "wind_speed": 4.67
}