{
  "reportId": "9992",
  "title": "",
  "date": "",
  "observed": "Me and a buddy have frequented the [canyon] for fishing and hunting over the past three years.  We are both wildlife majors at Texas Tech and are very accomplished big game hunters and flyfishermen. We followed the trail that begins at the [bottom of the canyon] and followed it until the trail diappeared.  Abouth 1/4 of a mile up the river bed from there we set up camp in our usual spot which was a grassy embankment along the rocky riverbed. We had been there for three days of fall brook trout fishing and camping. The nights leading up to the final day were routine, elk bugling, racoons in the creek bed and one encounter with a small black bear that was very curious about us.  Spending a lot of time here and in other dense wilderness areas in these mountains was no problem for us. The final night was bitterly cold, so we didn't sleep that much.  I decided to leave camp at first light to begin fishing.  My partner was still tired from the cold night and stayed behind to get some rest. I followed the river upstream on my usual route through the thick underbrush, fishing all the logjams and deep pools that the trout piled up in.  I was probably about a mile upstream from camp when I followed the river into a steep canyon of giant boulders that had an good sized pool.  I fished for about fifteen minutes before I started to feel something watching me or a presence. The strange thing that scared me was that the birds stopped singing and the woods almost went silent.  I then scanned the steep canyon boulders and pine forest and saw brush and trees shaking vigorously and immediately thought I was about to see a bear. I slowly went to the opposite side of the creek and stared in the area trying to make out the creature.  Everything stopped moving and I quickly started down river towards camp.  About 10 minutes later I heard what sounded like a gutteral moan or cry directly across the river, like the creature was trying to scare me, this combined with the fact that it had parralled me down river really made me panic.  I then ran all the way back to camp as quickly as I could, spraining my ankle in the process. I am an accomplished outdoorsman who has had plenty of experience with bears and the area, but I have never seen a bear parralel a human for as long as this creature did, and the cry was definetly different from any kind of growl or vocalization that I have ever heard out of a bear.",
  "classification": "Class B",
  "county": "Lincoln",
  "state": "New Mexico",
  "location_details": "[Location specifics withheld due to upcoming expedition to this area]",
  "summary": ""
}