{
  "reportId": "32444",
  "title": "",
  "date": "",
  "observed": "I was deer hunting off of Highway 24 near Rhodestown, NC, right outside of Jacksonville, NC. I had been in my stand since about three that afternoon. It was close to dark and I saw a deer walking along the edge of the clearing I was in. It kept looking into the woods like it was curious of something. The deer got closer and I took the shot. When I did, it took off running and hit some brush and fell down. I waited about 30 minutes and it got dark. I got out of my stand and went to get the deer. I got my things together and started dragging my deer to my truck that was about a quarter of a mile through a thick part of the woods I was hunting in. I was carrying my rifle, backpack, the deer, and a flashlight in my mouth. So I could pull the deer by its leg, and hold my rifle and backpack straps. After walking through the thick part of the woods, it was a straight shot to my truck. I dropped the deers leg to get situated and get myself altogether to continue my walk out, when I looked up with my light still in my mouth. I saw two eyes looking back at me. They looked wider than any animal I had ever seen at night. I have been hunting all my life. I have seen everything from deer to coyote to bear. These set of eyes were about my height, I am 5' 10\". The trail I was on slightly went down hill. It stared at me long enough for me to put my rifle and backpack down. I had a 9mm Glock with me and I pulled it out, I shot once into the ground next to me to get whatever it was to get out of the trail I was on. It did not move or flinch, it just simply looked to its left and looked back at me. I looked down to take a knee, because I was getting worried. I got on my knee, looked back up, and it walked off to it's left, into some of the thickest woods I have seen. I grabbed the deer and continued dragging it towards my truck. When I got to the spot where I thought I saw the eyes, I looked to both sides of the trail and I could smell a musky foul odor, and where it had walked off the trail, tree limbs and trees were pushed over as if something huge had just barged through the thicket. I went to my truck, cleaned the deer out there in the woods. Like another post on here that I read, I felt like I was watched the whole time I was cleaning the deer. I left the rib cage and spine of the deer I cleaned out there, along with the hide. When I came back to the same spot, the spine had been drug off about 300 yards from where I left it. It was one of the strangest and creepiest nights I have ever had in the woods by myself.",
  "classification": "Class B",
  "county": "Onslow",
  "state": "North Carolina",
  "location_details": "The location is some woods behind a neighborhood on McGowan Rd. off of Highway 24 between Jacksonville, NC and Richlands, NC. The woods are very secluded and seem like no one has been back there in years.",
  "summary": ""
}