{
  "reportId": "671",
  "title": "",
  "date": "",
  "observed": "My father was driving eastbound on Interstate 84 at about 7pm, it was raining, but not torrential. It was dark. We crested a point of the hwy.when we seen brake lights and swerving in front of us so we slowed thinking it must be an animal or a wreck up ahead. when we got to the area of the braking we noticed a probable person running with arms swinging along the divide between the two directions of travel. My first impression was that it was someone wearing a fur type coat with a hood as I could see the wet hair. My father was in the outside lane and there was a car in the inside lane, the car ahead and inside slamed on the brakes as the figure crossed in front of their car, and my father also slowed way down. At this time the figure crossed in front of our car and my father says he felt the car hit the lower portion of the leg and made eye to eye contact with it. At that time it started to run along the outside lane still with the flow of traffic, at that time we came up to it's side. I was in the passenger side of the car and looked up at this figure as we commensed to pass. My wife was in the rear passenger window and my mother in the center of the front seat. I looked straight into his face at about 3-4 feet, and saw a look of total fright and terror in it's eyes. At that moment it made a 90 degree turn away from our oncoming car and right into the rear drivers side of an oncoming pickup with a camper on it and literally bounced off the rear corner of the camper and up about a 60 degree incline and into the trees. When I got home I called the State Patrol and asked where I was to report an unusual sighting, and he asked me if I thought It was a UFO, I told him no and he said a Bigfoot, I said well something like that. He told me to call the shariff of the county in which it happened and I did. When I called them I went through the same conversation. I told him the facts as I knew them. He knew I was a little aprehensive, and told me not to feel aprehensive about turning in the sighting as he had taken quite a few reports that night on the same sighting and four of those where police officers. This report was taken by Peter Byrns and Barbara Wasson with NASI. Many years later,just a few months ago I had dinner with Peter in Portland, Oregon just before he moved to California and he told me that one thing he was impressed with in this report was not only that so many people at one time saw it but that two days later in the same spot but in the westbound lane they had the same report with multiple sightings. He surmised that purhaps the creature was returning back to the river the opposite direction as our sighting. Creature 6-7 feet tall, black with wet hair,not as heavy as the so called Patty.",
  "classification": "Class A",
  "county": "Hood River",
  "state": "Oregon",
  "location_details": "Cascade Locks area on Interstate 84",
  "summary": ""
}