{
  "reportId": "6470",
  "title": "",
  "date": "",
  "observed": "BACKGROUND My 18-year old son and I departed Cape Henlopen State Park on the Atlantic Coast near Lewes, Deleware at about 1:30AM, June 7, 2003, after a day of fishing from the park's 1/4 mile long pier. We had intended to catch a couple of hours sleep in my extended cab pickup before starting the two-hour return trip to our home outside of Annapolis, Maryland.  However, we both managed to catnap in our fishing chairs throughout the day, did not feel the least bit tired, so decided to depart immediately for home.  Route 404 is the most direct route from Lewes to the Chespeake Bay Bridge and Annapolis, meandering though the Deleware and Maryland countryside, with only two small-to-middle sized towns (Denton and Georgetown) along the route.  The remainder of Rt. 404 is bordered by farmland (chicken and dairy production) and woodlands. DETAILS I was driving and my son was in the passenger seat. We departed the park via Rt. 9, headed north a short distance on Rt. 1, and picked up Rt. 404 West . There was very little traffic on this secondary road at this time of morning, so I drove with my highbeams on and set the cruise control. Within a few minutes I saw a movement along the right side of the road about 100 yards ahead and began braking.  A doe stepped onto the berm of the road and crossed from right to left. I continued braking, almost to a complete stop, in case more deer followed the doe, but she apparently was alone.  Another few minutes passed before we saw a car approaching from the opposite direction. We could see its headlight glow before we could see the car itself because we were approaching a gentle curve in the road to the right. I flicked my headlights to lowbeam and in a matter of a few seconds saw the silhouette of a large biped cross the road, from the center part of the road, across our lane of travel, and enter the woods to our right some 100-150 feet ahead.  My son immediately exclaimed, \"What the heck was that?!?! I asked him if he saw it too and he said, \"Yes, there were two of them!\" \"Two??, I asked and he said, \"Yes, a tall one in front and a shorter one 4-5 feet behind.\"  My truck has almost slowed to a complete stop by this time because my foot was on the brake as soon as I first spotted the creature.  My son and I slowly drove by the spot where they appeared to enter the woods, but we could see nothing.  The car that was approaching passed us at this point, without slowing down or stopping.  I asked my son to describe what he saw. He said a large thing walking on two legs with another, shorter thing following behind. He added that the shorter one was about chest high on the larger one.  My son is near 6' tall and he said the larger one was taller than him.  I saw the taller one, side profile, as a silhouette -- almost a shadow.  It moved across the road quickly, in a purposeful manner.  I could see no arms or arm swing.  It did not turn its hear to look toward us.  I could discern no color or body features beyond a head, torso, and legs. There was no accompanying odor.  When we passed what we believed to be the creatures' entry point in the woods, my son's passenger side window was completely down and mine was partially down. A normal moist, woodsy night time odor was all we noticed. Additional observation by my son, in his own words: My father saw one thing cross the road, while I saw two.  I use the word \"thing\" because I truly have no idea what I saw cross the road that night. They were NOT quadrupeds. The larger one walked upright and at a smooth pace...no bouncing around. It didn't seem to speed up as our truck approached. When the oncoming car drew closer to the curve in the road, I then saw the second, shorter one in the glow of the other car's headlights. This second, shorter thing followed closely behind the larger thing. I could see that it wasn't standing straight up, like the larger one, but was slightly leaning forward. The siloette of both things appeared fuzzy, like a picture out of focus. My Dad said he didn't see arms or arms moving, but I could see long arms moving back and forth on both things. The arms didn't move very much, but I could see them. I don't mean to make a joke out of what we saw, but the big thing could have looked Yao Ming, the Texas basketball player from China, eye-to-eye. COMMENTS When I first put this encounter down on paper, I described what I saw as a shadow, not as a silhouette.  While silhouette might be a more appropriate word, I cannot put the illusion of a shadow out of my mind.  After talking this over with my son, we believe that the creatures that we saw did, in fact, have hair on the body and that a combination of (back)lighting from the car approaching in the opposite direction and my own lowbeam headlights caused the outline of the creature that I saw appear shadowy or diffused --perhaps a result of light shining on or though its hair. This, perhaps, can be supported by my son's description of the silhouette of both creatures appearing fuzzy or out-of-focus.",
  "classification": "Class A",
  "county": "Sussex",
  "state": "Delaware",
  "location_details": "My son and I plan on returning to better pinpoint the location this weekend, June 14-15. The distance between Coolspring and Gravel Hill is approximately 4 miles.  We will return to the intersection of Rt. 1 and Rt. 404 and get an odometer reading from that location to the sighting area.",
  "summary": ""
}