{
  "reportId": "24224",
  "title": "Man tells of his possible daylight encounter as a young motorcycle explorer in the Coeur d'Alene National Forest",
  "date": "1981-08-01",
  "timestamp": 365472000,
  "observed": "After the eighth grade, my family moved to Kellogg Idaho and I purchased a motorcycle with money I had earned from a dish washing job.  I spent most of my summer days riding the many forest service roads, logging roads, and trails around Kellogg and the North Fork of the Coeur d'Alene river. By the end of my junior year of high school, these outings had turned into more organized explorations of ghost towns, abandoned mines, secluded lakes, and mountain peaks.  I used information from friends and forest service maps to identify potentially interesting locations and took increasingly long and difficult rides to reach them. In August 1981, I was looking at the forest service maps for the North Fork area and noticed a road leading up to a star and then continuing on to another star about half a mile away where the road ended.  Stars denoted mountain peaks and I was intrigued by the idea that I could ride up to a mountain summit.  It was a longer trip than I usually made, but I figured it could be done in a day.  About 10AM the next day, I fired up my Yamaha 250 and headed out I rode along the river and then headed northwest into the back country.  Eventually, I reached the foothills on this warm and dry Idaho summer day.  The road was a well maintained dirt road with compressed gravel on top.  Since the road was in such good condition, I was riding at unsafe-teenager speed until I rounded a corner and almost hit a moose.  Even in  Idaho, moose are rare and this is the first time I had seen one.  It stood in the middle of the road staring at me and wouldn't move.  I had heard the moose sometime attack people, so I backed up and gave it some room.  It just stood and stared at me, so after a minute or two I tried to go around it.  As I got close to it, it trotted off to the side of the road and continued staring at me as I went by. From there, I began the long ride upward through the valleys and switchbacks and along ridges ever upward.  The nice gravel road gave way to a back-country dirt road, which eventually turned into more of a trail.  As I rode along the trail, the forest canopy closed overhead and I was riding on something of a game trail through the cool, dark forest.  Even the game trail started fading out as I went up a short steep hill and entered an almost level area near the treeline.  To my right, there was an opening on the trees that revealed an amazing view.  I stopped, turned off my cycle, and walked over to enjoy the view. I stood for a minute or so looking through the gap in the trees caused by a steep drop-off.  In the clear late-summer sun, I could see the forest and mountains for miles and miles.  As my ears begin to adjust from the roar of the motorcycle to the quiet of the forest, I began to notice the silence.  It wasn't just quiet, it was silent -- no scurrying animals, no birds, no insects, no nothing.  I turned and took a closer look at my surroundings. It was the high forest and the trees were between 8 and maybe 40 feet high, with little underbrush.  The ground was bare clay covered by a thin layer of pine needles.  The perspective effects of looking through tree trunks made it difficult to say exactly, but visibility was maybe 100 feet.  It was dark and cool and there was no movement or noise. I decided to continue on, but when I took a step towards my bike I noticed something unusual in the ground.  It was an enormous animal track and my first thought was that it was a bigfoot print.  It was old and appeared to have been made during the wet months in the spring.  I removed a thin layer of pine needles to get a better look.   The print was very clear and was not distorted or munged.  It was about 14 inches long, 8 inches wide, and 2 to 3 inches deep at the heel.  The heel was narrow, the ball wide, and the toes were more indented than long and straight.  It was facing away from the vista that I had been looking at. I had seen on \"In Search Of\" that bigfoot tracks were about 18 inches long and looked exactly like big human prints, which wasn't to be the case with this track.  However there were no claw marks above the toes, which seemed to eliminate a mutant grizzly.  Even though the soil in the area was of the same consistency,  I couldn't find any additional prints. As I was mentally visualizing the small bigfoot or mutant grizzly that had made the print, the silence once again intruded on my consciousness.  I looked around, but couldn't see anything and whatever had made the print was long gone.  So, I decided to finish my ride to the peak.  After another hundred yards or two, I emerged from the treeline and into the bright, late afternoon sun.  The peak was more of a tall hill covered with tall grass and I continued up to the top. I got off my bike and slowly turned to enjoy the 360 degree view of the  forest and mountains that stretched in all directions for as far as I could see.  As I turned and admired view, I started to get that \"you're being watched\" vibe and my eyes were suddenly drawn down to the dark treeline.  I immediately saw a shadow in the trees shaped like the head and shoulders of someone looking out from behind a tree, with some brush obscuring it below the chest.  After the initial shock of recognition, I started reasoning that the shadow was a stump, or maybe a suggestive shadow formed by some tree trunks and the crossing of branches in the shadows.  I had spent a lot of time in the forest and I had seen this sort of suggestive shadow before.  After staring at the unmoving shape for a minute or so, I decided that I was \"psyching myself out\" and I forced myself to return to the view of the forest. But now as I looked at miles of uninterrupted forest, what I saw was the complete lack of buildings, roads, or any sign other of humanity for as far as I could see.  After about thirty seconds of forcing myself to look at the view, I decided to check on the stump again -- just to reassure myself that it was still there.  However as I scanned the treeline below, I couldn't find what I had seen so quickly seen before.  I looked up and down the treeline until I was sure that I had identified the bush and tree that had partially obscured the shadow, but now there was nothing behind them.  For some reason, my eyes immediately traced the distance from the former location of the shadow to where I had rode out of the treeline.  In retrospect I don't know why I was afraid of being trapped, since animals in the forest don't behave this way. I quickly considered my options -- continue on to the next peek, which had no exit on map, wait and think it through, or immediately blast down the mountain.  I fired up my bike and headed down the ridge line at high speed.  As I reached the treeline, I could only see a few feet into the dark forest.  Even so, I didn't slow down and entered the treeline at what looked like the most likely location of the former road.  I went through the treeline without incident, but I didn't really look around to see if anything was there.  This was partly because I needed my concentration on the road in front of me to keep from hitting a tree,  but also in part because I didn't really *want* to see anything.  I reached the bottom of the mountain in only about 45 minutes. After that day, I didn't have much enthusiasm for riding in the mountains.  Somehow, even the trails close to town didn't really feel safe anymore.  When I left home a year later, I didn't even take my formerly beloved motorcycle with me.",
  "classification": "Class B",
  "county": "Shoshone",
  "state": "Idaho",
  "latitude": 47.6835,
  "longitude": -116.211,
  "location": "-116.211,47.6835",
  "location_details": "I'm not 100% sure, but this looks like the location. http://maps.google.com/maps?hl=en&ie=UTF8&ll=47.682726,-116.209431&spn=0.019184,0.040169&t=h&z=15",
  "temperature_high": 84.44,
  "temperature_mid": 67.9,
  "temperature_low": 51.36,
  "dew_point": 44.15,
  "humidity": 0.46,
  "cloud_cover": 0.07,
  "moon_phase": 0.06,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.68,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 9.7,
  "wind_bearing": 235,
  "wind_speed": 1.84
}