{
  "id": "5121",
  "title": "",
  "date": "",
  "observed": "There is a small pond located in the wildlife management area in Harwinton. I have frequently visited this place throughout my youth, and adulthood to fish, camp, hike, bike, and hunt. The pond is spring fed, and is located in a flood conroll area. A town built dam at one end helps contoll the water level, but at the time of the incident the dam was poorly built. In late summer the water level in the pond would drop drastically, and create a higher concenration of fish. The best time to go fishing was at night when temps. were cooler. On this one particular night I decided to go moonlight topwater bassi'n alone. I parked my car at the entance gate around 9:00pm, and proceeded on foot down the service road. The moonlight was intense, and afforded me the luxury of saving my flashlight batteries for most of the treck. The trip from the road to the pond is approx. 3/4 of a mile, and takes you through several fields wich are cut in the summer.On the way i startled some deer that were around a salt lick, they ran off in the opposite direction of the pond. I walked through the final field, and over a stone wall, onto a path that leads directly to the spot on the pond where i wanted to fish.The area from the stone wall to the pond is wooded, and recquired use of the flashlight. The path, and woodline end in an area of land that juts out into the pond, forming a point. Due to the low water level, it was another 50 yds. walk to get to the waters edge. I fished off of a couple of rocks that jutted out even further. I had been fishing for approximately an hour, and havig some luck. The moon was full, and almost directly overhead. I was out in the wide open, and could see very well all around the shoreline. The woodline around the pond was spaced from the water at least 30yards plus in all directions. The moonlight did not penetrate into the woods, and so I could not see into them. I felt as though I were on center stage to anything that might be in the woods wathing me. All of a sudden out of nowhere a loud and deep sound eminated direclty from the woodline where I had entered the area. My knees went weak, and I nearly fell off the rocks. I turned to face the area in a ducking position trying to see what it was. The sound was again repeated after a short pause, and then nothin. I pointed my flashlight in the direction of the sound,but it was too far and too weak, not even an eyeshine. This was all that I heard. The sounds were as follows: WWRRUUMMMPFSFSFSFSSS!!-twice in succession, then a short pause (10 sec.) followed by the same WWRRUUMMMPFSFSFSSS!!-Twice in succession. The sounds were deep, and came from something large, (200+lbs.) They echoed across the pond! They were definitely directed at me, something was letting me know it was there. I found it odd that pryor to and after, there were no sounds of walking in the woods. Watever this was made a stealthy approach, and exit. I never heard anything again. I stayed and fished nervously for another hour, and left the area scared but without incident. ",
  "classification": "Class B",
  "county": "Litchfield",
  "state": "Connecticut",
  "location_details": "The incident took place in the Roraback Wildlife Management area.I entered off of south road,there are two closed access service roads that lead to the pond, one is paved, the other is not but leads almost directly to the area of incident.",
  "summary": ""
}