{
  "reportId": "27341",
  "title": "Childhood memory of a figure filling the window of her home near Evening Shade",
  "date": "1977-03-15",
  "timestamp": 227232000,
  "observed": "I was nearly 13 years old at the time. We lived in a trailer park away from town, but I can't remember what road it was on. One evening I was home alone. My mother had gone to pick up my stepfather. It was around 8-9 pm. I was sitting in the living room watching TV when my dog starting acting strange. He stood up with his hackles raised and started to growl, staring at the back door of the trailer. The back door of the trailer was in the hallway just off the living room. We had an outside light on the telephone pole in the backyard which was shining into the privacy window of the back door. His behavior caught my attention because he was a gentle natured dog who loved people. This was the first and only time I ever heard him growl like that. As I looked up to see what was bothering him, I noticed a shadow filling the entire window of the back door. My dog lifted his nose to sniff in the direction of the door, and suddenly his posture changed in an instant. He started cowering, tucked his tail between his legs, and quickly came over to hide by me. I had never seen him act this way before. Then the shadow went by the living room window, and it nearly filled the entire window. The shadow stayed in place for a few seconds, then moved away from the trailer. I could smell a faint skunk-like odor as well. I didn't have the courage to open the door and look outside for the source of the shadow. I wasn't even about to walk down the hall to my bedroom until my mother got home. (My dog didn't want to walk down the hall either.) We were both petrified! We stayed on the couch until my mother and stepfather came home about 30-45 minutes later. I'm sure they were puzzled as to why I was huddled on the couch with my dog, instead of in bed. I was afraid to tell them about the incident. Now I wish I would have at least told my mother. I've always wondered what could have been large enough to fill the whole window like that.",
  "classification": "Class B",
  "county": "Texas",
  "state": "Missouri",
  "latitude": 37.5656,
  "longitude": -92.1426,
  "location": "-92.1426,37.5656",
  "location_details": "I don't remember how to get there.",
  "temperature_high": 65.51,
  "temperature_mid": 50.245,
  "temperature_low": 34.98,
  "dew_point": 42.48,
  "humidity": 0.59,
  "cloud_cover": 0.27,
  "moon_phase": 0.87,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.72,
  "summary": "Partly cloudy until evening.",
  "uv_index": 4,
  "visibility": 7.97,
  "wind_bearing": 288,
  "wind_speed": 6.87
}