{
  "id": "41448",
  "title": "Motorist has daytime sighting along I-75 near Ruskin",
  "date": "2012-03-29",
  "timestamp": 1332979200,
  "observed": "I, a female lady, was driving on a clear day on I75 in the afternoon on a spring day from Sarasota to Tampa going north 65 to 70 miles per hour on the far right lane. This would be on the east side of I75. I had to take an exam in Tampa the next day so I know the exact date I was traveling. My window was slightly open on the passenger side to let the fresh air in. I was driving on the far right side of the highway in a heavily tropical wooded area when I saw what I first thought was a man walking fast about 50 feet away from the highway in like a grassy meadow with thick brush or tropical woods behind him. As I got closer I saw that it was not a man but a creature that looked like a man but with (approximately) three inch long brown hair covering it's body from head to foot. When I was parallel to the creature it quickly went into the brush/wooded area and disappeared. It looked like tall thick brush or woods. The creature looked like a male around I am guessing 6 to 7 feet tall with a thick body, thick legs, wide shoulders. I could see the brown body hair as it turned it's whole body all at once, bent its head, and went into the brush/woods. It was going north the same direction as me and walked quickly with wide steps with knees bent before it turned into the brush or woods. As I drove off I couldn't get over what I just saw. It happened in about 30 seconds. My car smelled like rotten eggs, sulphur, or just a strange awful odor for about 10 minutes after. I was not afraid. It did not look scary just really strange. It happened so fast and without warning.",
  "classification": "Class A",
  "county": "Hillsborough",
  "state": "Florida",
  "latitude": 27.66726,
  "longitude": -82.43094,
  "location": "-82.43094,27.66726",
  "location_details": "To the right (east) side of I75 going North after where I275 exit to St. Petersburg crosses, about 10 miles north of there near Little Manatee River State Park. There is a small bridge on I75, I witnessed the sighting either before or after the small highway bridge near Manatee River State Park. I was driving on the far right lane going about 65 or 70 miles per hour. I hope no one tries to hurt it or capture it. Maybe it is best not to post the exact location online for the benefit of the creature.",
  "temperature_high": 80.67,
  "temperature_mid": 74.52,
  "temperature_low": 68.37,
  "dew_point": 63.15,
  "humidity": 0.7,
  "cloud_cover": 0.1,
  "moon_phase": 0.22,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.4,
  "summary": "Clear throughout the day.",
  "uv_index": 10,
  "visibility": 9.99,
  "wind_bearing": 199,
  "wind_speed": 3.2
}