{
  "reportId": "1818",
  "title": "",
  "date": "",
  "observed": "First off, I'd like to say that I happened across your website quite by accident -- a link off of msn.com, matter of fact.  I haven't given this much thought for years. I grew up in Arizona, and was always crawling around the woods, backpacking.  I was a Boy Scout, and we spent a lot of time getting into the back-and-beyond, where the average camper (and most day-hikers) simply didn't go. One of the big experiences is a 50-Miler Afoot/Afloat trip, where you go 50+ miles both hiking and floating, like a canoe trip with portages.  In Arizona, we didn't have much canoe water, so we made do. We hiked West Clear Creek Canyon, an extremely remote and tougher'n hell area to get into and out of.  The \"trail\" was the bottom of the canyon and/or the creek itself.  To continue downstream, we inflated air mattresses and swam, pushing our backpacks on the matresses.  When we reached ground again, we'd deflate and press on. Needless to say, this meant that the area was virtually human-free.  We saw several bears at surprisingly close distance, bears that looked right at us as if to say \"what the heck are you?\" before scooting away.  The deer also weren't too skittish, which was cool.  Neither were the skunks, which wasn't. This hike travels from roughly Payson, near where we started, to Camp Verde, near where we got picked up.  We actually ended up at the end of Bull Pen Road, which used to be a fairly popular day camper location. In any event, suffice to say that the canyon itself didn't see many visitors.  Now for the time frame.  As best as I can recollect, this would have been in 1977, I would have been 15 at the time.  This has been in the back of my mind for that long -- but to *tell* anybody, you must first join the ranks of the loonie patrol.  That's how you'll be viewed, at any rate. All during the hike, we were paying attention to the critters, signs, spoor, tracks, etc.  Several of us were self-described Grizzly Adams, priding ourselves on our ability to identify animals by the evidence of their passing. About halfway through the hike, we came to what I recall was a mini-meadow.  It was a small patch of grass on a fairly stable slab of dirt, anchored upsteam and downstream by large rocks.  I thought at the time that this slab of soil, which was right next to the creek itself, should not have been so well-seeded with grass and low shrubs, but I suspect the rocks offered at least some protection from the annual floods.  At least enough to retain the soil, if not the plants thereon. At the edge of this soil, there was a small strip of mud beach at the water.  About two feet back from the water, and parellel to it, was a large footprint.  And I mean *large*.  And deep. By way of comparison, my foot was used.  I was about the biggest kid there, having a size 15 foot.  Placing my foot next to the print, my boot would be about 70% the size of the footprint.  We had no ruler or tape measure, but I guesstimated it would have been 18 or 20 inches long.  Big dude. I weighed about 220 pounds back then, so I got to be the depth tester, too.  I stepped in the mud, between the print and the water.  Even though where I stepped was wetter than where the print was, I left an impression of perhaps 1/8\" deep.  We guesstimated the print itself to be almost 1/2\" deep.  As I said, a big dude. There was no drying of the edges of the print, nor had the edges begun to curl down or slide back into the print.  The grass crushed inside the print had begun to bend back up, so we guesstimated that the print was older than 8 hours, but less than 24 hours old. We really wanted to take a cast, but (of course) we had no plaster, and couldn't think of a suitable substitute.  We didn't have the time to wait, in any event. Thankfully, the canyon went through a wide spot at that point, and we couldn't stop to mess with the track.  We had to make so many miles per day, so we had to press on after stalling there for about 30 minutes or so.  We were *very* very vigilant for the duration of that trip, I can assure you.  We had to have walked right past it, either before we saw the track or afterwards.  Creepy, thinking that something that big might be staring at you from the brush or the canyon wall. We heard nothing, and saw no other tracks, no hair, no scat, nothing we could attribute to \"the big critter\".  We tried, but even our overactive imaginations could not come up with another bit of evidence.",
  "classification": "Class B",
  "county": "Yavapai",
  "state": "Arizona",
  "location_details": "Apart from the description in the text above, I cannot give precise directions.  I'm not even altogether sure which county we were in at the time, as our hike traversed from Gila to Yavapai.",
  "summary": ""
}