{
  "reportId": "30860",
  "title": "Daylight sighting by camper at Black Mountain Campground near Blue Ridge Parkway",
  "date": "2011-08-21",
  "timestamp": 1313884800,
  "observed": "My two friends and I were camping near Busick, NC, just east of the Smokey Mountain National Park.   We were northeest of Asheville, near the Blue Ridge Parkway.    (Busick is so small that google earth does not have a marker for it.)   On the first of the two nights we were there, we heard wierd yells going through the woods right after dark.   Later, while we were sitting near the campfire playing dominos, we heard the same yell and heard rustling in the woods nearby.   We couldn't distinguish what it was because there were some people singing christian hymns at a small theatre nearby.   Later that night, when I was asleep, my friends(they were brothers) were talking about the upcoming wedding of one of them this coming spring and the younger brother says that he saw it move through the woods very close to our camp.   He told me about it the next day and I got kind of scared, since I may have seen a bigfoot in New Mexico back in 1994 while in the boy scouts.   The next day the two brothers went on a long hike and I stayed in camp since I was experiencing foot problems and had no hiking boots.    I got really bored so I decided to walk down what seemed to be a game trail into the woods for a few hundred yards.   I noticed that there were a lot of trees that were broken, like something had bended them.   None of these trees were very thick, but there were a few that I knew I could not snap.   I started to get a little scared, like something wasn't right.   I was only about a 1/4 mile from the campground, and I saw it.   It scared the s**t out of me.   I only saw it for about 10-15 seconds(maybe, I was so scared it could've been 5 seconds or it could have been a minute), and the best way to describe it would be that it looked like the bigfoot from Harry and the Hendersons only it was heavier and a little bit darker.   I was probably about 15-30 feet from it when I saw it.   We stared at each other for the duration of my sighting, and then it walked away as if I wasn't anything to worry about.    I stood in that spot for a little while and then walked back to the campsite, stopping every now and then to look around for the thing.   I told my friends about it and after describing the thing the one brother who saw it the night before said that it was probably the same thing he saw.",
  "classification": "Class A",
  "county": "Yancey",
  "state": "North Carolina",
  "latitude": 35.75278,
  "longitude": -82.22121,
  "location": "-82.22121,35.75278",
  "location_details": "Pisgah National Forest, Black Mountain Campground",
  "temperature_high": 84.9,
  "temperature_mid": 76.275,
  "temperature_low": 67.65,
  "dew_point": 67.54,
  "humidity": 0.81,
  "cloud_cover": 0.32,
  "moon_phase": 0.74,
  "precip_intensity": 0.0049,
  "precip_probability": 0.22,
  "precip_type": "rain",
  "pressure": 1014.78,
  "summary": "Light rain in the evening.",
  "uv_index": 9,
  "visibility": 7.25,
  "wind_bearing": 247,
  "wind_speed": 2.21
}