{
  "reportId": "7835",
  "title": "Unseen animal intimidates fishermen on Colorado River near Lake Spence.",
  "date": "2004-01-22",
  "timestamp": 1074729600,
  "observed": "I arrived at site during fall thunderstorm and after it passed around 9 pm, set up to fish under bridge as the water was running and the catfish had swam upstream from Spence to feed. Observed one identifiable humanoid track (fresh) in river mud under bridge and several large smears along rivers side in 20 ft radius. Around 10 pm., from across the river, we heard 2 LOUD roars, that ended in a scream, grunt cough? This was unnerving, as we had fished this area several times times in the past and even though at times felt nervous in the area, maybe spooked?, nothing like this before. After the screams we heard a heavy moment in the thick mesquite in the area the roars came from, then a heavy thudding sound. Nothing more occurred for 1hr, until my fishing buddy said in a low voice that someone had just threw a rock at him, at that moment a large rock hit the dirt between us with a lot of velocity, I yelled to cut it out, and another roar answered me, this time there was no doubt it was time to leave. We gathered our gear as fast as possible and left for the truck parked up on the road above us, as we were walking up the concrete to the bridge, we both heard a heavy splashing and something running in the river below, {river at this time around 5 ft. deep due to run off} and a grunting noise. When we got to the truck we both saw river mud spattered all over the windshield, side and grill, and it had the most foul odor I've ever smelt, like the smell of lake mud when the lake turns over in the fall. I've never been spooked like that before or since. Also I've never returned to that spot because it scared me. Problem is, it's some great fishing! Locals in the area at times had told us to stay away from under this bridge, but never gave explanation. The store in the town of Silver (pop. 10, at the time was the areas meeting place. For what is worth, there's the info. hope it can be of assistance to you guys.",
  "classification": "Class B",
  "county": "Coke",
  "state": "Texas",
  "latitude": 31.84167,
  "longitude": -100.5167,
  "location": "-100.5167,31.84167",
  "location_details": "Near E.V. Spence Reservoir.",
  "temperature_high": 57.16,
  "temperature_mid": 51.345,
  "temperature_low": 45.53,
  "dew_point": 40.52,
  "humidity": 0.78,
  "cloud_cover": 0.73,
  "moon_phase": 0.04,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1025.29,
  "summary": "Mostly cloudy starting in the afternoon.",
  "uv_index": 2,
  "visibility": 8.49,
  "wind_bearing": 274,
  "wind_speed": 1.14
}