{
  "reportId": "43911",
  "title": "Memory told of screaming creature terrifying campers at Gold Basin Campground along the Mountain Loop Highway",
  "date": "1974-09-15",
  "timestamp": 148435200,
  "observed": "August 1974 I and my three friends Tom, Byron, and Jay went camping with their parents who slept inside their camper while we slept on the ground with a plastic tarp draped over us.  It had been raining the day before.  Around 2 am I was awakened by an eerie screaming.  It sounded like a woman was being murdered.  It freaked me out.  The screaming was across the Stillaguamish River which was about 50 meters from where we slept and into the forest on the other side.  Across the river was a steep incline into the rustic forest and beyond that was nothing but wilderness all the way into Canada.  The screaming became louder and louder as the “thing” that was screaming was getting closer.  I heard it walking down the steep hill on the other side of the river, and then I heard it walk up and down the other side of the river, screaming all the more.  It was very loud and very scary.  It gave me the impression that it was angry.  Angry at us for being in its area and it wanted us out.  That was my impression.  I was scared to death and I did not know what to do.  Then, suddenly, the thing walked across the river towards me!  It came to my side of the river and began to walk up and down the river bank screaming all the louder.  Then it stepped on a fallen tree that was on the river bank and I heard a “snap” as the weight of the thing broke the log as it stepped on it.  Then the thing walked up to me and my friends and came within 10 feet of us and screamed some more.  I thought it was going to kill us.  Just then I noticed the terrible odor that this thing had.  It was overwhelming!  It was so strong it made my eyes water.  I was petrified.  I was too scared to move, to speak, to do anything.  I really thought it was going to kill me.  It was lasting forever!  This thing was standing over top of me, screaming, smelling horrible, and scaring me to death.  Then he started to simply walk away.  It went back to the river and walked across it to the other side.  Then it climbed up the steep hill and into the forest screaming all the time.  The screams became farther and farther away.  When it was a good distance away I started to believe that it wasn’t going to kill me.  I then asked my friends, “Tom, Byron, Jay, did you guys hear that”?  They all three jumped up and yelled at me “yes what the hell was that?”  It seems they were just as terrified as I was and were frozen stiff with fear.  The entire episode lasted for approximately 25 minutes.  What did I see?  I saw nothing because it was pitch black dark.  I heard and smelled everything.  It was as real as it could possibly have been and we are convinced that it was some kind of monster.  It walked on two legs just like a human.  I have been shot at, artillery shelled, sniper shot at, have had a hand grenade tossed at me, survived an ambush, and IEDs while in combat.  I have been attacked by a 12 foot shark while scuba diving.  I have been face to face with three adult man eating lions that were pets of Saddam Hussein’s son.   Nothing can compare with the fear that I felt this day.",
  "classification": "Class B",
  "county": "Snohomish",
  "state": "Washington",
  "latitude": 48.07834,
  "longitude": -121.7363,
  "location": "-121.7363,48.07834",
  "location_details": "It was about 5 miles toward Monte Cristo on the Mount Loop Highway at a campground called Gold Basin.  Mount Pilchuch was the nearest mountain in the range.",
  "temperature_high": 71.92,
  "temperature_mid": 60.71,
  "temperature_low": 49.5,
  "dew_point": 49.83,
  "humidity": 0.68,
  "cloud_cover": 0.42,
  "moon_phase": 0.98,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.32,
  "summary": "Mostly cloudy until afternoon.",
  "uv_index": 3,
  "visibility": 8.67,
  "wind_bearing": 222,
  "wind_speed": 2.65
}