{
  "reportId": "22500",
  "title": "Paranormal investigator describes encounter near Covelo",
  "date": "2007-12-15",
  "timestamp": 1197676800,
  "observed": "Id like to do it this way, still not sure exactly what happened. Im with a paranormal invest group, earlier this monthwe went to Round Valley (Covelo) In calif. One of the investigations was a night time walk up a hill at a rancher's property in Covelo; earlier in the week, from what I remember hearing, was a Bigfoot had been interacting twice with his horses, which he chased off, so we hit that spot. Except me, I stayed in the car with a video game and a flashlight onhand. Maybe 10-15 mins after everyone else took off up the hill, I noticed a movement by the rear passenger window at the driver's side of the car, something a gold-tan color was standing by the back window. Turned off the interior light in the car and sat in the dark a little while, maybe 4-5 mins, then turned it back on. Whatever it was came back to the window again; this time I heard what I guess has to be described as 'patting/palming' the door of the car. I about lost it then, ( I dont scare, so this is really strange), and turned off the light, didnt turn it back on till everyone else came back down the hill. Just before people returned, I saw something run past the car really fast, up toward the front of the car line ( we had 4 cars there, I was in the last one). No one else saw the running whatever, they checked the door but didnt see any muddy handprints or anything on it. Im still frazzled, been dealing with all types of wild animals  since I was a kid ( aunt worked witha  zoo and Ive done wildlife rehab since I was a kid). Heard from someone in town there that BF's have a way of sort of mentally 'fear-paralyzing' animals; this sort of explains why I tried to turn myself into a tall thin stick when I was sitting there. Any ideas? Im stumped.",
  "classification": "Class A",
  "county": "Mendocino",
  "state": "California",
  "latitude": 39.83929,
  "longitude": -123.2393,
  "location": "-123.2393,39.83929",
  "location_details": "Was on a Covelo residents property, up a hill, he had 2 horses. Not sure where it was exactly, we were asked to go there to look over this. Please dont list this, Im still not sure what happened yet.",
  "temperature_high": 50.16,
  "temperature_mid": 45.755,
  "temperature_low": 41.35,
  "dew_point": 38.95,
  "humidity": 0.81,
  "cloud_cover": 0.78,
  "moon_phase": 0.2,
  "precip_intensity": 0.0013,
  "precip_probability": 0.34,
  "precip_type": "rain",
  "pressure": 1024.67,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 6.6,
  "wind_bearing": 128,
  "wind_speed": 1.69
}