{
  "reportId": "49902",
  "title": "Possible footprints found by a hiker on Mt. Ascutney",
  "date": "2015-05-24",
  "timestamp": 1432425600,
  "observed": "I research mountain lions in NH, but I was caring for my mother and hadn't gotten out since Christmas Day, 2014. On 5/24/15 I decided to just go for a walk, no research. I did a Meet-up with someone who walked much faster than me. She left me at the power line. I was way downhill, but was determined to at least make it to the power line. I did, but when I turned back to go down to the car, I saw two huge prints near a tree by the trail. When I got to them, the heels were 3-4 inches deep in the soil and leaves. They touched and the toes went out and away from each other like a duck's feet. They seemed to be 15 inches long, but it was hard to tell with all the leaves, unevenness, grass, etc. I took photos and measurements (even on a walk I take a camera and tape measure). It was interesting as hiding by that tree the Futures Trail went right past the tree, above was the power line and behind the tree was the park road, so that it was an advantageous hunting spot as animals coming from six different directions could easily be hunted down. Going back to the car, I saw two more tracks to the right of the trail. One was about 10 inches. The other seemed to be 15 inches, but with a 10 inch track inside it. The toes were 5 inches across for the three toes that were embedded in the bank. The other toes were over the hardened trail. There was also a 5x6 inch parallelogram shape. I kick myself now as I didn't take a photo. Later I saw a knuckle-walking gorilla on TV and thought, \"That's what that was!\" It was a knuckle print and also was very deep. At the bottom I asked the ranger to do a casting and he said I could instead, so I bought plaster of Paris. It wasn't enough. I had to go back several days later (rain). The casts are awful. There were too many leaves, the toes broke off, etc. The interesting part was that the park ranger acknowledged the report with a \"Yeah, we get lots of reports of bigfoots, but we try to keep it on the down low.\" When I asked him about mountain lion sightings, he seemed scared and said, \"You think there are mountain lions up there?\" It was odd that bigfoot was \"normal\" and mountain lions were \"strange\"! When I came back, I heard from someone else that this same ranger had been followed down the hill by something he nicknamed Roy. He was hoping it was a bigfoot and not a lion. Part of his job is to clear the trails and make sure everyone is off the mountain. That night it got dark, and he was also \"helped\" off the mountain, though \"it\" always stayed the same distance behind him.",
  "classification": "Class B",
  "county": "Windsor",
  "state": "Vermont",
  "latitude": 43.43623,
  "longitude": -72.43684,
  "location": "-72.43684,43.43623",
  "location_details": "Park rangers are trying to keep this quiet, but have had reports of bigfoots and tracks. The tracks I saw were on the Futures Trail above the first parking lot and below the power line at Mt. Ascutney State Park in Windsor, VT.",
  "temperature_high": 79.96,
  "temperature_mid": 66.61,
  "temperature_low": 53.26,
  "dew_point": 36.04,
  "humidity": 0.43,
  "cloud_cover": 0.05,
  "moon_phase": 0.22,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1022.83,
  "summary": "Clear throughout the day.",
  "uv_index": 10,
  "visibility": 9.98,
  "wind_bearing": 235,
  "wind_speed": 5.81
}