{
  "id": "8999",
  "title": "Woman reports riverbank sighting",
  "date": "2004-03-14",
  "timestamp": 1079222400,
  "observed": "I was driving from Columbia Falls to St. Regis Montana to pick up my daughter Jessica. She had spent the weekend with her father who lives in Spokane Washington. It was a bright sunny afternoon either the last weekend of Feburary or the first weekend in March. The time was 3:55 PM on a Sunday. I remember the time as I had just looked at the clock on my dash and we always exchange Jessica on Sunday. We had been following the river for some time and I noticed the ice was breaking up from around the edges and floated down stream. My daughters 15 year old boyfriend was traveling with me. We were traveling west on highway 135 at aproximately 60/65 MPH towards St. Regis. As we started over the bridge that spans the clark fork river I looked to my left as I always do. I like to look for deer and other wild life along the river bank. There is a sand bar that reaches out into the river on the west side and near the tip I saw a very tall (8 to 10 feet) hairy being and a much smaller one. It looked to be right at or just  taller then the knee of the larger one. The larger one was standing about 5 to 6 feet behind the small one with it's arms outstreched and taking a step forward. The small one looked as if it was curious about the chuncks of ice that were near the waters edge as it was leaning forward looking down. The tall one had long reddish brown hair. I remember seeing it flow from the upper arm area, and the hair on it's head and shoulders was also long. It looked silky and shown in the bright sun light. The small one looked to be the same color with shorter hair. When I saw them I said to my daughters boyfriend, \"Look at that!!!\" He said \"WHOA!!\" then we were over the bridge. We looked at each other with our mouths open. We didnt turn around, I think we were stunned and didnt quite believe what we had just seen, maybe a bit scared too?. We didnt talk about it on the way back. After picking up my daughter, the two of them were excited to see each other and talked non-stop in the back seat. I did look at the sand bar on the way back over the bridge which was about 30-40 minutes later, but I didn't see anything. I didnt tell my husband about this until a few weeks ago. I'd been trying to convince my self I didnt really see what I saw. Then one night at dinner I told my family what I had seen. My husband said, \"YA RIGHT!\" My daughter's boyfriend happened to be there for dinner and said, \"Kelly, I remember that, I was there with you!\" He and I hadn't talked about this until that night. I knew then I had to send our siting to the BFRO. I totally believe that what he and I saw was a mother Bigfoot and her young child. I got the feeling in that brief moment, that she was showing her young one something new, allowing him or her to explore. Perhaps her baby had gone too close to the river and she was reaching out as if to say \"that is far enough!\" Just as I have done with my own children.",
  "classification": "Class A",
  "county": "Sanders",
  "state": "Montana",
  "latitude": 47.62167,
  "longitude": -115.3903,
  "location": "-115.3903,47.62167",
  "location_details": "To the right of the bridge is a public boat launch on the east side of the river. The sighting took place on the west side of the river in a popular picnicing/camping area in the summer months. In the winter it is deserted.",
  "temperature_high": 45.92,
  "temperature_mid": 37.875,
  "temperature_low": 29.83,
  "dew_point": 25.47,
  "humidity": 0.62,
  "cloud_cover": 0.66,
  "moon_phase": 0.78,
  "precip_intensity": 0.0005,
  "precip_probability": 0.53,
  "precip_type": "rain",
  "pressure": 1019.56,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 9.68,
  "wind_bearing": 241,
  "wind_speed": 4.86
}