{
  "reportId": "2553",
  "title": "Bowhunter and wife abandon deer when threatened by large, unseen animal",
  "date": "1964-08-30",
  "timestamp": -168480000,
  "observed": "I was bow hunting with my wife Joyce.  I pulled off the road and parked my jeep.  It was the middle of the afternoon.  As we were walking up in the timber we kept hearing things behind us.  I knew it was big because of the noises we were hearing.  We would walk and it would start walking and it would stop whenever we did.  I never saw it but we knew it was there. We were walking very softly through the quakies and I saw an ear flicker.  I drew my bow and the deer stood up.  It was a four point buck.  It was about 50 feet in front of us.  When I shot and hit the deer the it fell.  Immediately whatever was behind us let out a loud, shrill, deep-throated, dragged-out chirp. I cannot explain it as I never had and never have since heard anything like it.  I have spent my whole life in the mountains of Colorado and think I have heard just about everything. This was new. It made the hair on the back of my neck stand up.  I knew it wasn't a bear because I know a bear is not capable of that noise. The deer stood up and kept going down the hill to the right.  We followed the deer and the thing behind us kept following, thrashing the brush all the way.  It sounded like it was breaking over trees.  It was ticked off because I shot the deer.  I never saw it because it wouldn't come out of the trees.  We decided to forget about the deer and high-tailed it out of there as fast as we could.  I haven't went back in those trees since.",
  "classification": "Class B",
  "county": "Gunnison",
  "state": "Colorado",
  "latitude": 38.90833,
  "longitude": -107.575,
  "location": "-107.575,38.90833",
  "location_details": "Near Longs Lake, about a quarter mile west of the lake.",
  "temperature_high": 80.74,
  "temperature_mid": 67.09,
  "temperature_low": 53.44,
  "dew_point": 30.79,
  "humidity": 0.33,
  "cloud_cover": 0.26,
  "moon_phase": 0.76,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.26,
  "summary": "Partly cloudy until evening.",
  "uv_index": 8,
  "visibility": 10,
  "wind_bearing": 160,
  "wind_speed": 4.17
}