{
  "reportId": "24879",
  "title": "Daylight sighting of a white-haired Bigfoot in a yard outside Lonedell",
  "date": "2005-08-25",
  "timestamp": 1124928000,
  "observed": "My four year old son and I were visiting my parents who lived in Lonedell, Missouri. My mother was napping, my father was at work (he helped farm there on the land--they lived in a trailer on the about 350 acres owned by their landlord). I was sitting on the front porch with my son and my parent's dog, Buddy. It was mid-afternoon, probably between 1 and 3 pm. I noticed something or someone walking in the field connected to the front yard coming in our direction. My first instinct was to get my baby and get inside. However, I could not help but stand in the doorway, screen door closed but the wooden door open just enough for me to peer through. Whatever that thing was, it kept coming closer to the trailer. By this time, Buddy (the dog) was timidly barking. I could tell from his bark that he was threatened but afraid. I felt bad leaving the dog out on the porch alone, but was too afraid to go out there. The thing (for lack of a known word to call what it was that I saw)was walking, on two legs, aimlessly, not in a hurry and I could not find a reason as to why it came into the yard as it was just looking around aimlessly and leisurely walking. There was a wooden fence, mostly for decoration and only about 20 feet long, that the thing walked next to. My mother had some decorations (can't remember what) hanging on the fence that the thing seemed to look at. The dog barking did not startle the creature, it just kept walking. I was absolutely astounded by what I was seeing; if not for the fact that the dog was seeing it too, I would have wondered if my eyes and/or brain was playing tricks on me. I decided to be brave and opened the screen door just enough to stick my head outside. That's when the thing looked at me, met my gaze. I just stood there, half afraid of it's reaction and it's next move but more curious than anything. My heart was racing. I held my son up to look at it also, still indoors. After it looked at me and yet showed no fear I had more time to study it and I was racking my brain to identify what it was that I was seeing. Here is the best description I can give...It was between 4-6 feet tall, walking on two legs, covered from head to toe in very long white hair. It's face was mostly covered in white hair as well, except for it's eyes and maybe it's mouth. It did not have the snout like a dog, it's shape and build was that of a human's. I even compared it to a bear in my head, but their were not enough similarities. This thing was not very animalistic in behavior--the way it walked and looked at me were more typical of human behaviors. Yet, the way it wandered and seemed oblivious to the man-made things around it (cars, the trailer, even the fence) was more like the characteristics of an animal. I did not get the feeling that it was aggressive or wanting to cause harm. Yet, because of the size and animalistic nature of it, I knew that it was strong and could hurt me, my son, or the dog. It began to walk around the side of the garage, out of my sight, but closer towards the end of the trailer that had the bedroom my mom was napping in. I ran down into the bedroom and began frantically looking out the windows searching to see where it had gone. i woke my mother up in my tizzy and quickly told her what I had seen and I wanted her to look. She was still half-asleep and slow to process what I was saying. I did not see where it went from there. I could not locate it through the windows and I was much too afraid to go outside and look. My mom, my son, and I all sat and talked about what I had seen that afternoon. I was still shook up about it. My son was able to confirm to my mother that it was not a dog, not a bear. The fact that we both saw and heard that dog barking at it helped to convince my mom that it wasn't a human or another dog, bear, etc. My mom said that people down the road have two big white dogs--but like I told her, this thing was walking on two legs, not on all fours like a dog. For many other reasons, I knew it was not a dog. I'd never seen a bear in real life before, but I am sure it was not a bear either. I had heard of and seen animated Yetis on a pc game before. That was the closest thing I could match to what I had seen. I knew then and know now that many people do not believe Yetis are real--but whatever it was that I saw that day makes me wonder if they are in fact real and if that is what I saw. I believe it was late summer when this happened. Nice weather, sunny day. Like I said, mid-afternoon and it was out in the open. There were clear farmlands all around us. One pond stocked with fish and swans right next to the end of the trailer that it went in the direction of. There were also two other ponds on the land. I know that a lot of the 350 acres was wooded. Also, there was a road about 300 feet from where the thing was and also from where I was. There was only about 150 feet between myself and the creature. I'm not good at mathematical estimations, but I was as close as I would have wanted to be to whatever that was. It looked as if it could have made about 10 strides to me in a very short amount of time, so I stayed inside. I've read a few of the other sightings here on your sight, but all that I have read are of people seeing creatures covered in dark brown or almost black long hair. That wasn't the case with me. The description of the hair being that it was very long and covered the whole creature, not tangled, matted, or dissarrayed, but it was a blinding white color--didn't even look dirty or yellowed. I wish I could remember its hands or feet, but I can't. I can say that it's eyes were bigger than that of a human's and seemed very dark. Other than when we met each other's gaze, it had it's head looking down so I could not see it's eyes or facial features well if at all. It did not make any noises at all. It hardly made any sounds while walking. This happened about 5 years ago and I have not forgotten it--never will forget it. In fact, my son still remembers seeing it as well. I told my dad about it when he got home--he couldn't tell me what it was either, had not seen anything like that before. I've told my husband, my brother, some friends--no one can relate to what I saw or help me to name what it was. I often wish I could go back to that day and be less afraid and more willing to study it, to even sit outside and watch it instead of hiding inside. I doubt I will ever see anything like that again, and yet I don't know if I really want to, lol. I hope this helps with your work in some way. I had no idea that there have been so many sightings of similar creatures in Missouri and in our country as a whole. I'm going to look through some more stories of sightings after I submit this--I'm curious to see if anyone else has reported a white creature before. It feels great to share my story with someone who might be able to tell me what it was that I saw that day--someone who might have seen something like this before themselves. Thanks, Amber.",
  "classification": "Class A",
  "county": "Franklin",
  "state": "Missouri",
  "latitude": 37.79465,
  "longitude": -90.79886,
  "location": "-90.79886,37.79465",
  "location_details": "Lonedell, MO",
  "temperature_high": 81.01,
  "temperature_mid": 76.255,
  "temperature_low": 71.5,
  "dew_point": 69.96,
  "humidity": 0.84,
  "cloud_cover": 0.39,
  "moon_phase": 0.72,
  "precip_intensity": 0.0204,
  "precip_probability": 0.51,
  "precip_type": "rain",
  "pressure": 1017.13,
  "summary": "Rain in the afternoon.",
  "uv_index": 7,
  "visibility": 6.75,
  "wind_bearing": 79,
  "wind_speed": 2.59
}