{
  "reportId": "11682",
  "title": "Young men have frightening vocalization incident near Stones River.",
  "date": "1993-03-15",
  "timestamp": 732153600,
  "observed": "Upon my initial encounter, I did not think at all that I would be attributing it to something like this. However, the more I read, the more certain I am that me and my friends had a close encounter with a bigfoot. It was early spring when me and two buddies decided to romp through the woods behind my dad's house. It was just before dusk and there was an hour or so left of daylight. We headed out equipped with only two flashlights and cigarettes. My friends were Robert (a tall well built guy and Paul, another large guy but not as tall as Robert). Neither of them had any beliefs in anything other than the normal mundane. I on the other hand have always had an open mind on topics such as these. We were prompted to venture out based on some local tales of the woods that grew up to my dad's back yard and that encompassed many miles of land along the Stones River in TN. The stories were mostly odd noises (growling, knocking sounds, and screams). The occasional sighting of something strange (figures moving through the woods etc). We always thought it to be ghosts as battles of the Civil War were fought in the area. Anyway, we set out to explore the woods and the horse trail that followed the river several hundred yards behind the house. As we reached the trail I noticed oddly that there seemed to be quite a few trees that had been pushed over and uprooted. I commented on this to them and they didn't seem to think much of it. We continued on and at a fork in the trail we opted for the higher ground as the alternative path was somewhat muddy. This lead us to a ravine that the trail sharply bypasses. On a whim I offered up the idea that we should get off the trail and hike out this ravine to see where it would lead. They both pondered for a moment and off we went. Perhaps an hour or two went by with us all having a great time laughing and conversing when we came upon a spot of ground that was covered with dried grass and chose to take a break. At this point it was well past dark. We shut off our lights and Robert and Paul lit up their cigarretes. I remember looking up while they smoked and seeing stars but no moon. It was crystal clear and I commented on how dark it was. A few moments passed and Robert then seemed to become uneasy and stated that he was ready to head back. Paul and myself seemed a little thrown off by this as we have never seen Robert become so unnerved so quickly. We readily agreed to leave and rose from our spot on the ground and realized that where we were sitting was just 5' from the trail. We climbed the steep embankment and resumed our walk on the trail. The trail follows the river and if you walk far enough it meets the road and curves sharply back into the woods and continues on with the river for many miles. I have never (especially after that night) walked it's entire length. In fact, I can't recall anyone I know that has. Regardless as we started walking I did get the sensation that we were being watched. I think we all 3 had this feeling as our conversation and laughter didn't ever quite resume. We had walked about 15-20 yards perhaps after climbing back onto the trail (which at this point had no trees overhead just on each side of us) and then the trail entered into the woods again. The forest here was extremely thick overhead and it was very dark at this point. We continued on with the intentions of getting to the road as mentioned before. We were perhaps 100 yards from the road when we heard the first branch break. If you asked me today I would tell you that Paul was a little crazy as he darted into the woods in the direction of the noise. He had no flashlight as Robert and myself had the only 2. At this moment I have never seen someone so afraid as Robert was at that moment. He was more than willing to leave our idiot friend and bolt for the road. After some convincing, we headed toward the location Paul had run. We used our flashlights sparingly as we had assumed by now that someone was out there with us. We did not want out lights to give away our location. I remember nearing the point where Paul vanished and calling his name in a half yell/whisper. His reponse still gives me chills. He half pleading asked me to be quiet. Then I heard him making his way toward us. When he entered onto the trail from the trees on our right side I could see his face (barely but enough) was filled with fear. He told us that someone was out here and that now he too was more than ready to leave. We quickly stood up and turned to make our way to the nearest exit... to the road when we heard again another branch break. This was in the direction we were wanting to go. Not what we wanted to hear. At this point, I feel it's necessary to point out that when I say branches breaking I don't mean little twigs. It was loud enough to sound like someone snapping a rather large branch on their knee. To me it meant something big. With no option to leave quickly we opted to head back the way we had come. I would guess that we had walked maybe 2-3 miles away from my home. None of us looked forward to this prospect, least of all Robert. At a brisk pace we began the hike back with our lights on. This is where the story begins to blur and again I get chills thinking about it. Whatever it was had to be following us for from time to time, we would hear the same branch breaking. Each time we did, we would crouch down and huddle together with our lights off. Then, when all seemed well, we would trek off again lights blazing. I would say this pattern repeated perhaps 5-6 times. The last time we huddled is the last moment of clarity I have. We were at the base of a fairly steep incline on the trail. Along the river this was an area we called the bluffs as there are a series of steep cliffs here. We cut off ourlights again in response to the same noises. We had not huddled for more than 30 seconds when the air was filled with the most horrific scream I have ever heard in my life. The intensity was such that it echoed far down the river and I would have to say for several miles. Without hesitation I ran. I know they did too as I could hear Robert and Paul behind me. We did not stop and did not turn off our lights till we reached the house. Fully out of breath, we all three collapsed in the living room. We were all in disbelief unsure as to what had just happened. I heard my dog begin to bark and assumed that she was barking at us returning home. She was kept in a fenced in area out back. Paul took a light and shone it into the yard and quickly noted that she was barking into the woods. When he closed the back door, we heard the scream again. It had followed us for the most part but remained in the woods. Having enough, we left. I spent the night at their house not eager to remain home. There are several other things I would like to report that have only now dawned on me that relate to this experience and this topic. Also, I would love the chance to have someone with knowledge accompany me to the area as I do not think this was an isolated encounter. (Added some of these notes below)",
  "classification": "Class B",
  "county": "Rutherford",
  "state": "Tennessee",
  "latitude": 35.94778,
  "longitude": -86.36485,
  "location": "-86.36485,35.94778",
  "location_details": "",
  "temperature_high": 47.7,
  "temperature_mid": 43.65,
  "temperature_low": 39.6,
  "dew_point": 16.27,
  "humidity": 0.51,
  "cloud_cover": 0.46,
  "moon_phase": 0.77,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1029.63,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 9.76,
  "wind_bearing": 170,
  "wind_speed": 8.89
}