{
  "reportId": "42022",
  "title": "Possible nighttime encounter near Spencer leaves three men startled",
  "date": "2013-04-13",
  "timestamp": 1365811200,
  "observed": "The whole thing was sparked because I had found an unusual barefoot track while out fishing with a friend. While fishing at night we have heard some very strange sounds. We went out hoping to hear something or find another track. We were sitting by the lake originally with nothing happening. After it being cool and a bit rainy, we decided to leave the area. We were going up the road when XXX made the suggestion to pull over by the archery field to see if we could see any deer on the way out. When we pulled over to the field we caught a glimpse of eyes. We stepped out of our vehicle using a large mag-light and we glassed the area where we saw the eyes and caught the eyes moving over the grass line. The thing that made me think this was strange was the distance between the eyes. They were about a foot apart and shined green when the light hit them. Then, it moved left to right and appeared to be just above the grass line which was roughly about four foot high. When it moved to the right is when it got interesting... It stood up straight and looked toward us. The eyes where clearly another 4 foot above the grass line. It then turned to its left and walked across the field into the wood line. We were all stunned. We decided to leave the area kind of in a state of shock...as we were kind of freaked out. We pulled out and headed out towards the road when XXXXXX said we should go back and get a size comparison. He said we watched it leave so we should go back for a more accurate comparison. It needs to be stated at this time that I am an avid hunter and was a Nuisance animal control specialist with the ODNR for three years. What we had seen at that point was nothing that should have been in this area. Not a deer, not a coyote, not a bear...this was much larger. We turned the truck around and pulled back into the archery area and made a general plan. XXX would keep the truck running as I would walk to the edge of the field with the mag-light. XXXXXX wanted to walk across towards the tree line to where we saw it go into the woods so we would get a height comparison. The truck lights were on....as XXXXXX started across the field, I was trying to glass the edge of the field with the light showing him which way to go. About 30 yards in or so the eyes reappeared in the same location it entered into the woods...low to the ground just above the grass line. I hollered to XXXXXX that it was back and he needed to go to the right. Once he started moving to the right, he looked back at the truck and said he could not see the eyes. He was looking back into the truck lights off and on. This thing stood straight up and looked down at XXXXXX. He was probably just about 30 maybe at most 40 yards from this thing. Jeremy is 6 foot and this thing just dwarfed him in size. I hollered for him to freeze! XXXXXX turned and looked at us, and I told him to move back to us slowly. XXX and I were honestly rattled. XXX was asking me what it is..what is it??…. as I was trying to rationalize what we were seeing. I had to answer him with a, I don't know??? As XXXXXX was walking back towards us slowly....facing away from us...all I could think was if it wanted him, we could never had made it to him in time. It stared at him till he was more than half way back and once again turned left and went into the woods. XXXXXX never saw the eyes. He said he did hear something moving into the woods...but it was faint at that point. We are guessing that it was around 8 foot tall.",
  "classification": "Class B",
  "county": "Medina",
  "state": "Ohio",
  "latitude": 41.11417,
  "longitude": -82.07824,
  "location": "-82.07824,41.11417",
  "location_details": "The location of the sighting was near Spencer, Ohio. I would prefer if the location was not disclosed. I do not want anyone trying to shoot at or accidentally get shot....looking for these creatures.",
  "temperature_high": 42.78,
  "temperature_mid": 38.13,
  "temperature_low": 33.48,
  "dew_point": 32.73,
  "humidity": 0.73,
  "cloud_cover": 0.92,
  "moon_phase": 0.11,
  "precip_intensity": 0.0005,
  "precip_probability": 0.41,
  "precip_type": "rain",
  "pressure": 1013.27,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 9.78,
  "wind_bearing": 248,
  "wind_speed": 12.57
}