{
  "id": "8375",
  "title": "While constructing \"fort,\" young teenager has afternoon sighting in Amboy off Rotschy Road",
  "date": "1993-02-15",
  "timestamp": 729734400,
  "observed": "I was about 13 and lived in Southern Washington in a small town called Amboy. I lived with my mother stepfather and stepbrother in a small house on about 5 acres pretty far from anyone, on Rotschy Hill. One day my brother and I were building a fort in the woods on the base of an small hill just on the outside of our property. On top of the hill there was a house that you couldn't see from where we were. So we were working on our fort when we heard a lot of noise on the side of the hill branches breaking, dogs barking - it was very loud and I looked over approx. 250-300 yrds from where we were. I actually first saw the dogs and noticed what they were running after what seemed to be like a gorilla. I say that because of the arms. It was running on the side of the hill, taking large steps, kind of striding on two legs. It seemed to be scared of the dogs. There were 3 dogs running down the hillside about 50 yrds behind it at first. At that point I was sort of in shock and trying to get my brother to see it, too, but from where he was he couldn't see it. From that point on I got really excited to tell my mom and my uncle who also claims to have seen it around Mt. St. Helens awhile back. Of course, nobody really believes me except my brother, so I don't really tell the story now that im 23 and I understand the skepticism that surrounds this subject. This happened about 10 yrs ago so im not sure how usefull I've been in telling this story.",
  "classification": "Class A",
  "county": "Clark",
  "state": "Washington",
  "latitude": 45.8911,
  "longitude": -122.4076,
  "location": "-122.4076,45.8911",
  "location_details": "It's the first drive way on the right on Rotschy road; it's a long drive way, you can park at the gate and walk NW about 1/2 mile.",
  "temperature_high": 42.62,
  "temperature_mid": 33.95,
  "temperature_low": 25.28,
  "dew_point": 17.34,
  "humidity": 0.48,
  "cloud_cover": 0.24,
  "moon_phase": 0.82,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.78,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 2,
  "visibility": 9.76,
  "wind_bearing": 75,
  "wind_speed": 9.09
}