{
  "id": "37386",
  "title": "Couple hear possible screams and knocks at their home near Redden State Park",
  "date": "2012-11-13",
  "timestamp": 1352764800,
  "observed": "On 11-13-12 my wife and I just returned from the store and I stayed out by the car as she walked in the house after a couple minutes of me messing with her phone and some slight music playing on speaker, I heard the most blairing scream I have ever heard in my life and to follow. 4 blasting knocks. I screamed for my wife and told her I believe I just heard a squatch, she rolled her eyes and said if you would stop trying to call them after you watch the show they wouldn't come and then 4 more loud knocks. She went back into the house and while I stood there I could here the trees moving around, I have been watching the show and joking with the kids and wife with calling them in the rear of our wooded lot but after hearing this I can honestly say they are out there. This couldn't have been 100ft away from me and was so loud that it felt like it was next to me, I don't know if it was the light music playing that had it let me hear it or the practice calling in the rear yard but there are definitly BIG FOOTS IN DELAWARE",
  "classification": "Class B",
  "county": "Sussex",
  "state": "Delaware",
  "latitude": 38.71,
  "longitude": -75.36536,
  "location": "-75.36536,38.71",
  "location_details": "When you come from Milton on route 30 heading east towards Millsboro you come to xxxxxxx Rd and take a right the home is in the wooded area down about 1/2 mile. The whole area in surrounded by wet lands and Pine trees",
  "temperature_high": 48.73,
  "temperature_mid": 43.585,
  "temperature_low": 38.44,
  "dew_point": 43.58,
  "humidity": 0.81,
  "cloud_cover": 0.89,
  "moon_phase": 0.99,
  "precip_intensity": 0.0013,
  "precip_probability": 0.19,
  "precip_type": "rain",
  "pressure": 1026.38,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 9.47,
  "wind_bearing": 338,
  "wind_speed": 6.29
}