{
  "id": "28777",
  "title": "Memory of finding tracks in snow and the attempt to keep a record south of Quarryville",
  "date": "2011-07-20",
  "timestamp": 1311120000,
  "observed": "On the morning noted a neighborhood man was driving down Pilottown Road around 4-5 in the morning when he came across large human-like footprints crossing the road and heading into a field/wooded area. I was almost 17 and when I woke up later that morning several neighbors were inspecting the tracks which came from a field behind my house, through my yard, across Cookslanding Road, into my neighbors yard, over a fence into a wooded area, across Pilottown Road and into the field/wooded area. The direction of travel appeared to be south east toward the Susquehanna River hills. Whatever made the tracks did take the time to inspect my rabbit hutch and my neighbors as well, though leaving them undisturbed. it also seemed to have walked around my neighbor's house, leaving 1 very good print protected by the overhang of the roof. The rest were partially filled with snow, but still unsettling due to their size and shape. The tracks were about 16\" long, 8.5\" wide, and 2\" deep in the snow, and had a stride of about 4 feet. I am including a tracing I took of the well preserved track I found. It may seem a very incredible way of preserving the footprint, but it was the only thing I could think to do to preserve it. I traced over it EXACTLY as it appeared in the snow. To this day nobody knows what made the tracks. My neighbor and several other people of the neighborhood are avid hunters and outdoorsman. They didn't know what to make of them. I am not saying this is sasquatch, but here is the 'tracing':",
  "classification": "Class B",
  "county": "Lancaster",
  "state": "Pennsylvania",
  "latitude": 39.72785,
  "longitude": -76.2074,
  "location": "-76.2074,39.72785",
  "location_details": "The area lies very close to the river hills of the Susquehanna where there is alot of cover and not alot of people.",
  "temperature_high": 89.59,
  "temperature_mid": 83.375,
  "temperature_low": 77.16,
  "dew_point": 72.8,
  "humidity": 0.78,
  "cloud_cover": 0.1,
  "moon_phase": 0.67,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1010.95,
  "summary": "Humid throughout the day.",
  "uv_index": 9,
  "visibility": 6.71,
  "wind_bearing": 127,
  "wind_speed": 2.57
}