{
  "reportId": "12021",
  "title": "Boy encounters animal near Lemolo Lake",
  "date": "1956-07-15",
  "timestamp": -424915200,
  "observed": "When my dad was about 8 years old, his family moved to Douglas County in Oregon, located in the Cascade Mountains, because his dad was a logger. They lived there only through the summer season. They had two lakes near them. Diamond Lake and Lemolo Lake. He said he had a half day at school, so he headed home at about 1pm. He took a trail that goes around Lemolo Lake (that he wasn't allowed to take because it was right next to the logger camp). He headed down that trail in the afternoon of a clear, sunny summer day and stopped at the bottom of the trail when he saw something crouched down drinking from the lake [see note below]. It was only about 150 to 200 feet away from him on the same side of the lake. As soon as he had seen it the creature stood up as straight as a man and stared straight at him. The minute my dad realized it wasn't a man or a bear he ran right back up that trail. He said it had dark fur all over and it was pretty large...but then again he was very small! When I asked him about this story today to get the details, he said that during the 3 or 4 months they lived there that year he heard loud screeching, howling noises once in awhile that he didn't recognize to be any animal he had ever heard.",
  "classification": "Class A",
  "county": "Douglas",
  "state": "Oregon",
  "latitude": 43.31815,
  "longitude": -122.1954,
  "location": "-122.1954,43.31815",
  "location_details": "It was near a logging camp (we dont know if it is still there or not) There were a few cabins around that the loggers stayed in. It was at Lemolo Lake, north of Diamond Lake.",
  "temperature_high": 83.19,
  "temperature_mid": 68.17,
  "temperature_low": 53.15,
  "dew_point": 49.08,
  "humidity": 0.56,
  "cloud_cover": 0.15,
  "moon_phase": 0.28,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.57,
  "summary": "Clear throughout the day.",
  "uv_index": 10,
  "visibility": 9.66,
  "wind_bearing": 356,
  "wind_speed": 2.94
}