{
  "reportId": "9439",
  "title": "",
  "date": "",
  "observed": "On July 5, 2004, my brother and I went on a sasquatch expedition to the Bluff Creek area of Humboldt County California. The first night we stayed at Onion Lake on Onion Mountain located on forest service road 13NO1. We spent all afternoon setting up camp, takeing pictures and looking around Onion Lake for Sasquatch evidence. Around 9 p.m, just as it got dark, we heard a loud grunt roar down from a hill top just above our camp. The grunt we heard can only be described as something exhaling a great amount of air all at onece. The grunt was very loud, very rough and only lasted for a second. My brother turned to me and said,\"WHAT THE HECK WAS THAT\"? At that moment a deer ran down the hill from the direction of the grunt and into our camp. Then out of the darkness, another grunt roared through the forest from our right at a distance we thought was about 100-150 yards out from our camp. Then we heared a grunt that strait out from our camp that was at least 400-500 yards out. Then we heared the grunt from up on top of the hill again. Then the grunt to our right answered the grunt on top of the hill and then we heared the grunt that was out 400-500 yards answer the grunt on top of the hill and the grunt to our right. It was as if what ever it was makeing these sounds were communicating back and forth to one another. This grunting was very intense for the fist hour or so then it calmed down a little through out the rest of the night. The last grunt we heared was around 5 a.m just before first light. At one time around 10 p.m, we heared a loud grunt come from behind us over by Onion Lake. I turned on my three miliion candle spot light and searched the forest in the direction we heared the grunt but saw nothing. That grunt could not of been no more than 100 yards away from us and was very loud and rough. Around that same time the other grunts seemed to getting closer to our camp as well and we were starting to get scared. We huddled together in the middle of our camp with our rifles and shotguns in hand along with our three million candle spot light in hand ready to take on what ever it was makeing these loud grunts. We were hearing something we had never heard before in the woods and what ever it was, it sounded like it was VERY BIG by the sound of the grunts these things were makeing. We were scared. If it was not for the firearms we took with us we would of thrown all of our camping gear into our vehicle and we would've left a dust cloud a half mile high and twenty miles long as we were getting the heck out of there. We got up the next morning and looked around a little but we did'nt see or hear anything. What ever it was makeing these grunts, they were nocturnal animals and they were only active at night. We could also tell the animals were moveing around in the forest from grunt to grunt. Example: the grunts would get loud and would come from a specific location in the woods and then the next grunt would come from the same general location but a little to the right or left and a little closer or further away than tha grunt before. But we never did hear anything walking through the dry under brush. What ever they were makeing these grunts, they move through the woods very quietly with no sound at all except for their grunts. We packed our camping equipment into our vehicle and we spent the next night down at Louse Camp on Bluff Creek. That night we had no visitors and we returned home to Eureka the next morning. About one month after we returned from our expedition to Onion Lake and Bluff Creek, I was watching a show on the Discovery Channel about Ball Pythons in India. A large fifteen foot snake was crawling on the ground in the jungle as a family of monkeys were going crazy at the sight of the snake. These monkeys looked alot like Chimpanzees but the had black faces and black fur. At one moment, a large male monkey made a loud grunt as he threw a stick at the snake. The grunt was very loud, very rough and only lasted for a second. I came flying off the coutch and said to myself,\"thats what we heared at Onion Lake\". The grunt the monkey made at the snake on the Discovery Channel was the same tone, roughness, length and sounded exactly like the grunt we heared the night of July 5, 2004 at Onion Lake. The Sasquatch is thought to be a large primate of somekind and my brother and I heared loud grunts comeing out the forest at Onion Lake. These grunts I later heared a monkey make on T.V in India. The monkeys grunts were identical to the grunts we heared at Onion Lake. I'm not a scientist or expert on grunts, but I think this is very interesting. My brother and I were raised here in Humboldt County, California and have lived here in the heart of Bigfoot country all our lives. We have been interested in the Sasquatch/Bigfoot for as long as we can remember and we plan on makeing other Bigfoot expeditions in the future because the sounds we heared comeing out of the woods at Onion Lake on the night of July 5, 2004 makes us wonder even more now about whats really out there.",
  "classification": "Class B",
  "county": "Humboldt",
  "state": "California",
  "location_details": "At Arcata, California take Highway 299 East. Go about 45 miles East to the small town of Willow Creek. Take Highway 96 North. Travel on Highway 96 to about 5 miles past the town of Weitchpec. Turn left onto the Bluff Creek Road known as Forest Service Road 13N01. Travel about 20 miles up Forest Service Road 13N01 to Onion Lake.",
  "summary": ""
}