{
  "reportId": "42304",
  "title": "Camper photographs possible footprints at Lena Lake in the Buckhorn Wilderness",
  "date": "2013-09-21",
  "timestamp": 1379721600,
  "observed": "Last month I went on a backpacking trip in the Buckhorn Wilderness, to a small alpine lake about two hours into the wilderness; called Lena Lake. I went with my mother and we accompanied a group of people on this two day backpacking trip. When we got to the lake everyone set camp and it was time to start preparing dinner. I went down to the shore of the lake to explore while everyone was at camp. When I got there I was surprised to see tons of barefoot tracks everywhere. But what caught my attention was how these tracks were so unusual, they did not look like some random people were walking around barefoot in the mud. It wasn't exactly the size of them that caught my attention but how deep they were in the mud. Whatever it was must of been at least around 200-300 pounds or more because I'm around 130 pounds and jumped as hard as I possibly could in the mud, and I barely made an indent. Whereas the prints I was looking at were around 4 to 5 inches deep. Also what struck my attention was the raised area of the foot. I looked up Bigfoot footprints online and they described it as the mid-tarsal break. All of the footprints I was looking at by the lake had a mid-tarsal break. I looked up photos of Bigfoot tracks and one of mine looked very similar to the track photographed in the Hoh Rainforest in 2005. All the tracks seemed to come from a family, for some were very small and others were larger. The tracks lead into the water and out from another shore of a shallow part of the lake and I followed them up into the gravel as they disappeared into some boulders and large rocks by the lake. I couldn't understand how people would walk around barefoot in the rock and gravel especially when it was a very cold time of the year. The tracks looked about a few days old because I could tell they weren't fresh, but they were so unusual and looked so like the ones online that my instincts told me that these were not human footprints.",
  "classification": "Class B",
  "county": "Jefferson",
  "state": "Washington",
  "latitude": 47.61922,
  "longitude": -123.1592,
  "location": "-123.1592,47.61922",
  "location_details": "Lena Lake, Buckhorn wilderness.",
  "temperature_high": 63.68,
  "temperature_mid": 59.36,
  "temperature_low": 55.04,
  "dew_point": 52,
  "humidity": 0.79,
  "cloud_cover": 0.12,
  "moon_phase": 0.58,
  "precip_intensity": 0.0006,
  "precip_probability": 0.4,
  "precip_type": "rain",
  "pressure": 1005.71,
  "summary": "Clear throughout the day.",
  "uv_index": 4,
  "visibility": 9.59,
  "wind_bearing": 205,
  "wind_speed": 3.31
}