{
  "reportId": "24456",
  "title": "Native American experiences a close encounter from her backyard outside the San Bernadino National Forest",
  "date": "2008-08-21",
  "timestamp": 1219276800,
  "observed": "During the early morning hours of August 14th at 1:am; I was laying in bed when I heard this god awful sound out of my bedroom window coming from my back yard.  I never heard anything so awful in all of my life.  In my life time I never heard a wild animal that could make an awful sound like that. I’ve heard through the years about this big foot stuff, and I’m not sure what this thing was, but while I was at the window looking I could hear foot steps in the leaves. It made the sound three times, so I made a mad cat fighting sound, and it was then that I heard the foot steps leave my yard and I know that it was human steps and not animal sounding steps. I went back to bed, but I could not forget that sound. A friend called the next day and I was telling them about it.  He told me there was some guys on the news who had found a dead big foot back east.  He told me to go to your web site for pictures, so I did for fun.  I looked at all of the pictures and listened to the different sounds, and when I got to the last sounds on your site page, I freaked out, because that was the same sound that I heard that morning. The next night it was back again, but this time I saw out my window this hairy thing which was very-very tall. I have been freaked out ever since, and I can’t sleep, because this thing is very upsetting.",
  "classification": "Class B",
  "county": "San Bernardino",
  "state": "California",
  "latitude": 34.04165,
  "longitude": -117.0416,
  "location": "-117.0416,34.04165",
  "location_details": "Being Indian, I can not understand why it would come this far from the woodland area except maybe looking for food. We do have a lot of fruit trees and stuff growing in the back yard and near by other yards.",
  "temperature_high": 87.43,
  "temperature_mid": 74.385,
  "temperature_low": 61.34,
  "dew_point": 53.72,
  "humidity": 0.52,
  "cloud_cover": 0.06,
  "moon_phase": 0.67,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1008.33,
  "summary": "Clear throughout the day.",
  "uv_index": 10,
  "visibility": 9.51,
  "wind_bearing": 268,
  "wind_speed": 5.39
}