{
  "reportId": "674",
  "title": "",
  "date": "",
  "observed": "My hunting partner Ed and I were into the second week of the Oregon bow season. It was about 0600 when we came  upon a stock pond. These ponds are fed by a small spring or small creek. We decided to circumnavigate it to see if we could see what was watering in the area. I went left Ed went to the right. I hadn’t gone far when I came to a depression in the muddy gravely pond edge. It looked like a very big heavy person had left a footprint there. I got down and saw that there were toe impressions at the front. Well I called Ed over to see this and he said there was another one behind the first. We backtracked the prints and found what appeared to be skid marks on the hill side of the pond. This was just next to the small trickle of water which fed the pond. The hair on the back of my neck stood right up. We went up the hill for about forty yards but found indistinguishable impressions in the trashy undergrowth. We went back down and tracked them in the other direction and the impressions (overturned pebbles, broken and bent grasses) went about 100 yards down a hill into a ravine thick with manzineta and small scrub oak. We then went back to the foot tracks and covered them with logs so they wouldn’t be destroyed. Went home and got some plaster of Paris. We made the impressions and we were shocked to find that there were definitely toes on one cast the other was in too much gravel to make a good impression. At the same time I took some pictures of Ed stretching to match the stride of the prints. The next week we went into the same area, same skid road, about 300 yards past the stock tank. We were walking side by side when something to my left and slightly behind us, up the hill aprox.100yards something caught my eye. I spun around to see what it was, and to my astonishment I saw a pair of legs running into the thick underbrush. I couldn’t see all of it because of the trees. My impression was of a two legged creature, animal,  with long brown hair on the legs running away from us. Ed saw the branches swinging back into place but saw nothing else. We both got spooked and quickly went back to the truck and never hunted there again. I gave the plaster cast to my nephew in San Jose California and have never seen them again. I still have the photos of Ed stretching to match the stride. The foot prints measured 18\" long By 6\" across the heel, and 8\" across the ball of the foot. I got some hair samples from a star thistle down in the ravine and I still have them. Other comments: I'm an exited typist once I get started I type to beat the band, I can't spell  worth a darn. I love this site and look forward each day for the BFRO.",
  "classification": "Class A",
  "county": "Jackson",
  "state": "Oregon",
  "location_details": "appox. ten miles northwest of highway 140 in an area called salt creek. This is part of the Butte Falls water shed. All of this is approximate. We were on a skid road in this area.",
  "summary": ""
}