{
  "reportId": "5316",
  "title": "Daytime sighting by hiker near Spring Creek.",
  "date": "2002-10-10",
  "timestamp": 1034208000,
  "observed": "I am writing this because i think that i might have had a recent  experience with a bigfoot. I live in Springdale, Ar. Springdale is not very rugged as far as forest goes, but it can get pretty secluded in the right places. On october 10,2002 me and a friend set out on a trip to follow a creek to see how far it goes, because i followed this creek when i was young. This creek goes through springdale, and winds in through Elm springs,wheres theres nothing but dense trees on one side the left, and open fields, to the right-private properity. Well Elm springs is not a big city, and you would never know the surrundings where i was not unless you owend the properity.It was about 5:00 pm when i decided that it was time to try to get out of the creek and up on the bank,we had been walking about 2 hours in and out of the creek,and i decided that we could cover more ground on land before the sun went down. Now im about 5\"9 and i guess the creek bed must have been 7 foot high,so i had my friend C hoist my foot up while i got my knee up high enough to pull myself up.Now the original plan was to yank him up once on top,but looking back on it now i realize how foolish this was because i would had to be extremely strong,because i probably could have just have barely have had touched his fingertips from way up there,but it didnt matter because what i saw when i got on my feet scared the crap out of me. The best way to explain it is just to tell you that my heart sunk,and I was just extremely stunned. When i got to my feet i was facing nothing but dense forests or woods,somthing caught the corner of my eye about lets say 75 to 100 yards off. Just before getting a good enough look at it i could tell it was big and brown,now ive never seen a bear before out in the wild, so imediately i started to panic. I took one quick look down and figured i would break every bone in my legs if i were to jump,for the water was only maybe a foot deep, with all this happening in what i would say just about 2 seconds,and keep in mind i havent even been able to warn my friend yet of what i thought to be a charging bear, i look back to see this thing or whatever it was walking extremely fast! It was then i noticed that this couldnt have been a bear. I got a clear look at it for just a second.Ill never forget what i saw that day.I remember its head, real long head,i guess you could say it was shaped like an egg, i just know it wasnt like a humans, the eyes must have been dark because i couldnt make them out,i didnt reall notice a nose ether, but there was so much hair, it was hard to make anything out except for the head.The biggest thing ill never forget is the height and weight of this thing.It was so big,legs coverd with hair, so massive,that had to have been the biggest part of this thing,so wide,had to have been as wide as a refrigerator.In comparing the legs to my legs i would have to say each leg made two sets of both of my legs.The shouldars were massive,could have been three feet or over from shoulder to shoulder.I also remember how it walked, besides taking extremely wide steps, it kind of walked with its front body slightly hunched over,i dont know, like some one with bad posture.The height of this thing was astronomical.The tip of its head was in the tree tops!!! now dont get me wrong, the trees werent that tall, but they were at least 8 to 9 feet where the limbs started to curl out and i remember the head was up there with them, there is no way i could have jumped and touched the limbs, they were just to high up.So i would put whatever it was that i seen to be 8 to 9 foot tall. And looking back on it now, the frame could have easily held 500- 600 pounds,the arms on it looked long, and they swayed back in forth heavily,i do not recall a odor,or anything like that,for this thing was out of my view in about id say 5 to 7 seconds. Now i realize when i was getting up the creek bed, i had spooked the thing,because it sure didnt waste no time getting gone into the woods.And i was not about to follow it.So with all this said,i asked my friend if he had heard anything,which he said no because of the running water,and i guess because he was down there,and i said man,i just seen a monster go into the woods! ofcourse my facial feachure was very solemn and serious,but he still didnt believe me.I repeated this several times to him,and i guess he could tell by looking at my face i was serious.He later said my face looked white. With his help i got down back into the creek,but it did take a few minutes,and even then i wound up falling back down in the creek,luckly i wasnt hurt,just wet and scared,the sun was setting,and we jogged and trampled our way back,never once daring to go back up on land. We talked and thought better of muterring such foolishness around for fear of people thinking were nuts. Truthfuly,i dont even think he beleives me.But putting myself in his shoes i probably wouldnt either.But it doesnt matter, i know what i saw, so in closing i have ruled out the possbility of a hoax,1. why would somebody be out in the middle of nowhere in this kind of costume? 2. how would they know we were coming?3.how do you account for the height and size, it was easily a foot taller than any human ive ever seen.It was so tall,you cant duplicate that kind of height.Ihope someone reads this and takes it seriously because i dont know if ill ever go into the woods again.",
  "classification": "Class A",
  "county": "Washington",
  "state": "Arkansas",
  "latitude": 36.20611,
  "longitude": -94.23417,
  "location": "-94.23417,36.20611",
  "location_details": "Im not familiar with location,me and my friend followed Spring creek from Springdale into Elm Springs,where there is only dense woods,id say about five miles into Elm Springs,out of the creek bed,to the left,about fifty yards off.",
  "temperature_high": 66.23,
  "temperature_mid": 63.68,
  "temperature_low": 61.13,
  "dew_point": 56.07,
  "humidity": 0.88,
  "cloud_cover": 0.99,
  "moon_phase": 0.16,
  "precip_intensity": 0.0004,
  "precip_probability": 0.24,
  "precip_type": "rain",
  "pressure": 1017.08,
  "summary": "Overcast throughout the day.",
  "uv_index": 3,
  "visibility": 8.41,
  "wind_bearing": 69,
  "wind_speed": 3.47
}