{
  "reportId": "672",
  "title": "",
  "date": "",
  "observed": "Four of us guys decided to hike up the mountain for an adventure sort of speak and get to the top of the mountain and set up camp for a night. We loaded our essentials on our backs and took off walking. We started out at the State dept. shed just south of the community of Mt. Hood and walked east up the mountain. It was about 12 midnight when we started out I was raised in the area and spent most of my time as I was growing up in the hills and knew them like the back of my hand and we thought it would be fun to travel at night, just to be different. About two hours later we arrived two thirds of the way up the mountain side, I would say that we were about 500 feet below the summit and stoped to rest for a bit before makeing the top. It was 2:20 am if I remember right. As we were sitting there talking all of a sudden a very loud and piercing scream came from the ridge above us, two long sustained screams followed by a very powerfull growl needless to say we were scared to death and litterally ran down the mountain and did not stop until we had arrived at the Hiway and returned home. I have heard just about every thing that there is in the woods and I know it was not and elk, deer, bear, mountain lion ect... The best way I can describe the scream is that it sounded like the alarm on a fire station, it was that loud. The previous fall a friend and I were in the same area down below this area walking and checking out Hiway 35 at the Baseline Dr. junction. It had flooded and washed out the hiway in 1980 two years prior to this and we were just looking to see how the rebuilding process was going. We had stoped on a large pile of gravel to rest and talk a bit, when what I thought was a man walked out of the woods and sat upon a stump. I asked my friend if he saw the man up there on the hill sitting and he said yes, but that it did'nt look like a person to him, that it looked strange, so we decided to walk towards it to get a better look it was about 600 to 700 feet away when we first saw it. We walked to where we were about 300 feet away. At that distance we could both see that it was not a man but it was covered with dark brown hair. It did not move, but seemed to see us it was looking directly at us the whole time since we had started walking toward it. After looking at it a moment I decided to wave my arm at it to see if I could get a response and it did move a bit kinda back and forth a bit like it was trying to see better or size us up I'm not sure which. At that time we were so excited and scared also, that we descussed going closer to see if this could be Bigfoot that I had heard of and so we did out of sheer adrinaline I'm sure because I was scared I know this for sure and my friend was to. So we reaced the bottom of the small foot hill it was on, but had lost site of it because it was back a ways from the crest of the top. We decided after a bit of descussion to go up toward the top of ! the area that it was in and did. When we got to where we could see the creature was gone. But, we arrived at the stump that it had sat on. there was no hair or evidence that anything was there except the tree had just been felled and in the center as is usual there were spikes that had been sticking straight up but now were smased flat and broken. This is no easy task unless you were to hit them with a sledge hammer ie... The grass was smased all around the stump and we could see were it had walked back into the tree line and followed for a couple hundred feet or so but we were so frightened that we left after only five minutes or so, but we did see back in the tree's aways there was a meadow with small young fir tree's and there limb's touched the ground. Under one there was a bed sort of like an elk bed but much larger, approximately 15 feet long by 8 feet wide and it looked like a large man had laid there proped up on an elbow or something. We left immediately after that and never saw it or anything like it again. I know this is strange but I swear to God this really happened and I have not told but a couple of people to this day, but I know that its out there and I've seen the tracks and hair samples to know its there, my grandfather saw it back in 1974 on Fir mountian and I was allowed by Peter Byrne to go along and so, ever since then and from those two experinces I'm convinced that the creature is out there and so, I just wanted to share this with you.",
  "classification": "Class A",
  "county": "Hood River",
  "state": "Oregon",
  "location_details": "It was just south of Bald Butte approximately 1 to 1 and half miles, 500 feet below surveyers ridge trail at about the 3000 foot level.",
  "summary": ""
}