{
  "reportId": "685",
  "title": "",
  "date": "",
  "observed": "My cousin and I were on a camping trip to the Bohemia Mine area like we do at least two times a year. This was in 1992 or 1993 I belive in August.We setup camp anf then hiked around until evening then came back and made dinner. After dinner it was dark so we went up to lookout tower which besides Bohemia Mountain itself was the highest peak about 6000 ft. there was a meteior shower that weekend and we went up to watch it. We stayed up there till about 21:00 I think and then went back to our camp. We stayed up for about half of an hour then went to bed. We had a 3 man tent to sleep in. At about 22:00-23:00 I was just about to fall asleep when I started hearing branches breaking like something walking through the woods towards us. It started a ways away from our camp and kept getting closer. My cousin was calling my name and asking me if I had heard the sounds but I was consentrating on listening to them and to scared to answer him so I just lay there like I was asleep. we had taken his car up there and we parked it about 100 ft. away from our tent because there was to many branches and stuff to drive it all the way up to the tent. The noises stopped and all the sudden there was high pitched and fast \" Woop, Woop, Woop\" thatfrom about where his car was parked. My cousin asked what that noise was and said nothing because it scared me to death. Then it started walking our way and we just layed there and listened and it got closer and closer to our tent until it came about a couple of ft. away. We were so scared we layed there and didnt move a mustle because whatever it was had been walking on two feet not four. It stopped making noise a couple of ft away and we couldnt hear any walking until we could here it was right next tot he tent it had snuck up real quiet we could hear it breathing, when my cousin moved a leg it scared whatever was outside our tent and it took off running and we could hear the individual steps that hit the ground like thunder. It sounded very heavy. It ran off about 50 ft. and stopped. Then it would start walking back towards us, got within about 10 ft. then we couldnt hear it anymore. Then all the sudden it was right next to the tent. It had snuck up real quiet again to our tent: it could move very quiet when it chose to, it move from one side of the tent to the other quietly and fast, it would beon one side and then the other before we new it. It did this pretty much all night. It had left once then came back. finally we fell asleep off and on. In the morning we looked for tracks but there was to much forest litter to see any. we did not have any protection with us at the time and I have never been so scared in my life. I have believed in Sasquatch pretty much all my life, my cousin and I go up there a couple of times a year to look for evidence and hope to have another encounter, but have not. I have hunted since I was a little boy with my father and continue to hunt today and I know the sounds deer, elk and other four legged creatures make when walking and this creature definetly was walking on two legs. Deer usually visit our camp when we go up there and we can hear them coming in the dark, they get close and we can see them in the flashlight. I have read other accounts in books after ours and have found a few simulaitys, like the heavy footsteps when it ran, the \" Woop, Woop, Woop\" we heard is also in Roosevelts account I believe as well as others. My cousin and I have read books about the fourtys and some of the miners reported seeing Bigfoot, there is also other reports from the Cottage Grove area that I have from old newspapers. I have became a volunteer researcher and have read alot of reports and my cousin and I ahve gone over this in our heads to make sure that it couldnt have been another animal that visited us and we know that it was a Sasquatch.",
  "classification": "Class B",
  "county": "Lane",
  "state": "Oregon",
  "location_details": "Bohemia Mining District, about 15 miles East of Cottage Grove, Oregon, can get exact GPS coords.",
  "summary": ""
}