{
  "id": "25592",
  "title": "Man recalls a vivid daytime encounter as a youth near Portland",
  "date": "1986-05-24",
  "timestamp": 517276800,
  "observed": "This happened in May/June of 1986. I was visiting a friend's farm near Portland, TN. My friend, \"J\", wanted to make preparations for his upcoming birthday party, he wanted a campout of sorts. I offered to help him get firewood. So, J and I went to the woods near his farm, accompanied by his dog to gather the firewood. While we were in the woods, his dog started to act very strange. Refusing to obey J's command's and breaking for the nearest open field. We followed the dog until we stopped to notice that several trees were stripped of their bark. The tree bark had been completely removed and then we noticed that the branches on several of the trees were snapped off. This upset J very much that he wanted to leave the woods to tell his father. J marked the spot by sticking his knife in the ground and said that we'd come back with his father. And so we left the woods and J's dog came with us too. J walked me over to his father's barn and told me to sit tight as he went to get his father. The dog stayed with me when J left, but for some reason the dog didn't want to be in the barn. So, I let the dog out and it went to the nearby watering pond, and so I followed the dog. While at the pond, I decided to have a sit with the dog. Shortly afterward, the dog turned and started barking. I turned around to see what the dog was barking at and then I saw it! A little over 100 feet away from me, it was standing at the electric fence separating the field from the woods. The creature stood near some trailers used to haul tobacco during harvest time. This creature stood head and shoulders taller than the trailers. It was very tall, had reddish-brown hair, muscular build, stood upright and had a very gorilla-like face. Scared, I dropped to the ground and kept watching it. The creature sniff the air and grunted some as the dog kept barking at it. Then suddenly, it turned and run back into the woods, shortly after that J's dad arrived in his truck. J's dad got out of his truck with a shotgun and asked if I had seen it. I pointed at the woods and said it just ran off. J's dad mumbled about something attacking his cows and then asked J to take him to where we had found the trees stripped of bark. I told J's dad that it was just there moments before he had arrived, J's dad decided to check the spot before going into the woods. At the spot where the creature had stood were footprints in the dirt. J's dad was a tall man and wore cowboy boots. He placed his foot inside the track, the track was larger then his boot. He mumbled something, looked at J and said that they'd come back for J's knife later. J's dad said he'd take back to the house, and while we rode in his truck, he asked us not to say anything to J' mother about this.",
  "classification": "Class A",
  "county": "Sumner",
  "state": "Tennessee",
  "latitude": 36.5802,
  "longitude": -86.5104,
  "location": "-86.5104,36.5802",
  "location_details": "A day or so later, J told me that he accompanied his father, along with some other friends, to the spot where we'd had found the trees. Said the knife was still in the ground. Mentioned that they found additional tracks. A month or so after that, he said there was a nighttime sighting of something crossing a neighbor's field.",
  "temperature_high": 77.09,
  "temperature_mid": 69.275,
  "temperature_low": 61.46,
  "dew_point": 63.34,
  "humidity": 0.88,
  "cloud_cover": 0.96,
  "moon_phase": 0.53,
  "precip_intensity": 0.0235,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1016.2,
  "summary": "Heavy rain in the evening.",
  "uv_index": 7,
  "visibility": 4.74,
  "wind_bearing": 114,
  "wind_speed": 1.8
}