{
  "reportId": "2303",
  "title": "Woman see's dark upright man-like figure while walking dogs",
  "date": "2001-04-25",
  "timestamp": 988156800,
  "observed": "I was letting my dogs go for a run in the woods off of the McKenna cut-off road in Pierce County. I was only about a quarter of a mile into the walk when my dog, Einstein (an Akita/Shepard mix), stopped ahead of me on the trail. He was blocking the trail facing towards the bushes on my left (East), he had his hackles up and was growling. My other dog, Bandit (Border Collie/Chow mix), had just stopped and barked once and then ran back behind me continuing to play. I walked up to Einstein thinking there was a little animal or something in the bushes. When I got up next to him I heard the bushes rattling off to my left and when I looked over in that direction I saw something really big standing next to a tree about 40' away from me, seemed to be shaking the limbs on the tree to make noise. I also got the feeling it was looking at me but it didn't move behind the tree or crouch down to hide. I also didn't feel threatened. I thought it might be a big bear because of the shape of it's body. It was a dark color, I couldn't make out any facial features or see how long the arms were. The shoulders were quite broad and there didn't seem to be a neck. Because it never got down I thought it a transient person, but if it was a transient they were dressed in a dark parka with the hood pulled up and were wearing alot of bulky clothing with the tempature above 70. I grabbed Einstein and we turned around to head back to the truck. Bandit was running ahead of me. Every once in a while I would look back and eventually I saw what ever it was walking upright down the road away from me. The trees blocked the upper part of the body but I could see the lower part of the legs, I didn't see any boots or shoes or clothing. At one point Bandit was running along the highway and I yelled really loud for her to come to me and when I look back down the trail it looked like whatever it was was now headed towards me, going in and out of the bushes on the right side of the old road. I know it wasn't a bear and it sure didn't look like it was a human walking towards me. I couldn't get the dogs in the truck fast enough, but when I did I looked back down the road and didn't see anything. I've got to say I never really believed in Bigfoot, but I do now.",
  "classification": "Class A",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 46.9382,
  "longitude": -122.382,
  "location": "-122.382,46.9382",
  "location_details": "Hwy 702 is the McKenna Tanwax cutoff road.  I was about 1-2 miles west of Hwy 7. There is a pullout on the south side of Hwy 702 right across from a Century 21 for sale sign.  The street sign says 34 Av S. You can see an old vehicle path heading south into the woods. I was about a quarter of a mile into the woods. I could just see the front of my truck when I turned around to head back.",
  "temperature_high": 71.36,
  "temperature_mid": 60.18,
  "temperature_low": 49,
  "dew_point": 50.79,
  "humidity": 0.76,
  "cloud_cover": 0.39,
  "moon_phase": 0.07,
  "precip_intensity": 0.0001,
  "precip_probability": 0.21,
  "precip_type": "rain",
  "pressure": 1018.45,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 8.33,
  "wind_bearing": 1,
  "wind_speed": 4.78
}