{
  "id": "24056",
  "title": "Hunter describes combination of rock clacking and bird-like vocals in public hunting area near Van Wert",
  "date": "2008-05-28",
  "timestamp": 1211932800,
  "observed": "JUNE 28TH, 2006.   I HAVE EARLIER REPORTED A BIGFOOT SIGHTING SEVERAL YRS AGO. THIS HAPPENED TO BE IN IOWA, DECATUR CO. AND SO HAS THIS OCCURENCE. IF YOU HAVE EVER BEEN AT LEAST A PART TIME SPORTSMAN AND FOUND YOURSELF LOVING THE NATURE AROUND YOU, THEN YOU MAY KNOW WHAT I AM SPEAKING OF. THERE ARE CERTAIN SOUNDS THAT GOES ALONG WITH ANY GIVEN AREA, SOUNDS THAT BIRDS AND OTHER FAMILIAR CREATURES MAKE. EVEN THE NUTHATCH AND THE POPPING MOREL MUSHROOM MAKE A SOUND IF YOU ARE IN THEIR WORLD LONG ENOUGH TO HEAR THEM IN REPETITION. EVEN THE TREES AND THE GROUND HAVE MADE NOISES THAT MOST SPORTSMEN SIMILARLY IGNORE. IT WASN'T UNTIL TODAY, 6/24/08, THAT I PUT IT TOGETHER. A SOUND WAS RECOGNIZED BY MYSELF WHICH I BELIEVE TO BE A BIGFOOT.  I WILL EXPLAIN AS BEST I CAN. I RETURNED TO THE PARSAL OF LAND WHICH I HAD MY 1ST VISUAL EXPERIENCE OF THE CREATURE. HE SORTA SCARED ME OFF. I BROUGHT A FRIEND WITH ME TO  SHOOT SOME GUNS AS IT IS A VERY SAFE PLACE TO DO SO. WE HADN'T PUT TOO MANY ROUNDS DOWN RANGE INTO A STEEP VERTICLE BANK WHICH IS PROBABLY 50 FT HIGH. WE WERE LESS THAN 200 YDS FROM THE SIGHTING LOCATION AND I COULD HEAR TWO HUGE ROCKS BEING SMACKED TOGETHER. IT WAS NO COINCIDENCE. I HAVE HEARD THIS BEFORE WHILE IN THE WOODS, BUT ONLY AT 2 LOCATIONS. IT WAS QUITE RHYTHMIC AND THE NUMBER OF SMACKS WERE LIKE ALWAYS EQUALING 4-6 IN THE COUNT. I EVEN MENTIONED TO THE MAN WHO WAS WITH ME, BUT THE NOISE HAD STOPPED BY THE TIME HE HEARD ME OVER HIS EAR PROTECTION. I ALSO HAD EAR PLUGS IN, BUT HAD NO PROBLEM HEARING THE SOUNDS. I KIND OF THINK THIS ROCK SMACKING IS TO LET ALL OTHERS OF THEIR KIND KNOW ABOUT HUMANS ARE AROUND. I'M ALSO THINKING THAT IT IS TO GIVE AN \" ALL CLEAR\" MESSAGE AS IT IS HAPPENING AT A SPECIFIC TIME, EACH TIME. I ALSO THINK THEY USE THE CALLS OF NATURE'S WILDLIFE TO COMMUNICATE. PARTICULARLY THAT OF A GREAT HORNED OWL AND A CROW. THIS IS DUE TO THE FREQUENCY AND TIMES OF OCCURRENCE WHICH I CAN'T QUITE EXPLAIN.  IT IS SOMETHING YOU HAVE TO EXPERIENCE FOR YOURSELF.",
  "classification": "Class B",
  "county": "Decatur",
  "state": "Iowa",
  "latitude": 40.8348,
  "longitude": -93.85965,
  "location": "-93.85965,40.8348",
  "location_details": "THE WEST END OF DEKALB PUBLIC HUNTING AREA. AROUND THE ABANDONED QUERRY PIT.",
  "temperature_high": 76.83,
  "temperature_mid": 66.445,
  "temperature_low": 56.06,
  "dew_point": 46.35,
  "humidity": 0.7,
  "cloud_cover": 0.84,
  "moon_phase": 0.77,
  "precip_intensity": 0.002,
  "precip_probability": 0.6,
  "precip_type": "rain",
  "pressure": 1024.71,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 9.83,
  "wind_bearing": 91,
  "wind_speed": 7.48
}