{
  "id": "801",
  "title": "",
  "date": "",
  "observed": "Observed a large creature, about 8' tall, covered with short brown hair, man-like face, black or very dark eyes, standing under a tree approximately 75' from my uncle's weekend cabin. When I was 13, I was invited to spend the summer with my aunt and uncle in Escanaba. Every Friday evening, we would leave Escanaba and go to their summer cabin in Dickenson County. The Cabin was built by my aunt's father and was in a very heavily forrested area off Rt. 69. We would usually arrive around 6:00pm, have dinner and walk in the woods. This one particular Friday it had rained earilier in the day so we decided to stay near the cabin and just relax. My aunt had gone into the back yard to get something and then came running around the house yelling there was a bear in the yard. My uncle went in to get his rifle and I went in the back to see the bear (I was from New Jersey and that's quite a common sight there). When I got around the house, I was stunned to find our visitor was no bear. He (or it) was standing under a tree approximately 75' from the house. His right arm was drapped over a branch and he was standing like he was waiting for a bus. My aunt had followed me into the yard and she was behind me crying and shaking like a leaf. At that point, my uncle came out onto the back porch and I took several steps toward our visitor. I don't know if it was my forward motion or the sight of the rifle, but our visitor decided that was time to leave. He turned and walked back up the old deer path alongside the tree and disappeared into the woods. We found only scuff marks and not tracks because of the heavy pine needles on the ground. I would also like to mention that my uncle's German Shepard found a safe place in the house and refused to come out. From that time on, the dog would jump out of the car and into the house and never again walked with us. We went every weekend, but never saw our friend again. However, for years, my aunt felt uncomfortable going up there and finally my uncle sold the property in the mid 70's. I never thought about what we saw until an article appeared in the old ARGOSY magazine (late 60's) about the \"MINNESOTA ICEMAN.\" I firmly believe we encountered something like it that night.",
  "classification": "Class A",
  "county": "Dickinson",
  "state": "Michigan",
  "location_details": "Near the town of Hardwood, Dickenson County, Michigan, off an old logging road that ran off Rt. 69 west of Escanaba, Michigan.",
  "summary": ""
}