{
  "id": "726",
  "title": "A hitchhiker reports seeing a bigfoot in a forested area off U.S. 441",
  "date": "1977-10-05",
  "timestamp": 244857600,
  "observed": "Newspaper article: Sentinel Star (Orlando, Florida), October 5, 1977 LURKING BIGFOOT TRICK OR THREAT? Halloween is still three weeks away but strange creatures are already being seen around Central Florida this week. A 22-year-old hitchhiker reported sighting the legendary Bigfoot, saying the beast was tall, dark and stinky. It lurked in the darkness in a lightly forested area off U.S. 441 half a mile south of Belleview, he said. \"I've got some information about Bigfoot,\" the tremulous voice on the telephone said. \"I think I just saw it.\" Monday morning a security guard for an Apopka nursery told police a 10-foot-tall hairy animal with a chestful of reddish- gray fur and small ears attacked him, ripping off the terrified guard's shirt. Donnie Hall, 27, said he fired several gunshots at the creature in vain. The Bigfoot sighter - a Belleview welder who didn't want his name known - said the beast was brown and black. \"I'm six feet tall and it was bigger than me. It smelled horrible, like garbage.\" Neither of the two creature sightings was substantiated. A Florida Game and Fresh Water Commission agent who examined tracks at John's Nursery in Apopka said they all appeared to be man-made. Marion County Sheriff Don Moreland chuckled about the Bigfoot report. \"I've been in law enforcement for 20 years here and I don't remember any reports of monsters. Flying saucers, yes, but I don't recall any monsters.\"",
  "classification": "Class A",
  "county": "Marion",
  "state": "Florida",
  "latitude": 29.0599,
  "longitude": -82.05835,
  "location": "-82.05835,29.0599",
  "location_details": "",
  "temperature_high": 81.92,
  "temperature_mid": 71.745,
  "temperature_low": 61.57,
  "dew_point": 56.99,
  "humidity": 0.65,
  "cloud_cover": 0.19,
  "moon_phase": 0.76,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.8,
  "summary": "Partly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 6,
  "visibility": 9.48,
  "wind_bearing": 43,
  "wind_speed": 8.34
}