{
  "id": "40381",
  "title": "",
  "date": "",
  "observed": "Witness' Report: As told to Scott Taylor and Rayn Moonflower. The witness does not own a computer. I had been helping some neighbors with a repair, and since I don’t drive anymore, they took me home. It was about 2:00PM on Dec 26th 2012. The car had several people in it when they dropped me off. I was up on my porch, getting my keys out to open the front door when I heard screaming coming from the car which was still in the driveway. Wondering what they were arguing about, I turned to look at them, and saw that they were frantic, pointing to the back of my yard. I turned to look at what they were pointing at, when I saw a very large, hairy, upright form crossing a little cut in the brush at the back of my lot. There were three deer with it, two in front and one behind. That seemed strange. The deer were unconcerned. We have a huge population of deer here. I knew immediately what it was….a bigfoot. I noted a tree limb that was even with its head. One step and it was gone. I went out there and marked the limb where its head was with a piece of white rag. The next week, on January 3rd around 2:30PM, I was out at the back of my property with my loppers. I was cutting a trail through the very thick brush so that I could get to the next street easier. There are narrow deer trails and I was on one of those. I smelled something really bad. It was like a ripe garbage can. I made my way in that direction, clipping branches, when suddenly I saw something on the ground in about 6-8 feet in front of me. At first, I couldn’t see what it was, and then it moved. I was frozen in fear. I am on oxygen, and knew I could not run. This thing arose to hands and knees. It was hairy and brown, with silver gray hair on its back. It reminded me of a giant pile of steel wool. I thought it was a bear at first. It was supporting itself on its right hand and knees. The left hand was off the ground. It turned its head and upper body to look left and looked at me. My fear level was a 10! I dropped my loppers without moving. He then looked away from me, shifting his weight to his left hand. He brought his right hand up in front of him and rubbed his thumb on his fingers while he looked right, then forward as if he were reasoning out which way to go. Then he looked back at me, but his expression changed, and my fear level dropped. He looked intelligent. After a few seconds of considering what to do, he took off in the direction he was facing, straight ahead. On all fours he slithered along the ground, going under limbs and up a little rise for about 15 feet. Then I saw him stand up momentarily, and then duck down and dart away to the right. It was at that moment that I decided to run, to heck with the consequences. I made it back to my yard and about halfway to the house when I collapsed. After resting, getting my breath, and collecting my wits, I went back there. I found what I think is a hand print, and placed a bucket over it to preserve it. After thinking things over, the next evening, I called the police. Two officers were there within minutes. They arrived around 6:30PM. They were very re-assuring. They said to not worry, and to just tell them what happened, as they see strange things all the time. I told them what happened. They stayed with me for a couple of hours. They did not make fun of me and were supportive and re-assuring. I don’t own a computer, and don’t even know how to turn one on. I started asking around for some friends in real-estate to look for some organization to report this to. Eventually, someone found your number and gave it to me. I thought it was a Montana phone number. I called an left a message.",
  "classification": "Class A",
  "county": "Grays Harbor",
  "state": "Washington",
  "location_details": "Edited to preserve the privacy of the witness.",
  "summary": ""
}