{
  "reportId": "7382",
  "title": "Various incidents along the Kalama River.",
  "date": "2001-07-15",
  "timestamp": 995155200,
  "observed": "Up until last year I owned a bait and tackle store on the Kalama River in Kalama, Wa. I guess I would have to say that there were some strange things happening to several of my customers who would fish directly upstream from my store at a hole known as Beginner's Hole. For instance, one of my customers, Steve and his girlfriend Tasha, arrived on the river a couple of hours before daylight and decided to get some rest in there car before the usual crowed arrived. They laid there seats backed and turned up the radio when all of a sudden something hit the driver's side window with enough force to almost break the glass. Steve later told me that he thought it must have been a rock of considerable size as it shook the whole car. He immediately started the car and turned on his lights only to find nobody could be seen in the large parking area and Tasha was so shook up by it that she made him leave and spend the rest of the night parked under the lights of my store. I guess I really didn’t think much of to until approximately a week or so later at about 9:30pm after just locking up for the night and being startled by someone frantically pounding on my store door only to open it and find a very scared fisherman who had claimed to have seen a Bigfoot within a block of my store just standing on the riverbank looking at him walk by on the road 75 feet away. It was late May or early June (2001) so it had just gotten dark. I can’t remember ever seeing a grown man so afraid of a wild animal in my life as Jason was at that moment. He just kept saying that he just witnessed Bigfoot and to stay inside for fear it was going to get us. I grabbed a flashlight and tried to talk him into showing me where he had seen it but he refused to go outside, insisting I was crazy because he said it must have been at least 7 foot tall. A week or so later I went up to Beginner's Hole at about 10:30pm with my beer distributor Travis to do some glowballing for summer-run steelhead as I had for many years in the past when it started to get warmer and the fish seemed to get more active. We pulled into the parking area and I ran over the bank so I could get the first cast because it was usually payday and Travis stood in front of the headlights still rigging his pole. I had taken several casts with no luck when I noticed the fish down river in the deep hole were jumping like I had never seen before. I climbed up the bank as Travis was just finishing and told him to come on. We were going to walk down and see what was going on. As we arrived at the hole about 200 yards down stream, we quickly climbed down the bank and began casting. Travis was located 50 feet below me behind a large bush when I heard a loud splash from his direction. Thinking he must have fallen in I yelled to see if he was alright when to my surprise we were face-to- face and he was yelling for me to run in a very  panicked voice! I wasted no time following him up the bank because it must have been something pretty serious to scare Travis as he stands 6ft tall and weighs over 220 lbs. As we climbed in the car, he was yelling something about a giant ape-like figure that had porpoised, went under and then came back out of the water and jumped. What ever it was, it must have been very large judging by the sound that I had heard and seeing that Travis was very wet from the splash that it had made. I guess that’s when I started believing that maybe Bigfoot was real! Being very knowledgeable of the river and the fish runs, I came to the conclusion that combined with the fact that for the last few years the woods had been closed to public entry 90% of the season and that the summer-run steelhead where being let go out of the lower hatchery and almost all of them stopping at Beginner's Hole because that’s where they had been released that maybe it had come down from up river looking for food and quite possibly had found a steelhead paradise. It took several days before I or Travis had found the nerve to venture back up there but the thought of those fish made us finally give in to our fear. What a mistake! Arriving at the hole, I as usual ran over the bank to get the first cast and Travis as usual stood rigging his pole in the headlights. As I started to cast I felt very uneasy and continued looking up and down the river trying to see in the nighttime darkness when directly across the river from me I heard a baseball-sized rock hit the water a few feet off the far bank. I strained my eyes to see what had thrown it thinking that after telling several of my customers of the earlier incident that maybe someone was playing a trick or something. That’s when I heard it! A low, deep moan-like sound that turned into a high pitched scream. I have been in the woods enough to know that there is no animal that could possibly make the noise that I had just heard and it surely wasn’t a customer. As I screamed for Travis I felt reassured to see him already coming over the bank asking what the hell had made that noise. He couldn’t even finish his sentence before that sound let loose again! It seemed to be on the opposite shore and running directly away from us at a speed I had never seen an animal run at before. It almost seemed like a bird it was going so fast through the trees directly away from us up the hill. It had seemed like seconds before it reached the top of the hill maybe an eighth of a mile away and remained there for several minutes making a noise that had every hair on your entire body standing at perfect attention. Then as quick as it had started it stopped and we found ourselves climbing in the car speeding for the safety of my store where we sat up all night going over and over what we had just heard. It wasn’t until a couple of weeks later that I was forced into going back there because I am a licensed fishing guide and the only one who does nighttime drift boat trips down the river. Seeing that I had two paying customers, one a young man in his late twenties from Iowa and the other, a regular customer who also owns a house on the river, I felt obligated to do my best to get them fish and as scary as it may seem, I knew that beginners was the spot. I launched the boat directly into Beginner's Hole at about 10:30pm and had planned to take about a 2 mile trip down stream hoping to get a quick fish or two out of the hole and get the hell out of there but the fish just weren’t going for it. Every time I suggested that we head on down I was cut off by the local home owner telling me that we were in the hot spot and he wanted to try it longer and to quit being a baby, that there was no such thing as bigfoot. He, too, had heard the rumors going around about what I had seen. As he teased me, it got the Iowa guy asking all kinds of questions because that was the first he had heard of the monster that lived at Beginner's. I tried to avoid the hole thing as best as I could but he wasn’t about to leave it alone and talked me into telling my story. I was almost finished reciting the months' events when something happened that I will never in all of my life forget. All of a sudden the pole that I was holding almost got ripped from my hands and I yelled fish on! Or so I thought. It took but seconds to realize that something was not right by the way it was pulling. It felt like I had hooked into a bail of hay that had floated by in the heavy current but yet you could tell that it was alive. The Iowa guy was screaming for me to give him the rod cause that was to be his first steelhead ever and he took the rod from my hands. As I stood there in my drift boat watching the line slowly peel off of the reel, I couldn’t help but feel confused about what could possibly be attached to the other end when it stood up in the middle of the river 30 feet below my boat and seemed, by the glowing corkies and sand shrimp, to be hooked in the left shoulder and not at all comfortable with the whole situation, nor where either of the two gentlemen in the front of my boat. The Iowa guy was shouting something about it being a dead body and I can’t recall the local man saying anything at all. The river was about 4 1/2 feet deep where it was and it seemed to me in the moonlight to be standing waist deep, slowly swinging its arms trying to get free. As I pulled my anchor and tried to stay my distance, the Iowa guy was pulling for all he was worth. I was using 30Lbs line and there wasn’t much chance of it breaking. Maybe 3 minutes passed or so it seemed like before it finally freed itself and dove under water never to be seen again, just a wake of water heading downstream into the deep hole and as far as I could tell, never coming up for a breath in at least 100 yards till it rounded the bend and out of sight. To this day I have not fished Beginners Hole and I am no longer a guide. I mainly stay at home and work on computers. What happened to me on the Kalama River will stay with me for the rest of my life and I’m sure that all of this sounds pretty strange but I will tell anyone who wants to know the names of every person involved and would gladly take them to the place and show them. I am almost certain that if someone was to spend next spring and summer at beginner’s hole on the Kalama River between the hours of 10:00pm and 4:00am it will quite possibly change the way they view Bigfoot for the rest of there life! Thank You; ",
  "classification": "Class A",
  "county": "Cowlitz",
  "state": "Washington",
  "latitude": 46.0471,
  "longitude": -122.8294,
  "location": "-122.8294,46.0471",
  "location_details": "Beginner's Hole",
  "temperature_high": 63.28,
  "temperature_mid": 58.99,
  "temperature_low": 54.7,
  "dew_point": 49.8,
  "humidity": 0.76,
  "cloud_cover": 0.91,
  "moon_phase": 0.82,
  "precip_intensity": 0.0006,
  "precip_probability": 0.33,
  "precip_type": "rain",
  "pressure": 1014.38,
  "summary": "Overcast throughout the day.",
  "uv_index": 5,
  "visibility": 9.43,
  "wind_bearing": 265,
  "wind_speed": 3.07
}