{
  "reportId": "20159",
  "title": "Nighttime sighting by motorist on Hwy 33 near Seneca Rocks",
  "date": "2007-07-08",
  "timestamp": 1183852800,
  "observed": "I didn't actually see the creature, but was riding in the car with my boyfriend when all this occurred. We were coming back from a trip to Ohio with a detour to see some friends in West Virginia. Instead of taking interstates home to Virginia, we took US 33, a very twisty mountain road, heading east. I was dozing in the passenger seat when I was startled by my boyfriend yelling \"what the hell was that?!\" I sat straight up, and noticed that whoever was in the car behind us suddenly hit the brakes and flashed up the high beams. We were only going about 30 anyway because we were rounding a curve, so he got a pretty good view of whatever it was. His first description was \"some guy was walking on the road in a tree costume.\" After he told me a few more details, I yelled, \"Sasquatch! That's what you saw!\" I immediately took some notes. This is what he says that he saw: human-like figure, at least six feet tall and very bulky, with very long hair (\"the hairiest thing I've ever seen\"). It was a mossy grayish green color. It was walking along the side of the road upright like a man, but slightly hunched over with knees bent and elbows sticking out (\"an ape-like walk, definitely not human\"). It had no distinguishable facial features, because it was so hairy. He says the arms were six to eight inches wide and the legs were wider, at least eight inches. The creature also did not react to the sound and light from our car or the one behind us. He says it was absolutely not a bear, deer or large dog. Without our headlights, it was completely dark with just a little moonlight. The creature had no light source, and if it was a man (in a pretty elaborate costume), it was on a heck of a walk because there was not anything within reasonable walking distance, especially with no light.",
  "classification": "Class A",
  "county": "Pendleton",
  "state": "West Virginia",
  "latitude": 38.8926,
  "longitude": -79.47325,
  "location": "-79.47325,38.8926",
  "location_details": "We were somewhere between Harmon and Seneca Rocks, West Virginia on US 33. We were probably in Pendleton County, but may have been in Randolph. It was close to the county line, I think. My boyfriend says we may have been about 10 miles west of Seneca Rocks.",
  "temperature_high": 83.68,
  "temperature_mid": 72.665,
  "temperature_low": 61.65,
  "dew_point": 58.09,
  "humidity": 0.67,
  "cloud_cover": 0.08,
  "moon_phase": 0.79,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.52,
  "summary": "Clear throughout the day.",
  "uv_index": 11,
  "visibility": 7.77,
  "wind_bearing": 262,
  "wind_speed": 2.23
}