{
  "reportId": "5778",
  "title": "Couple horseback riding catch a glimpse of unknown creature followed by a nasty smell and a loud moaning scream",
  "date": "1987-08-07",
  "timestamp": 555292800,
  "observed": "My wife and I had saddled our horses on this day and we decided to take an afternoon ride on an old trail we had rode on many times before. The day was bright and clear. While on our way down this trail I looked to my right and saw a dark shape, just the head, no neck and shoulders. At the time, I didn't think to much about it since many times in the woods while hunting or riding I have seen shapes that later turned out to be nothing but clumps of branches or leaves. I said nothing to my wife about the shape as we kept on riding. A few minutes later we passed an old hedge row on our right, when my wife complained about smelling something terrible that she thought was coming from behind the hedge row. I just said something must have died and we went on. A few minutes later we heard this loud long moaning or wailing sound coming from behind us and to the left. This is a very remote area and no one lives around there for at least a mile and a half. We stopped in our tracks and listened. It seemed to last for thirty seconds or so. We started to talk about what I had seen, what my wife had smelled, and what we had just heard, and started to put two and two together. I believe what we encountered must have been a Bigfoot. I have never told this story to anyone, neither has she, but after finding your website and reviewing all the sightings around our area I had to report this to you. By the way, we went back to the same spots where I had seen this shape and she had smelled the odor, and both were gone.",
  "classification": "Class B",
  "county": "Jefferson",
  "state": "Ohio",
  "latitude": 40.54269,
  "longitude": -80.89606,
  "location": "-80.89606,40.54269",
  "location_details": "The location was just off State Route 164 on Brushcreek Township Road 289 between Monroeville and Bergholz, Ohio.",
  "temperature_high": 84.73,
  "temperature_mid": 74.13,
  "temperature_low": 63.53,
  "dew_point": 60.2,
  "humidity": 0.68,
  "cloud_cover": 0.3,
  "moon_phase": 0.43,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.72,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 8,
  "visibility": 7.58,
  "wind_bearing": 324,
  "wind_speed": 1.95
}