{
  "reportId": "45883",
  "title": "Two deputy sheriffs report hearing possible vocalizations while hog hunting near Poinciana",
  "date": "2013-04-13",
  "timestamp": 1365811200,
  "observed": "Well where do I start. Oddly enough, here, at my last resort. Let me please start off with the whole I'm not crazy speech. I live here in Central Florida and work as a Deputy Sheriff for the past 16 years. Add to that my time in the military and being some what of a hunter and one could say I have spent a good bit of time in the woods and around the world. However about 1.5 years ago myself and a friend (with a similar background) heard something while hog hunting at night that to this day rattled my very being. The location was near Lake Hatchineha in the Poinciana area of Polk County. The time was close to 2am. We were still hunting in an open area with a heavy woodline between us and the lake. What we both heard is difficult to describe since I had only ever heard a similar sound in a movie. Yep a movie, and excluding that in my four decades of life and travel I have never heard anything remotely close. It was not a whoop or a howl or a cry but what I can only describe as a chuffing noise. Now if you want to listen to the only thing that I have been able to find that comes close, watch Jurassic Park and when the raptors call to each other, that's it. But here is where that similarity ends. The sound was much deeper and had a slight rumble at the end. From our position it sounded at least 1/4 -1/2 mile away. The noise was made four times like (chuff-chuff-chuff-chuff)  then complete silence and by that I mean not even the birds were chirping.  Both my buddy and I had that whole hair on the back of the neck thing going on big time. What set our nerves on overdrive was after about  an hour later we heard it again. This time it was to our north and only about 50 yards away. Needless to say it was much louder as in I honestly felt it in my chest. What ever it was it was big and moving our way in the tree line. We could hear it moving slowly to the west and it did not sound like a deer, bear, or any of the many other animals I have heard or tracked ever. I will say this. I do not scare easily. I have been alone in deep woods in the green swamp and never had a second thought. But that night I have not and will not ever forget. We hunted the rest of the night back to back literally. Now I assume your wondering why am I writing this here. Well in truth I have searched every site on strange noises with no luck. I have spoken to countless others about it with no luck and got in touch with my buddies at FWC with no luck. Am I a believer? Well my thought is simple - why cant they exist? Did we hear one that night? I have no clue. I am making contact with you because as I stated earlier this seems like my last resort. Maybe you or someone has heard the same thing and can identify the animal. If you actually have or just need to Q&A me I can be contacted by email or phone Thank you for your time.",
  "classification": "Class B",
  "county": "Polk",
  "state": "Florida",
  "latitude": 28.05144,
  "longitude": -81.51359,
  "location": "-81.51359,28.05144",
  "location_details": "Location was and undeveloped area north of Rock Drive. Directions from US Hwy 27 to Hwy 544 east to 17 (Scenic Hwy) then south to Hatchineha Rd then east to Allegheny then north to Greenfield to dead end. Turn right, go to dead end then left on Rock Drive.",
  "temperature_high": 83.91,
  "temperature_mid": 76.27,
  "temperature_low": 68.63,
  "dew_point": 65.49,
  "humidity": 0.72,
  "cloud_cover": 0.38,
  "moon_phase": 0.11,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.84,
  "summary": "Partly cloudy until evening.",
  "uv_index": 8,
  "visibility": 9.47,
  "wind_bearing": 15,
  "wind_speed": 1.85
}