{
  "reportId": "37558",
  "title": "",
  "date": "",
  "observed": "11/20/12 I have been keeping my eyes peeled for any potential sign even though I live in a fairly populated area. I live on and drive up and down Carrollton Rd several times a week. What I noticed was a fresh break of a young tree, about 50-60 feet in from the road. Due to brambles, and being private property, I didn't go in for exact measurements but I'm a pretty good estimator. This break is about 6 feet off the ground, maybe 5, the tree is approximately 4-5 inches in diameter. I noticed that there are significant scrape marks on one the road side of the tree, can't see the other side, The marks are ONLY below the break. I also found what looks like definite depressions in the leaf litter, with a bit of compressed bare ground, one about 6 feet in from the road at the tree line, and one about 2 feet from the guardrail. I carry a tape measure with me in my car as part of my tools for farriery, so I was able to lay it out at what I believe is the length of the depressions and get pictures. Of course I couldn't resist doing a few knocks, there were some good rocks at the roadside so I did one knock, waited about 10 seconds then did two more about 2 seconds apart. I waited about two seconds, stood up, took two steps and heard a response knock!!! It sounded like it was certainly past the hill (top is about 3-500 yards from road) and probably well past that, guessing within a half mile. I waited about 30 seconds, put out a few more knocks, nothing. Couldn't help a few short whoops, no response.",
  "classification": "Class B",
  "county": "Carroll",
  "state": "Maryland",
  "location_details": "Location is \"ruralurbia\" - Carroll county is farm lands interspersed with residential and horse property and also has a fair networking of wooded areas still intact. About 6 miles as the crow flies to the east is Liberty Reservoir, which empties into the Patapsco River. Immediate \"neighborhood\" is mostly large residential and many wooded properties, we ourselves have horses on 17 acres that is 1/2 wooded with a creek bottom and a rather constant deer herd.",
  "summary": ""
}