{
  "reportId": "23784",
  "title": "",
  "date": "",
  "observed": "Me, my cousin Kevin and my three friends Timmy, Tyler, and Steve were walking round in the woods maybe a mile from my house in October or November of 2007. We always used to go out in the woods and do dumb stuff like spy on the construction  workers that worked at a nearby construction(1/2 mile away) site. We always knew that there was something fishy going on in those woods, but when something freaky happened we never stuck round to find out what. So we are about to enter the woods from a field and I start smelling this foul stench. I don't say anything at first because I didn't think I had to. I didn't think anything of it, until I was taking a leak facing the woods, when about 20 feet down the tree line where my friends were, the brush started shaking violently, no one said anything, we just pointed our flashlights and I pointed my camera, but it was too far away at night to catch anything (if the night-vision on the camera was working I could have had something on video, but oh well). My friend said he saw a broad pair of  shoulders move right through the brush. We quickly decided it was a deer w/barely any further speculation. On our way through the valley, my friend (Timmy) noticed something run down the hill we were on, but it wasn't clear enough to determine what it was. We got across the creek and a big tree that fell over was moved a good 10 feet from its previous position, and me and my cousin are pretty strong guys and we couldn't move it at all. So naturally we were baffled. On our way out of the valley when we heard something moving in the brush next to us, so we all shined our flashlights at the bushes. My cousin and my friends Timmy and Tyler claim to have seen a pair of shoulders, when the lights where shined. I didn't have a good angle, but I did see it as it crouched and shimmied its way through really thick brush. My 6'4 310 pound cousin was so scared, that he trucked right through some water to get out of there, we were all scared.",
  "classification": "Class B",
  "county": "Burlington",
  "state": "New Jersey",
  "location_details": "Edited out at the request of the witness.",
  "summary": ""
}