{
  "id": "35479",
  "title": "Nighttime sighting by a motorist near BZ Corner",
  "date": "2010-09-15",
  "timestamp": 1284508800,
  "observed": "I was on my way back from Glenwood where my cousin had had a high school volleyball game; I and her older brother had hung around town well after the game so I left around midnight. On the way back I drove slower than normal because I didn't want to hit a deer with my car I had bought the previous month. I was a little more than two miles from the BZ corner junction when I saw a set of eyes reflecting on the opposite side of the road. I slowed down thinking it was a deer, however as I continued to approach I saw that they were sitting up pretty high. The road dips down on that side just as on mine, there are steep banks here and there. When it began to cross I was a little less than 10 yards from it but through the majority of the encounter I inched towards it to approximately 5/6 yards at the closest. When it came in to the shoulder of my headlights I noticed that the legs weren't thin like a deer or elk they were thick. I thought it might be a bear, however as it continued to cross I could tell it was way too big to be a bear sitting at roughly 7/8 foot high. I also knew it wasn't a bear because bears are meant to be on all fours it wouldn't have \"arms\" that came down about half way down the thigh (I could tell they came down that far because they swing slightly as it walked). When it crossed over the centerline for a moment it made about a quarter turn with its torso and looked at me briefly before turning back (all as it was walking, it didn't stop at any time while on the road). I don't recall much of the face but what I do clearly remember was noticing the shape of the head was not at all like a bear, more like a tall bump off of massive shoulders and that there was no snout (that part I noticed as it finished looking away from me). It continued to walk forward in to a ditch along the road with a steep bank (as it did so walking a little bit towards my car as if trying to step out of the light). It awkwardly turned away and I started driving forward slowly. I ended up crossing halfway into the other lane but I would estimate its distance to the side of my car as I began to pass would have been 3/4 feet at the closest. Once I was pretty sure I had passed it I sped up. I never looked in the rear view mirror, I was honestly too afraid too. The hairs were standing on the back of my neck the rest of the drive. I knew it was watching me as I drove away and the scariest part was I knew it was watching me when I was unable to see it after I passed.",
  "classification": "Class A",
  "county": "Klickitat",
  "state": "Washington",
  "latitude": 45.86883,
  "longitude": -121.4813,
  "location": "-121.4813,45.86883",
  "location_details": "This happened while I was traveling South West on the BZ Glenwood Highway 2 miles from the BZ junction on to HWY 141.",
  "temperature_high": 72.39,
  "temperature_mid": 66.575,
  "temperature_low": 60.76,
  "dew_point": 54.94,
  "humidity": 0.77,
  "cloud_cover": 0.46,
  "moon_phase": 0.27,
  "precip_intensity": 0.004,
  "precip_probability": 0.88,
  "precip_type": "rain",
  "pressure": 1013.76,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 9.19,
  "wind_bearing": 173,
  "wind_speed": 1.75
}