{
  "id": "9853",
  "title": "While camping, couple hears repeated strange, night time vocalizations",
  "date": "2004-11-27",
  "timestamp": 1101513600,
  "observed": "This was our third trip to the LeFlore county area.  We were aware of the BFRO reports from this area and decided to camp,explore and just enjoy some time outside.  To become more familiar with the area we wanted to spend time in the Honobia Wildlife Area and the Ouchita Nat'l Forest.  We arrived late on October 22nd and just picked an easy place to access.  We set up camp in the Billy Creek campground.  At approximately 2330 hours Ann and I both heard an unusual sound.  Ann described the sound as being a cross between an elk and an elephant.  She heard the sound twice and thought it came from west of us on a slight ridge.  I heard the sound four times and thought it came from the creek bottom.  I would describe the sound as having a hollow quality with two distinct pitches.  The sound lasted about three seconds with the first half being the higher pitch.  Our dog was acting rather nervous for a short time before and during the sounds.  After the sounds he settled down and went to sleep.  We didn't hear anything else.  We were the only ones in the campground that night.  The next night there were three other tents.  We heard nothing that night.  We're not saying that this was a bigfoot, but we've spent quite a bit of time outdoors and haven't heard anything like this previously. Being rural people we're aware of the different wildlife sounds but, this was a new one to us.",
  "classification": "Class B",
  "county": "Le Flore",
  "state": "Oklahoma",
  "latitude": 34.695,
  "longitude": -94.685,
  "location": "-94.685,34.695",
  "location_details": "Billy Creek campground",
  "temperature_high": 57.45,
  "temperature_mid": 44.76,
  "temperature_low": 32.07,
  "dew_point": 41.07,
  "humidity": 0.67,
  "cloud_cover": 0.48,
  "moon_phase": 0.53,
  "precip_intensity": 0.0129,
  "precip_probability": 0.72,
  "precip_type": "rain",
  "pressure": 1010.11,
  "summary": "Mostly cloudy until afternoon and breezy in the afternoon.",
  "uv_index": 2,
  "visibility": 9.84,
  "wind_bearing": 305,
  "wind_speed": 7.67
}