{
  "reportId": "15416",
  "title": "Possible vocalizations heard by campers near Lowman",
  "date": "2004-06-19",
  "timestamp": 1087603200,
  "observed": "We went camping in a remote spot off of Highway 21, 18 miles east of Lowman. Turn left onto Old highway 21 and take a right on a dirt road in front of an old ranger house. The road curves around a couple of miles and we camped in front of a dirt airstrip (warm springs airstrip). We were only there for a few minutes and began setting up camp when we heard these loud high and low pitch screams coming from the woods. I asked my husband if he heard that. We listened for a moment. I screamed back at them.  I am not sure why I did that. My first thought was that there were people playing down by the river. But then as we listened I noticed the sounds were screams...that seemed to go back in forth from one direction and then something returned from the other direction. It was long with high and low pitches. This happened, off and on, for 30 min. or so. We soon forgot about about the sounds and began camping out. The next day, my sons ( ages 13 and 9 ) asked me if they could go up a tall hill and come back down. I could watch them through binoculars and they would talk to me with walkie-talkies. Not sure why I allowed  this.  Anyway, they began their walk and at the bottom of the hill they reported seeing a dead deer. They said it looked like the back leg was missing and saw another bone a few feet from it. There was meat on it and fur but they didn't notice any guts. They kept walking up the hill. After reaching the top they told me there was a valley on the other side and they wanted to walk just for a minute more. After about 2 minutes they began telling me there was an awful smell that they described as being the grossest smell they had ever smelled. They said it was like something was dead, but worse. They said they were scared and ran over the top of the hill and came back toward me fast. They later told me there were woods off to the left that they entered into. They didn't see or hear anything.  I am not sure if this is at all related to Bigfoot activities. I decided to write because a few months back I saw a show that had a man  that was recounting his Bigfoot sighting in Ca. outside of some caves and they played a taped recording of what they presume is Bigfoot. I got a lump in my throat. That was what I heard. I played a type recording off of another site for my boys who are now 15 and 11. Without any coaching, I asked them if they had ever heard that noise before. The older one replied, \"Yes, when we went camping at the hot springs. What is it?\" We will be camping near there in a couple of weeks and I will now be more aware of my surroundings.",
  "classification": "Class B",
  "county": "Boise",
  "state": "Idaho",
  "latitude": 44.14555,
  "longitude": -115.3106,
  "location": "-115.3106,44.14555",
  "location_details": "18 miles East of Lowman ranger station. Turn left onto the Old Highway 21 take a right in front of an old ranger house and about 2 miles back is an airstrip and across from that is where we camped. It is about a 20 min. hike to a hotspring.",
  "temperature_high": 72.8,
  "temperature_mid": 58.99,
  "temperature_low": 45.18,
  "dew_point": 42.51,
  "humidity": 0.58,
  "cloud_cover": 0.27,
  "moon_phase": 0.06,
  "precip_intensity": 0.0017,
  "precip_probability": 0.44,
  "precip_type": "rain",
  "pressure": 1016.88,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 10,
  "visibility": 9.99,
  "wind_bearing": 39,
  "wind_speed": 2.2
}