{
  "id": "6462",
  "title": "",
  "date": "",
  "observed": "Depth finder read at the entrance of the channel approx 3' but fell to 8' and greater once into the channel. The deeper back we went the better the fish were biting. My husband manned the trolling motor on the front of the boat and me on the back end. Just slowly and enjoying the day and the fish that were biting and the sounds of the wildlife. We could hear the carp slapping the water surface deeper up the channel. We were there a good two hours. Husband looked up to start deeper into the channel but saw a dark, black, bulky body standing behind brush hunched over looking at us. He studied it and finally said to me \"well what the hell is that...(mumbled something).... and I asked him what/where... I saw the bushes moving slowly up into the woods as if someone/thing was fast-walking. He said to be quiet until we got backed out of the channel. It haunts him still and we are trying to logic out what he saw. The odd thing was that just before my husband said he was seeing something, I got a day-ja-vue feeling and felt we were not alone, because the birds stopped their activity and went from feeling content and calm to feeling spooked. Like when crickets stop singing when disturbed. Was crazy, just can't explain it. My husband was scared and I never saw him act that way before. I know he saw something, I saw something moving the bushes cutting up into the woods. He first thought it to be the \"back end\" of a black bull/cow. Then he thought it to be a moonshiner or a big black man hiding. It was black and not in shadows. He saw no facial features and no outline of a head. That make sense?? It darted away quickly up into the woods as he commented to me that he was seeing this..... I saw the bushes moving up into the woods. We left.",
  "classification": "Class B",
  "county": "Tipton",
  "state": "Tennessee",
  "location_details": "In a runoff channel across from the lake chute. Go Hwy 51 towards Henning, TN from Memphis, TN. Take Hwy 87 to Hwy 387 past Ft. Pillow state prison to Cold Creek Lake.",
  "summary": ""
}