{
  "id": "2144",
  "title": "",
  "date": "",
  "observed": "I had parked my Volkswagen beetle at the junction of Rte. 17A and the Appalachian Trail, intending to camp out overnite along the trail.  I then hiked south on the trail about 4 miles, along a ridge that overlooks Greenwood Lake until I was perhaps just above the New Jersey line.  Since I had hiked this section of trail before I knew of an ideal camping site - a large outcropping of bedrock that rises about 10 feet above the surrounding terrain, and has a sheer drop off on the west side with a small swampy area on that side.  I unrolled my sleeping bag and bedded down as soon as it got dark, enjoying the magnificent view of the sky before dozing off.  About midnight I awoke for some unknown reason, and shortly after heard the most horrifying high pitched scream I had ever heard out in the woods, perhaps a 100 yards to my southeast.  I scrambled out of my sleeping bag, and quickly put my boots on.  Then the scream repeated itself, and I was positively terrified, as I knew it was miles in the dark to my car, and I had only a small flashlight.  Thinking to scare off, what I assumed was an animal, I screamed back at it, and was aghast when it returned my scream.  Several more screams were exchanged and then silence.  With my heart racing, I gathered up all the stones I could find in depressions in the rock I was camping on, and began throwing them in the direction the loud scream originated.  Then, to my horror, another scream came from a direction south-southwest of me, which astonished me as I heard no noise of movement, and in those days had extremely good hearing.  I hurled rocks in this direction, with more screams being exchanged.  This process went on for another hour, and then quiet, but I stayed up all night.  In the morning I checked the area where the noise had originated, and discovered it was covered with dry leaves, which made me more puzzled why I heard no noise.",
  "classification": "Class B",
  "county": "Orange",
  "state": "New York",
  "location_details": "",
  "summary": ""
}