{
  "reportId": "8527",
  "title": "Man has extraordinary, close encounter while fishing near Huntington",
  "date": "2004-04-23",
  "timestamp": 1082678400,
  "observed": "I was visiting some friends in Huntington Arkansas in the summer of 1988. We all decided to go to a local lake for some bass fishing. They had warned me that there were tons of water moccasins and to be VERY careful where I stepped. I was moving along the bank fishing and I was paying a whole bunch of attention to where I was placing my feet when all of a sudden there was a commotion in the woods about fifteen feet to the right of me. When I turned and looked I could see a very large creature, about 7 to 8 feet tall with very broad shoulders, and could hear a sort of \"whoooop whoooop\" noise. Thinking it was one of my companions trying to scare me I moved toward it. At that time it grabbed the tree trunk next to it and just twisted it off, and kind of slapped the ground with it, and made a very low guttural growl. At that point I was more scared than I have ever been in my life. It was really intimidating because its muscles were flexed, and its head was tilted down and it was staring right at me. My Dad had taught me about encounters with bears and what to do. My instinct was to run, but my Dad always taught me that an animal will chase you if you run. I just dropped my pole and looked down at the ground and slowly backed away. The animal followed me a short way and just turned and walked into the woods. When I got back to where my friends were I told them happened and they just laughed at, and made fun of me. I have never been back to that part of the country and now live in the desert where there are few trees.",
  "classification": "Class A",
  "county": "Sebastian",
  "state": "Arkansas",
  "latitude": 35.09306,
  "longitude": -94.356,
  "location": "-94.356,35.09306",
  "location_details": "",
  "temperature_high": 70.39,
  "temperature_mid": 65.995,
  "temperature_low": 61.6,
  "dew_point": 62.85,
  "humidity": 0.87,
  "cloud_cover": 0.8,
  "moon_phase": 0.13,
  "precip_intensity": 0.026,
  "precip_probability": 0.79,
  "precip_type": "rain",
  "pressure": 1013.02,
  "summary": "Heavy rain in the morning and overnight.",
  "uv_index": 6,
  "visibility": 8.83,
  "wind_bearing": 91,
  "wind_speed": 6.18
}