{
  "reportId": "49096",
  "title": "Campers have possible encounter while staying in High Point State Park",
  "date": "2015-06-23",
  "timestamp": 1435017600,
  "observed": "My brother and I camped overnight in High Point State Park, New Jersey, the other night. Driving around the park, the camping sites were labeled with numbers. We wanted to set up in a place as far away as we could from the other people. I myself, have known the existence of Sasquatch to be real for quite some time. Not from a personal experience which was yet to come, but because of watching so many people tell their stories of encounters, and just seeing the genuine fright and truthfulness in their eyes when they tell their stories. My brother however, always laughed at the subject of Bigfoot, and was a complete skeptic. So, my brother and I has set up camp on the edge of what I'm assuming was the only lake in the park. We walked through the forest in the daytime, and indeed found many peculiar structures and tree breaks I had seen before on Bigfoot TV shows. As night fell, we made a fire, and watched the numerous stars reveal themselves as the night got darker. Around 12 o'clock at night I went over to a rock right by the edge of the lake and looked up at the stars, while my brother tended the fire. I'm an astronomy fan, so before I knew it I had been sitting there for two hours when I checked my phone and it said it was nearing 2 in the morning. Just then my phone ran out of battery. While sitting on the rock, I began to feel a weird sensation that someone or something was watching me, I checked to see if it was my brother but he was staring into the fire. I dismissed this feeling and told myself I had just brought it on myself. I looked back up at the stars and got lost in some train of thought when all of the sudden, something made a very loud noise that could only be described as a very large man exhaling aggressively towards me. I jumped up and ran to my brother, and we heard the thing walk towards the forest, all the while breaking branches and continuing to make the same aggressive noise I heard so close to me. It got quiet, and my brother and I were standing looking in the direction where all the noise had came from when it made the noise again. Now, I don't speak Sasquatch but that thing was telling us to get the heck out of there. I don't get scared easily at all, and I was shaking like I never had before. I felt so much negative energy and decided I was too scared to stay outside, so we went to the car and sat inside, praying whatever made that noise didn't come back. My brother described the sound as sounding like someone ripping a tent. Whatever the noise was, absolutely no common animal could have made it. After a sleepless night, when it got light out again around 5:30, we built up the courage to go back where we heard the noise to see if there were any indications of what made it. And when we got there, I was shocked. There was a makeshift bed made from giant leaves that was fit for a very large creature. I could see the exact spot where the thing that had made the noise was watching me, and where it walked away, as there was a clear path of flattened grass and plants leading up the forest. The area was wet and muddy, and indeed there were footprints. But, as I was taking pictures the path leading from the bed to the upper forest, it happened again. The thing made the same exact noise, this time it was so close, I nearly fell. We ran back to our campsite and listened. But nothing made a sound. We stayed there for about 30 minutes until I decided to go back and see if there were fresh prints or anything I could take back as proof. I took more pictures, and i was standing on the trail leading back to our campsite looking at the pictures I had taken when again, the thing made the same noise! This time it was on the side of me that I would have to run past it to get back to the campsite. As soon as I heard it, it felt like my heart literally dropped and my legs became wobbly, but I summed up my courage and once again ran back to the campsite in fear. It was only about 10 seconds away, and when I got there my brother was standing there wide eyed asking if I had heard the noise. Whatever it was, it was not happy and we heard it walk up into the forest breaking branches and exhaling aggressively as it headed deeper into the forest. At this point my brother wanted to get the heck out of there, but I needed to see it. I went up to the road right before the forest where we had heard it go in, and looked around, but saw nothing. I was so confused on how the heck it ever got so close to me without me seeing or hearing it walk at all. While I was walking on the road, I saw my brother walk up from the campsite looking around. When he spotted me, he sighed in relief and told me he though I was getting attacked because he heard a bunch of human like screams coming from the forest. I walked towards where he was and started to hear them too, but by the time I reached him the screams started to sound like some kind of weird chatter. My brother, the skeptic, was so scared he told me were packing up and leaving right away. I have no doubt in my mind that we just happened to pick a campsite right next to where a Sasquatch was sleeping, and he was just not happy about that. I know what we heard was a Sasquatch. My brother entered a skeptic, but left a full believer in Bigfoot.",
  "classification": "Class B",
  "county": "Sussex",
  "state": "New Jersey",
  "latitude": 41.29453,
  "longitude": -74.68758,
  "location": "-74.68758,41.29453",
  "location_details": "If you drive into High Point State Park, past the left turn and sign that says Park Ridge I believe, and keep driving all the way to main lake, keep passing campsites until you reach campsite number 19. When you get to the campsite, there is a path leading to the lake. Go down it, turn right, and keep going until you see another campsite that is right on the lake's edge.",
  "temperature_high": 85.97,
  "temperature_mid": 74.69,
  "temperature_low": 63.41,
  "dew_point": 67.98,
  "humidity": 0.77,
  "cloud_cover": 0.11,
  "moon_phase": 0.23,
  "precip_intensity": 0.0064,
  "precip_probability": 0.44,
  "precip_type": "rain",
  "pressure": 1010.86,
  "summary": "Humid throughout the day.",
  "uv_index": 11,
  "visibility": 9.18,
  "wind_bearing": 237,
  "wind_speed": 7.01
}