{
  "id": "4196",
  "title": "",
  "date": "",
  "observed": "In the 1980 to 1985 time period, my wife and I spent almost every week-end spring through fall at my sister's place on Santee Cooper, and because we liked travelling off the beaten path, usually travelled on highway 97 through Liberty Hill, SC both ways. to Cross, SC.  One Sunday evening very late (11:00pm or so) as we drove toward Great Falls on highway 97, I rounded a curve to the right, and saw a big erect creature with a very athletic body, and covered with hair, crossing the road about 50 feet in front of me.  I hit the breaks to avoid hitting the creature, aand shouted, \"Look! \" to my wife, who was about to nod off in the passenger's seat.  The creature turned his head to look at me, and continued to cross the road into the trees. He walked with an easy stride, and did not seem to be hurrying, but crossed the road very quickly.  By the time my wife looked up and oriented in the direction I was looking, she only got a brief glimpse before it entered the dense woods. I stopped and backed the jeep to where I thought he had crossed the road, and searched with a dim flashlight, but could find no tracks or other sign.  I also did not notice any unusual smells, but I have a very poor sense of smell.  My wife wouldn't get out of the jeep, and thought I was a nut to do so. The area of the sighting is heavily forested, with a large, lightly developed lake and several several creeks and swamps around.  There is a lot of game such as deer and turkey. We had past Liberty Hill heading North.  The road at that point was a gently decending grade through a hilly area with winding curves.  The night was relatively dark.  I don't remember whether there was no moon or whether there was an overcast.  The weather was comfortable in summer clothing. The creature's hair was distinctly dark brown or black, and covered him(it) completely. The hair was not especially long. The face was more human than apelike.  The body build was very athletic and stocky, but not fat.  I think it was over 6 feet tall, but didn't have anything of known height to compare to.  It crossed the road, from the center of the right lane to the woods on the left, in about three strides.  The road was a standard width, two lane blacktop state highway, with a painted centerline",
  "classification": "Class A",
  "county": "Kershaw",
  "state": "South Carolina",
  "location_details": "After leaving Liberty Hil, heading north on SC Highway 97.  The road is a decending grade through a hilly area for about 5 miles or so, with several curves.  The sighting was probably 3 to 4 mikes into the decent.",
  "summary": ""
}