{
  "reportId": "50541",
  "title": "Motorist has a close sighting at dusk on AR-258 outside Bald Knob",
  "date": "2015-12-28",
  "timestamp": 1451260800,
  "observed": "Around 5pm I was driving down hwy 258 to go to the store. We have had some recent flooding so I was driving slower than normal and watching for deer. Along the way I seen 2 different area of deer, one had 3 I could see the other there was at least 6. So on the way back from the store I knew to slow down in those areas just in case. In one area it is a rather sharp curve and I had seen the most deer there. As I came up on the curve I slowed down and suddenly something jumped out in front of the car!!! I'll call it a \"he from here out.\"  He seem to have been running from the pine tree line and took a, what I would call a leap, out onto the road then he was gone. It was only 1 maybe two steps on the road it's self to clear it! I had slammed on the brakes and just sit there in awe wondering if I really seen what I had.  He was standing on two legs, lots of fur and what I would assume Is at least 8 foot tall. When he jumped in front of the car he was about a car length in front of me. He looked to have had a large fish in his hand. I know how that sounds but I swear it was a long fish. My husband said it may have been a stick but I'm a country girl and I know my fish! His \"fur\" was longer than what bear fur would be and although he was dark brown it had a reddish hue to it, the headlights gave s good look at the color as it leaped across.  There is a lake back behind where he was running from but he also jumped across to the right where those 6 plus deer were standing. We are going back at first light to see if he left foot prints. It's so muddy I'm hoping to see some.  We hear sounds out here almost nightly of what we describe as big foot sounds but I've honestly never thought they was out here. It is just sounds you can't describe, so we call it bigfoot sounds. I've had several friends and family hear them and one of them will not stay outside long out here because she's heard it so much. When I got home my husband came to the door to help bring stuff in and ask what was wrong, I said the deer are out bad and he asked if I hit one, I said no and he asked why was I shaking. I didn't realize my whole body was still shaking! LoL  I started telling him and I had tears rolling down, heart pounding and still shaking so bad. It really shook me up so much.  Not sure what else to say. It was one of the most amazing yet scariest things I've ever seen. I know I will not sleep tonight due to thinking about it and what exactly happened.",
  "classification": "Class A",
  "county": "White",
  "state": "Arkansas",
  "latitude": 35.34737,
  "longitude": -91.60007,
  "location": "-91.60007,35.34737",
  "location_details": "Going north on 67/167 take the second Bald Knob exit, turn left and go under over pass, then turn left onto Hwy 258, about two miles down in the curve.",
  "temperature_high": 52.36,
  "temperature_mid": 44.785,
  "temperature_low": 37.21,
  "dew_point": 41.74,
  "humidity": 0.84,
  "cloud_cover": 0.31,
  "moon_phase": 0.61,
  "precip_intensity": 0.0478,
  "precip_probability": 0.89,
  "precip_type": "rain",
  "pressure": 1004.02,
  "summary": "Heavy rain in the morning and breezy until afternoon.",
  "uv_index": 2,
  "visibility": 8.93,
  "wind_bearing": 235,
  "wind_speed": 6.65
}