{
  "reportId": "577",
  "title": "Man has repeated visits at family farm",
  "date": "1999-11-15",
  "timestamp": 942624000,
  "observed": "In 1979 and '80 I was living in my grandparent's old homeplace on our family farm in Alabama.  The farm has about 300 acres of woods covering an area of deep hollows leading down to sloughs off of a river. In late summer and fall of '79 we had been having trouble with deer poachers and some cattle rustling on our farm, so I was spending a lot of time out at night and on my off days trying to catch them.  Several times at night and a couple of times during the day I had heard strange screams back in the woods towards the river.  The first time I heard them, I thought it might be a peacock or a screech owl, but it really didn't sound like either, and it seemed to be much louder and more prolonged. I really didn't think much of it until one night I was walking back to the house from the back of the farm at about 11:00pm.  It was a clear night with a bright half moon shining and I could see quite well.  I was skirting along the south edge of the woods about 1/2 mile due north of the house when suddenly I got a creeping feeling that I was being watched and/or was in danger.  My skin started crawling and the hair on the back of my neck and hands stood up.  At the same time my dog, a large doberman pinscher, started acting nervous and whining quietly and started looking back over his shoulder to our left towards the woodline. I eased the safety off on my rifle and increased my pace.  Right at that instant, something screamed right in the edge of the woods less than 35 yards behind and to the left of us.  The pitch and volume of the scream was incredible.  I could feel my chest vibrating from the loudness of the scream.  My dog and I both broke and ran to our right out into the pasture about 50 yards and I spun around and stopped with my rifle up to see if it was chasing us, but it wasn't.  I stood there with my rifle up and whatever it was screamed at us five or six more times.  Also I could hear movement in the dry leaves where the sound was coming from, that sounded like a large person pacing back and forth.  I could also see the tops of some saplings and small trees sway and move as it bumped into them or pushed and pulled on them. The screams were longer lasting and a little lower pitched than what I had heard before.  I also know for sure that they weren't bobcat screams.  I became aware of the sound of our cattle running away towards the southwest.  The woods got quiet but I knew it was standing there still watching me.  But I never saw anything.  I backed away for about 100yds and then broke into a jog back to the house, spinning around and stopping with my rifle up about every 50 yards or so to make sure it wasn't following me. A few nights later, I was up late about 1:30am and getting ready for bed.  I came out of the bathroom into my bedroom and my dog was standing there staring towards the front of the house.  He was completely stiff, with the hair standing up on his back and neck and he was growling very low and menacingly.  It was the ONLY time I ever saw him do that and he was deadly serious.  I got a glimpse of a shadow move across the corner of my front bedroom window moving towards the west side of the house. The moon was shining right on the west wall of the house.  My dog turned towards the west and kept growling even more seriously.  Then I saw a large, sort of human shaped shadow move across both windows on the west side of the house.  The dog kept turning and growling and following the shadow.  Whatever it was, had to have been about 10 feet tall to cast a shadow that far up on the windows.  I was petrified with fear. I finally picked up my riot shotgun and chambered a round of buckshot.  My dog, at this time, was staring towards the north window of the spare bedroom and was still stiff and but not growling quite as bad.  I got up enough nerve to look out the bathroom window but saw nothing.  My yard was surrounded by a 3 ft high, hog-wire fence with two strands of barbed wire on top of it and locked steel gates, so whatever it was, stepped over the fence to get into and out of my yard.  The gates made a lot of noise if you tried to climb or open them, so it didn't come or go through the gates. In the next few weeks, while I was walking through the woods near the river, in two different locations, I found several deer that had been killed.  At the time, I thought that poachers had done it, but they were all complete except for having their abdomens cut or torn open and the guts pulled out.  None of the meat was gone from any of them, other than what possums or coons had eaten, and most of them had broken legs.  Only one was a buck and it was a yearling spike.  One of the deer had been killed right where I found it.  There were broken limbs and saplings and hair all around it.  There were tufts of deer hair hung in the bark of two larger trees next to the carcass.  Some of the tufts were over 10 feet off the ground.  Both of the deer's back legs were broken and twisted.  Even then I thought that it looked like something had grabbed that deer by the back legs and beaten it to death against the trees. I didn't tell anyone about any of this.  My dad and other folks had told me that people had been hearing and seeing strange things along that part of the river for decades.  But I had a neighbor that had told about seeing a bigfoot on his property a few years earlier and everybody laughed at him. In early fall of 1980, my wife was bringing in the wash one night about 7:00pm.  I had fed the horses some oats about 30 minutes earlier and I was now in the kitchen and suddenly heard a scream outside.  I ran out and my wife was running in, scared nearly to death. Something was right outside the gate between the storage shed and tack room/stables screaming just like before.  The horses went running out of there wide open.  The fence and gate there is quite high because there is a corral there also.  I could hear it moving around but could only get a glimpse of it occasionally.  It was MUCH taller than the 6 ft fence there and it appeared to be black with maybe a little silver or grey mixed in.  There's a steetlight in our yard on that side of the house, and when it moved though a patch of light, I could see the light glint off of its fur.  It was tall enough that it hit or shoved aside some tree limbs that I have to jump to be able to touch.  It screamed several more times and I could tell that it was becoming more agitated.  Between screams, I could hear it making a very eerie strange noise with an intermittent clicking sound that sounded like it was growling as it chewed or moved its mouth.   I ran back in the house and locked the doors. We moved shortly after that and I spent hardly any time on the farm until we moved back to the area in 1997.  My son, daughter and I and a couple of friends were coon hunting on the back of the farm near the river last year (November 1999) and the dogs were down on the east side of a ridge and we were waiting up on the top of the ridge for them to tree.  We started to hear the same screams as before about 600 yards to the west of us, in one of the areas where I had found dead deer before.  The screams lasted maybe 30 seconds to a minute and then stopped. We had tried to get the dogs to go in that direction earlier, and they wouldn't and we tried again later, but they kept circling back around and going to the truck, and these are championship dogs.  I didn't get to go back in the woods there until April of this year (2000).  I found fresh deer bones in the area where I had found several dead deer 20 years before. After finding your website and reading about the bigfoot killing deer, I now know that it hasn't been poachers killing all of our deer.  I believe that I will probably find more evidence of activity because the deer population is increasing in our area. .",
  "classification": "Class A",
  "county": "Colbert",
  "state": "Alabama",
  "latitude": 34.80405,
  "longitude": -87.50905,
  "location": "-87.50905,34.80405",
  "location_details": "East of Muscle Shoals. [More specific directions not posted at this time due to current investigation].",
  "temperature_high": 61.98,
  "temperature_mid": 48.915,
  "temperature_low": 35.85,
  "dew_point": 29.62,
  "humidity": 0.43,
  "cloud_cover": 0,
  "moon_phase": 0.23,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.38,
  "summary": "Clear throughout the day.",
  "uv_index": 3,
  "visibility": 9.81,
  "wind_bearing": 359,
  "wind_speed": 8.02
}