{
  "reportId": "1369",
  "title": "faint groaning and growling vocalizations heard.",
  "date": "1998-09-04",
  "timestamp": 904867200,
  "observed": "Nights of 9/4 & 9/5/1998 Vocalizations heard while camping. We arrived at Indian Mtn in the afternoon of 9/4 and set up 2 man tent at approx elevation 9,000 ft.  Stoked fire and retired to tent at approximately 2300 hrs.  No more than 15 to 20 min. later - loud but fairly distant howls heard eminating from the area to the east of our campsite. Dogs in adjacent neighbors properties were very disturbed and barked for sometime after hearing sounds in the area.  Sounds heard again approximately an hour later. *Was wide awake due to chill in air. Second night, approximately same time - same vocalization.  The dogs again were extremely agitated and would not settle down.  At approx 1 a.m. vocalizations heard again and faint groaning/growling sound.  About an hour later - shots heard in the area surrounding our campsite. When talking with neighbors below us, they thought a bear might have come up on to their porch during the night of 9/5.  Loud footsteps had been heard on their front stoop. I am an avid outdoors woman and not at all normally uncomfortable camping. Have been coming into the mountains for several years. *Sounds very much like those soundclips heard online.",
  "classification": "Class B",
  "county": "Park",
  "state": "Colorado",
  "latitude": 39.40305,
  "longitude": -105.8226,
  "location": "-105.8226,39.40305",
  "location_details": "Private deeded rural community called Indian Mountain approx 2-3 miles W. of Kenosha Pass off Rt. 285. Jefferson, Colorado",
  "temperature_high": 85.76,
  "temperature_mid": 69.745,
  "temperature_low": 53.73,
  "dew_point": 38.94,
  "humidity": 0.37,
  "cloud_cover": 0.14,
  "moon_phase": 0.43,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.59,
  "summary": "Clear throughout the day.",
  "uv_index": 9,
  "visibility": 10,
  "wind_bearing": 175,
  "wind_speed": 7.59
}