{
  "reportId": "5229",
  "title": "Man recalls seeing a strange bipedal animal during his one and only hunting trip",
  "date": "2004-06-25",
  "timestamp": 1088121600,
  "observed": "I was 15 years old at the time, I remember because I didn't have my drivers license yet. My brother and father and I were hunting squirrel. The funny thing was, this was our first hunting experience except for our father. Dad was born and raised in this part of the country. We had moved to Springboro, which is south of Dayton, when he decided to take us on a \"hunting trip.\"... Me and my brother were not the \"outdoors type,\" both of us being born in Dayton. My father had borrowed the guns we were using, since we would probably never go again. Me and my brother both knew how to shoot a gun, just never hunted wildlife before. Anyway, we were on our first \"safari,\" very excited and scared at the same time. The year before, my brother and I had got walkie talkies for Christmas. Not the cheap kind, but a nice set with a range of a \"mile\" under normal circumstances.. which was..... ha ha apparently not hills and \"hollers.\" Sorry, back to the sighting... We had split up a few hills back, each combing a hill or two. I heard a few shots from two different directions before it got very quiet. Birds had been chirping as the sun was high and the temperature had to be well within the 80's. I was at the top of a \"holler\" and decided to go down, instead of staying on top of the hill. As I descended, I got a weird feeling, as though I shouldn't be there or something else. I started to call my brother on the walkie talkie when I heard a loud sound coming from the right of me and fifty some yards down. I thought, why is someone running? As I approached it from behind, I turned off the walkie talkie so I didn't disturb what I was about to see. At first I thought it was a bear, but it was sitting on a large rock. Then I thought it was my father playing a trick on me, trying to scare me, but he didn't have a costume when we started to hunt. Did he bring one earlier? As this is going through my mind it stood up, I was coming quietly down the \"holler.\" I now could hear noise to my left and then right, like people just walking, not trying to draw attention to themselves. What gets me is that it never turned around, like it knew I was there. I was above wind, so how? As it stood, I was maybe 30 yards behind it, I never saw what was to my left and right, but it took off like a shot of lightning. I am now 6 foot 2 and 300 pounds, this thing was at least 8 foot tall and between 350 pounds and 450 pounds. I stood there for what felt like forever, a horrid odor had filled my senses, making me want to cry. I decided to go back up the \"holler\" away from what I had seen. I stood on top of that hill, calling my brother on the walkie talkie telling him to hurry. My father got there first, which I never understood, and he looked old and tired. I asked why are you standing so alert? He said \"we should leave now.\" As we were leaving in the truck, I asked why leave so early? He said \"son some things can't be explained.\" I understand now.",
  "classification": "Class A",
  "county": "Scioto",
  "state": "Ohio",
  "latitude": 38.79215,
  "longitude": -82.93085,
  "location": "-82.93085,38.79215",
  "location_details": "A few miles off of State Route 139.",
  "temperature_high": 72.53,
  "temperature_mid": 65.61,
  "temperature_low": 58.69,
  "dew_point": 61.06,
  "humidity": 0.82,
  "cloud_cover": 0.54,
  "moon_phase": 0.25,
  "precip_intensity": 0.0127,
  "precip_probability": 0.81,
  "precip_type": "rain",
  "pressure": 1017.39,
  "summary": "Rain starting in the evening.",
  "uv_index": 8,
  "visibility": 7.69,
  "wind_bearing": 27,
  "wind_speed": 4.51
}