{
  "id": "9315",
  "title": "Boy sees a bigfoot while clearing land",
  "date": "2002-04-29",
  "timestamp": 1020038400,
  "observed": "Let me first start by saying that when I opened my new issue of Texas Fish and Game, it opened right to the page with the picture of the \"creature\" on it, and the hairs stood on my head.  The image of the creature in the background is right on the money for what I saw. At the time, I was probably around 13 - 14 years of age (I'm now 37), and I've never had the opportunity to \"officially\" tell anyone about this until now.  Only my family and close friends have heard this, and everytime I tell it, my eyes water, and the hairs on my head stand on end (I can't explain this reaction).  Back then, we were in the process of clearing @ 40 acres of bottom land for farming. I was in the woods alone, operating a Model R John Deere, with an offset plow. I was making a turn under a tree, when a limb got hung on the stack of the tractor.  When freed from the stack the limb came towards the rear of the tractor, where I was already on the floorboard, so instead of catching me, and throwing me off the seat into the plow, caught the throttle (mounted on the steering column), killing the engine, and putting a nice bend in the steering wheel. Don't know how much you know about a Model R, but it has a smaller motor (pony motor), which starts the larger motor. I was never succesful in starting the larger motor with the pony motor. I was in the \"bottom\" of this 40 acre bottom, and to my left was a dirt road, and some cows inside a fence. To my right was the majority of the acreage, and a fence about 175 - 200 yards away. It was on the fence line 175 - 200 yards away, where I saw a large dark figure (standing on two legs), and appeared to be trying to get a better look at me, by leaning one way then the other.  I actually saw the arm move a branch. It was partially blocked by foliage along the fenceline, and I could not make out any facial features. After us getting a better look at each other, I had seen enough and sprung from the tractor, running as fast as I can (which is not easy to do in freshly plowed ground). I realized the tractor was probably my best chance out of there, so I ran back, pulled the pin from the clevis, and started pulling furiously on the starter for the pony motor which started.  I released the compression on the larger engine with one lever, and then engaged the pony motor to the larger engine with another lever, and for the first time, successfully started that tractor on my own. While beating a hasty retreat, I looked back along the fenceline, but could not see \"it\" anymore.",
  "classification": "Class A",
  "county": "Wharton",
  "state": "Texas",
  "latitude": 29.38333,
  "longitude": -96.25,
  "location": "-96.25,29.38333",
  "location_details": "",
  "temperature_high": 90.44,
  "temperature_mid": 81.685,
  "temperature_low": 72.93,
  "dew_point": 73.4,
  "humidity": 0.8,
  "cloud_cover": 0.48,
  "moon_phase": 0.6,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.34,
  "summary": "Humid throughout the day and mostly cloudy until afternoon.",
  "uv_index": 10,
  "visibility": 7.96,
  "wind_bearing": 177,
  "wind_speed": 8.48
}