{
  "id": "29227",
  "title": "Possible footprints found near Metropolis",
  "date": "2011-05-03",
  "timestamp": 1304380800,
  "observed": "To be honest, I’m very reluctant to submit this report but the pictures and details are simply too compelling to ignore. Two months ago my wife and I purchased five acres of rural, wooded property here in Massac County, Illinois.  I mow approximately two acres of this ground, with the rest of it being heavily wooded. I know nothing about Botany, so I can’t describe the vegetation on the property outside of an Oak and/or Silver Maple trees. Just take my word for it – it’s thick with trees and underbrush. On May 3rd at 6:15p.m., my wife, myself, and my two boys sons went out to this new property to have a picnic at the cabin. I was half-way down the hill toward the cabin when my wife yelled, “Oh my gosh! Look at this - look at this!” She was up the slope close to our parked trucks, staring at the ground. I walked back up to her position and she was staring at this print on the ground (pictures attached).  I had, evidently, walked right over the track without noticing. I then searched the radial area around the track and found two more partial impressions.  Growing more suspicious caused me to search the “bottoms” behind the cabin.  I found a strange tree structure and photographed that, as well. Listen, I’ve got a BS in Management Communication and am pursuing a Masters in Theology. I am also a local minister, so my credibility is at stake. I would never consider fabricating a story, much less a story like this one. Now, we’ve got to use a little critical thinking, but this is where logic and reality seem to be in opposition.  What makes a print like the one we’ve found on our property?  There’s two plausible possibilities; (1) A very large, very heavy man or woman – with a 14+ inch foot - is walking around out in the cool spring air with no shoes, trespassing on private property, out in a rural part of the country, risking arrest or a bullet. Or (2), ? I asked a good friend of mine, and member of the church, to take photos of the print using his 10 mega-pixal camera – the photos are truly incredible.  He took several photos, including a  “foot-in” and “foot-out” to show scale, two with a tape measure, one showing depth, and photos of the area via Google earth.",
  "classification": "Class B",
  "county": "Massac",
  "state": "Illinois",
  "latitude": 37.2276,
  "longitude": -88.7584,
  "location": "-88.7584,37.2276",
  "location_details": "(please do not post location online)",
  "temperature_high": 63.24,
  "temperature_mid": 50.51,
  "temperature_low": 37.78,
  "dew_point": 40.63,
  "humidity": 0.67,
  "cloud_cover": 0.42,
  "moon_phase": 0.01,
  "precip_intensity": 0.0087,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1023.04,
  "summary": "Light rain in the morning.",
  "uv_index": 10,
  "visibility": 9.53,
  "wind_bearing": 325,
  "wind_speed": 6.14
}