{
  "reportId": "30367",
  "title": "Memories told of encounters experienced by a family living near Villa Grove",
  "date": "1964-11-07",
  "timestamp": -162518400,
  "observed": "It was a clear cold November mid-afternoon day in 1964 me and my siblings had went outside with our mother to get fuel oil to burn in our stove while playing in the yard. We seen a upright black figure stand at a far distance in a harvested  corn field. We started yelling at it.  It appeared to turn towards us then turn back away. Our dog went chasing after it. We couldn’t see the dog any longer but we could  still see the black figure standing at a far distance in the field. Mom came over to see what we were yelling at. She also seen the black figure. She told us to quit yelling at it and get in the house right now. She seemed very frightened and scared so we went in the house, couldn’t see the dog any longer but we could  still see the black figure standing at a far distance in the field. A day or two after seeing the black figure in the corn field  my little brother and I went outside to play. We were always playing scavenger hunt. We decided to go into the empty hog pen beside our house  and see if we could find anything related to what we had seen just a day or two earlier. We seen what we thought were weird footprints so we followed them. It led to a hog house. There we spotted one good footprint indented into the ground It had two toes its was big! Looking back now I would say it was 16 to 18 inches long. We were scared. We had never seen anything like it. We tried to get each other to look in the hog house. I said let's go tell mom what we found. So they all came out and looked and seen the footprint. Also we got to looking around the hog house to see if we could find any more footprints. But we didn’t find any more, but we did find a clump of hair stuck to a metal piece in the window of the hog house. It had a very stinky musty smell to it, so we keep it and we put it in a envelope and 47 years later we still have it. In the days between all the these sightings my mother would wake up in the night to sounds. She would wake my older brother because she was scared. I never heard the sounds but one of the stories told was chain sounds on concrete, door handles shaking, footsteps on the front porch, and deep growling noises. Forty seven years have passed and to this day I think we had a bigfoot.",
  "classification": "Class A",
  "county": "Douglas",
  "state": "Illinois",
  "latitude": 39.8213,
  "longitude": -88.1676,
  "location": "-88.1676,39.8213",
  "location_details": "Approx. 3 miles from Villa Grove",
  "temperature_high": 58.17,
  "temperature_mid": 54.085,
  "temperature_low": 50,
  "dew_point": 43.55,
  "humidity": 0.75,
  "cloud_cover": 0.84,
  "moon_phase": 0.11,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.62,
  "summary": "Foggy in the morning.",
  "uv_index": 2,
  "visibility": 4.19,
  "wind_bearing": 66,
  "wind_speed": 3.28
}