{
  "reportId": "8715",
  "title": "Motorist has nighttime sighting of animal along Interstate 75.",
  "date": "2005-02-02",
  "timestamp": 1107302400,
  "observed": "I saw something along Interstate 75 South in Kentucky, maybe 30-40 miles south of Cincinnati. I don't recall exactly where along that highway I was at the time, somewhere after three lanes had been reduced to two. And it happened 4-5 years ago, in 1999 or 2000. I don't recall what time of year it was, maybe autumn. It never occured to me to report it, and I just found this site so I thought I'd let you decide if it has any merit. It was late, between 1-2 AM, and I was heading back to Winchester, KY (20 miles E of Lexington on Interstate 64) after a visit to PA. No other traffic was on the road at the time I sighted what appeared to be a large animal standing in a recess along a road cut, which I wouldn't have seen but for my headlights; there were no street lights or other sources of light. It stood erect and was covered in dark fur like a bear, which I imagined it must be, but it had no muzzle like a bear. I wondered if it could have been an elk because it was the right height, but I couldn't reconcile an elk with the other body features. It was only in view for 3-4 seconds and was not moving, only looking directly at my car as I sped by. I passed within 15-20 feet of it. I looked directly at it, and it had an angry expression on its face. It made my hair stand on end. I usually didn't travel via Cincinatti when I lived in Winchester (I live in Lexington now), and in subsequent trips along that stretch of road I have been unable to find the exact spot at which I sighted it. Perhaps the roadway has since been modified to eliminate overhanging rocks; there has been a lot of road work along that stretch in the last few years. And I've wondered if it was just the play of shadows from my headlights that gave the illusion of something standing there, but the shape of a shadow changes as the light source moves, and this figure did not change. I was not sleepy; I work a night shift so I'm usually awake at that time. I'm reasonably certain I saw something, just not sure what. In summary, whatever I saw was 6-6.5 feet tall, dark brown to black fur, bipedal posture, angry demeanor. And it appeared to be holding its arms/paws up at shoulder height, as though it were a tree, or stiking some pose intended to frighten me, which was very effective. My initial impression was that it struck a very human posture. I heard no sound and it it not move. ",
  "classification": "Class A",
  "county": "Grant",
  "state": "Kentucky",
  "latitude": 38.528,
  "longitude": -84.588,
  "location": "-84.588,38.528",
  "location_details": "30-40 miles south of Cincinnati, OH on Interstate 75.",
  "temperature_high": 36.88,
  "temperature_mid": 33.955,
  "temperature_low": 31.03,
  "dew_point": 25.46,
  "humidity": 0.79,
  "cloud_cover": 0.47,
  "moon_phase": 0.77,
  "precip_intensity": 0.0029,
  "precip_probability": 0.64,
  "precip_type": "snow",
  "pressure": 1027.51,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 6,
  "wind_bearing": 49,
  "wind_speed": 5.42
}