{
  "reportId": "41043",
  "title": "",
  "date": "",
  "observed": "Whenever my husband works midnights I can't sleep, so I came outside to sit on my steps and smoke a cigarette. I happened to look up because the dogs were barking at something. I looked up and saw this tall black figure standing and kind of peeking out from behind the shed. I looked at it and kind of squinted at it to see what I could see, it really wasn't moving. I went back inside my house and grabbed the gun, when I came back out it was gone. I don't know what he was doing there. It was just a big tall black mass peeking out from behind the shed. It was massive, it was big. I jumped up and ran inside to get the gun.  I was able to see its head, part of the shoulder and some of the knee. It was leaning out. It was seven foot tall, but it was sort of hunched over too. There is no lighting back there, only in the front of the house. We have a tree line that comes up behind our place. The treeline comes with about a hundred feet of the house. I don't know how many times I've been here by myself and heard something bang on that shed in the back. There were a couple of nights that I went out there with my gun, but every time I've heard a bang like something is hitting on it and the door had been left open. I don't know if something was trying to get in there, I know it is not the door banging because the door is on a track to hold it still. There has been other times by my camper shell I have heard noises, I've run inside and get the big light and shine it over there but nothing there. There are a lot of unusual noises I've heard over the years here that I've never been able to put what it was. There have several times when I have walked back to check noises at the shed where I felt something was watching me. I've also gotten that feeling a lot at my French doors because I don't have anything over them.  I'll be sitting on my couch and feel like someone is looking through that window and I'll look up and there is nothing there. And when I get this feeling I am home by myself. I have an apple orchard in the back , but of course this time of year there aren't any apples. But last year later on a lot of apples were gone. My husband picks up all the bad ones and throws them out in the field. I got to thinking about this because someone found a footprint recently between Bunker Hill and Staunton.",
  "classification": "Class B",
  "county": "Macoupin",
  "state": "Illinois",
  "location_details": "",
  "summary": ""
}