{
  "reportId": "2180",
  "title": "Two sisters witness bipedal animal walk through yard",
  "date": "1977-09-01",
  "timestamp": 241920000,
  "observed": "It was in 1977 and it was late summer or early fall.  I was about 6 or 7 years old and my younger sister and I were looking out our living room window and saw a big hairy ape-like creature walking upright. It walked across our yard and into the woods.  It looked like it came across the road from the angle it was walking but we didn't see it cross.  We didn't see until it was almost to the side of the house, it was only about 100 feet away from us and we got a good look at it.  I still live in the same house where this happened.  It was dusk but still bright enough outside to see well.  It looked right at us and of course it scared us at the time.  We told our mom but she didn't believe us, but to calm us she told us to hide in the bathroom. So we did.  It's hair was a dark redish brown but the red tint could of been from the sun going down. It was about 6'6\" or so, tall, stocky, broad shouldered, hairy, and naked.  It was not human, it had way too much hair for that. Most people in the area do not act too surprised when sasquatch are mentioned. I hope you can prove their existance for good but I hope that they don't get harmed in the prossess. They don't seem to harm anyone or anything and it would be a shame to harm them.  You never hear of anyone human or animal being attacked by them so why should we attack them?  I say take pics and film and sound but don't cage, cut, inject, tourcher, or harm them in any way. Leave them in peace and let them live like they are use to.",
  "classification": "Class A",
  "county": "Lawrence",
  "state": "Missouri",
  "latitude": 37.11433,
  "longitude": -93.71506,
  "location": "-93.71506,37.11433",
  "location_details": "The one I saw was right at Hwy. 174 and Hwy. N outside Mt. Vernon, MO.  Coming from I-44 you go towards Chesapeak and Republic on 174 about maybe a little less than 2 miles to N Hwy. and there is a convenient store on the corner that didn't use to be there.",
  "temperature_high": 88.62,
  "temperature_mid": 78.965,
  "temperature_low": 69.31,
  "dew_point": 69.21,
  "humidity": 0.74,
  "cloud_cover": 0.61,
  "moon_phase": 0.63,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.01,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 9.25,
  "wind_bearing": 177,
  "wind_speed": 4.64
}