{
  "id": "24508",
  "title": "Possible early evening sighting near Lake Namekagon",
  "date": "2008-08-18",
  "timestamp": 1219017600,
  "observed": "A guy of friend and I were fishing and spending a couple of days in northern Wisconsin. After a day of fishing we were driving back to the cabin at around 6 or 7 pm. After just passing(heading east) the Tahkodah golf course, I was looking out the back seat (on the drivers side) and saw this brown figure kneel down behind some bushes as we drove by. Due to the curves in the road, we were probably going around 25-35 mph. It lasted only a split second, and something didn't register right with what I saw. I was going to remain silent until the driver of the Jeep said, \"Did anyone just see that?\" He had seen the same thing-a brown figure kneel down, like a human, to hide behind the tall bushes. I affirmed that I saw it, but didn't know what it was, so wasn't going to say anything. I've seen bears fall from their hind legs to all fours and this wasn't the same falling forward motion. It was as though someone standing upright and then kneeling down, in a straight fashion, to a crouching position. We didn't go back to investigate b/c we were too scared.",
  "classification": "Class B",
  "county": "Bayfield",
  "state": "Wisconsin",
  "latitude": 46.25961,
  "longitude": -91.10812,
  "location": "-91.10812,46.25961",
  "location_details": "We were staying in a cabin on Hwy D, just north of Lake Namekagon. We were fishing on Lake Owen, which is to the west of Lake Namekagon. To get to our boat, we took Pioneer Road to Lake Owen. The sighting was just east of the golf course on Pioneer",
  "temperature_high": 75.05,
  "temperature_mid": 63.94,
  "temperature_low": 52.83,
  "dew_point": 58.65,
  "humidity": 0.7,
  "cloud_cover": 0.28,
  "moon_phase": 0.56,
  "precip_intensity": 0.0002,
  "precip_probability": 0.43,
  "precip_type": "rain",
  "pressure": 1013.74,
  "summary": "Partly cloudy until evening.",
  "uv_index": 5,
  "visibility": 9.97,
  "wind_bearing": 47,
  "wind_speed": 2.35
}