{
  "reportId": "44003",
  "title": "Close encounter while fishing remembered near Giant City State Park",
  "date": "2014-05-14",
  "timestamp": 1400025600,
  "observed": "I had previously written an Email to BFRO and explained my encounter with a sasquatch that we called the big muddy monster at a pond called A-41. Well guess what, I was just watching TV and they just ran a story about the same monster that I had encountered while I was going to Southern Illinois University in Carbondale, Illinois.  I was the bartender at the Midland Inn in Murphysboro, Illinois. This thing was in the wooded area behind where I was fishing. I kept hearing the brush breaking behind me but thought it was squirrels or deer or turkey. Then it started breaking whole trees, snapping them like they were twigs. I started getting very scared as the area I was fishing was miles from my truck or any roads. you had to trek in. Then a huge chunk of rock splashed into the water in front of me, then another. I turned around and it was standing there looking very pissed off that I was there. It immediately let out a scream. I can still imitate this scream. It starts out as a high pitched siren type scream that makes every hair on your body stand up. Then it gets higher pitched and is so loud you cant believe what is happening. With one step this thing could have reached out and twisted my head right off my shoulders. I knew I could not out run it so I just froze. I could not believe what was happening or what I was seeing. This thing was 5 feet wide at the shoulders. I was on the lower side of the hill so I could not get a real good estimate on height but I'm going to say it had to be at least 7 feet high. Nothing but pure muscular athletic bodybuilder outlined upper torso. A couple seconds after it screamed I was trying to think of an escape and turned away from it. It retreated back into the woods so fast that I lost sight of it against the wooded background almost immediately. I grabbed whatever gear I could and started running back down the trail as fast as I could. I don't know what I left there or what I took with me. I ran as far as I could until all I could do was a fast jog all the way back to the car. I was playing rugby for SIU at the time and was in pretty good physical shape. The whole time I was running I was thinking that it could have over took me at any time. There is more to this story. I had been fishing for bass with large shiner minnows for a couple hours. I was hearing something behind me in the brush. I kept fishing, something was stealing my bait off the hook time after time but I could never hook anything. A fat black water moccasin surfaced around the bank so I switched hooks to a #5 treble hook and snagged it. When I set it down on the bank and beat its head in with a stick, That's when all hell broke loose. To me it seemed that the creature was watching me the whole time I was fishing. After I killed the snake and wrapped it around a branch I pinned it to a tree. Right then is when the huge rocks hit the water, trees started snapping and I turned around to the scream. This is a true story. I fished this small lake several times before this happened but have never returned. My memory will never forget this spot on the lake, the snake, the scream, the creature. It has been over twenty years. Story has always been told the same. I told this story to a BFRO rep. about four years ago and I think it was the guy who covers Jackson County, Illinois. I told him about the A41 lake and that he could find what he was looking for right there. He asked me to make a report on the site but I did not. Now after seeing this episode of Monsters and mysteries in America and the guy from the Murphysboro salvage yard describing the scream exactly I knew I had to come forward. This is true and it really does exist.",
  "classification": "Class A",
  "county": "Jackson",
  "state": "Illinois",
  "latitude": 37.63264,
  "longitude": -89.17177,
  "location": "-89.17177,37.63264",
  "location_details": "This is a small lake on a map created by Illinois Department of Conservation. I was fishing this lake because it had a 21 inch length minimum limit. Listed as lake A-41 in Jackson County Illinois.",
  "temperature_high": 52.85,
  "temperature_mid": 50.135,
  "temperature_low": 47.42,
  "dew_point": 49.17,
  "humidity": 0.9,
  "cloud_cover": 0.37,
  "moon_phase": 0.49,
  "precip_intensity": 0.022,
  "precip_probability": 0.96,
  "precip_type": "rain",
  "pressure": 1018.14,
  "summary": "Rain in the morning and afternoon.",
  "uv_index": 6,
  "visibility": 7.25,
  "wind_bearing": 350,
  "wind_speed": 9.23
}