{
  "reportId": "7036",
  "title": "Elk hunter trailed by large biped in twilight, finds tracks the next day",
  "date": "2003-09-17",
  "timestamp": 1063756800,
  "observed": "I'm not sure even how to tell the events as they unfolded. All I know is that a large something followed me from a place I was sitting half way back to camp. At first I thought it was a back bear until I came to a large open field on top of the mountain. I had walked out of the heavy timber on a trail to an open field (the moon was very bright almost like daylight in the field , it was very easy to see my surroundings). I walked to the middle of the field, sat and waited, and nothing happened. So I continued on, reaching the heavy timber on the other side of the field on the trail. I turned and looked back and noticed a large black bump sitting where I waited just moments ago. Then it stood up and walked right at me. Then I said “Hey you” in a loud voice. Then it turned and it walked or ran very fast directly to the north into the timber. No noise, but it looked to be like a bear due to the heavy coat. But when do bears walk like humans? And it had a large swinging motion on the torso area. Very weird. So I'm afraid really to tell this story because I do not want my friends or family to know about this. It's such a weird thing to tell people.",
  "classification": "Class A",
  "county": "Pitkin",
  "state": "Colorado",
  "latitude": 39.45824,
  "longitude": -106.625,
  "location": "-106.625,39.45824",
  "location_details": "The sighting location was about 7 miles east of Aspen at the top of the  Hunter Creek drainage of the Hunter-Fryingpan Wilderness Area.",
  "temperature_high": 68.03,
  "temperature_mid": 47.48,
  "temperature_low": 26.93,
  "dew_point": 28.28,
  "humidity": 0.35,
  "cloud_cover": 0.37,
  "moon_phase": 0.72,
  "precip_type": "rain",
  "pressure": 1003.98,
  "summary": "Breezy in the afternoon and light rain starting in the afternoon, continuing until evening.",
  "uv_index": 7,
  "visibility": 9.98,
  "wind_bearing": 248,
  "wind_speed": 6.8
}