{
  "reportId": "5493",
  "title": "Young camper has early morning encounter.",
  "date": "2005-03-19",
  "timestamp": 1111190400,
  "observed": "My family (5) and I go on vacation every year. One year we decided to go to Colorado on a camping trip. We also would always our dog and this year my brother took his rat.  After a long trip across Kansas, we finally crossed the border to Colorado. We headed to Colorado Springs. We were going to stay at a camping trip, but as usual we found a place to set up camp away from any sites or towns. It was pretty secluded where we were. Our camp site was surrounded by woods except to the east there was a long field. Now it was the very first night and we had two tents. In one tent was my Parents and my sister. In the other tent was my brother his pet rat and I. We ate a good meal of hot dogs and s'mores. A sitting around the fire for a little while, we went to bed. It was a very clear night and I remember how bright the moon and stars were. I really ever heard of \"bigfoot\" or paid to much attention to it before. It seemed like I hadn't had much sleep before I awoke to find my brother's rat digging around in the bag at the top of the little pup tent(my brother let the rat run around in the tent). Its rustling is what I think woke me up. So I got up to take him out, but I froze as did my blood. I was suddenly wide awake. I just stared because to the left of me I saw the silouette of a tall two legged creature through the door( we had zipped up the screen and left the cover off ).  I was and still am sure that it was not a bear or any other animal, and I am especially sure it was no human. Its arms were shorter than its legs and it was covered with hair. I got the feeling it was alarmed because right when stopped a jerked its head and walked speadlily away. My eyes were glued to it and I watched its every move. It walked away towards the field, turned around, and I lost sight of it. I can still remember thinking about the way it moved. It definatly was not normal. It bent at the knee and when it turned, it seemed like its whole upper body moved around. Of course the next day when I told my family no one believed me, but I know and I have known that it is a fact that sasquatch is real and is a living breathing animal. I also believe that it is not a threat. I definatly encourage people who are trying to bring sasquatch into reality for others for the right reasons. Ever since then I been very interested in it and cryptozoology.",
  "classification": "Class A",
  "county": "Teller",
  "state": "Colorado",
  "latitude": 39.11636,
  "longitude": -105.2155,
  "location": "-105.2155,39.11636",
  "location_details": "off the road from Woodland Park to Decker.",
  "temperature_high": 49.67,
  "temperature_mid": 38.885,
  "temperature_low": 28.1,
  "dew_point": 20.09,
  "humidity": 0.59,
  "cloud_cover": 0.46,
  "moon_phase": 0.31,
  "precip_intensity": 0.0007,
  "precip_probability": 0.2,
  "precip_type": "snow",
  "pressure": 1010.74,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 9.63,
  "wind_bearing": 188,
  "wind_speed": 3.89
}