{
  "reportId": "18793",
  "title": "Possible whoops heard in logging area outside the Monongahela National Forest",
  "date": "2007-05-20",
  "timestamp": 1179619200,
  "observed": "Before I say anything more I would like to say that at the time I never considered that Sasquatch were real. I considered it all to be a hoax. I am a student studying wildlife biology. The following happen in West Virgina, Pocahontas County, near the Monongahela National Forest. MeadWestVaco owns and operates 3413 hectares in the Allegheny Mountain range for logging and ecological reseach. It is gated and not open to the public see website.  I was participating in a study project studying the distribution and breeding success of songbirds in forest cutting sites. The study was headed by West Virgina University. My job was to search for bird nest of particular species and track their progress from egg to fledge. I was familiar with every kind of bird in the area by call, as it was one of my job requirements and hobbies. I was just coming down from the top of this ridge in a clear cut area with many downed trees, slash and new growth only about waist high. I heard the strangest sound coming from above on a ridge or rock outcropping about 100 yards above. It was a \"whooping\" sound. It was very loud vocalization. Its sound was resonating through the whole valley below and carrying very far. The only sound I could match it to was a monkey call in a tropical forest (which I have never experienced). It was a very alarming call, and I assumed it was some kind of bird that I have never seen or heard before. I scanned the trees, bushes and rocky outcrop for a silhouette of a bird with my binoculars but did not spot anything. The call lasted for about 3 to 4 minutes. The \"whooping\" was repetitive, about 15  \"whoops\" and then a pause, and then 10 to 15 more about 4 sets in all. It felt like it lasted a long time. The entire time I was scanning the vegetation looking for a bird. It was so loud and deep I often thought it couldn't be a bird but it was my only conclusion. When it stopped I made my way up to the spot where It was coming from. It took me about 10 minutes to walk along logging trails and through vegetation to get there. Once I got to the summit of this ridge it flatted out. I remember seeing many game trails and beaten paths. This was common in some areas due to heavy use by deer. I started walking around looking into the trees which consisted of Eastern Hemlock and mixed hardwoods. I heard nothing. It was strangely quiet, like everything was scared off from the call. I traversed the slope very excited that I may see possibly an invasive species of bird, but when I got to the top of that ridge I felt very uneasy. I cant explain it. I never wanted to go back up to that spot after this incident. I wrote down exactly what I heard. When I went back to camp that evening, I told the ornithologists what I had heard and they said the only bird that makes such a loud and similar sound as that was a Yellow-billed Cuckoo. I listened to sound recordings of the Yellow-Billed Cuckoo that night and quickly realized that was not the sound I heard. I also called my father, an avid birdwatcher and told him about it. Then last month I watched a program on the Discovery Channel about Sasquatch.To reiterate, I was not a believer at that time and am still borderline. Watching the program peaked my interest to search online. I came across this website. I noticed that an expedition was done in almost the same spot where I had worked, just further north. I also listened to the audio recordings from  the Berry-Morehead Expeditions in the 1970's from the Sierra Nevada Mountains. When I listened to the \"Whoops and Knocks\" audio clip it was the exact call I had heard but in a different sequence. I was, and still am floored and in awe. The only thing that stops me from believing it was a Sasquatch is not knowing anything about the authenticity of that recording, but I am certain it was that same kind of \"whoop\".",
  "classification": "Class B",
  "county": "Randolph",
  "state": "West Virginia",
  "latitude": 38.8762,
  "longitude": -79.95695,
  "location": "-79.95695,38.8762",
  "location_details": "Private property. Edited out at the request of the witness.",
  "temperature_high": 68.95,
  "temperature_mid": 61.69,
  "temperature_low": 54.43,
  "dew_point": 45.7,
  "humidity": 0.61,
  "cloud_cover": 0.49,
  "moon_phase": 0.14,
  "precip_intensity": 0.0005,
  "precip_probability": 0.75,
  "precip_type": "rain",
  "pressure": 1018.37,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 8,
  "visibility": 9.78,
  "wind_bearing": 263,
  "wind_speed": 5.92
}