{
  "reportId": "1136",
  "title": "Creature seen stepping over four foot barbed wire fence near the town of Louisiana",
  "date": "1972-07-15",
  "timestamp": 80006400,
  "observed": "It was a moon lit night just about dusk a friend and I had gone to a party but it was a bust. When we got to the place out of town. I took off by myself down the road towards the East back to Route 70 to wait. I had been walking for about 25-30 minutes when the wind shifted from the South. I smelled something awful a cross between a skunk and rotten flesh, like something died. As I was walking along the South side of the road I noticed someone walking about 300-400 feet away along the edge of the woods on the South side of pasture. I thought it was kind of late for a farmer to be bringing his cows in as they were in a big hurry to get away from him. About that time I heard a God Awful blood curdling scream which I thought was the cattle screaming. I stopped to look accross at the farmer and he also stopped and stood still looking at me, which I considered odd. As I continued East I watched as he matched my every move and would stop and stare when I did. The cows were gone buy now and the stench was getting stronger as what I thought was a man angeled his way closer to me. I stopped and stared right at the thing ( at that point I knew it was not a man as it was only walking and I was almost running ) it was coming straight for me. It stood close to eleven foot tall and was covered with thick matted redish brown hair. I took off running as fast as I could for the next light down the road. It was a long way off, and as I looked over my shoulder it stepped over a four foot high barbed wire fence with out touching the wire. I knew I was in trouble. I ran for the far away farm house as fast as I could go. My adrenalin going and was scared out of my wits. As I approached the fence to get to the house towards the South, I realized that not only was the house much farther then I thought, but I was met by a pack of farm dogs at the gate. As I jumped the gate ( I don't even think my feet touched the gate ) into the pack of dogs I didn't dare look back. I ran to the home of a farmer and pounded on the door but the farmer would not open the door. I looked at the farmer and I could tell he had seen the creature by the terrified and confused look on his face. I was so scared that I sat down on the porch in a ball and waited for the creature to leave. When I looked up the creature was headed towards the same pasture it had come from with the dogs chasing after it. That was the last I saw of it. I ran and hid behind a tree until my friend joined me. I did not tell my friend what had happened. I have raised three daughters now and for years I told the story of the monster while we were camping. About three years ago I was messing around on the web and came across Bigfoot website. I decided to check in the area and found multiple sightings of the monster at the exact time and place of my misshap.",
  "classification": "Class A",
  "county": "Pike",
  "state": "Missouri",
  "latitude": 39.3735,
  "longitude": -91.093,
  "location": "-91.093,39.3735",
  "location_details": "",
  "temperature_high": 81.79,
  "temperature_mid": 73.765,
  "temperature_low": 65.74,
  "dew_point": 69.69,
  "humidity": 0.8,
  "cloud_cover": 0.88,
  "moon_phase": 0.17,
  "precip_intensity": 0.0201,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1011.24,
  "summary": "Heavy rain in the morning.",
  "uv_index": 6,
  "visibility": 9.11,
  "wind_bearing": 266,
  "wind_speed": 5.28
}