{
  "reportId": "1768",
  "title": "Lifelong hunter hears strange screams in early morning twilight directly under tree stand",
  "date": "1988-11-01",
  "timestamp": 594345600,
  "observed": "Deer hunting from a tree stand approx. 15 feet high. Arrived way too early, maybe an hour or more before daylight. I climbed into my tree stand and reversed the batteries in my flashlight to keep it from coming on in my pack, as I usually hunt all day until after dark in the evening. I had settled down and was waiting for shooting light. Quite some time had passed, enough time for everything to grow quite and me to cool off from the hike to my tree stand. Without any warning, directly underneath my stand came the most horrible sound imaginable. It started as a low guttural roar, somewhat as a lion or large cat might make. Then ascended in the scale until it was a horrifying, piercing, scream, that lasted several seconds or at least seemed to. I cannot describe how scary, and unnerving this scream was. Words do not convey it. After gathering my wits I comforted my self that I had a loaded 30/06 and nothing on earth could survive the 15 foot climb up that tree. I sat very still and strained every sense I had for whatever it was to reveal itself. I made no attempt to retrieve my light and reverse the batteries. I really thought I was about to be attacked by something that only the word MONSTER would convey. The night was a totally moonless night, absolutely dark. But the leaves were very, very dry and crunched under foot. I absolutely knew that nothing could move that close to me without revealing it's whereabouts via sound. I sat and waited until daylight and saw nothing. The area was somewhat dense at ground level with laurel, my tree stand was above the growth. I am a life long hunter and have spent thousands of hours in the mountains. Nothing could have moved that closely, under those conditions, without sound, BUT IT NOT ONLY APPROACHED MY TREE STAND, IT ALSO LEFT WITHOUT A SOUND. After daylight I searched for tracks, spoor, hair, in the area. There was nothing. Up until that day I always walked to my tree stands with my rifle unloaded and never loaded it until I was in my stand. Needless to say that has stopped, I would no more walk in those woods with an unloaded gun than I would attempt to fly. I was embarrassed and did not wish to be labeled as someone that told tall tales. But I did tell those that hunted with me in that area. For one reason, genuine concern for their safety. I know what I heard. It was large, it was horrible, it was menacing. The thing I heard was no laughing matter. Words cannot convey the seriousness of what I heard. I also drove to the Peaks of Otter and told a Ranger there and asked if anyone had ever reported strange sounds, as I had heard a monster. He said they have had reports. Then tried to convince me that I had heard an owl. This is insulting. I have hunted all my life and killed most every type animal in Virginia, this was no owl. Even if it was a large bird of some kind, I was so close that I would have heard wing beats, or the rush of air as it flapped to get air borne. I heard nothing but the Roar/scream. I might add that it became a matter of courage to continue hunting in the area, but I did. And in the general area killed a deer and a black bear that year. No one hunting with me heard anything that day. But later on in the season, I think the same week, two people heard the same thing on a ridge above the car after hunting all day and returning to the car after dark. The reason I am supplying the story now is that while recently at the YMCA working out I overheard a conversation about someone encountering what they thought was a \"bigfoot\" in that general area. Apparently they also smelled the thing. I however did not smell anything. But what I heard was enough.",
  "classification": "Class B",
  "county": "Bedford",
  "state": "Virginia",
  "latitude": 37.53434,
  "longitude": -79.49707,
  "location": "-79.49707,37.53434",
  "location_details": "George Washington and Jefferson National Forest off of the Blue Ridge Parkway in Amherst County Virginia, White Oaks Flats area.",
  "temperature_high": 57.72,
  "temperature_mid": 48.25,
  "temperature_low": 38.78,
  "dew_point": 35.68,
  "humidity": 0.71,
  "cloud_cover": 0.64,
  "moon_phase": 0.76,
  "precip_intensity": 0.0141,
  "precip_probability": 0.81,
  "precip_type": "rain",
  "pressure": 1012.66,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 6.75,
  "wind_bearing": 314,
  "wind_speed": 4.89
}