{
  "id": "17175",
  "title": "Possible bluff charge toward a hunter in a blind near Copemish",
  "date": "1995-11-15",
  "timestamp": 816393600,
  "observed": "We deer hunt in a very remote and thickly wooded swamp.  It is very difficult to walk through, not because of lots of water or mud, but there are fallen trees and dense small trees and brush.  My encounter occurred very deep in the swamp, almost 1/2 of a mile from the closest road or field.  I had been in a ground blind (a clump of fallen trees) all afternoon and I was facing south.  It was getting dark and I had heard some noises (not uncommon for dusk with all the animals in there) to the NE.  I waited until it was completely dark or a little after and abruptly started getting ready to depart.  I was on my knees packing up my gear and made alot of noise and flashlight movement.  After about 5-10 seconds I was shocked by the sound of a massive animal crashing through the woods to the NE headed South.  It got a little closer as it ran by at about 20 yards at the closest and I heard it for about 40-50 yards.  I immediately thought \"there is a huge hunter with no flashlight running at me\" which of course was ridiculous since I am one of the few people to even have ever walked in there.  It was not a deer which I have experienced countless times, the noise they make running through the woods is more varied and continuous.  This noise was very much a person running sound with the \"bang, bang, bang\" type pattern.  For all these years I have assumed it was a very large bear, but could never explain how it could run through those woods in such a straight line at a speed of a man running, and I have wondered if a bear could make the rhythmic \"thump, thump, thump\" sound of footstep crashes.  (There are alot of branches to break on the swamp ground).  Lately I have tried to understand what happened, and have only recently wondered if it was a large Bigfoot.  It didn't bother me too much back then.  It was completely dark and I never saw anything.",
  "classification": "Class B",
  "county": "Manistee",
  "state": "Michigan",
  "latitude": 44.4887,
  "longitude": -85.93575,
  "location": "-85.93575,44.4887",
  "location_details": "(removed per witness)",
  "temperature_high": 32.16,
  "temperature_mid": 30.565,
  "temperature_low": 28.97,
  "dew_point": 18.35,
  "humidity": 0.71,
  "cloud_cover": 0.79,
  "moon_phase": 0.76,
  "precip_intensity": 0.0008,
  "precip_probability": 0.41,
  "precip_type": "snow",
  "pressure": 1016.1,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 8.86,
  "wind_bearing": 338,
  "wind_speed": 9.41
}