{
  "reportId": "14373",
  "title": "Possible daylight stalking and knocking heard by hunter near Deposit",
  "date": "2005-10-01",
  "timestamp": 1128124800,
  "observed": "My unusual experience occurred during the first week of October 2005. I was scouting for deer in a very isolated and limited access area in upstate New York accessible by a 4 x 4 trail. I had scouted another area earlier during the day and had about 2 hours of good daylight left to scout this area. My standard practice is to drive the entire length of the valley to check the parking areas as to see where other hunters are located before scouting. On this day, like most during pre archery and archery season, I was the only person and vehicle on the 4000 acres. I turned around and headed back up the valley to where I wanted to scout. It was a nice sunny fall day but the sun was beginning to drop. I parked my truck, grabbed my backpack, and headed down a steep ravine into a creek bed. I crossed the creek and proceeded up the other side of the wooded ravine. There is a field at the top of the ravine that I crossed and a hedgerow that separated a hidden field on top.  I wanted to check some apple trees for apples. On the far side of the hidden field is a large pile for rocks that appear to be the foundation of an old homestead. I usually climb on top of the rock pile because it is high enough for me to glass the entire field to the top, which is a couple hundred yards. I glassed the field and saw nothing, which is odd for that time of day but not unheard of. A deer trail crosses in front of the rock pile and heads into a marsh area with a thicket on the backside of the marsh. The thicket is a few hundred yards wide then breaks into a mature open hardwood where I wanted to scout for a tree stand location. I was about halfway across the marsh when I heard a very loud, deep, resonating growl or roar. It stopped me dead in my tracks and came from the thicket I was headed into about 100 yards away. I have never heard anything in the woods in my 25 years of hunting like it. It was not a cat, coyote, dog, and I do not think a bear. I did see a very large bear the season before in this area at 20 yards but he did not make a sound when I waved him off. He just stood up and looked at me then turned and ran off about 50 yards before walking again. I had a rifle at the time and the bear did not see me until I waved at him. He was walking straight down the mountain at me where I was sitting on stand next to a huge boulder. One year I did spook a bear out of a small orchard and he kind of \"woofed\" at me as left the area. But this sound wasn't anything like a \"woof\" it was more of a roar that lasted about 1 to 1.5 seconds. I was shocked and taken back by it. After stopping dead in my tracks I spotted a big flat rock a few feet away. I climbed up on the rock and took my pack off. What ever made the noise was very large so I dug out my hunting knife and put it on my belt. I usually carry a sidearm when scouting but they are not allowed in this area. That day I wish I had one with me. I glassed the thicket with my binoculars but I could not see anything that could have made the sound. After about 5 minutes of looking, I wrote it off as a bear and decided to change direction and go check another field that is over the hill from the field I crossed to get to the marsh but at other end of that field. I started walking up the marsh parallel to the thicket and to my surprise and shock; whatever was in the thicket was walking parallel to me or flanking my right side. I could hear it snapping limbs and twigs as it walked. This was something heavy at least the size of a deer, bear, or person. I never heard anything scamper or scurry in the leaves like a small animal will eventually do if you listen long enough. I could hear it busting through the saplings. At this point I decided to get out of the marsh and into 75 to 100 yard wide hedgerow and that runs between the field I crossed and the marsh. This also would lead me away from the thicket. I could not hear whatever was in the thicket after I got into the hedgerow. I was about in the middle of the hedgerow on an old logging road that runs parallel to the field I crossed to get to the marsh when I ran across something odd. There were two trees about 20 to 25 feet in height bent completely over and parallel to the ground across the logging road. The trees were a good 4 to 5 inches in diameter. There was no obvious damage to the trees and the trees were alive with green leaves on them. I kept walking up the hedgerow and toward the field at the top. I arrived at the top of the hill and top of the field I had crossed to get into the marsh. There is a hedgerow that separates the two fields. I glassed the second field for a few minutes and saw nothing. I had yet to see any kind of wildlife on this scouting trip. The sun was starting to get very low in the sky so I decided to start heading back to my truck. I knew if I followed the top hedgerow down the hill I would pass a couple apple trees and it would lead me to the top of the ravine. I kept following the hedgerow down the hill until I almost reached the top of the ravine. I stopped to check for deer sign around a couple of apple trees. As I was looking for sign, I heard a series of \"knocking\" noises coming from about the area where I crossed the ravine on my trip up into the fields. I would estimate the knocking was 200 to 250 yards away. It was not a woodpecker because the time between knocks was too long and it was a more dulled whack rather than a hollow sound a woodpecker makes. A woodpecker has an almost machine gun sound to it. I heard a series of about 4 or 5 knocks then 20 seconds later another series and then another series. At this point, I got kind of spooked because it seemed whatever was in the thicket had backtracked me to where I had crossed the creek and ravine at the start of my scouting trip. The sun was starting to set behind the mountain and it was going to start to get dark quickly. I was literally miles from any main road or person and in the middle of nowhere. If whatever was backtracking me continued to do so, then we were going to end up at the same place, my truck. My original plan was to walk the top of the ravine back down to where I had crossed the first time because it is easier to climb back up the hill.  Well, that is where I was hearing the knocking noise coming from so I decided I didn't want to get any closer to the source of the knocking. I headed straight down the side of the ravine into the creek bottom. It much darker in the creek bottom and everything was in shades of gray. I stopped for a moment to catch my breath before I started up the other side of the ravine to my truck. As I was standing there catching my breath, I started hearing rocks landing on the rocks in the creek bed a couple of hundred yards downstream from me. I could not tell if they were rolling down the hill and landing on the rocks in the creek bed or being thrown. I could hear the rocks land on other rocks and roll around a bit. This happened 5 or 6 times. After hearing this, I just headed straight up the other side of the ravine grabbing trees to pull myself up and got out of there as quickly as possible. I hit the jeep trail about 75 yards above where I parked. I made a beeline for my truck, dumped my pack in the passenger side and drove out of there as quickly as I could and the trail would let me. It was four wheel drive low range all the way out. I kept checking in my side and rearview mirrors for anything on the road behind me. I never saw anything on the road behind me. Was it a bigfoot? I can't say that. I can say that I have never heard a roar or growl like that in the woods. I researched the Internet on animal vocalizations but could not find anything that was an exact match. The closest match was a snarling wolf but it was not the sound I heard. I listened to the bigfoot vocalizations on this site and can not say that is what I heard either. The thing roared or growled once and it was kind of short. It startled me and I didn't get a second chance to hear it. After reading some of the reports on this site, the unusual events that occurred that day match other people's experiences. There are also reports on this site that are from the same area as I was scouting. I was back in the area again during gun season 6 weeks later and did not see or experience anything unusual. I usually don't spook very easy and travel the backcountry alone quite often. I will admit, that day I was spooked by something.",
  "classification": "Class B",
  "county": "Delaware",
  "state": "New York",
  "latitude": 42.0837,
  "longitude": -75.38025,
  "location": "-75.38025,42.0837",
  "location_details": "Witness requested location details be kept confidential",
  "temperature_high": 71.66,
  "temperature_mid": 58.945,
  "temperature_low": 46.23,
  "dew_point": 44.08,
  "humidity": 0.69,
  "cloud_cover": 0.03,
  "moon_phase": 0.94,
  "precip_intensity": 0.0054,
  "precip_probability": 0.44,
  "precip_type": "rain",
  "pressure": 1025.18,
  "summary": "Clear throughout the day.",
  "uv_index": 4,
  "visibility": 9.7,
  "wind_bearing": 174,
  "wind_speed": 3.55
}