{
  "reportId": "1213",
  "title": "Encounter on Toledo Bend",
  "date": "2004-02-03",
  "timestamp": 1075766400,
  "observed": "Reported on behalf of a friend who wishes to remain anonymous. While fishing from a small boat close to shore on the Texas side of Toledo Bend, D.R. noticed a strong, musky/fecal odor for several minutes before actually seeing anything. The shore sloped gently up from the water, and was covered with short grass. This offered an unobstructed view to the trees which began growing approximately 20 yards up from the bank. These trees were short (approximately 5-10 feet), and spread far apart. D.R. cast his line into the shallower water toward the bank and that is when he noticed what he thought was someone watching them from the treeline. He also noticed that the creature was attempting to hide behind one of the short trees. It was very still, and did not move for several seconds (reckoned to be two to three minutes). At that point, the creature stood up straight (it had been semi-crouched behind the tree), walked into the open and looked directly at the boat, and then turned and walked slowly up the bank and into the heavier trees. The distance was later to be estimated at 60 to 70 yards before the creature disappeared into the forest. D.R. described the creature as being 8 to 9 feet tall, covered with the exception of the face with reddish-brown hair.    A companion in the boat noticed the smell, but never saw the creature.",
  "classification": "Class B",
  "county": "Sabine",
  "state": "Texas",
  "latitude": 31.56,
  "longitude": -93.87194,
  "location": "-93.87194,31.56",
  "location_details": "Approximately halfway (North to South) down Toledo Bend Reservoir. Unknown exact mileage from nearest town.",
  "temperature_high": 54.11,
  "temperature_mid": 47.615,
  "temperature_low": 41.12,
  "dew_point": 28.83,
  "humidity": 0.63,
  "cloud_cover": 0.18,
  "moon_phase": 0.41,
  "precip_intensity": 0.0006,
  "precip_probability": 0.52,
  "precip_type": "rain",
  "pressure": 1025.04,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 4,
  "visibility": 9.45,
  "wind_bearing": 47,
  "wind_speed": 4.25
}