{
  "id": "2176",
  "title": "",
  "date": "",
  "observed": "A friend and I went driving to camp in Oregon on Hwy. 199 in the Fall of 1985. We didn't want to stay at a pay site so we pulled off on a side spur road in dense forest and set up a tent. We had our two Malamute-cross dogs with us who had been by our sides in many back-country adventures. As we set up our sleeping bags in the tent the dogs began growling very menacingly with the hair up full on their backs. We thought there might have been a bear around and worried that they would take off after it and be difficult to catch. We left them outside anyway and crawled into our bags to sleep. Then the dogs began whimpering and trying to claw their way into the tent. We nervously let them in and not long afterwards began to hear howling; first just one voice but then followed by many voices. I would estimate that the sounds came from about 100 yards away. It was reminiscent of hearing a coyote pack or wolf pack but these were not canine voices. They ranged in pitch from \"childlike\" to adult male and higher female voices. It sounded like a really loud frat party in the middle of nowhere on a stormy blustery night in the dark. It sounded like the people were talking very loud yet howling at the same time. I've had many experiences hearing coyote packs and this was not what I heard. I have no further explanation. We braved through the night and got the heck out of there in the morning. The second \"experience\" I had at Avenue of the Giants was with the same friend while we were hiking a trail there. It was again the Fall of 1985 about a month later than the first. We had a map with us and decided to cut a loop short by going cross-country through the dense redwood forest. Not long after we got started, the dog we had with us (same as one of the dogs previous) lunged out full on his leash and began dragging my friend up a steep incline. We reached the top and noticed large foot-shaped impressions (maybe 14-18 inches long and 8-10 inches wide) in the duff below. Above us on the length of ground the dog drug us through, branches were snapped off clean up to 10 feet high on the trees. We made our way back to the main trail with no further incident.",
  "classification": "Class B",
  "county": "Humboldt",
  "state": "California",
  "location_details": "Off Highway 199 just south of the Oregon border. Also at Avenue of the Giants off Hwy. 101 Humboldt County, California.",
  "summary": ""
}