{
  "reportId": "490",
  "title": "",
  "date": "",
  "observed": "My family would spend the summers in the mountains and help herd sheep. We had a cabin, corrals, tents, several other structures on the property and occasionally would have some weird experience with our animals. The dogs would bark at something unseen to us and the sheep would run away from something hidden in the forest, we would just feel like something was watching us from the shadows. It was near dusk and my family had just finished dinner and were socializing. I had been thumbing through a book when John, who I will call to respect his privacy, came running in the shade house we built next to the cabin crying and white as a sheet. He was always the macho type that showed no emotion so to see him this frightened alarmed my grandmother and my aunts and uncles to hurry out the front door. They stood at the threshold looking down in the direction of the well. I put the book down and walked to the door. They were all whispering in Navajo when I saw something down at the well. I first was excited because I thought it was a black bear. Then I noticed it was a grayish/brown color and was kneeling. I never heard of a bear that could kneel like a man. It looked as if it was washing something off or taking a drink. I had no problem with it until it looked over it's shoulder at us and I could see it's features. Manlike. That was all I needed to see. I ran into the cabin and hid in the bed under the covers. I was younger and to this day when I ask my mother about it she says that everyone else was in agreement that it was a Bigfoot. A few weeks later it was standing outside of our tent about 2 a.m. I saw the shadow on the tent, as for the dogs, they were not making a sound when typically when anything or anyone comes around they howl and bark.",
  "classification": "Class A",
  "county": "San Juan",
  "state": "New Mexico",
  "location_details": "Near mountain lake in the Chuska Mountains on the New Mexico/Arizona border. There is a road that runs the length of the mountain chain.",
  "summary": ""
}