{
  "reportId": "22742",
  "title": "Hikers hear possible vocalizations near Cascade Locks along the Columbia River",
  "date": "2008-05-23",
  "timestamp": 1211500800,
  "observed": "My friend B.P. and I decided to spend an evening at Eagle Creek State Park along the Columbia River on I-84 at milepost 41 East of Portland, OR. We had a cook out  camp fire in the Community Kitchen there. It was on April 9th, 2001, a Monday, which we purposely chose to avoid the crowds. Not that there are many people out there in the Winter but a Monday evening will usually guarantee no others will be around. It was cold out, just above freezing, and it had been raining quite a bit earlier.  We had a nice dinner. We had cooked on our portable BBQ earlier in the evening which had included BBQ steak. We had already picked up and put away all of our gear so we were ready to go when we wanted to. At 11:50 PM we had just looked at our watches thinking it was time to go, when from across the creek, about 200 yards away, came a shrieking yell that both startled and shocked us. The yell came from across the creek, up on a ridge due west of us.   At first I thought it was an emergency siren going off at nearby Bonneville Dam, but the siren quality of yell quickly turned into a very breathy roar of some very large animal. It lasted about 10 seconds. We stared at each other in disbelief. Before either of us could utter a word, another yell, just like the first, came from behind the Community Kitchen no more that 100 feet from us.  This was the first time that I had ever experienced the hair standing up on the back of my neck.  I thought I would have been able to identify any animal that lived in the forests of Oregon but this call was completely new to me. We stood there silent, listening for about 5 minutes. We knew that we were right in the middle of the two calls so maybe these two animals were going to meet right where we were standing.  We then decided to leave. I was so glad. When I was inside my truck we locked the doors right away. We did leave our left-over food behind for them in case they were interested in that. I was skeptical about Bigfoot before but I try to keep an open mind.  The only place I have heard the same exact calls since was in a film that was a 70's Class B movie called The Bermuda Triangle. Another thing to note on that occasion was that the snow line was unusually low still for that time of year. We thought that maybe this had driven these bigfoots down low in search of food. We were up there a few more times that year with our recorders but never heard another thing.",
  "classification": "Class B",
  "county": "Hood River",
  "state": "Oregon",
  "latitude": 45.38736,
  "longitude": -121.5134,
  "location": "-121.5134,45.38736",
  "location_details": "Was right inside the lower park south of the ranger station and fish hatchery at the Community Kitchen.",
  "temperature_high": 72.57,
  "temperature_mid": 60.625,
  "temperature_low": 48.68,
  "dew_point": 46.32,
  "humidity": 0.8,
  "cloud_cover": 0.92,
  "moon_phase": 0.61,
  "precip_intensity": 0.0036,
  "precip_probability": 0.68,
  "precip_type": "rain",
  "pressure": 1005.76,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 9.54,
  "wind_bearing": 315,
  "wind_speed": 3.72
}