{
  "reportId": "23330",
  "title": "",
  "date": "",
  "observed": "I was talking with my sister in the spare room. She and her kids were spending the night. Her kids were sleeping and she was just getting into bed. My two dogs were barking outside, so I decided to take them for a walk since I figured they wanted me to take them out of the cage to do their business. I went to the backyard and opened the cage, but before I let them out, I placed the leash on their necks so they wouldn't run around and make trouble. They were barking more then usual, like when company arrives in the drive way, but there was no one.  I went to the front of the house and got to the street. I noticed that the bushes in front of the neighbor's house were moving and thought it may be a deer. As I kept walking I looked back to the bushes with curiousity and I noticed a figure walking from the bushes towards the back of the neighbor's house. Their entire front and back yard was lit due a full moon and I could see a human shape going towards the back slowly, almost like hiding. It was weird because I could see the reflection of the moon on its entire body, as if it was wearing something that reflected the light very well. I turned around with the dogs and went down the hill towards the end of the street. I kept looking to the left since I knew that whatever I saw (if it wasn't human) had to cross an opening across the other neighbor's front yard to escape into the woods. As I approched the mailbox of the last house of the dead end, I kept looking to the house on the left, their driveway went up hill. The full moon illuminated the driveway very well. I stopped and waited about a minute. The dogs started barking even more. Then I saw something running on two legs across and the dogs wanted to go after it, the chain almost slipped from my hands and they were pulling so hard. The thing ran across and went into the trees. The entire body had what appeared to be hair all over. I couldn't tell  whether the fur was dark gray or brown. I'm leaning more to brown. But everything else was as clear as day. I then thought to myself, if it was a thief dressed in a monkey suit going from yard to yard thru people's properties why then wasn't he smart enough to wait until I left with my dogs to run across? And if it was a practical joke from someone, that guy must had really had to have guts of steel to listen to mad barking dogs and still run. Besides, it's a crime to traspass thru multiple houses' yards, specially so late at night just for a joke. I told my sister the next day about it, she remembered the unusual loud barkings of the dogs and she confessed she felt a little concerned about it. I'm glad she believed me. I didn't tell my parents though. . That's the first and last experience I had with something I couldn't explain.",
  "classification": "Class B",
  "county": "New London",
  "state": "Connecticut",
  "location_details": "",
  "summary": ""
}