{
  "reportId": "1268",
  "title": "More sightings of a strange creature centering around the town of Ottosen. Other stories told about strange sounds, footprints and animal mutilatations.",
  "date": "1978-09-12",
  "timestamp": 274406400,
  "observed": "Iowa Flap Continues From newspaper account: -------------------------------------------------------------------------------- From the Register; September 24, 1978 REPORTS OF HAIRY BEAST, NIGHT SCREAMS HAVE IOWA TOWN ON EDGE By Steven Klaus Register Assistant OTTOSEN, IA. - A fortnight ago Anna Dodrill froze with fear when she looked up from a load of dishes into the \"burning red eyes\" of a big-nosed, black-faced, hairy-headed creature staring at her through a window a few feet away. Terror tied her tongue. Her brother, who earlier that evening thought he had seen a large and hairy arm reach out from behind a cattle shed, sat at a table with a rifle ready. But he knew nothing of the kitchen scene beyond his view. Seconds passed - slowly, agonizing. The creature's eyes bored in on Dodrill. Frightened as she had never been before, she blinked but could not look away. After three minutes, Anna Dodrill screamed. The creature, whatever it was, fled into the darkness outside her farm home three miles northwest of here. \"It was the first time in my life I couldn't move,\" Dodrill said later. What she saw that night may have been Bigfoot, the beast rumored since July to be responsible for eerie night screams, broken fences, stampeded cattle, chewed-up cats, mangled rabbits and the death of a dog whose neck had been broken while it was chained near the home of its master. It - named or nameless, male or female or something biologically unknown - has been seen since. So have the terror and uncertainty. People here don't know what - if anything - is loose in the countryside. They don't know if they should lock their doors or laugh, buy weapons or rein in their imaginations. They don't know many things about what has happened. All they know is that something is different here. And they know, many of them children will not walk along at night until they know more. SIGHTED AGAIN Early, September 12, only 24 hours after the incident at the home of Anna and Jennings Dodrill, the creature was sighted again. Eighteen-year-old Robert Newell IV was dressing for work in a bedroom of the family home about two miles southeast of Ottosen. From out of the backyard came a deep whining sound. \"No horse or pig could have made it,\" Newell, a rock quarry worker, said later. He looked out the bedroom window toward the barn, located about 35 feet south of the house and illuminated by the yard lights. Newell said he saw a tall, hairy hunchbacked figure go into the barn. It jumped sideways into a manure spreader, got out and stood for a moment, then got into a grain spreader. Newell said the creature appeared to be looking for food. It then stood up in front of the barn for a short time, walked around a grain silo and headed south into a recently harvested cornfield. The whole episode lasted about 3 ½ minutes. Newell said the creature was between six and seven feet tall, had black hair and walked quite fast on its hind legs. The experiences of Dodrill and Newell are the latest in a rash of such sightings that have occurred in and around Ottosen during the past two months. Since mid-July, the Humboldt and Kossuth county sheriff's offices have received numerous complaints from farmers and residents in the Ottosen, West Bend, and Homboldt area who have seen a large, hairy creature or have been awakened by strange screams and an eerie, high- pitched  whistle. Many in the area believe the creature - or creatures - is Bigfoot, a legendary, nocturnal primate that has been reported throughout history as occupying a position between ape and man. It is also known as Sasquatch, Yeti and the abominable snowman. HOAX There are those who adamantly disagree with the Bigfoot theory and explain the sightings as either an elaborate hoax or the figment of fertile imaginations. Whatever the case, the sightings have brought unusual pressures on this close-knit Humboldt County town of 135 persons. Alberta Bennett, wife of Ottosen Marshal Tom Bennett, said the situation has created a division in town between believers and non-believers. \"Its left a strange feeling in town\", she said. There has been the unusual humor that accompanies such sightings. Someone recently tracked another sign beneath the Ottosen sign on Highway 222, which skirts the town. The new sign reads \"Big Foot Country.\" A letter received last week at the post office was addressed to \"Bigfoot Country.\" Then there was the fellow who walked into the post office wearing a monkey mask. STRANGE FOOTPRINTS But the humor is checked by the stories related by those who gather at Twig's Grocery Store here. There, in addition to stories of mutilated animals, residents talk of being awakened by eerie screams in the night; of strange footprints two-hands wide by three-hands long; of unusual feces found in Marilyn Schmacher's lean-to; and of children so terrified by what they saw that they cannot sleep and who for days wouldn't walk the town's streets - even in the daytime. One man who has heard all these stories is Humboldt County Sheriff Marvin Andersen. \"I tell you, if you're a non believer after you talk to a few of these people, you have to believe there's something there,\" he said. \"I think those people have seen something, but I don't know if its this Bigfoot connection they are talking about.\" Andersen was first called to Ottsen in July when three boys, ages 10 to 12 came home terrified from something they'd seen near the sales barn at the edge of town. The boys had spied a cat that was bleeding and chased it up a tree near the barn. \"We heard this scratching noise come from the buildings, like something rubbing up against something.\" one of the boys said later. \"We tossed a rock into the building.\" When the rock cracked against the floor a face appeared in a window, the quickly disappeared. The boys told the sheriff it had a big, square, black head with a flat nose and broad shoulders. The boys bolted for home and the creature took off into a cornfield, they said. When Sheriff Andersen arrived in Ottsen he learned that this was not the first such incident. Days earlier, one of Jan Henkin's daughters left home about 11 p.m. to go to her grandmother's house about a block away. When the girl walked out of her grandmother's backdoor, she heard a noise and found herself face to face with the beast. She screamed and retreated into the house, where she told her two uncles about the incident. About a half hour later another of Henkins' daughters rode her bicycle uptown with two other girls.  They beat it back home when they spotted a figure five feet tall standing in front of a vacant lumber building. Henkins said she and a friend, Pat Young, went up to the main street to see what had frightened the girls and saw a hairy head looking out from behind one of the buildings. They quickly returned home and sent Henkins' brother and a friend uptown with a dog.  As the two men neared the building, they glimpsed what appeared to be a large animal.  Yelping, the dog charged out from behind the building and headed for home. Henkins said she saw the creature the following night when she and Young left Young's house to learn why the dogs were barking and saw the creature about one-block from the home.  When the creature took a step toward them, they retreated into another home. After that experience, Henkins sent her daughters to stay with a sister in Livermore for a couple of nights. \"My oldest daughter would wake up and just be shaking,\" she said. DELUGED WITH HUNTERS For several nights after the reports of those sightings were publicized, Ottosen was deluged with hunters and curiosity seekers from as far away as Davenport.  At night, the traffic on normally quiet streets was so heavy one woman complained to the sheriff's office that she couldn't cross the street in from of her home. Sheriff Anderson, who sent two deputies to patrol the town for a few nights, said at least one pickup load of gun-toting hunters was sent home. That situation and the ridicule many have received from skeptics have left Ottosen residents reluctant and embarrassed to discuss the sightings. \"People are afraid to say anything anymore,\" said Henkins, whose children and others have been ridiculed by classmates. But those who claim to have seen the beast remain adamant. \"I'm not a nut and I know what I saw,\" said Dodrill. Newell agreed: \"They'll ridicule about it until they're unlucky enough to see it themselves,\" he said. This past week reports of unusual animal sounds were filled with the sheriff by two farmers east of Ottosen and by a family that lives northeast of Humboldt.  In each case, farm dogs became restless but would not leave their yards to investigate. Postmaster Edna Kampen, who has neither seen nor heard the animal but sees and hears most of Ottosen's residents on a daily basis, summed up local opinion this way: \"At first they thought it was a hoax, I think.  But know there's been so many classes of people-farmers, townspeople, etc.- who saw it, that they're taking it more seriously.\"",
  "classification": "Class A",
  "county": "Humboldt",
  "state": "Iowa",
  "latitude": 42.8674,
  "longitude": -94.356,
  "location": "-94.356,42.8674",
  "location_details": "",
  "temperature_high": 78.87,
  "temperature_mid": 70.895,
  "temperature_low": 62.92,
  "dew_point": 66.05,
  "humidity": 0.84,
  "cloud_cover": 0.79,
  "moon_phase": 0.35,
  "precip_type": "rain",
  "pressure": 1005.72,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 7.35,
  "wind_bearing": 134,
  "wind_speed": 7.82
}