{
  "id": "661",
  "title": "",
  "date": "",
  "observed": "In 1969 at the end of August four other boys and myself went camping near Babyfoot lake in the Kalmiopsis wilderness area in south coastal Oregon.   I was 16.  At around 11 PM, three of  us were asleep and two were up.  Even though we were within the wilderness area, we had parked our car some ways down a very hard to negotiate road by a stream bed and had ascended a small hill  where there was a campground with easy water access a little further up the stream.  One boy, George, went down the hill to get something out of the car, and as he approached the car something which had been hanging out near it took off and ran downstream.   It was so loud that Matt, the other wakeful boy, heard it too, and they said it sounded like a jeep going through the brush without a motor.  But the real fun started about two hours later, when horrible screams started to be heard from a distance.  The sounds eventually woke all of us up, and I must say there were of an incredibly scary nature, not cats or anything even like that.  More like metal ripping in a factory.  Eventually it became obvious that the creature was making its way towards our camp by the stream, and, machetes in hand in the case of two boys, we all hid deep in our sleeping bags.  Well, the camp spent about a half hour estimated under siege by something walking around it on two feet, and continuing to let out these massive wails while us boys shivered in our sleeping bags in utter terror.  Finally, the creature started to move away, and as it did, two or three of us looked carefully out to see a huge hulking form moving away in the minor moonlight.  This is absolutely a true story, whatever this creature was, its \"wail\" could raise the dead.  George and Matt were the totally skeptical types, and the experience shook them tremendously.  The Kalmiopsis is a uniquely beautiful place in its own way, but there's stuff out there, as we learned that day in 1969.",
  "classification": "Class B",
  "county": "Curry",
  "state": "Oregon",
  "location_details": "Near Babyfoot lake in the Kalmiopsis wilderness area in south coastal Oregon",
  "summary": ""
}