{
  "id": "32400",
  "title": "Jogger has daylight sighting on Prairie Trail near Algonquin",
  "date": "2008-09-13",
  "timestamp": 1221264000,
  "observed": "I was jogging on the prairie path I have been jogging on for years. i can show you the place, I was crossing the bridge over Algonquin road heading north. Mile marker 1 i just came from and before i get to 2 I park my car up on hill there, so I come down to the trail run over the bridege to mile marker 1, turn around and then run all the way to mile marker 3, then back to my car, so 6 miles. Anyway i was heading to the 2 mile mark (or kilometer mark, can't recall) and i was coming around the bend and i can see more than a half, maybe 2 thirds mile down the path, not sure, and i see a big guy weasring a coat. walking in the way i'm running. As i got closer It looked furry and i thought why would someone be wearing a coat it's 65 degrees or more out! As i jogged closer, the thing got bigger (it had it's back toward me) and I stopped, got the chivvers and thought...that is a bigfoot...then the thing went around the bend ahead where there's a small stream and retention pond. It was still daylight and i kept running thinking it couldn't have been...but i ran another mile and there was no one there...where did it go? On the way back i stopped at a whole in a fence by a stream and small pond and lookeed in there. it was pitch black and then i got the chills and thought that thing might be in there...i went back to my car and have not run on that trail since! Finding Bigfoot show reminded me of this.",
  "classification": "Class A",
  "county": "McHenry",
  "state": "Illinois",
  "latitude": 42.18476,
  "longitude": -88.29926,
  "location": "-88.29926,42.18476",
  "location_details": "It was the prairie path next to the Algonquin postoffice. if you were coming from rt. 31 going to Randall road, it would be on the left side about mile marker 2 or 2 and a half.",
  "temperature_high": 73.76,
  "temperature_mid": 67.945,
  "temperature_low": 62.13,
  "dew_point": 68.75,
  "humidity": 0.92,
  "cloud_cover": 0.97,
  "moon_phase": 0.44,
  "precip_intensity": 0.1305,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1006.85,
  "summary": "Heavy rain until evening, starting again overnight.",
  "uv_index": 3,
  "visibility": 5.58,
  "wind_bearing": 197,
  "wind_speed": 7.01
}