{
  "id": "1548",
  "title": "",
  "date": "",
  "observed": "We lived in an A-framed cabin that overlooked Bidwell Canyon about 1 mile from Forest Ranch. The previous renter worked for a company that had her out of town frequently, so I am not sure on any encounters she may or may not have had. We had 4 large dogs and one of my chores was feeding and watering them daily. Two of our dogs were german sheppard/husky, which were tied on a runner that was connected to the top of the house and a tree about 20 yards away. We were the only house on that side of the highway, our nearest neighbors being across the highwahy maybe another mile away.The other two dogs that we had were a german short hair and a griffin, those two were tied up down in front of our house by our vehicles, one of which barked constantly. The one thing that we could not figure out was why every day and evening the dogs water - a 5 gallon buckets were constantly empty. We did not see any occasions where the buckets had tipped over, so that was one conclusion we discarded. Another occurance was the fact that the dogs would not come out of their doghouses after dark, which was odd. We did not have running water in the house, so we had to use an outhouse, which was about 10 yards away from the back door. After several alarming incidents where my mom and I  would make our trip to the outhouse before bed, we were aware of the sounds around us, usually stopping for no apparent reason. Then the frequent feeling of being watched, and the hairs on the back of our necks would prickle, leaving us no choice but to stop our visits after dark. There was one incident in which my step-dad was up late around 2 or 3 in the morning and he visited the outhouse where he heard the unmistakeable sound of something very large, on two legs approaching, through 3-5 foot high thick brush which is only accessable with a machetti. The creature was grunting in a gutteral, deep sound that communicated aggression to my step-dad. He felt severly threatened by this creature and began running to the house, hearing it follow just below the trail. There were no bears I can assure you. Another incident was the unmistakeable communication between three creatures, one above the house and two below in the brush. The calls were loud shrill whistles and chirps, then low gutteral  grunts. One would call, then two would answer. The last incident was while my mom and I were looking for one of the dogs that had been gone for a few days, we walked about 300 yards down below the house on a trail that led to an over look where you could see the bottom of the canyon, very beautiful. I seen a some indention by a large rock that looked like a trail, so we thought if we could go further down the mountain side, we might be able to call for the dog. Well, this trail led down a very steep coulie that had a few taller trees in it, and a rather sheer wall that was then turned inward toward the ground creating a type of shelter/cave. Under this overhang were three deep impressions that looked to be beds, scooped out and shallow with foot prints aound them in the loose powdery dirt. This really raised the hackles on our necks, and looking at eachother we quickly ran up to the house, so unnerved by this find. Thses incidents did not result in any photos, but definately a belief in the existence of Bigfoot.",
  "classification": "Class B",
  "county": "Butte",
  "state": "California",
  "location_details": "Forest Ranch about 16 miles from Chico, not sure which highway",
  "summary": ""
}