{
  "reportId": "12068",
  "title": "Possible intimidation behavior experienced while shining for alligators in Ormond Beach",
  "date": "2005-05-24",
  "timestamp": 1116892800,
  "observed": "BFRO, My friend and I, were 'spotting' gators one night in Ormond Beach, FL when we had an encounter with something, well...unknown. We were near a lake when we heard something large in the woods behind us.  When we shined our lights into the woods to see what was making the noises, we heard a series of blunt beating noises, about a second to two seconds apart.  The sound was like that of a wood baseball bat hitting a tree.  This went on from about 30 seconds to a minute before the tree fell.  As we heard the crackling of the falling tree we ran back towards the nearest safe place to us.  At this same time we heard in the woods to our left, something almost stalking our every move.  Once we got to \"civilization\" and realized we were out of danger, we decided to go back to find out the source of what happened. When we returned, almost an hour later, we found a tree freshly broken in half, the break being about eight feet from the ground.  The break was not a clean cut like that of a hatchet, rather like the tree had been bent to its breaking point.  We knew this was a fresh break from the dripping sap, which next day was dry so it was definitely the source of the noise of a falling tree.  On a branch about seven feet from the ground we found a hair sample.  The hair is still yet to be identified.  The best description we can give is it is a two to two and a half inch light brown hair, which is wavy with a kink close to the middle of it. The tree is about 25 to 30 feet tall.  The break was about seven to eight feet in the air.  At waist, the diameter is about ten inches, and at the break between six and eight inches. Please help us to determine if this was from a known and indigenous species or if it was our distant friend. Also, If there is a credible source to send the hair, to find out its origin, please send us a lab. Thank you. ***A NEW REPORT (37689) OF THIS INCIDENT WAS FILED 11/25/12. THIS IS THE STATEMENT FROM IT. BOTH REPORTS ARE NOW COMBINED. While walking down the dock, the woods next to the dock began moving and shaking violently. We were scared but assuming it could be a bum, we shouted into the woods. Eventually the shaking stopped and a few minutes later, we heard a knocking sound. It sounded like a 4x4 size pieces of wood hitting a tree. The knocking went on for several minutes. We continued to yell trying to figure out what it was. Next, was the scariest part. A tree about 25-30 feet from the dock started rocking violently. Still screaming, the tree fell toward the dock and we started running, the whole time we heard something keeping pace parallel to us on the dock and grunting. We later went back and found a brown/red hair hanging from the bottom of a branch.",
  "classification": "Class B",
  "county": "Volusia",
  "state": "Florida",
  "latitude": 29.29063,
  "longitude": -81.08198,
  "location": "-81.08198,29.29063",
  "location_details": "From US1 head west on Wilmette.  After a small rightward bend, you will see an apartment complex called Willow Pond on the right, after entering the complex, follow the parking lot all the way to the back, and once you find the pool the entrance to the dock is on your right.  Follow the dock about an eight of a mile to a large uprooted tree.  Another 40 feet directly back, off the dock, is the tree in question.",
  "temperature_high": 88.84,
  "temperature_mid": 80.51,
  "temperature_low": 72.18,
  "dew_point": 68.75,
  "humidity": 0.74,
  "cloud_cover": 0.28,
  "moon_phase": 0.53,
  "precip_intensity": 0.005,
  "precip_probability": 0.22,
  "precip_type": "rain",
  "pressure": 1006.67,
  "summary": "Light rain in the afternoon.",
  "uv_index": 10,
  "visibility": 7.95,
  "wind_bearing": 260,
  "wind_speed": 9.23
}