{
  "reportId": "24695",
  "title": "Disoriented coon hunter is followed out of the woods and experiences possible intimidation near Buckley",
  "date": "2008-09-25",
  "timestamp": 1222300800,
  "observed": "Let me start out saying I grew up in the woods of northern Michigan(I was 18 at the time ) I have hunted trapped and fished just about every critter in those woods since I was a very small child and have never experienced any thing like this (that couldn’t be attributed to any thing conventional) before or since ! The night started out normal my ex and I departed for a night of coon hunting. We released the old black and tan hound about a mile from where the encounter happened on a large creek bottom of Fletcher creek just north of eight road where the creek crosses the road this was  around 9 o clock pm . The dog took off across the thick creek bottom headed west then north crossing an open meadow and some pine trees before striking the coons sent and quickly treeing the coon on the edge of a large swamp in a big white pine everything normal so far. we didn’t have a gun with us that night so we quickly loaded up the dog and took off to tree another. We released the dog again where the road  (possibly 5 or 5and a half road)intersects a old beaver pond where she promptly struck a scent and made a long arching track north then east then south east covering a few miles of the dense forest quickly. I soon realized the dog had struck a bear or bobcat track as she had chased and treed both (in the area and never chased trash deer coyote etc..) and was covering ground quickly in a circle so we decided to intercept the dog on the next trail by the time(around 10 thirty) we got ahead of the dog she had treed whatever she was chasing about a mile south of the road( I don’t know the name of it there is a hunting pen and an oil well on the end of it) so we set off unarmed with two lights nearly dead after about a half mile whatever she was chasing took off again this time easterly assuming it was a bobcat I shut the lights off and stood silently (a bobcat will jump tree and run if it sees a light coming) the dog promptly treed or/bayed the animal it was chasing again about a mile away we headed that way using the lights sparingly again the animal ran after repeating this another two or three times we finally closed the gap to about 300 yards when suddenly  the dog went silent and ran straight  to us (without calling she wouldn’t come if I called I never could call her off a trail EVER!) tail between its legs whimpering I thought this was odd because the dog had fought bear coon and bobcat and never backed down or lost I didn’t think much of it I was glad to have her back so we could go so I  just leashed the dog and started back out we were less than disorientated because of the long twisting turning chase and no moon and to make matters worse the lights died and we had no cell service! after about an hour of walking in what I thought was the right direction I began to hear something big trailing slightly behind and to the left me I stopped and asked my friend if she had heard any thing she admitted she had but didn’t want to admit it for fear of me picking on her  we continued and so did the trailing I kept throwing the dim dead light back in the direction of the animal each time the brush would crash and limbs high I don’t know how high but higher than a deer could reach and only a large bear on its hind legs could move or break would react to something fleeing the light before it would die out again after a couple seconds the dog continued its unusual behavior (tail between its legs and skittishness)especially when the animal began circling us we would hear it then it would be silent and a leaf would crunch a head of us I would shine the light in that direction and the sound of heavy pounding feat and big 3 inch around trees would break and shake then the light would go dead The whole time I felt as if something large and intelligent was observing us sizing us up the hair on the back of my neck was standing up and shivers ran down my spine the whole incident lasted an hour or 2 we never saw the animal but heard it circling us and breaking huge limbs trees 2 to 3 inches were being broken within fifty feet of us and less and we never saw the animal just the vegetation around it broken or moving after it fled our light for a brief moment before the light would die. It was almost as if it were deliberately breaking trees to intimidate us or that is what it felt like. I never looked for hair or tracks  there was a good foot of leaf cover so tracks were unlikely I never thought of it as a big foot just an unexplainable anomaly . I assumed it was a bear but there was no “woofing” or jaw “popping” both of which I have heard before and I don’t believe the dog would have backed down after treeing and chasing a few already I don’t know if this was a big foot or not it is near some of the other sightings on your web page (I had no idea there were big foot sightings in Michigan) so I figured I would share my story  I’m not a big foot believer I believe in the possibility but I’m still skeptical. The only other   strange occurrence I had occurred within about  a mile of the other 3 weeks or so earlier when the dog treed a young bear we left the tree to immediately hear a low cry like that of a juvenile animal a whaaa-ooo-a first in the distance then about fifty yards away we attributed it to the young bear calling for its mother and left reflecting on it later it was unlike any bear sound I’d heard -death cry roar growl nothing I don’t know  it was raining hard so perhaps the sound was distorted.",
  "classification": "Class B",
  "county": "Wexford",
  "state": "Michigan",
  "latitude": 44.45835,
  "longitude": -85.6667,
  "location": "-85.6667,44.45835",
  "location_details": "about three miles west of the intersection of 7 and 8 road north of eight road between eight and four road in wexford county",
  "temperature_high": 72.33,
  "temperature_mid": 60.865,
  "temperature_low": 49.4,
  "dew_point": 53.41,
  "humidity": 0.8,
  "cloud_cover": 0.42,
  "moon_phase": 0.88,
  "precip_intensity": 0.0003,
  "precip_probability": 0.48,
  "precip_type": "rain",
  "pressure": 1027.14,
  "summary": "Foggy in the morning.",
  "uv_index": 4,
  "visibility": 5.67,
  "wind_bearing": 65,
  "wind_speed": 2.02
}