{
  "reportId": "2076",
  "title": "",
  "date": "",
  "observed": "In October of 1987 a friend and I went camping just outside of Kingsbury Ordinance Plant (KOP for short) in Kingsbury, IN. We were about 1 to 11/2 miles off Hupp rd (which is the road the enters KOP). We set up camp just before dark around 6 pm or so. After about 45 min, my friend went home to eat dinner and call another friend of ours to come out when he gets off duty. Just around dusk, while getting fire started, I heard rustling in woods about 25 yards away. I didn't think anything of it at the time and because of the population of Deer out in that area, I thought it might be one. After about 10 minutes, heard noise again, but it was about 15 yards away this time. I yelled HEY real load and the noise stopped for about 5 minutes. Then I heard grunting about same distance away. Getting nervous, I yelled again Knock it off. I then picked up a stick and said, I have a gun. The noise stopped after 3 or 4 sec and as I turned to look at fire, I heard a loud thump to my right. I looked and saw a large tree stump that landed about 8 ft away. I turned around and faced woods and yelled very loudly Knock it off or  I'll shoot. I then saw another large log come sailing through the air toward my direction and land about 3 feet in front of me and about 5 feet to left. I started running down a trail toward the road. I did not hear anything for about the first 100 yards, and then I heard rocks moving as if someone was running in the same direction as I, but they were on the RR tracks to my left. The sounds of the steps were about 1 sec. apart. I heard this for about 8 to 10 sec. then it stopped. I ran for about 25 more yards and stopped. It was dark and overcast skies, but still there was enough light to see where I was running. I turned and looked behind me and then to my left and saw nothing. I then turned back toward the road and focused on the street light ahead. Walking very fast now, I came to a dip in the trail. This is where I saw it, a large figure standing in front of me. The dip in the trail sloped down to about 3 feet deep and ran the depth for about 30 ft. then it rose again to ground level. The figure was standing in the center of the dip in the trail and stood at the same height as myself. I am 5'9\" so I the figure had to be from 8 to 9 feet tall. This thing let out the most God forsaking scream, that it would make your blood curdle. I did what any normal person would have done; I took off running toward my right through an open field. I ran as fast as I could away from this figure. I finally reached my friends front steps about 3/4 miles away. At first I thought it was him, but when he came to door he had been eating dinner, his shoes where off, and his mom said that he had not left the house.  After he ate and our other friend arrived we all went back out there about 3 hours later. The small tent we put up had been tore down and logs and stump that were thrown were lying in the spots that they landed. I have never forgotten this. For years I have dreams, (Nightmares I call them) about the creature and that terrible scream. Till this day I am still scared to go out there. ",
  "classification": "Class A",
  "county": "La Porte",
  "state": "Indiana",
  "location_details": "This was located just outside of the Kingbury Fish and Game Wildlife refuge",
  "summary": ""
}