{
  "reportId": "25948",
  "title": "Man hears characteristic howls in early morning hours near Mechanicstown",
  "date": "2009-05-10",
  "timestamp": 1241913600,
  "observed": "On the morning of May 10th 2009 me and my friends were camping at my girlfriends house in Mechanicstown, Ohio. Mechanicstown is in Carrol County, just bordering Columbiana County. We were out @ about 3:00 in the morning trying to get the fire going in the back yard. As we were lighting the fire, I heard a loud howling coming over the hills. I stopped and asked my cousin if he heard the noise too. At first he acknowledged hearing the dogs barking off in the distance. However, he did notice the howling I was talking about. We both stood at the fire and listened to the howling continue for a couple of minutes. We are not from around this area, so he asked me what I thought it was that might be howling like that. I told him it was probably a bear...but it was still some distance away...my estimate being 4-5 miles. We brushed the noise off, and went back inside. The next morning i tried as best as i could to describe the sound to my girlfriends parents, who are residents of the area. They told me they dont know what i heard...but it did not seem to resemble a bear because bears in this area do not howl like that. The next day, I happened to be watching MonsterQuest on the History Channel. It was about Bigfoot legends from around the US and they happened to play a clip from a unknown howling recorded in Columbiana County, Ohio in 1994. As soon as I heard the howling...i recognized it. It was the EXACT same sound we had heard the night before. I decided to google Columbiana County, Bigfoot, 1994 and actually found the clip of the sound on this website. I listened to it...and am 100% positive that was the exact noise i heard. I sent the clip to my cousin, and he too confirmed that was the noise that he heard as well. I did not come out the following night or morning to check for the noise. I did notice, however, that the morning we heard the howling in the distance was a full moon. The following full moon i do intend to at least peak out and see if i can again hear the noise.",
  "classification": "Class B",
  "county": "Carroll",
  "state": "Ohio",
  "latitude": 40.64049,
  "longitude": -80.90944,
  "location": "-80.90944,40.64049",
  "location_details": "We are located on Apollo Road NE near Bane Road.",
  "temperature_high": 60.34,
  "temperature_mid": 54.235,
  "temperature_low": 48.13,
  "dew_point": 40.87,
  "humidity": 0.64,
  "cloud_cover": 0.58,
  "moon_phase": 0.55,
  "precip_intensity": 0.0009,
  "precip_probability": 0.08,
  "precip_type": "rain",
  "pressure": 1018.72,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 9.89,
  "wind_bearing": 291,
  "wind_speed": 8.47
}