{
  "reportId": "959",
  "title": "Sighting by a deer hunter on a logging road.",
  "date": "1997-10-15",
  "timestamp": 876873600,
  "observed": "I was hunting deer in mid October of 1997. I was on an old logging road and was watching a cleared area for deer when from across the draw I observed someone come out of the tree line on the other side of the draw. At first I thought it was a very large man as it seemed to move as one, walking quite comfortably as though it were strolling on a road. I am aware of the roads in this area and was surprised to see that there was a road there. As I looked closer I realized this \"PERSON\" was far taller than a human and the strides while walking were quite long. It seemed to move along as though on a hard flat surface which is why I had the impression at first that there was a road there. It was a varied color of browns with what appeared to be lighter almost gray brown head and shoulders giving the impression that it was mature. After observing for several seconds it turned towards me as though it just realized I was there and then turned back to the treeline and easily! moved back into them. Still thinking that I couldn't have seen what I saw, I went across to the treeline where he entered just sure I was going to find a road and a fellow hunter up there. I discovered no road and a uneven difficult ground cover. When I entered the trees where I saw this thing go in I discovered that just through the trees was another draw that was very steep and un-hikable. Having never gave thought to Sasquatch possibilities before I was truly amazed to find that I saw one. I was hunting with my son and a friend but they were not in the area when I saw this. I am positive that I saw something definately not human but quite graceful on two legs. I was not sure if I should tell anyone of this as the thought of disbelievers and coming from a small made me a bit aprehensive. I did tell my hunting buddy and my son, but even took a few days to tell my wife. I feel honored to have been blessed with this sighting and have wanted to have wanted to report it. Until now I had let it slide so to speak but last night saw a show on Sasquatch and after seeing a film of one walking it confirmed my belief that I truly saw what I saw. This I swear is true and sure.",
  "classification": "Class A",
  "county": "Grays Harbor",
  "state": "Washington",
  "latitude": 47.2475,
  "longitude": -123.8886,
  "location": "-123.8886,47.2475",
  "location_details": "Off the East Humptulips Rd., just off Hwy 101, between Hoquiam and Humptulips. This was off an old logging road.",
  "temperature_high": 67.54,
  "temperature_mid": 56.955,
  "temperature_low": 46.37,
  "dew_point": 50.33,
  "humidity": 0.84,
  "cloud_cover": 0.56,
  "moon_phase": 0.49,
  "precip_intensity": 0.0078,
  "precip_probability": 0.47,
  "precip_type": "rain",
  "pressure": 1023.27,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 6.41,
  "wind_bearing": 112,
  "wind_speed": 1.44
}