{
  "reportId": "25793",
  "title": "Campers have campsite visitor on two separate occasions near Campbellsburg",
  "date": "1997-08-01",
  "timestamp": 870393600,
  "observed": "I have had two possible \"Bigfoot related\" incidents. I've wanted to discuss the older incident for quite some time but have hesitated to do so. The second incident occurred March 16, 2009 and unnerved me enough to go ahead with these reports. (Note: see for the more recent incident) The first incident occurred in approximately August of either 1997 or 1998, I can't recall offhand the exact year any longer. This happened on private land near Campbellsburg, IN. The terrain of this private land is moderate hardwood forest, heavy leaf litter and only mildly rugged. There are several caves (all of them quite extensive as privately held cave systems go). There is also a valley with a small creek and a disused cabin. We had two separate incidents. On the first night we camped at the top of the valley so we could look down on the cabin and creek, mainly because it was a very pretty overlook and we could see the stars. After dinner and a couple of beers (no one was intoxicated by any means), one by one we headed off to use the restroom downwind and far away from camp. On one side of camp was the valley and on the other side was a very steep incline leading down to a privately owned field that no one could trespass without risking at least arrest, if not worse. As I started out into the forest to relieve myself, I heard the distinct sounds of someone walking purposefully up this steep incline. The footfalls were heavy enough to be heard distinctly apart from the shuffling of leaf litter. I squatted down, thinking it was the adjacent property owner coming over to complain about noise or trying to chase us off (even though we had full permission to use this property). The footfalls stopped at the top of the incline and then, whoever this was, took off running full bore into the deeper parts of the forest. The footfalls were very distinctly bipedal and NOT the rapid sound of deer footfalls. I didn't know who this may be so I called out to them. The running continued and no response was given. After I did my business, I went back to camp and the other persons agreed they heard the footfalls and thought it was me. None of us saw anything at that time. About 2 hours later we heard a VERY loud scream, starting at a low pitch and rapidly increasing to a piercing screech. We heard this only once and it caused the forest sounds to stop -- about 2-3 minutes later the normal forest sounds started again. We then decided to turn in for the night -- we had been creeped out enough. We slept in a van on our trips so we climbed into the van and fell asleep. About 2 or 3 AM, one of the other persons on the trip yelled out and woke us all up. He'd awakened to see a large arm (he never specified anything other than it was very large and the hand was large and dark) reaching in the van window and taking food out of the front seat. We looked and the food was partially missing, the remainder spilled about the seat and floorboard. I can't say for sure if he was dreaming, hallucinating or just spooked from earlier and mistook a raccoon for an arm or something like that. Something had disturbed the food but I don't know what it specifically was -- though I personally made the connection to our \"visitor\" from earlier visiting the camp. No tracks were found in camp but we could see where something large had ascended the steep incline the night before when we investigated the next morning. These were just gouges in the hillside and disturbances in the leaf litter, nothing more. But whatever or whoever came up that incline had marched right up and never hesitated. We didn't have tools to measure, photograph or record what we saw as we didn't think it was \"bigfoot\" but rather an animal or the other property owner at that point. We camped in the valley for the remainder of the trip without incident. We returned about a year later. We decided that we'd camp in the valley for the trip -- it was creepy on top of the hill plus we were still thinking the adjacent property owner would be angry again at us being up there with a bonfire and making noise at night. We had 3 uneventful nights in the valley. The fourth night was different -- other than the noise of the stream, the normal \"night sounds\" were generally absent, except for the occasional owl calls or other sporadic noises. It was quite eerie that night. We went to bed around 1AM (this time we were camping in tents and not in the van). About one hour later, we heard the familiar footfalls, this time descending the valley wall on the opposite side of the creek. There would 2 or 3 footfalls, a sliding sound then 20-30 seconds of silence. This process repeated until (we assumed) the person reached the edge of the creek opposite us. After what seemed like an eternity, the person crossed the creek very slowly -- we could hear gentle splashes with each step. Once in our camp, we could hear shuffling sounds. Our fire had gone out, so we could not see anything through the tent walls. None of us really cared to confront whoever or whatever was visiting. After about 30 minutes of shuffling, our cooler was forcefully knocked to the ground. Silence followed and we all fell back asleep. I awoke sometime later to the sound of someone approaching the tent. As I looked up through the rainfly, a head appeared and looked down at me. As we were under the tree canopy, the lighting was very poor. I could see that the head was very large, there was coarse hair on top and sticking out to the sides in places, but the face was in shadow. At that point I gasped and the head quickly moved out of view. I could hear it cross the creek and head up the hill and it was gone. I mentioned this to the guys the next morning and none of them noticed it return for the second visit but me. We had no further disturbance. Neither time did I feel \"threatened\" or any negative feelings other than the fear of encountering an unknown visitor, whether human or otherwise. But the head looking in the tent, and the stealthiness of the visitor, clued me in that this was not a \"man\" looking to scare us but rather likely a startled Bigfoot (the first encounter) and then an inquisitive Bigfoot (second encounter). I poked around quite a bit on the property and didn't see any obvious sign of a large animal, but there were lots of deer and the disused cabin had several bedding areas in it. Something or someone had bedded down there many times in the past, but the areas looked disused as well. Also note these bedding areas were on both the first and second floors of the building.",
  "classification": "Class A",
  "county": "Washington",
  "state": "Indiana",
  "latitude": 38.6899,
  "longitude": -86.25349,
  "location": "-86.25349,38.6899",
  "location_details": "near North Cave River Valley Rd and West Cave River Valley Road",
  "temperature_high": 86.54,
  "temperature_mid": 75.58,
  "temperature_low": 64.62,
  "dew_point": 58.52,
  "humidity": 0.62,
  "cloud_cover": 0.26,
  "moon_phase": 0.95,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1022.08,
  "summary": "Partly cloudy until evening.",
  "uv_index": 8,
  "visibility": 9.03,
  "wind_bearing": 188,
  "wind_speed": 1.73
}