{
  "reportId": "3049",
  "title": "Atv riders hear daytime vocalization and find tracks near Keokuk",
  "date": "1985-02-15",
  "timestamp": 477273600,
  "observed": "This incident involved hearing and smelling what my brothers and I can only describe as Bigfoot.  It happened on my Grandparents property when I was approx. 14 years old.  Our Grandparents had given all three of us 3-wheelers for Christmas the following year.  It had to be sometime between February and July of 1985 (Est. year, can not recall exact date).  My brothers (at the time ages 12 and 9), were all on our 3-wheelers down by the creek behind my Grandparents home.  We had just gotten off of the ATV's and were going to cut through the woods to go up to my Grandmothers antique store, when we smelled something so putrid, it reminded us of sewage.  I remember telling my brothers that something really stank at about the time they smelled the odor.  Seconds later, we all heard a very loud, gutterral roar.  We froze in terror, looking at one another for what may have been only seconds, but seemed like several minutes.  Then we all raced up the hill to our Grandparents house, leaving our ATV's down by the creek.  We told our Grandparents and parents what we had smelled and heard, and we went back down to the creek with our Father and Grandfather, but could not find anything.  The odor was still in the air, and my Father and Grandfather could both smell it.  We took our ATV's back up to the house, and went home shortly after that.  That evening, it rained, and the next day, our eperience still racing in our minds, we went back to the creek to look for footprints.  We did not find any down there, but while riding on another section of the property, we found what appeared to be very large footprints, resembling a human foot, only much longer and wider and deeper.  The prints were located in a new driveway at the front of my Grandparents property.  The drive was made of black cinders, and the prints were very noticeable.  We returned to the house, and got a ruler and our Mom, who went with us to see the prints.  Frankly, she was amazed.  I imagine she was quite suprised to see actual prints, and if she had any doubts about the story we told the day before, they vanished when she took us to the local Jacks store to get Plaster of Paris to make plaster casts of the prints.  Unfortunately, the casts did not set up well in the black cinder, probably due to how hot the cinders got in the sun, and when we tried to remove the plaster casts, the casts crumbled.  We had measured the prints prior to the casting, and they measured 13 inches long by 8 inches wide by 2.5 inches deep.  My Grandpa, whom at the time weighed roughly 250 lbs., could not even leave a print in the cinders.  We guessed that whatever made the tracks must have weighed around 400 to 600 lbs.  We never mentioned it to anyone outside the family, mostly because we were afraid of skepticism.  When one of my brothers, who is now 28 and a Deputy Sheriff, got hooked up to the internet recently, showed me your site, I decided to report our incident.",
  "classification": "Class B",
  "county": "Lee",
  "state": "Iowa",
  "latitude": 40.4415,
  "longitude": -91.4261,
  "location": "-91.4261,40.4415",
  "location_details": "Grandparents property.  Request location not be listed, but will gladly show area to a researcher.",
  "temperature_high": 16.61,
  "temperature_mid": 15.595,
  "temperature_low": 14.58,
  "dew_point": 0.3,
  "humidity": 0.63,
  "cloud_cover": 0.39,
  "moon_phase": 0.87,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.87,
  "summary": "Mostly cloudy starting in the afternoon.",
  "uv_index": 3,
  "visibility": 10,
  "wind_bearing": 274,
  "wind_speed": 6.75
}