{
  "reportId": "34710",
  "title": "While target shooting a family observes a large bi-ped in a blackberry patch near the town of Rainier",
  "date": "2012-03-20",
  "timestamp": 1332201600,
  "observed": "On wed march 20,2012 My 2, sons J and T, and 2 friends S and T along with myself, went out to target practice outside the town of Rainer, Wash. It was about 5:40 when we came through a hay field and stopped to decide where we should go next. I was looking across the field scanning the tree line that runs along the edge of the river. At the far southwest end of the field I notice a figure getting up out of a blackberry patch. It was huge and dark. I couldnt tell how tall it was but I could tell it was massive. Big shoulders long arms and wide body all covered in brown hair. The hair on it head looked like it went to its shoulders. It stood up and walk from the center of the patch to the trail in front of it. I brought it to the attention of the others with me as it crossed the trail and stood next to a fir tree it looked back at us. It turned and walked south into the next hay field and towards the southwest corner. We ran to were we saw it. We found nothing. The blackberry bushes looked like something used it as a bed, all the branches were bent down flat. We compared the fir tree with my son T to get an idea of how tall it was, my son is 6ft and the creature was at least 8.5 we took pictures then followed the grass trail it left behind (We could see where it went across the field in bent grass) and into the second field and stopped at the edge of the third and noticed that ahead of us the birds flew out of the trees making alot of noise. a few minutes later we heard dogs barking in the distance but not to far. Then we heard a load knocking sound for 5 or 6 beats. Everything went real quiet then we heard what sounded like a popping sound  followed by several hoots. We waited in the trees for several more minutes but heard and saw nothing out of place",
  "classification": "Class A",
  "county": "Thurston",
  "state": "Washington",
  "latitude": 46.78571,
  "longitude": -122.7515,
  "location": "-122.7515,46.78571",
  "location_details": "(Exact location details edidted by the investigator to protect the location)",
  "temperature_high": 43.65,
  "temperature_mid": 39.035,
  "temperature_low": 34.42,
  "dew_point": 36.52,
  "humidity": 0.85,
  "cloud_cover": 0.84,
  "moon_phase": 0.94,
  "precip_intensity": 0.0121,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1007.93,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 8.97,
  "wind_bearing": 201,
  "wind_speed": 10.36
}