{
  "reportId": "12542",
  "title": "River guide sees skinny bigfoot at dusk",
  "date": "2002-03-16",
  "timestamp": 1016236800,
  "observed": "[Note - At their request, the witness's names were removed from this report.] It was back a few years ago when we were still scouting put-ins and take outs on the non- commercial sections of the San Juan River. We would drive these narrow two track roads to find river access. And then float and scout these sections accordingly. We could not find any real information either in print or on the web about the river from Shiprock, Nm,  down to Montezuma Creek Utah. We had to explore it ourselves via kayaks and canoes. Nowadays, we have a river company through the Navajo Tribe, and take people down this sections all the time. We found a put-in at mile ten just out side of Shiprock. It's about ten bumpy bad road miles to the river, but provided a good launch area. We used my truck to put -in with the boats. We had already dropped a truck off at Four Corners Bridge. (some 17 river miles away) The day was fairly warm for early March, mid 60's I think. We did the run in under 5 hours. We loaded the boats and gear in the truck,and headed back over to pick up my truck. It was getting dark by the time we got there. My ex wife, and my partner pulled up out of the small canyon before me. We carry walkie talkies on the river and in our vehicles. I turned mine on, and told them to wait up. My partner replied \"sure no problem\"--just then before he let go of the button, I heard XXX (my ex-wife) screaming. \"What's going on up there!\" I shouted through my walkie talkie. \"XXX sees somthing up by that old sheep corral, turn your bright's on, I can't see it because I'm trying to get outta here, and not reck this truck, she says look it's on your right, you'll be coming right up on it!\" Sure enough, I got right behind them, I saw the back of it as it turned in my headlights. A few swings of it's arms, and it was out of there. This was not what I expected to see at all. I would put it at about 7 feet tall, skinny, gray in color, arms past the knees, like looking at the back of a grinch head-pointy. XXX got a better look at it then I did. She said it looked right at her. Does not much want to talk about it. J p.s. We see strange things out here all the time.",
  "classification": "Class A",
  "county": "San Juan",
  "state": "New Mexico",
  "latitude": 36.81315,
  "longitude": -108.7608,
  "location": "-108.7608,36.81315",
  "location_details": "There is a turn off to the right of the highway just before the ten mile marker. It's about ten miles to the river. We had just come up out of the first canyon to a small flat area when this incidence occured.",
  "temperature_high": 38.81,
  "temperature_mid": 29.395,
  "temperature_low": 19.98,
  "dew_point": 6.33,
  "humidity": 0.41,
  "cloud_cover": 0.39,
  "moon_phase": 0.08,
  "precip_intensity": 0.0011,
  "precip_probability": 0.29,
  "precip_type": "snow",
  "pressure": 1011.85,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 9.45,
  "wind_bearing": 216,
  "wind_speed": 7.05
}