{
  "reportId": "1082",
  "title": "",
  "date": "",
  "observed": "My sister says I must tell this to this WWW sight. So here goes.  In June of 1996 I was a helper at a vision quest on the Cheyenne side of Bear Butte. This is a state park as many or all of the sacred sights of the indigenous peoples of this land are. Camp was set and people went off to do errands as the painters  had yet to arrive. I know that I should explain some of the  terms I use, but please bear with me, that isn't the point. Anyway the head woman askes me if I wouldn't mind serving the next camp over some soup when they are done with their work, I say sure. I find myself alone on the back of the butte when the men also leave for town, Sturgis, S.D. I am standing at the cook stove wondering what to do with the pot of soup, set it on the ground or put it over on the table, etc. I happend to glance out across the camp and to the ridge beyond, about 100 yards. Over the top he came. I say He because I felt this was so. He was as stunned as I was. I dropped my eyes, I don't know why. I looked back but in that moment I felt a rush and the feeling that someone pulled on the back of my t-shirt. No mortal being could travel that fast nor could they come unseen. In that moment I was changed. I no longer can nor will poke fun at the cooks who have seen things that few others have seen. My body was charged, goose-bumps. I spoke outloud, \"I'm going to my tent now,\" as if to let him know  I felt no threat. I didn't but I was unnerved. The elders in camp at breakfast dismissed my sighting as (run of the mill, no big thing) as many see him back there.  Good luck for the camp, people who stand in the doorways see him. as in , when alone, watching the fort, or in this case camp..many who are fire keepers for lodges have seen him skirt the encampment like no big deal.  Well, I don't care what the Northern Cheyenne say, it was a big deal for this Sioux. As I struck camp days later I thought of the feeling thesurprise we both felt..how could he be startled by a human, I know he had so many more powers than we humans..he can move unseen, so fast.",
  "classification": "Class A",
  "county": "Meade",
  "state": "South Dakota",
  "location_details": "1996, Bear Butte State Park, Cheyenne Side.",
  "summary": ""
}