{
  "reportId": "28898",
  "title": "Dusk and nighttime sightings by couple at rock quarry near Greenwater",
  "date": "2008-06-07",
  "timestamp": 1212796800,
  "observed": "My husband and I were up off of highway 410, about 5 miles outside of Greenwater (on the FS road right after the fire station on the left side of the road)around the first part of June in 2008.  We had come from Tacoma and I was trying to get my husband acquainted with being in the woods at night, so we headed up to a place I liked to go occasionally to start a fire and cook some food and relax.  It was a site for what looked like an old rock quarry alongside the right hand side of the woods. I chose the spot because it was fairly open to the road and there were also a large number of campers dotted throughout the woods and along the river at the time.  It should also be noted that it was foggy. We pulled into the muddy rock pit(we were driving a '69 220 Mercedes) drove in about 50 feet and then noticed something in front of the car.  My husband seemed panicked and wondered what the hell it was.  It was gray(light colored)big, human shape, visible right in front of our car no more than 15 feet from the front bumper.  Even though I knew it wasn't human or a known animal, I told him it was a deer's butt and not to be scared. He has stopped the car at this point and then we both witnessed the creature climb up the side of the quarry at a high rate of speed.  He was terrified, but for some reason, I wasn't scared at all even though I had just something unexplainable.  I convinced him to park and we got the stuff out the trunk headed up the other side of the quarry and started the fire.  By the time it was really going it was dark out and we were just sitting and talking.  It also started to rain a little.  I had the unerving feeling that we were being watched.  That was when we saw headlights coming up the road and turning into the quarry.  It was the sheriff.  He stopped at our car then came up the side of the quarry in his truck, shining his search beam on us as he ascended.  After asking what we were doing he left and headed down the side of the quarry in which we had seen the creature earlier.  I noticed about a quarter of the way down he stopped and shone his light into the woods at which time the previously viewed creature was spotted standing at the edge of the woods.  It turned around and headed back into the woods and the sheriff sped down the side of the quarry.  I bet he remembers it, but I don't remember his name. We left immediatelly. It should also be noted that I didn't feel scared at all and I almost forgot that I had seen the creature until we drove home and my husband reminded me.  It was almost like my mind was trying to dismiss it because I didn't know or could make sense out of what I had seen.",
  "classification": "Class A",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 47.12045,
  "longitude": -121.5298,
  "location": "-121.5298,47.12045",
  "location_details": "Please read account",
  "temperature_high": 56.21,
  "temperature_mid": 50.53,
  "temperature_low": 44.85,
  "dew_point": 42.65,
  "humidity": 0.81,
  "cloud_cover": 0.82,
  "moon_phase": 0.15,
  "precip_intensity": 0.0028,
  "precip_probability": 0.39,
  "precip_type": "rain",
  "pressure": 1021.45,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 7.7,
  "wind_bearing": 242,
  "wind_speed": 4.89
}