{
  "reportId": "26440",
  "title": "Hitchhiker hears loud vocalization just outside Ilwaco",
  "date": "1979-07-15",
  "timestamp": 300844800,
  "observed": "I have never spoke to anyone about the night that my friend that I will call Joe and me left Long Beach Wa. on State Route 101. Walking with our packbacks that probably weighed about 70 lbs. a piece. We left Seattle thinking that we were going all the way to Santa Cruz, Ca. However we did not plan on leaving in the middle of the night from Long Beach... we had a room that we were hanging out with a couple of girls we had met earlier at the bar. Well after a few hours of drinking things suddenly turned nasty. So Joe and I decided that it was best to get out of town. We had Astoria, Oregon on our next desination stop. However we had no idea we would be heading there in the middle of the night. It was late July so we had no problem worrying about rain or cold weather. It was a crystal clear night walking down Hwy. 101 at around 2:30 in the morning. We were trying to hitch hike but at that time in the early morning there was not much traffic. We walked for miles, however we were relieved just knowing we got out of town and away from those wicked girls. Whew ! So now we have walked to IIwaco, Wa. and it's pitch black out. The only light we had to go by was the light of the stars above. It was a beautiful sight. We were laughing and joking when suddenly we heard a growl that instantly stood the hairs on our neck up in a frenzy. Joe nor I had ever heard such a growl like what we heard that night. It was frightening and I thought that it just might be the end. I looked at Joe and he looked at me, and I swear all I could see was the whites of his eyes. We took off running as fast as we could. 70 lb. packbacks and our tail between our legs. We must have ran for a mile at least ! If not more. We were absolutely terrorfied! To this day I will never forget that night and what that might have been out there in the marshland by Fort Canby State Park. To this day when I think about it...I still get chills.",
  "classification": "Class B",
  "county": "Pacific",
  "state": "Washington",
  "latitude": 46.31401,
  "longitude": -124.0273,
  "location": "-124.0273,46.31401",
  "location_details": "",
  "temperature_high": 84.96,
  "temperature_mid": 71.49,
  "temperature_low": 58.02,
  "dew_point": 54.07,
  "humidity": 0.64,
  "cloud_cover": 0.2,
  "moon_phase": 0.72,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.29,
  "summary": "Partly cloudy starting in the evening.",
  "uv_index": 8,
  "visibility": 9.6,
  "wind_bearing": 338,
  "wind_speed": 3.78
}