{
  "reportId": "7425",
  "title": "A Teenager and His Dog Encounter an Ape-like Creature While Retrieving Their Trap Lines",
  "date": "1958-11-01",
  "timestamp": -352425600,
  "observed": "I was fifteen or sixteen at the time, 1958, and running a trapline on a creek west and south of Adario, Ohio. It was my third or fourth year of trapping. My dog, Smokey, always went with me and usually chased rabbits while I was checking my traps. That morning, before going to school, I set out to check my traps with a near full moon lighting up the sky. It was a very cold morning. As I started down the Adario West Road toward the creek, Smokey started acting strange and wouldn't leave my side. He started growling a real deep growl, just barely audible. At each spot where I had a trap set, Smokey would sit on top of the bank while I went to check my traps. I was nearing the end of my trap line when I had to go down a steep bank to retrieve a muskrat in one of my traps. This time Smokey came down the bank with me and sat facing up the bank, his growling growing louder. I was just getting ready to reset the trap when an errie feeling came over me. I turned to look up the bank (Smokey had ceased growling and was leaning against me)and saw something I had never seen before until many years later in a documentary on 'Big Foot'. Whatever it was stood approx. seven feet tall and was all covered with long hair, except its face. The face was not exactly human, but not animal either. And there seemed to be some kind of foul odor in the air. Needless to say, it scared me half to death, but I think I also might have surprised it at the same time. In just seconds it turned and half walked, half ran away. I started up the bank a few seconds later and reached the top of the bank in time to see 'it' cross a six foot high gate leading into a field, without even touching it. I watched it lumber through the field for a minute or so to make sure it wasn't going the direction I had to go, and then started for home. Unfortunately, there was no snow on the ground and the ground was frozen pretty hard. I didn't even think to look for tracks at the time, but thought about it in school later in the day. I decided to go back out and look for tracks after school, but as luck would have it we got about four inches of snow before I got home from school. I didn't tell my parents or anyone else because I didn't want to loose my freedom to trap and knew my mom would come unglued if she knew about it. I waited several days before checking my trap line again for fear of running into it again, but never did see anything like it again. There are a lot of small woodlots in that area, but nothing of any great size because it is farm country with roads as close as one mile apart. I have no idea where something like that could have lived undetected by someone, sometime. I didn't find out until the early nineties that there had ever been any 'sightings' of such a creature anywhere in Ohio. I thought such sightings were mostly in northern CA and up the coast states into Canada. Anyhow, that's about as much as I can remember after forty-five years.",
  "classification": "Class A",
  "county": "Richland",
  "state": "Ohio",
  "latitude": 40.92276,
  "longitude": -82.44401,
  "location": "-82.44401,40.92276",
  "location_details": "The location was south of the Adario West Road approx 1/2 mile along the creek.",
  "temperature_high": 52.95,
  "temperature_mid": 47.99,
  "temperature_low": 43.03,
  "dew_point": 38.49,
  "humidity": 0.77,
  "cloud_cover": 0.72,
  "moon_phase": 0.65,
  "precip_intensity": 0.0012,
  "precip_probability": 0.34,
  "precip_type": "rain",
  "pressure": 1015.14,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 7.46,
  "wind_bearing": 36,
  "wind_speed": 6.58
}