{
  "id": "26035",
  "title": "Possible vocalizations heard and large footprints found near Malo",
  "date": "2005-03-01",
  "timestamp": 1109635200,
  "observed": "I'm going to put down three different incidents that has happened since I move to the mountains of northeast washington. The first I have already reported. It happened back in march of '05. It was about 1 or 1:30 in the morning and it was pretty warm in my room, so I got up to open the window. As I was standing there let the cool air hit my face I heard a cry that was kind of what I would have to say a moan/growl. It was coming from the hill that is in front of the house I live at. I have lived up here since '96 so I get to hear the sounds of nature and I can say for sure this wasn't anything I've ever heard before. I didn't even think it could be a bigfoot until the next week when I told my dad. He told me son I think you heard a bigfoot. I wasen't ready for that, then he tried to tell me what it would sound like from what other people reported and that was what I heard that night. The second is like the first close to where I heard the first. I was on a back road between my house and the next road over. It was dusk out and I was coming to an intersection just before I got to a cattleguard when I heard something. I stopped and turned off my truck to listen better. I stuck my head out the window when I heard the some type of moan/growl as in first. This time I got pretty excited. It was coming from behind and on a high bald hill to the east of where I was. This incident happened in august of '08. Now for number three. This happened back in '08 but in Febuary when there was snow on the ground which dosen't make walking very easy. Well I went to this hill over looking the area I live which is above my friends place. I have walked this same area for awhile and this is this first time I ever found a foot print. As I was starting to climb out of a dip in the hill there it was. I thought it was weird for someone to be out in the snow in their bare feet. As I stood there looking at the print I remember what I read in some reports find something to compare the size to. Two problems one I didn't get my digital camera until may and all I had to compare the size to was my size 13 foot. The size of that print out did me by three sizes. Can someone tell me I have a 13 foot and stand at 6'. This out did me by three sizes, what was the size of the creature that made that print.",
  "classification": "Class B",
  "county": "Ferry",
  "state": "Washington",
  "latitude": 48.7844,
  "longitude": -118.5545,
  "location": "-118.5545,48.7844",
  "location_details": "republic north on 21 hwy. to malo turn east. to fork in road take north fork until you get to blue place road. go on blue place road until you go over cattleguard. you will be below the hill.",
  "temperature_high": 51.83,
  "temperature_mid": 41.555,
  "temperature_low": 31.28,
  "dew_point": 34.76,
  "humidity": 0.76,
  "cloud_cover": 0.65,
  "moon_phase": 0.68,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.97,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 8.61,
  "wind_bearing": 155,
  "wind_speed": 1.34
}