{
  "reportId": "9547",
  "title": "Early morning vocalizations heard on three consecutive days",
  "date": "2004-06-04",
  "timestamp": 1086307200,
  "observed": "June 2004 For three days at dawn, I heard a long series of calls, the first of which lasted for about half an hour.  I was not fully awake for the first calling, and half awake, wondered if it was a screaming cow, being attacked or something. We have major preditors here, including a Mountain Lion. THIS WAS NOT A MOUNTAIN LION.  We've heard their screams, and this was nothing like that. Each dawn, the calls occured for a shorter and shorter duration. I was wide awake on the second and third dawns. On the third day at dusk, there was a brief series of calls.  It was the softest in volume.  Since then, I have heard nothing.  I live on one side of the Nehalem River valley, up a little on the ridge, and it sounded like the calls came from the opposite ridge which is very forested.  The calls sounded like a huge howler monkey, sort of a whoooop    whoooop   whooooop who's pitch went up at the ending.  As it progressed, the whooops got closer and closer together, until it was whooopwhoooopwhoooop, and then gradually faded out softly.  This sound reverberated across the entire valley, which is perhaps one mile from ridge to ridge.  I have lived in the woods of No Cal and Oregon, and heard many wild animals.  This was not a wolf, coyote, owl, elk, mountain lion, or the cows and donkeys that are a mile away.  This was much louder than the most emphatic sounds that these animals make.  A friend who has lived here, and on an Elk Preserve for many many years, heard the last dusk calling, and he said he had Never heard anything like it, and that Elk do not make that noise, nor are they that loud.  I live on Hwy 103, in Jewell, one mile off of Hwy 26.",
  "classification": "Class B",
  "county": "Clatsop",
  "state": "Oregon",
  "latitude": 45.93701,
  "longitude": -123.5417,
  "location": "-123.5417,45.93701",
  "location_details": "This area is the extended roam of one of the largest herds of Elk.  There is a large Elk Preserve a few miles away, along the Nehalem.",
  "temperature_high": 75.4,
  "temperature_mid": 65.9,
  "temperature_low": 56.4,
  "dew_point": 50.9,
  "humidity": 0.68,
  "cloud_cover": 0.19,
  "moon_phase": 0.56,
  "precip_intensity": 0.0003,
  "precip_probability": 0.31,
  "precip_type": "rain",
  "pressure": 1016.89,
  "summary": "Mostly cloudy overnight.",
  "uv_index": 9,
  "visibility": 9.68,
  "wind_bearing": 221,
  "wind_speed": 4.04
}