{
  "reportId": "16228",
  "title": "Possible sighting by a security guard at strip mine outside Holden",
  "date": "1990-06-10",
  "timestamp": 644976000,
  "observed": "My sighting occurred while working as a security guard on top of a mountain in Logan WV. I was working the graveyard (11pm-7am) shift on top of the mountain at a strip mine that was closing. The company was in the process of moving all of the expensive equipment to another site. I had a little trailer as an office and several large pieces of equipment and machinery surrounded the trailer. The location was sort of in a sinkhole that had been created at the top of this mountain..due to blasting. I had just made a tour of the area,checking the equipment (probably 200 square yards total) and scanning the woods that surrounded the area. It was around 3am. I found nothing unusual and went back inside the trailer and turned on the radio to listen to a talk show that I had been listening to each night. I started to put on a pot of coffee when I realized that there were no filters. A little building outside kept all the cups, filters, coffee, condiments,  etc., so I walked out to the building and grabbed a bag of filters when I heard a rustle in the brush about 20 yards behind the trailer. I went inside the trailer and grabbed my flashlight and went outside to check out the sound. At first I saw and heard nothing. Then to my right was the sound of something taking off and running through the brush toward the mountain. The beam of my flashlight caught sight of what I thought, at first, to be a black bear which are quite common in this area. However, as I looked closer, I saw what appeared to be a large bi-pedal animal squatting behind a large thicket about 25 yards from where I stood. The beam from my flashlight raked across its body. It shielded its face with huge hands and then ran off into the night. Thirty five to forty minutes later, while sitting in the trailer (with the door firmly locked and pistol in hand..lol)  looking out the window, I heard what can only be described as a scream that absolutely chilled me to the bone. I have goosebumps now just thinking about it. This was about 16 years ago. I have tried many times to convince myself that it was a bear. Deep down I know what I saw that night was not a bear or any animal that I have ever seen or heard, before or since. I really do not know what it was that I saw that night..and have never told anyone until now because I know that most people will just think I am crazy. I don't make any claims as to what it could be but since then I have researched the \"Sasquatch\" legend and read many books and features on the legend itself. The only thing I can tell you is this; when listening to a sound recorded in Ohio (I think) it sounded almost identical to the sound that I heard that night. The sound, more than the sighting scared me the most! It was like nothing I have ever heard before or since, except the recording from Ohio. After about another hour on the hill, I got up the nerve to jump in my car and get the hell off the mountain. I never went back to work there again. I talked to a guy that worked that area for years and he said that he had never seen anything but had heard some very strange screams, he attributed them to mountain lions or bobcats what I heard was no feline. Anyway, I am glad to see so many others have had similar experiences. Keep up the good work. Maybe someday we will find out just what it is that roams our mountains and forests. Who knows?",
  "classification": "Class B",
  "county": "Logan",
  "state": "West Virginia",
  "latitude": 37.75415,
  "longitude": -82.0029,
  "location": "-82.0029,37.75415",
  "location_details": "An area with thick brushy mountains in the summer. Located in the middle of the Appalachain mountains. Mining and logging area. Some regions of this area are very sparsley populated and travelled.",
  "temperature_high": 75.22,
  "temperature_mid": 65.61,
  "temperature_low": 56,
  "dew_point": 58.97,
  "humidity": 0.71,
  "cloud_cover": 0.56,
  "moon_phase": 0.57,
  "precip_intensity": 0.0019,
  "precip_probability": 0.19,
  "precip_type": "rain",
  "pressure": 1017.06,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 8,
  "visibility": 7.75,
  "wind_bearing": 308,
  "wind_speed": 5.41
}