{
  "reportId": "3759",
  "title": "Elk hunters encounter large animal and hear vocalizations near Rimrock Lake",
  "date": "2001-10-29",
  "timestamp": 1004313600,
  "observed": "Elk Camp 2001 . . . VERY LOUD and LONG VOLCALIZATIONS! The night before the incident, I aimed my 2,000,000 candle power spotlight to the cliffs and caves above the camp. As usual the relatives were around the campfire till late at night (1:00 a.m.) cracking jokes and making the most racket around, long after other area camps shut off their noisy generators. Believed this attracted it's couriousity. The relatives (3) who witnessed the sounds are very experienced outdoorsmen. One worked in the Northwest woods as a surveyor and has been chased by bears a couple of times (One time his co-worker had his pack ripped from his back as they ran) and all three know the sounds animals make. What they heard was NOT something like a Bear or Cougar! They are braver than most, not easily frightened by anyone or anything! The night of the incident was quiet and cold . . . about 2:30 a.m. one relative went outside the tent to relieve himself. As usual, he shined his flashlight around the perimeter of the camp. As the light beam went close to the creature, it let out a VERY LOUD and LONG Volcalization as it ran through the dense timber. The noise was very intense and continious without breaking branches along the way and again 3/4 mile up the high ridge. It seemed to be mad for almost being spotted and made the sound as it ran as though it was without effort. Comparable to a kids loud car stereo turned on with the volume already up and was steady for 10 - 12 seconds. The second time up the ridge could have been from another creature but sounded like the same one. It would have easily beaten any person up the heavily timbered and steep ridge. It was defenetly NOT any known animal like a Bear bellaring as it ran or a cougar. The noise was so loud it woke up three camps about 1/4 mile apart. The relatives left a gas lantern on until it burned out each night afterwards and they went out with a loaded gun or second person with their loaded gun. None of them will EVER sleep on the ground again! That week of hard hunting, the 14 other hunters in the area didn't see any Elk or Deer. Also did not hear any coyotes! Seemed like everthing was frightened away, very unusual. There was no sign in the hard frozen ground or up the high ridge the next day.",
  "classification": "Class B",
  "county": "Yakima",
  "state": "Washington",
  "latitude": 46.621,
  "longitude": -121.0638,
  "location": "-121.0638,46.621",
  "location_details": "Logging road above Rimrock Lake.",
  "temperature_high": 47.29,
  "temperature_mid": 44.505,
  "temperature_low": 41.72,
  "dew_point": 34.86,
  "humidity": 0.78,
  "cloud_cover": 0.82,
  "moon_phase": 0.42,
  "precip_intensity": 0.001,
  "precip_probability": 0.22,
  "precip_type": "rain",
  "pressure": 1020.74,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 8.52,
  "wind_bearing": 155,
  "wind_speed": 0.64
}