{
  "reportId": "2367",
  "title": "Unusual screams and two sightings near Shady Grove",
  "date": "1997-10-01",
  "timestamp": 875664000,
  "observed": "The first time my father and I were going up on a ridge to listen for some turkeys, when all of a sudden out of a pine thicket about 900 yards away, we heard something let out this awful noise. At first we were shocked, then scared because we had never heard this sort of noise before. It made this noise two seperate times, and we left and headed home and didnt think anything of it. About three months after that took place my friends and me thought we would drive through the road just to look around, it was about 11:00 p.m. and sort of foggy,we were just driving along when my cousin noticed two red eyes on a bank. I thought it was a racoon until the thing blinked and walked acrossed the road in front of us about 100 yds. up the road. The creature walked upright on two legs and stood about 6'10. We locked the doors and drove off as the creature disappeared into a heavily timbered thicket. A year later which was on Aug. 10 of 98, just a day ago , my sisters and two of my friends got in his truck and decided to go look for some deer. We ended up going down the same road where we had seen and the creature the previous year. The girls were riding in the back just talking to each other when my youngest screamed out. I turned around just in time to see the figure of something standing about thirty yards behind the truck. I grabbed the spotlight and swung it around only to find that the thing had disappeared into the woods.",
  "classification": "Class A",
  "county": "Crittenden",
  "state": "Kentucky",
  "latitude": 37.34029,
  "longitude": -87.89844,
  "location": "-87.89844,37.34029",
  "location_details": "",
  "temperature_high": 72.34,
  "temperature_mid": 57.675,
  "temperature_low": 43.01,
  "dew_point": 46.36,
  "humidity": 0.65,
  "cloud_cover": 0.05,
  "moon_phase": 0.01,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.37,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.58,
  "wind_bearing": 359,
  "wind_speed": 4.51
}