{
  "reportId": "1951",
  "title": "",
  "date": "",
  "observed": "We were walking down a trail at night. It was a full moon, or pretty big anyhow. There was a stream and on the other side I saw a hominid. It was walking on two feet, easily. NOT a bear, not a gorilla, not a chimp, not any ape I've ever seen. I'm very, very sure on that. It was either a man or bigfoot. I don't think it was a man. It doesn't fit very well. I only saw him a few seconds out of the dark shadows under the trees, but it was so obvious there just about 50-60 ft. across the stream, walking along the bare side of an embankment where it sloped up from the stream-bottom. I didn't say anything at first it was so just right there, I assumed the guy in front of me saw it and had taken it into account. We kind of looked to him as the leader, since he was a few years older. Anyway, when he didn't say anything I began to suspect he didn't see anything. I think he was humming a song and wasn't paying much attention. I was about to speak up when the guy behind me started to say something too. He had heard a noise up ahead. He pointed to where the creature had gone. It had walked across the slope, and down toward the stream in front of us. There it made a noise above that of the small stream. It sounded like a rock clocking against another like when you step on a rock and it clocks into another one. So he was worried what that noise was. I was all excited and tried to tell them what I saw. We all got nervous. We yelled but there was no answer. We were extremely scared. We were working as merit badge counselors at a Scout Camp. When you see another person up there, you say hi, because they're all fun-loving, friendly scouts or scoutmasters. This creature passed very near us, easily in range for a howdy or hello, but it didn't answer and didn't talk. We back tracked through the meadow we were in at the time into the lodgepole pines at the other end. We sat in the dark till about 1 a.m. We figured the creature went past at about 10 p.m. We imagined all sorts of things sneaking up on us in the dark. We finally each got big sticks, and Danny got his knife and we went the rest of the way down the trail ready to attack anything that moved. We were extremely scared. Let me describe the creature. It was tall, seemed about 6-7 ft. It was all one dark color. It walked surely and quickly and quietly. I noticed it brush a sapling with it's hand as it walked by it. It had a high crown. It was built stoutly in the torso, hips and thighs. I don't think a person that fat could move so smooth like it did. It also didn't look like a fat person. It seemed proportional, like that was how it was supposed to be. The thighs were wide and went up to a curved, large buttock. It just wasn't like a person. It was bigger but seemed (the only word I can think of) firm, fit, not fat, not inhibiting. I'm a very methodical, detail-oriented, type person. I've loved nature all my life, and know what the different animals look like. It was not a bear or an escaped ape, it moved in a distinct way. It sort of twisted its hips so the outline of the thigh and buttock changed. We didn't find any tracks or such. The night we saw it we were too scared to go looking. The next day we had to do our job, which took all day. It had rained also before we had a chance to look for tracks and we thought that any tracks would have washed away.",
  "classification": "Class A",
  "county": "Summit",
  "state": "Utah",
  "location_details": "Bear Scout Camp.",
  "summary": ""
}