{
  "id": "20221",
  "title": "Winter hikers find trail of footprints near Clark Fork",
  "date": "2000-12-31",
  "timestamp": 978220800,
  "observed": "It was during the winter of 2000-2001 and a friend and I were trying to pass the long winter in rural north Idaho with a \"snow hike\" to a waterfall.  The closest town is called Clark Fork, population: a couple hundred. There was deep snow on the ground and it was cold, dark, and snowy on that day.  We drove up a dirt road as far as we could until it was chained off.  We parked the car and walked up some snowmobile tracks to where the trail usually is.  I say usually because it was totally covered in deep snow.  Most people would have thought us crazy to be hiking that trail that day but like I said before, it was something to do in N. Idaho in the middle of winter. So we managed thru the deep snow up a slight ravine.  There were no other tracks that a human would make such as footprints, snowmobile, or snowshoe going up this ravine.  Probably about half way up the trail/ravine, we crossed some tracks.  The hair on the back of my neck stood up as I looked down at the tracks.  I knew instantly what I was looking at but I tried to explain it some other way at first.  The friend I was with grew up in Clark Fork and had lived there all his life.  Without mentioning the word bigfoot or sasquatch, I looked at him and said \"Is this what I think it is?\" and he non-chalantly replied something to the effect of \"We see this kind of stuff around here all the time\". I definitely believed in the possibility of the existence of sasquatch at the time but these tracks really sealed the deal in my mind. I know what bear tracks look like in the snow.  Moose, deer and elk also have a certain kind of track.  The tracks that I am reporting were huge.  I could fit my boot covered foot into them and they were definitely bigger than my boot.  What was even more telling was the distance between the tracks.  I would have had to jump from track to track to make it. So to sum it up: the tracks were roughly human foot shaped but very large-too large to be human. They were obviously made by a two legged, upright walking creature. The path of the tracks came across the ravine and up the other side- from \"nowhere\" going into \"nowhere\".  This area is miles and miles of national forest on the Idaho/Montana border.  There is no other rational explanation for tracks of this size and shape to be found where they were, when they were.  Believe it or not, but I know what I saw.",
  "classification": "Class B",
  "county": "Bonner",
  "state": "Idaho",
  "latitude": 48.25206,
  "longitude": -116.0969,
  "location": "-116.0969,48.25206",
  "location_details": "Go from Clark Fork and cross the river on a small one car bridge.  Take the dirt road parallel to the river and turn off on a \"fire road\" to head towards the waterfall.  The locals know it well but it's been years since I wintered there and can't recall the names of the roads and landmarks off the top of my head.",
  "temperature_high": 33.46,
  "temperature_mid": 30.52,
  "temperature_low": 27.58,
  "dew_point": 26.73,
  "humidity": 0.89,
  "cloud_cover": 0.85,
  "moon_phase": 0.19,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1030.72,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 7.33,
  "wind_bearing": 209,
  "wind_speed": 1.45
}