{
  "reportId": "41270",
  "title": "Possible daylight sighting while driving in farm country near Nashville",
  "date": "2013-05-27",
  "timestamp": 1369612800,
  "observed": "I have two things to report: 1) I think I saw a bigfoot 2) A few weeks later, I think I heard it Where do you start making a report about this?  All I can say is that after what I saw and heard, I have to support the other person that made a report because I have to back them up. In mid May, 2013, I was returning from Buckeye Deli in Nashville Ohio on a deserted back road, (TR211 on my way to CR22).  It was early dusk because I wanted to get some cigarettes at the store before it got dark.  I stopped for several minutes to take pictures of some horses on the side of the road.  I was listening to live Grateful Dead,\"Two From the Vault,\" on the Ford Expedition's CD player. I was enjoying thinking about being off work from traveling this summer, and appreciating this beautiful place that we call home.  The road is very scenic.  There is a canopy of trees which makes it cool to drive through in the hot summer.  The road cuts through a hill on the left and a ravine on the right. There are no guard rails and it is a dirt road. You don't travel this road in the winter if it is snowy and icy.  There are a few houses and farms nearby but mostly it is just wooded and remote.  Just locals for the most part go by every now and then.  So after several minutes of nature watching, (I have three photographs), I decided to go forward and as I put the car into gear, about 250 feet ahead of me I saw a big black creature leap from the hillside into the ravine.  I said outloud to myself, \"What the hell was that?\"  I made a mental note to watch for deer, as we all do around here, but then I got thinking about what I saw. It was definitely black or dark colored.  Since it was filtered light I realized that it couldn't be a deer that was sillhouetted dark, because the sun wasn't right for that. There was a cover of trees. I went back another day at the same time and confirmed it with my brother-in-law and husband. So after I saw it, I got nervous because I believed that I may just have seen real sasquatch! I have seen the TV show a couple of times, but didn't really think about it much.  I drove forward to where I saw whatever it was cross the road, (arms / front legs in the air, big body lower, leaping into the woods), and didn't see anything after that. I can't say how big it was.  It fits the profile looking back in my mind now.  I remember at the time thinking at first that I saw a deer, and that it was a very big deer, (the kind that people would be proud to get around here in season), and that I should watch out on my way home. Then I started thinking about what I saw, and knew that it wasn't a deer.  I have to admit going down the road a bit that after a cursory glance, looking for whatever I saw...I kind of wanted to get the heck out of there.  I called my sister-in-law on my way back to tell her that I think I saw a sasquatch, (she likes to joke about sasquatch stuff).  She can verify that I was a little shaken up by it.  I was still reeling when I got home a few minutes later, still on the phone with her, and reported it to my husband.  After a few minutes discussion, he said that it was probably a bear, which I was OK with. I thought about it for awhile that night and went on to other things.  After several days, (it was still on my mind), I decided to look online to see if there was any other reports out there for Holmes County, Ohio.  After a google search, I found BFRO and read the report from June 2012 for that very same area!  That blew me away because we are in a very rural area in the middle of nowhere.  What were the chances of having a report HERE!  So I started to think that maybe it was a sasquatch.  I sent an e-mail to BFRO and got a call the next morning from the Ohio investigator.  He sounded very credible to me, and while I was rushing around getting ready for a job interview, I had to tell him what I saw. He blew me away when he told me that there have been several reports from my area in the past 6 months.  Now I was really concerned that this might be real.  Word went out to our family about my possible squatch sighting, and this past Sunday of Memorial Day weekend, my brother-in-law came down for a visit because everyone else was out of town.  So the three of us re-traced my steps down TR211 about the same time of day so I could verify that the light would not make a deer look black.  I have the three pictures of horses from where I was parked when I saw it.  We matched up the area and took another look. We stopped where we thought that it crossed before the bend in the road, looked over, and noticed that the fence was bent.  There was no fur stuck to it. There was a black thing on it but we didn't think it was fur.  Maybe I should go back and look again! lol My brother-in-law said that the area looked squatchy.  There was a canopy of trees, hills, a stream, wildlife and seclusion. Here's the best part of the story... On Sunday of Memorial Day weekend a few weeks after my sighting, we made a big warm bonfire because it was in the mid 30s and we wanted to be outside to celebrate the unofficial first weekend of summer regardless of the cold. My husband went to bed, and my brother-in-law and I decided to turn off the music and listen to the night sounds. It was about one o'clock in the morning. There is a lot of wildlife around here.  It was then that my brother-in-law let a really good squatch call rip, (like you hear on youtube).  And wouldn't you know it, we got a similar call back!  I looked and him and he looked at me, like did we really just hear that?  So he did it again, and sure as sh-- it came back even louder and clearer...then it trailed off.  I just about died.  We're like no way did that just happen!  I noted the time 0138.  We both said that it was one of two things, either someone else was messing with us, (there are campgrounds not too far away on the Mohican River), or it was a sasquatch.  I looked down the road and the distant neighbors did not appear to be out,  not surprising because it was really late and really cold. We heard it from the same direction on TR211 where I saw something a few weeks earlier. It was 35 degrees out and no one would be howling from a crowded campsite.  The calls definitely came from the general direction of Nashville. I can tell you that it did not sound human and was totally creepy!  Up until that moment, there were no answers to previous calls.  We had been having fun with it earlier in the day practicing our squatch calls.  But the two of us, without a doubt, heard those two calls.  It sent chills down our spines, and we know what we heard.  I made a new rule, that if anyone wants to call squatch, that we have to have tape rolling on it. We have lived here for 14 years and I have never been afraid of any animal life around here when I sit out late night watching the moon and the stars on our porch or by the fire. I am a night-owl and enjoy staying up late, sometimes until sunrise. It's a nice time to think, and to enjoy my beautiful surroundings when I don't have to get up early in the morning. It's an amazing place here in Drake's Valley as the original locals call it.  We call it home now since 1999 and never want to leave, even if there is a bigfoot nearby! Although I have to admit, this whole thing kind of freaks me out and I don't want to be scared of my surroundings. You move here for the glory of it all, not to be afraid of it.  Maybe this place just became more amazing to me and I should embrace it. This old farm house has been here for 138 years and we are surrounded by wilderness. You can't spend any time away from here because the wilderness will start to take it over, (squirrels, racoons, cardinals, wasps, mowing lawn for hours, cuyote, bees, birds, moles, tics, deer, bald eagles, fox, muskrat, cats, rooster, heron, hawk,snakes, grouse, geese, duck, bullfrog, possum, rabbit etc). We have it all down here...and now we have sasquatch possibly! My husband and I know that we are guests in these animals' home.  It's our home too though.  Somehow we will learn to live together...and maybe even communicate. In any case, I saw of glimpse of something and I heard something.  What it was / is, I don't  exactly know.  By the way, as I am typing this report, which takes a lot of guts to submit, on our porch two days after hearing the squatch call, with no music on, just sitting here enjoying the evening quietly for about 4 hours now, I just heard something at 0102.  It was a big tree knock!  SERIOUSLY!  Figures that would happen right now. If I hadn't started doing some more research, I might not have paid much attention to that type of sound.  I do pride myself on being able to idenify every night sound around here when my music isn't playing.  That one that I just heard was a real tree knock!  It sounded as if someone took a tree and banged it on another tree. I only heard it once now. I recognized it immediately from audio clips.  That was not too far away from me now!  I just called my sister-in-law.  It was in the opposite direction from where we heard the call Sunday. Maybe it's waiting around to see if my brother-in-law came back. There are 189 uninhabited acres from our back yard to the Mohican River. I heard it at 0102 in that direction.  I know all the sounds around here, and that was a darn tree knock. I also have to say that on Sunday, my we were playing Ohio squatch sounds on Youtube and I got a chill and said, \"I have heard that sound before.\"  I just wrote it off to cuyote, peacock or ferel cats.  I am usually playing music, but my first thought is that I have heard that sound before.  A cuyote cry, (or maybe a sasquatch cry), comes in over the music.  You hear a lot in this valley. I have found renewed motivation to send you this report now.  I don't know what is going on...we're just regular people.  I am not drunk.  And lol, I don't think that I am crazy!  You wanted description, so I wrote an epistle as my dad would say. :)",
  "classification": "Class B",
  "county": "Holmes",
  "state": "Ohio",
  "latitude": 40.59307,
  "longitude": -82.14194,
  "location": "-82.14194,40.59307",
  "location_details": "Take SR514 from Buckeye Deli in Nashville, right on TR211. Sighting was just before TR466.  The squatch call-back occurred near the intersection of TR211 and CR22 toward Nashville.",
  "temperature_high": 63,
  "temperature_mid": 59.915,
  "temperature_low": 56.83,
  "dew_point": 42.89,
  "humidity": 0.65,
  "cloud_cover": 0.24,
  "moon_phase": 0.59,
  "precip_intensity": 0.0022,
  "precip_probability": 0.54,
  "precip_type": "rain",
  "pressure": 1022.61,
  "summary": "Mostly cloudy until afternoon.",
  "uv_index": 8,
  "visibility": 9.84,
  "wind_bearing": 127,
  "wind_speed": 5.96
}