{
  "id": "26494",
  "title": "",
  "date": "",
  "observed": "My boyfriend and I were hanging out around our campfire when the most unusual terrifying sound filled the air around us close to or just after 1100 PM. It was difficult to tell what direction it was comeing from, it seemed to surround us. It was a high-pitched screaming sound with whoops, reminicent to a siren and it was fairly continuous. It sounded otherworldly and struck fear into us instantly. We froze in terror and listened for about 30 seconds as the screaming whoops got louder and closer-sounding. Then we ran to the truck and honked the horn like crazy. The sounds continued and we sat listening for a good ten minutes as the sounds continued but seemed to move further away. We exited the truck and tore down camp immediately, pausing every few minutes to monitor the distance of the sounds, jumping into the truck for a minute or so again when the sounds would get close, honking the horn occasionally for good measure. We pulled out of camp at 1145 PM. On the drive down the hill we spotted a deer crossing the road. When we got home exhasted as we were we got right on the computer and googled coyote calls to compare to what we heard. Nothing quite fit, the closest we got was to audio of a whole pack of coyotes hunting and vocalizing. This morning, unsatisfied and curious I googles \"screams in the woods\" and found your site. When I listened to the 1978 recording in Washington of whooping screams I felt like I was right back in camp. THAT is what I heard EXACTLY!",
  "classification": "Class B",
  "county": "Clackamas",
  "state": "Oregon",
  "location_details": "Our campsite was on a dead-end dirt road deep into [edited at request]. It is a campsite we visit several times throughout the year. It is very secluded and quiet. There are blueberries, huckle berries, blackberries, raspberries, dandelion, milk thistle, salmon berries, miner's lettuce, and countless other varieties of wild edibles in abundance as well as rabbits and deer roaming through camp.",
  "summary": ""
}