{
  "reportId": "40101",
  "title": "Motorist views large bipedal animal squatting at night beside I-40 near Marche.",
  "date": "2012-12-07",
  "timestamp": 1354838400,
  "observed": "I saw an unidentified animal around 7:55 P.M. on 12/7/12 on the side of the road with gray fur I was driving at night on I-40 W from Little Rock to Conway around the 144 marker. It was on the right hand side of the road and was in a slumped/ sitting position. The animal was very large and had long gray/silver/black hair but mostly a dirty light gray. The best view of the animal I got was the broad side of its back.  The widest part of the body was at the elbows and it appeared to be about 4.5ft wide. From what appeared to be the head to the ground was about 5.5 ft tall. As I passed by I tried slowing down and was able to see  a profile shot of the animal. It appeared to be sitting looking at something on the ground. I would guess that it could be a deer that was hit by a car. I see deer at night on the sides of the road here almost every night coming through this area. The size of the animal was scaled to a road sign I saw just before the sighting. It was a large 4x4 sign that was turned backwards so all I could only see is the gray back. Minuets later after I saw the sign, the same distance from the road and slightly down the embankment was the anima (about 1.5-2 ft away from the white line).  The hair was similar to that of those long haired cows all over the body but still was able to see muscles under the hair very similar to a gorilla. After it happened I was not sure what I saw. I tried to classify the animal. To this day I have no ideas for sure what I saw. I have seen hundreds of animals at night driving and this was the first thing I could not ID. The animal had an eerie resemblance to a Bigfoot. At the time I had never heard of a Bigfoot with light colored hair and until I saw an episode of Finding Bigfoot where an eye whitness saw a white colored Bigfoot. I am open to any possibilities of the ID of this animal. Please let me know the BFRO's thoughts. Thanks!",
  "classification": "Class A",
  "county": "Pulaski",
  "state": "Arkansas",
  "latitude": 34.86535,
  "longitude": -92.3575,
  "location": "-92.3575,34.86535",
  "location_details": "I-40 between Little Rock and Conway around marker 144 heading west.",
  "temperature_high": 62.41,
  "temperature_mid": 59.615,
  "temperature_low": 56.82,
  "dew_point": 54.92,
  "humidity": 0.87,
  "cloud_cover": 0.93,
  "moon_phase": 0.79,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1012.23,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 8.01,
  "wind_bearing": 188,
  "wind_speed": 4.14
}