{
  "id": "14611",
  "title": "Possible vocalizations heard by new residents in an unpopulated rural area near the Broad River",
  "date": "2006-05-08",
  "timestamp": 1147046400,
  "observed": "This is not a sighting, but I believe I may have heard some of these creatures near my home last night.  My husband and I recently moved to a remote area of Fairfield County, SC near the Blair community.  The house we are renting has been vacant for quite some time and is near a thickly wooded area; our house backs up to the woods.  We finished moving in last Sunday.  There are no other homes in sight, though there are a few down the road from us.  We drive 23 miles to the nearest town for shopping. Last night (Monday, May 8) my husband and I were half watching TV, half dozing when it occurred to me the sounds I was hearing outside the back window were getting strange.  At first in the back of my mind I thought it was an owl; then I thought it must be the noisiest owl on record.  We are both hard of hearing and had the TV turned up pretty loud and the windows closed.  Then I realized it was more than one, and they were calling to one another, and seemed to be getting closer. I became alarmed around 11PM when one of our two dogs started barking in response to the noise.  They are on our enclosed back porch and we keep the door to the outside open so they can go out to a small enclosed yard area when they need to.  I went out to the porch and turned on the light, and they were very nervous and happy to see me.  After I calmed them down I stayed on the porch and listened in earnest.  What I heard sounded like a rhythmic hoo hoo hoo HOOOOOO, but unlike owl or dove sounds, it was very deep and loud, not at all birdlike.  My husband and I could not identify it, we kept saying \"is that coyote?  wolf?\"  and as soon as we would say it we would just shake our heads.  We both grew up and camped, hiked and traveled extensively in the West and know what coyote and wolf sound like. We discerned there were at least three distinct voices fanned out - to the south of our house, directly behind, and to the north, all to the west (wooded) side.  Upon listening at length and discerning a pattern, which seemed to relate to our presence there somehow, I was concerned enough to lock the dogs up on the porch and turn on all the lights to the outside. As the calling continued to move closer, the dogs cowered in the far corner of the porch.  We then realized our indoor cats had been missing all evening.  We found them up in our attic underneath boards we leaned against the wall in preparation for adding shelves there.  When we brought them down they ran right back up there and we didn't see them until morning. Also, the usual night sounds were absent.  Nothing else made a sound while this went on, and it lasted for at least two hours.  Towards the end, another call was so close I nearly panicked, and this one was making rapid hoo HOO noises interspersed with almost talking? sounds, while moving very quickly from the south to the north.  The others were answering rapid-fire.  I can't describe it any better than that, other than to say it wasn't yips or croaking or any of the normal animal sounds we hear out here, but very loud, deep and rapid and most certainly they were communicating with each other.  It was scary and intimidating, and if I had been in a camping situation I would have run for my life. My husband is a rural mail carrier out here and knows everyone.  He talked to several people today and they all said they have heard the sounds before but they don't know what they are either, most think they must be wild dogs. They can't be serious, if they have really listened.  But it doesn't surprise me.  I figure it must be this way with most people when confronted with something unknown and unexplainable, to come up with just about any explanation at hand and dismiss it. I decided to get on the Internet and see if I could find recordings of wild dogs and birds and find something similar.  After a day of searching I found the recordings of wolf and coyote here and the whooping and calls we heard most closely resembled the suspected bigfoot whoops on this site.",
  "classification": "Class B",
  "county": "Fairfield",
  "state": "South Carolina",
  "latitude": 34.421,
  "longitude": -81.396,
  "location": "-81.396,34.421",
  "location_details": "[The address provided, but was removed from public posting per request of witness]",
  "temperature_high": 61.99,
  "temperature_mid": 58.32,
  "temperature_low": 54.65,
  "dew_point": 50.45,
  "humidity": 0.8,
  "cloud_cover": 0.99,
  "moon_phase": 0.35,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.19,
  "summary": "Overcast throughout the day.",
  "uv_index": 6,
  "visibility": 8.08,
  "wind_bearing": 35,
  "wind_speed": 6.33
}