{
  "reportId": "5477",
  "title": "Teenager has a nighttime close encounter and then sees tracks in the snow in Avery",
  "date": "1978-12-16",
  "timestamp": 282614400,
  "observed": "When I was in my early teens, my aunt was dating this fellow who lived in Avery, CA. He was an aspiring carpenter who was trying to build a cabin on his property. Though the main house was already completely built, he took it upon himself to build this cabin directly across the way, on the side of this hill. Running between the main house and the cabin was a creek, which stood at the base of the hill, that had a bridge crossing over it. Anyway, my aunt had decided to move in with him during their courtship and they decided to live in the cabin as it was being built. I had spent my summer there with them that year, but this was my first time being there during the winter. The area (Avery) in which they lived was heavily forested and fairly remote, with the nearest neighbor being several miles away. Needless to say, it was extremely cold at that time of year. As a result, because the cabin was a work in progress, and only had plastic instead of glass in the windows, the wind would howl through the cabin and we were forced to rely on a pipe stove for heat. On this particular night, I was sleeping downstairs on the couch, with my aunt and her boyfriend sleeping in the bedroom upstairs, and was shivering like mad in my sleeping bag. What's worse, it had snowed the day before, so that also helped to lower the outside temperature and make things miserable as well. I was joined by their two dogs, who slept on the floor beside the stove. Well, as I laid there in my sleeping bag shivering, I heard a noise outside, like something was walking just outside the cabin. At first, I thought I had imagined it, but then the noise continued, which raised the attention of the two dogs. The next thing I knew, the dogs were growling in agitation and began pacing across the floor. Until this time, I'd never seen the dogs act so hostile. They were both usually mild mannered and friendly animals, and didn't normally exhibit this type of behavior. By now, I was growing scared. Though I couldn't see what was outside, I could hear it, and it sounded big as it moved around. My anxiety that night was increased significantly when I realized that whatever was out there could easily get inside. I was especially nervous because the front door was constructed of several two by fours and plastic, something which even the dogs could break through. Fortunately, after fifteen minutes of stark terror had passed, whatever was making the noise outside had moved on and things had quieted down again. Because there wasn't anything left to growl at, the dogs returned to their spots on the floor and went back to sleep. I wasn't so lucky, however, and laid awake for another hour or two, wondering if the whole episode had been a product of my imagination. When it happened, it began so abruptly and ended so shortly that I wasn't sure if the surreal event had really occured. It wasn't until the following morning that I knew for sure. Awaking the next morning before anyone else, I decided to take the dogs outside for a bathroom break. After going down the front steps of the cabin, I began walking downhill when I spotted what looked a set of tracks in the snow. The tracks seemed to start at the crest of the hill, pass by the cabin and then stop at the creek, only to begin again at the other side. Upon close examination, and after walking to the top of the hill, I could see that the tracks actually extended much further. Apparently, whatever it was had come around a bend of trees in the distance, walked across a small valley, crossed (stepped?) over a barbed wire fence, marking the government property line, and continued down the hill past the cabin. The tracks then crossed over the creek as if it had been jumped and continued up the other side. Now what made all of this so sobering that morning was that the prints looked like large humanoid feet. Each print had five toes and was about 13 to 15 inches in length. The stride between each print was about six to seven feet apart and each print seemed to be about 4 to 5 inches deep, if not more. Even more astonishing was the barbed wire fence that lay directly behind the cabin and what it revealed. I was amazed to see that it appeared as though this thing had just stepped over it without any problems at all, with one left and right print being on each side. What makes this remarkable was that, at the time, this same fence came up to my chest and was about 4.5 feet in height. As you might imagine, I was very excited about  this, it's not every day that you see a set of huge footprints like this in the snow!, and tried to get my aunt and uncle to come outside to have a look. Unfortunately, though, neither one of them wanted to get out of bed and face the cold, so they never saw the tracks. Shortly after their refusal to come outside, it began snowing heavily and, so, the tracks were covered up. When I talked to their local friends about this occurence in the subsequent times we all got together, they believed me and provided me with stories of their own. One story that I repeatedly heard in particular was how people would pull over in the middle of the night, believing that the wailing that they were hearing was a siren on a police car, only to find themselves alone in the dark night. Because I didn't want to be embarrassed or ridiculed by people, I've mostly kept this story to myself over the years, only telling my wife and several friends about it. I have, however, been interested in the Bigfoot/Sasquatch developments ever since and feel that this is an undiscovered species. I feel that Dr. Grover Krantz may have been on track when he speculated that this was Gigantopithecus that we're dealing with here. Still, who knows? I only know that what I experienced that night was very scary and very real.",
  "classification": "Class B",
  "county": "Calaveras",
  "state": "California",
  "latitude": 38.20444,
  "longitude": -120.3689,
  "location": "-120.3689,38.20444",
  "location_details": "I'm sorry, but I can't recall the specific directions. I can tell you that I was there 5 years ago or so and that the area around Avery had been built up, though the main house and cabin still remained when I found them.",
  "temperature_high": 47.47,
  "temperature_mid": 44.095,
  "temperature_low": 40.72,
  "dew_point": 32.6,
  "humidity": 0.78,
  "cloud_cover": 0.44,
  "moon_phase": 0.57,
  "precip_intensity": 0.0004,
  "precip_probability": 0.44,
  "precip_type": "rain",
  "pressure": 1015.7,
  "summary": "Light rain overnight.",
  "uv_index": 2,
  "visibility": 2.73,
  "wind_bearing": 163,
  "wind_speed": 4.65
}