{
  "reportId": "11506",
  "title": "Youth watches while bipedal creature pushes down trees",
  "date": "1977-10-15",
  "timestamp": 245721600,
  "observed": "My experience with Bigfoot occured when I was about ten years old during the fall of 1977.  I was always exploring the wooded area between route 5 and route 20 in northwestern PA, west of Crayton road.  One cool, wet evening just before dusk, I walked north into the woods via the main trail from our house.  At the fork in the trail, running north and east, was a small sand pit which I crouched into because I saw someone or something in the distance.  I peered over the rough, looking slightly northeastward. I watched this thing for nearly five minutes.  It was over 7 feet tall and weighted about 500 - 700 pounds from as far as I could tell.  It was black from head to toe.  Even its face was black.  It was tearing off tree limbs and pushing over rotted trees.   Playing as such as I had done several days earlier at the exact same spot. It must have been watching me.  It amazed me because there were really no rotted trees left to push over or rotted tree branches to break. It's strength was incredible.  I could hear the sounds of trees crackling and smashing to the ground.  I grew extremely scared by bigfoots size and strength and what it might do to me if it saw me.  The hair on my body stood straight up and without looking back I turned and ran as fast as I could.  I ran approximately 50 yards back along the trail and another 100 yards through the field to my parents house.  I never returned to explore the woods for another six months.",
  "classification": "Class A",
  "county": "Erie",
  "state": "Pennsylvania",
  "latitude": 41.91826,
  "longitude": -80.54177,
  "location": "-80.54177,41.91826",
  "location_details": "I-20 west from Erie, PA to West Springfield, PA. Goto Crayton Road.  Head north less than 1/4 mile on the west side of the road.",
  "temperature_high": 58.74,
  "temperature_mid": 48.075,
  "temperature_low": 37.41,
  "dew_point": 39.6,
  "humidity": 0.79,
  "cloud_cover": 0.55,
  "moon_phase": 0.1,
  "precip_intensity": 0.0018,
  "precip_probability": 0.64,
  "precip_type": "rain",
  "pressure": 1010.79,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 7.32,
  "wind_bearing": 235,
  "wind_speed": 7.53
}