{
  "id": "23496",
  "title": "Possible daylight encounter by a rural resident south of Sturgeon Bay",
  "date": "2003-04-15",
  "timestamp": 1050364800,
  "observed": "I have been haunted for 5 years by an experience I had when I lived in Door County Wisconsin.  I lived in a small town called Forestville.  We lived in the woods.  I should have called the DNR when it happened but I wrote it off as a bear even though I know all the bears in Wisconsin are black.  What I saw in a thicket beside my house was redish brown.  I walked down my driveway to get the mail....it was very early Spring.  I heard loud noises that sounded more like a man than an animal.  I peered through the thicket and all I could see was the hump of its' back as it pounded its' head or shoulder against the tree.  It was large.  I was so very curious to see more that I walked up onto our mound so I could look down into the thicket.  I could not see it better but it must have picked up my sent or seen me because it ran toward me.  I could hear it running and growling.  It hit some downed trees and could not catch up to me....I heard it hit the trees as I was running to my back door.   I am not crazy.  I am an educated woman.  I know what I experienced.  I have contacted the DNR of Wisconsin from where I live now because I just have not been able to get the experience out of my mind...it haunts me.  The DNR said it could not have been a bear.  So what was it??",
  "classification": "Class B",
  "county": "Door",
  "state": "Wisconsin",
  "latitude": 44.69867,
  "longitude": -87.49564,
  "location": "-87.49564,44.69867",
  "location_details": "I lived in the woods on a private road called \"Sleepy Hollow Drive\" in Wisconsin.",
  "temperature_high": 72.52,
  "temperature_mid": 53.55,
  "temperature_low": 34.58,
  "dew_point": 44.34,
  "humidity": 0.57,
  "cloud_cover": 0.23,
  "moon_phase": 0.46,
  "precip_intensity": 0.0135,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1006.63,
  "summary": "Rain in the evening and overnight and breezy overnight.",
  "uv_index": 7,
  "visibility": 9.51,
  "wind_bearing": 228,
  "wind_speed": 2.76
}