{
  "reportId": "4137",
  "title": "Hairy 7-8' tall creature confronts fisherman in moonlight",
  "date": "1977-08-15",
  "timestamp": 240451200,
  "observed": "During August of the Summer of '77, I had gone fishing with five of my school buddies down at the Lampasas River. We got there during the early evening hours (approx. 5:30) so there would be plenty of daylight for us to set out our trot-lines. We used a row boat to get up the river where we would set the lines up against the river bank, about 1/4 mile up stream from the overpass we had set camp under. Once the lines were set-up we would take turns going to check for fish and to re-bait the hooks. The first check came about 7:30. No fish were caught and the hooks were re-baited. The second came about 8:30 and still no fish; the hooks were re-baited. At 9:30 it was time for myself and Glen to go check the lines. Out of the six of us teenaged fishermen, Glen was the most level headed one. He was a non-drinker, non-smoker, Eagle Scout, and one of the funniest guys you would ever meet. The rest of us were a bunch of hoodlums that liked drinking and cutting up. So anyway, we set off to check the lines. We got to the bank where it dropped off a couple of feet and found the line (it had been marked with a red piece of cloth around the tree by it). I got ahold of the line and began pulling us down to the end as Glen was re-baiting the hooks which I pulled up. It took about 20 minutes to finish the baiting and we started back down the river (still no fish). About 50 feet from the end of our trot-line there ran a gravel bed along the rivers bottom from one bank to the other. So when you get to this point you have to pick the boat up and carry it about 50 feet until you get over it, then sit the boat back down, hop in, and take off. The depth of the water on the bed was only about 18 inches and when walking on it would make a very loud grinding sound, like rocks rubbing together. If you look around at the scene from this position you see the river in front and behind you but on both sides the river banks slope up and are covered with trees. From the top of the slope to the water is probably about 30-40 feet with an incline of about 15 degrees. So we get to the gravel bed and I get out first since I was in the front of the boat. I step onto the bed and pull the boat forward so Glen can step out. We pick the boat up and begin carrying it across. After about 3-4 steps we hear what sounds to be a very sharp cracking sound. We both stop and listen. Nothing but silence. We begin and again hear a loud cracking sound. Now we question each other as to what it was, could be. All of the sudden we hear what sounded like something rushing towards us from the West bank. We could hear what sounded like trees being broken, and we could see by the moonlight trees falling from the top of the bank coming straight for us. We are frozen and neither of us moves. Whatever it is, it is now coming right for us. It gets through the trees and is completely exposed to the moonlight. This thing looked to be 7-8 feet in height, was dark with hair, had a small head which looked like two orange, almost glowing, eyes, no resembalence of a neck, and very long, swaying arms, covered with hair about a foot long. This thing was coming at us VERY quickly. I fell backwards and caught myself with the boat. This was all I needed to snap me out of this trance. I held onto the boat and ran a hard and fast as I could over the gravel be. Glen was still holding onto the back and quickly hit the water. He too came out of his shock and we worked together to get out of there. Fishing gear, bait, paddles, cushions, everything was flying out the boat. We were screaming like a couple of 8 year old girls. My feet found the drop off of the gravel bed and I jumped in the boat, grabbed the only paddle I saw, and began paddling. Glen's feet overlooked the drop off and he went over his head in water. He quickly surfaced and flew into the boat and grabbed a seat cushion and began paddling. We made to the overpass and all of the guys were yelling at us, they wanted to know what had happened. We jumped out of the boat and told them all to get the hell out of here. Knowing we were VERY serious, we left everything, got in our trucks and took off back to Cove. We ended up at Glen's house for the night. The next morning Glen's brother (a preacher) asked us all about it. We told him the story and we was very excited and wanted to go check the spot. We arrived at the river and all piled in the boat and headed up stream. We got to the gravel bed and pulled to the shore where we saw it. We searched the entire area. Due to the heavy foliage we did not find any complete tracks. Nor did we find any hair. The only physical evidence was about 20 Mesquite trees which has been broken about three feet from the ground and some deep indentions in the ground.",
  "classification": "Class A",
  "county": "Lampasas",
  "state": "Texas",
  "latitude": 31.11611,
  "longitude": -98.055,
  "location": "-98.055,31.11611",
  "location_details": "At the Lampasas River, between Copperas Cove and Lampasas, Texas off of Highway 190.",
  "temperature_high": 95.57,
  "temperature_mid": 84.96,
  "temperature_low": 74.35,
  "dew_point": 71.43,
  "humidity": 0.67,
  "cloud_cover": 0.52,
  "moon_phase": 0.02,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.94,
  "summary": "Humid throughout the day and partly cloudy until evening.",
  "uv_index": 9,
  "visibility": 9.83,
  "wind_bearing": 166,
  "wind_speed": 7.93
}