{
  "reportId": "1390",
  "title": "Fisherman spots a large upright creature digging on the shore",
  "date": "1991-06-22",
  "timestamp": 677548800,
  "observed": "Very early AM what I first thought was a bear digging on the shore with its hand (paw) I guess looking for clams or small crabs. I was doing some fishing and walked to the bank down a small trail when I spotted it. I thought it was a bear so I stopped and slowly started to walk backup the trail. I walked about 5 yards and turned to see if it was following or had left. When I stopped and turned around to see this ‘bear’ it stoodup on it's hind legs and looked right at me. It was not a bear. It was about 7-71/2' tall. It walked very quickly to the north and disappeared into the brush and trees. I was to scared to follow it and in shock. I do not believe in Bigfoot, I still am not sure what it was I saw. It may have been a bear but it looked like a large hairy man (no neck to speak of or really any hair on the face) and it walked upright taking strides as a man. This was in 1991. I no longer live in Washington but now in Colorado. When I saw the creature go into the forest I stayed frozen for a good 15 minutes listening to hear if it might be coming. After then I walked overto where it had been. There were only two footprints of any real detail in the rocky sand. I wear a size 13, these were 15-16 inches, 5 toes, no claws or \"pad\" prints like a bear. I am a ordained Assemblies of God minister and I do not wish to get involved in this kind of stuff but my wife said I should tell someone. I have two pictures of the footprints, one with my shoe next to it for comparison. As I said, I do not really believe in Bigfoot, I just don't know what it was. My mother in-law believes in these things and has shown these pictures to a newspaper.",
  "classification": "Class A",
  "county": "Kitsap",
  "state": "Washington",
  "latitude": 47.5279,
  "longitude": -122.3454,
  "location": "-122.3454,47.5279",
  "location_details": "One Mile NE of Hood Canal Bridge.",
  "temperature_high": 65.59,
  "temperature_mid": 60.11,
  "temperature_low": 54.63,
  "dew_point": 50.99,
  "humidity": 0.76,
  "cloud_cover": 0.94,
  "moon_phase": 0.37,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.52,
  "summary": "Overcast throughout the day.",
  "uv_index": 5,
  "visibility": 7.98,
  "wind_bearing": 264,
  "wind_speed": 2.85
}