{
  "id": "10533",
  "title": "Hikers have daylight sighting west of Pikes Peak",
  "date": "1977-07-04",
  "timestamp": 236822400,
  "observed": "In the summer of 1977 my brother and I had ridden up to the top of Pikes Peak on the cog railway. We made it to the top around noon, ate at the snack bar and headed down the West side with our backpacks for a few days of fishing the high country streams and beaver ponds. We picked our way down the steep slope and reached the treeline about about an hour later. As we hiked thru an opening we noticed something about a half mile away in a large meadow. At first I thought it was two people walking down the sloping hillside, one above the other. When we pulled up our binoculars we realized that it was an unusually tall, dark, hairy creature with exceptionally long arms and a very long stride. We watched it move downhill into the trees in approximately 10-15 seconds.We were both stunned and couldn't believe what we had seen. Neither one of us thought pull a camera out of our packs, it happened so fast. After we got over the initial shock we went on down to a small lake, set up camp and spent an uneventfull night. We hiked on down for the next two days, fishing and camping without any further sightings. We never did hear any sounds from the creature and it didn't appear to be the least bit concerned by our activity.",
  "classification": "Class A",
  "county": "Teller",
  "state": "Colorado",
  "latitude": 38.826,
  "longitude": -105.1146,
  "location": "-105.1146,38.826",
  "location_details": "Below the treeline on the west side of Pikes Peak looking toward the north in the direction of Horsethief Park.",
  "temperature_high": 91.71,
  "temperature_mid": 78.77,
  "temperature_low": 65.83,
  "dew_point": 48.76,
  "humidity": 0.38,
  "cloud_cover": 0.45,
  "moon_phase": 0.63,
  "precip_intensity": 0.0001,
  "precip_probability": 0.19,
  "precip_type": "rain",
  "pressure": 1006.92,
  "summary": "Mostly cloudy starting in the afternoon.",
  "uv_index": 14,
  "visibility": 9.3,
  "wind_bearing": 194,
  "wind_speed": 3.99
}