{
  "reportId": "28123",
  "title": "Teenager recounts his sighting as a very young boy on his property near Yacolt",
  "date": "1995-08-15",
  "timestamp": 808444800,
  "observed": "As usual for my afternoon activity, I left the house to pick thimbleberries.  I was approximately fifty yards away from the house, and had been devouring berries for no more than three minutes.  It was then that an enormous creature stood up suddenly, from what I presume to have been a squatting position, from behind the hedge of thimbleberries, no more than three feet away from me. Although I was only two years old at the time my memories of the incident remain quite clear.  The creature was covered in thistly stark white fur.  Its build consisted of exceptionly broad shoulders, long burly arms which dangled at its sides, and a waist easily twice as large I was.  The whole appearence gave it a rather squarish appearence.  For the three or so seconds that I remained there I stood petrified by how large the monster was. I didn't look up to see the monster's face, but my peripheral vision told me that it had a humanish-shaped head and that it touched a twig on the tree behind it. After those few second passed, I ran.  I ran back to the house as fast as I could.  I was terrified. Looking back and wondering what it might have been, I was looking on Youtube watching various bigfoot documentaries when one showed a clip of a white creature very much similar to the one I had encounted many years ago.  Only now do I know that what I had encounted was a sasquatch.",
  "classification": "Class A",
  "county": "Clark",
  "state": "Washington",
  "latitude": 45.90052,
  "longitude": -122.3898,
  "location": "-122.3898,45.90052",
  "location_details": "This incident occured on our rural, somewhat wooded lane, within sight of our house.",
  "temperature_high": 67.93,
  "temperature_mid": 61.8,
  "temperature_low": 55.67,
  "dew_point": 52.03,
  "humidity": 0.68,
  "cloud_cover": 0.87,
  "moon_phase": 0.67,
  "precip_intensity": 0.0004,
  "precip_probability": 0.52,
  "precip_type": "rain",
  "pressure": 1010.73,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 9.58,
  "wind_bearing": 284,
  "wind_speed": 5.27
}