{
  "reportId": "23808",
  "title": "",
  "date": "",
  "observed": "My husband had told me about these woods that he grew up near that used to scare him as a boy.  He had not been to the woods in about 8 years and he thought that the incidents were scary just because he was a kid. We decided to go camping in the woods for the first time in 2006. It was in the winter time and the leaves were crunchy on the ground.  We went to the camp site where my husband used to camp and set up everything.  The camp site was about two football fields away from the main trail down in the valley.  We were on a sand bar that extended out into the water and there was only one trail in and out for this site. Right as it began to get dark it got very still and quiet. There were no birds, no dogs barking and we could not hear anything moving around.  We started cooking dinner and right when it got dark we heard the most horrifying scream that I have ever heard in my life.  The sound was so loud that I could feel it in my chest like someone was holding an air horn right out in front of me. We were bound and determined to stay the night so we just brushed it off as an owl or something. After the sound we could hear walking, very heavy two legged walking.  We did not know what to think so we just shrugged it off as a deer.  We decided to go to bed and get some sleep and just make it through the night.  As we were lying in the tent the walking got louder and then we heard a loud kerplunk in the water next to the tent.  We pushed it off as a beaver.  Then it did it again and we could not take any more so we decided to just grab some of our things and leave. As we were getting out of the tent we could hear the walking in front of us.  The thing was walking down our path towards us.  My husband had a 22 gun and decided to call out a bunch of warnings to make sure that it was not a person.  We had two high beam flashlights on the path and we saw eyes. They were big with no visible pupils, and they were green. My husband felt that we were in danger and decided to shoot three times at the eyes.  When he shot the thing walked towards us three steps and stopped.  I do not know about you but a normal animal will run when gun shots are fired at the close of a range (about 30 feet).  We got back to the camp site and felt trapped and helpless because we do not know how to get out of the woods with this thing in our path.  My husband ended up calling one of his high school friends that he had not spoken to in about 5 years to come and help us. Our friend came to our rescue and brought a bigger weapon and more lights.  From what my husband says the thing followed us out of the woods the entire way.  This story is one of about 6 so far. After that night our friends wanted to go out there to investigate so we went out there the next day and looked around. We could not find any tracks or hair but there were some trees and vines that actually formed a dome shape that a 6’ person could stand straight up in.  There were little piles of sticks under there and a spot flattened out big enough for a grown man to lie down on. The next night it was walking around us and it also knocked sticks together and screamed at us again and we left around 10:00pm that night and left the camping gear behind.  We have been out there about 6 other times and it is always there waiting for us so that it can scare us out of the woods again. Just to give you a little bit of a back ground on our witnesses.  We have had four law enforcement officers (including my husband), an RN, me and our friend’s wife.  I am telling you this because this is not a joke to us and it is very real.  My husband and his friends went to the woods about a month ago and got ran out again.",
  "classification": "Class B",
  "county": "Lamar",
  "state": "Georgia",
  "location_details": "",
  "summary": ""
}