{
  "reportId": "10632",
  "title": "Young boy observes animal chasing family horses",
  "date": "1978-08-21",
  "timestamp": 272505600,
  "observed": "I was about 9 years old in the summer of 1978 and was sitting on an upper deck area of our house when several things happened at about the same time. I was sitting with my dog when he started growling and going down the steps towards the lower field area of our property. Our horses were running and winneying up towards thier barn. After seeing them running , out of the corner of my eye I noticed something large and black or very dark brown in the lower field . I only caught a glimpse of it but noticed that it was running and had a massive chest. I screamed and my parents and older sister came running out . I remember being so scared that I couldn't talk and was trying to hide behind my Dad while pointing down in the field. It was on two legs and dissapeared right after I screamed. After I calmed down enough to talk I told my parents what I had seen and my Dad wanted me to go with him to look where I had seen this thing. He was going to take a 16 guage shotgun and even then I didn't think that would be enough if this thing decided to attack us.It was probably 100 to 200 yds. away but it was still very big to me at the time. On talking with my Mom and Dad recently about it they had other strange incidents to add. One was something I also remember happening. We would swim in a stream about 1/2 miles from our house and on several occasions there would be sevier crashing and thrashing of brush directly across from where we were fishing or swimming. My Mom was with us on most occasions and remembered that as well. It was one of the most terrifying sounds I've heard since. Very large limbs/small trees being broken and brush being thrashed . Something that got our attention in a hurry! It scared us and we always left never wanting to find out what it was that was making all that racket. My Dad has other stories as well. Thank you.",
  "classification": "Class A",
  "county": "Clearfield",
  "state": "Pennsylvania",
  "latitude": 40.97015,
  "longitude": -78.42314,
  "location": "-78.42314,40.97015",
  "location_details": "If you take Glen Ritchie HWY. out past Clearfield to about 3 miles before dimeling bridge on the right . A very steep driveway will take you down to where we used to live.",
  "temperature_high": 77.08,
  "temperature_mid": 64.51,
  "temperature_low": 51.94,
  "dew_point": 51.42,
  "humidity": 0.67,
  "cloud_cover": 0.01,
  "moon_phase": 0.62,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1025.14,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 9.27,
  "wind_bearing": 5,
  "wind_speed": 4.46
}