{
  "reportId": "2667",
  "title": "Couple sees \"power-walking\" biped in forest above Leadville",
  "date": "1995-06-15",
  "timestamp": 803174400,
  "observed": "My husband and I had been camping and were just out in the afternoon for a casual ride to see the scenery.  We had travelled only about 7 miles out of the town past some old mines in the area.  The road we were on was a slight climb and ahead of us maybe a quarter of a mile ( if even that) was a curve coming up that went to the right.  I was driving and had my eyes pretty much on the road itself when my husband began stuttering and finally got out, \"Stop.  To the right . . . what is that?\"  We observed a large, black animal on two feet, just like a man, walking through a clearing of pine trees toward the mountain side which was away from any roads.  I think we were both in shock when we saw it and didn't really believe what we were seeing.  The thing that really sticks out about it was the long arms that hung nearly to the knees but it didn't lumber or swing it's arms like an ape does, although the arms did swing . . . about like a man's walk but I guess the arms were more noticable because they were so long.  It also took very huge strides but in no way acted like it was in a hurry.  It all happened so fast I can't recall many more details about it, I just know it has always sort of bugged me and I've wanted to see it again.  If I had to make a guess at the height I would say 7 feet or a little more.  My husband is 6'5.  By the time my husband and I snapped out of our daze it was gone and the really frustrating thing about it too, is that we had a camcorder right by our sides and neither of us even thought to grab it!  I'm a really bad judge of distance but I would guess it was a little over 100 feet away from us when we saw it.",
  "classification": "Class A",
  "county": "Lake",
  "state": "Colorado",
  "latitude": 39.24998,
  "longitude": -106.2583,
  "location": "-106.2583,39.24998",
  "location_details": "Sighting occured on an unspecified road east of Leadville in the Pike-San Isabel National Forest. It was a few miles past mining district. Road was not the one to Mosquito Pass.",
  "temperature_high": 78.96,
  "temperature_mid": 63.56,
  "temperature_low": 48.16,
  "dew_point": 41.77,
  "humidity": 0.42,
  "cloud_cover": 0.63,
  "moon_phase": 0.6,
  "precip_type": "rain",
  "pressure": 1006.96,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 10,
  "visibility": 9.98,
  "wind_bearing": 179,
  "wind_speed": 5.4
}