{
  "id": "9648",
  "title": "Hunters have strange experiences and make an unusual discovery.",
  "date": "2002-08-13",
  "timestamp": 1029196800,
  "observed": "I was hunting with my close friend Chris R. in Sonoma County, CA on our family property that is adjacent to Pine Mountain.  We were walking along an old camp road that had become overgrown with brush and scrub. It was obvious that bear had been using this trail as there was a considerable amount of bear sign along the old road.  We got to a point in the trail where there was an overhang of pine limbs over a slight depression on the right side of the old road.  Upon inspecting the depression we noticed what appeared to be a left foot print, and a right leg outstretched in the pine needle cover on the ground.  We continued to survey the area, and noticed what appeared to be more tracks leading away from this overhang and depression.  I took photos with a disposable camera.  I have the prints, but they did not come out very clear.  Which was a disappointment, but something to look at nonetheless. We finished poking around, and continued on our way.  We got just a bit further down the trail, and we walked through an extremely strong smell of skunk, or wet dog-like odor.  No sooner had you smelled it that is disappeared, but if you took a few steps back it was extremely strong again. I have been hunting and recreating outdoors for many years, and I am very familiar with skunk spray, and how it seems to permeate a large area.  This was not simply the spray of a skunk.  It was very centralized.  It was literally like you walked through it, and it disappeared, then you could turn around and walk through it again. The two of us spent a few moments looking around, and we noticed, something very peculiar.  In the middle of the trail and not far from this smell, and the foot prints we had seen, was a large pile of oak acorns.  The strange thing was there was not an oak anywhere near this pile of acorns!  They seemed to have been placed in this location.  They were not a collection of shells from squirrels, they were fresh dropped acorns.  Enough to hold a hungry deer, or two for a little while. We theorized that whatever had been hunkered down under the pine overhang in the depression may have placed these acorns, then set up under the overhang off of the trail in ambush. Our intent was to walk to the back of Pine Mountain, then still hunt our way up to the top of the mountain.  We had used this road for years to access the back of the mountain, and we were very used to the topography, so anything out of the norm would be noticeable to us. Chris and I team hunt very well together and after a short strategy chat, decided to use a 50 step method: one of us would go 50 steps, stop and whistle to let the other hunter know it was their turn to take 50 steps, and then just watch and listen.  We were approximately 130 yards apart. The ground was covered in heavy and dry leaf litter so the going was somewhat noisy.  I had gone nearly three quarters of the way to the saddle at the top, and I heard what sounded like a whistle, but not the whistle I recognized as Chris'.  I also heard what sounded like a very large boulder break loose and roll down the back of the hill.  I had assumed that Chris had rolled it down hoping to kick something out, but based on the last whistle, this rock was rolled from that area, and seemed to be 60 yards to my right, when Chris would have been twice that distance away from me.  I though that maybe he had gotten closer to me as we made our way up, but that would not have been the case in the past.  We work very well together and spacing is everyhting on our team hunts. We got to the top of Pine Mountain, and we had a discusion and he told me that he thought I had rolled the boulder, and vice versa.  I told him about the whistle, and he told me the exact same thing.  He also had this overwhelming feeling of being followed up the hill.  Like something was timing it's footfalls so as to not be detected.  I have to admit, I felt this way too, even more so after the discussion about the boulder.",
  "classification": "Class B",
  "county": "Lake",
  "state": "California",
  "latitude": 38.75,
  "longitude": -122.7,
  "location": "-122.7,38.75",
  "location_details": "Dry Creek Road comes off of Highway 29 out of Middletown, Dry Creek Road goes into the back country through much privately owned land, to our ranch.  Our property is adjacent to and North of Pine Mountain.",
  "temperature_high": 83.35,
  "temperature_mid": 70.065,
  "temperature_low": 56.78,
  "dew_point": 52.38,
  "humidity": 0.62,
  "cloud_cover": 0.18,
  "moon_phase": 0.19,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1010.64,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 10,
  "visibility": 8.09,
  "wind_bearing": 204,
  "wind_speed": 5.56
}