{
  "reportId": "5076",
  "title": "Multiple wood on wood sounds heard in the Beach City Wildlife area",
  "date": "2002-10-12",
  "timestamp": 1034380800,
  "observed": "My girlfriend and I left Akron about 1:00 PM to head south for the afternoon. My room mate had given us directions to a waterfall in a little-known back road park on the edge of Tuscawaras and Stark Counties. His directions weren't so great, and we couldn't find the place and ended up in the small town of Winesburg. After looking around we decided to head back, however we decided to \"get lost\" for some fun and took a couple of turns without noticing any street names. We eventually found ourselves on a class two state highway in Dundee, OH area. Heading north we passed a state gameland office on the left, and I started looking for a parking area to take a hike. I'm an avid hunter, and love the wildlife area's here in Ohio as they normally have nice trails and roads to hike around on. We came up on a set of railroad tracks from the south, and right before the tracks on the left there was a small one lane dirt road. It was marked as state game land, so I turned down it. It went down a hill, skirted along a swampy region, and then turned west a bit. The parking area was about 3/4 of a mile to a mile from the main road I'd say, and the road continued on past the parking area but there were signs saying no vehicles were allowed past that point. At the time we were the only ones there and got out to take a walk. We started out on the road past the parking area. It took us to the railroad tracks, and we crossed them. The road continued on from there, and took a small branch in the road. We first went right, and hiked a while. This branch of the road went towards the swamp, and was quite overgrown. We never really stopped to listen, but eventually turned around and took the fork in the road that went higher up the hill away from the swamp. This led to a very overgrown field, and we skirted along the West edge along the woods and along the edge of the hill that overlooked the swamp. At the end of the field, I decided to walk into the woods and stop and listen just to observe what was around, as I usually do when hunting. This is when it happened.  Across the swamp about 150 yards, we heard three loud evenly spaced knocks on what sounded to be a rather large tree. They occurred about three knocks in two seconds, I'd say. A couple of seconds later we heard three more knocks from what seemed a larger distance, probably 250 yards or more. After a short pause I brought my girlfriend's attention to the sounds. At that time we heard three more large knocks from in front of us, followed by three more louder knocks from the left. At this point, three knocks came from our right from across the body of the swamp. The water I'm sure obscured my judgment of distance, but with that in consideration now I'd say they were maybe 200 yards away. At this time, we heard four louder knocks from in front of us, then three to our left. At this time I felt uncomfortable enough to say I wanted to get out of there. After walking at a high rate of speed out of the area for a few hundred yards, I felt we were out of danger. My love for trains took over, and we walked for a 100 yards or so up the tracks to the south through a large rock cut and back to the path. We headed back to the car, and came across a puddle and I was showing my girlfriend a frog when all of a sudden the sounds came back. I don't know if whatever created the sounds on the far side of the swamp had moved, or if what we had perceived as the sound coming from our right was now in front of us.  In any case, we heard three more knocks from straight across the swamp from us, and then three more from our right again across the swamp. Distance was too hard to judge as we immediately started heading for the car. I knew there was a swamp in between us but I didn't like sticking around. On the way out we crossed paths with two hunters in camo and armed with bows. I said hello, but didn't bother mentioning the sounds as at the time I hadn't thought much about it. During the whole incident the thought of the possibility of Bigfoot crossed my mind, but I didn't let it stay long. Afterwards, while thinking about what happened, I said something to my girlfriend about how strange the sounds were, and that maybe it was Bigfoot. She shockingly agreed, saying she had seen TV reports of similar instances involving Bigfoot. I must admit a history of being very interested in Bigfoot as a whole, but never have I experienced something like this. I know of no animal that communicates like this. We both agree that it seemed like communication, either to us or to each other. The sounds seemed too big for humans to make, and the knocking was quite deep in pitch, indicating a larger sized tree. On return my room mate said he had indeed heard stories of people having encounters in that area, and I immediately turned here. I hope someone can validate this encounter, or at the very least tell me what other type of woodland creature communicates by regular banging on trees",
  "classification": "Class B",
  "county": "Tuscarawas",
  "state": "Ohio",
  "latitude": 40.6298,
  "longitude": -81.5693,
  "location": "-81.5693,40.6298",
  "location_details": "North of Dundee off of State Route 93.",
  "temperature_high": 61.88,
  "temperature_mid": 55.83,
  "temperature_low": 49.78,
  "dew_point": 54.47,
  "humidity": 0.87,
  "cloud_cover": 0.86,
  "moon_phase": 0.23,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.49,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 7.06,
  "wind_bearing": 136,
  "wind_speed": 2.22
}