{
  "id": "24696",
  "title": "",
  "date": "",
  "observed": "During an elk hunt Aug.28th to Sept. 4th we were camped in the Snow Mass Wilderness area. The first two days were normal with no activity. We were just glassing for elk and fishing. After the first day of elk season my friend Jim shot his elk and that night things started to happen. That night we put some loins on an old saddle rack ( about 4' high) for lunch the next day. The next morning they were gone with no trace of anything climbing or dragging them away. The rack would not of held up to anything of weight climbing on it. It was like something had picked them up and walked away. The next night one of the hunters was awakened by something pushing on his feet through the tent wall and asked his son if he was pushing on his feet but his son said no. The next night I was awakened about 2:00 am by something dragging my tent. I thought I was dreaming at first but realized I was't. I grabbed for my light but the tent quit moving as I rolled over. My first thought was a bear was trying to break in but I could not hear any breathing like a bear would be easy to hear at two feet also I could not hear no moving outside the tent. I did not turn on the light hoping whatever it was if did nothing it would leave. I layed motionless till morning and never heard anything. At daylight I exited my tent and found an old elk jaw at the doorway and the tent had been moved @ 6\" to 8\". I checked the elk jaw and tent for teeth marks or tears but there was none. Whatever had moved the tent would had to of had hands and had to of gripped the tent by each cornerabout 6 1/2' apart because the rain fly would have been in the way.I did not tell the other two guys in camp because I didn't want them to think I was crazy. Then as we went out to track an elk that morning as we cleared the trees by camp we heard 3 whooping typ calls from the thick pines above camp.The two hunters just looked at each other and said what the hell was that. I said I diddn't know and started walking. That evening Jim had returned from packing his elk out so I told him what had happened. That night something spooked one of the mules so bad it was trying to get loose so we went out to check but saw nothing. The next morning Jim and I talked about leaving and packed up camp and left with the other two hunters.",
  "classification": "Class B",
  "county": "Pitkin",
  "state": "Colorado",
  "location_details": "",
  "summary": ""
}