{
  "id": "49019",
  "title": "Memory told of a close daylight encounter while playing near Mikana",
  "date": "1975-07-15",
  "timestamp": 174614400,
  "observed": "I had spent the summer with my sister and her family. Prior to starting the new school year my family came from Oak Park IL. to get me and spend a few day with my sister. Myself 12 brother 10 and my 2 nieces 5 & 7 were at a swing set at the edge of the woods swinging and talking and cutting up. I don't know why but for some reason we all just stopped and turned around at the same time. Standing about 10 feet from us was a large ape like animal. In plain view nothing was near him at all. It was about 8 ft. tall covered head to toe with a medium brown hair except the face area which looked similar to a chimp face. It had a widows peak at the hairline and black eyes. Very muscular about 2 ft. thick from back to chest and long arms. At this age I had never heard of bigfoot. It was looking over its left shoulder and looking me directly in the eyes. All of us just froze and looked at it for a few seconds then at the same time we all took off in one direction as it took off in another. We ran to the house and told everyone we just saw a monster, but they just laugh at us. It was a year later that my brother found a book on bigfoot that's when we knew what we had encountered that day. Many days I have wondered how something that big could of got that close to us and what was it intending to do. Although it was not aggressive and it's reaction was the same as ours to run. We didn't go outside much after that.",
  "classification": "Class A",
  "county": "Barron",
  "state": "Wisconsin",
  "latitude": 45.58858,
  "longitude": -91.59938,
  "location": "-91.59938,45.58858",
  "location_details": "Location is near Shady Elms Resort.",
  "temperature_high": 89.5,
  "temperature_mid": 79.915,
  "temperature_low": 70.33,
  "dew_point": 63.08,
  "humidity": 0.66,
  "cloud_cover": 0.13,
  "moon_phase": 0.24,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.79,
  "summary": "Partly cloudy in the morning and breezy starting in the afternoon, continuing until evening.",
  "uv_index": 9,
  "visibility": 9.78,
  "wind_bearing": 196,
  "wind_speed": 10.74
}