{
  "reportId": "24612",
  "title": "Couple camping NW of Mt. Rainier hear loud vocals and footsteps",
  "date": "2008-08-24",
  "timestamp": 1219536000,
  "observed": "I have been researching bf for the last few months.  I read a report that I thought lead me to the area but Im having trouble finding it. My girlfriend and I decided on the spur of the moment to go check it out.  I drove my 4x4(4x4 needed to get there) up into the woods, we set up camp at about 11am aug 23 2008.  I didnt do anything out of the ordinary for a camping trip except through out 2 or 3 whoops during the day just kinda trying to practice making a sound that sounded some what believable.  We gathered some wood, made a fire, BBQ some burgers, it was a pretty uneventful day.  We decided to hit the hey relatively early at about ten to ten thirty.  We werent sleeping very soundly we were both waking throughout the night.  At about 3am I woke up and noticed the fire was about to go out, I hoped out of the truck turned some logs on the fire, took a leak and crawled back in bed.  No sooner then I got comfortable a very loud whoopish sound that turned into a bird sound at the end, it was all one breath no pause, much to loud to be a bird, and it was within 25 yards of my camp.  Within 30 seconds another one answered back from what I would guess to be a mile away atleast.  I grabed the flashlight and the rifle(just in case)I shined the light in the tree line. As soon as I turned the light on it got spooked, it got out of there but it wasnt a full run more of a jog. It was so close could hear the thuds of its feet on the ground.  I was tired and fell back to sleep within a hour or so my girlfriend couldnt sleep and said she heard another vocalization more distant then the first two.  I tried to look for prints in the mourning but the underbrush was so thick I could hardly move around, the brush was up to my waist everywhere and up to my chest in places and im 6 foot.  Unfortunatley I couldnt come up with any clear path it had taken.",
  "classification": "Class B",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 47.00008,
  "longitude": -121.9563,
  "location": "-121.9563,47.00008",
  "location_details": "old baldy mountain",
  "temperature_high": 72.2,
  "temperature_mid": 63.19,
  "temperature_low": 54.18,
  "dew_point": 55.64,
  "humidity": 0.78,
  "cloud_cover": 0.52,
  "moon_phase": 0.78,
  "precip_intensity": 0.0137,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1011.64,
  "summary": "Rain starting in the afternoon, continuing until evening.",
  "uv_index": 4,
  "visibility": 8.73,
  "wind_bearing": 193,
  "wind_speed": 4.03
}