{
  "reportId": "914",
  "title": "",
  "date": "",
  "observed": "On December 9, 2000, 3:30 pm I was working two of my horses near the barn. I saw my mares in the pasture looking in the woods. The mares were 100 feet from the woods, I with my stallion 400 feet (approx.) from the mares.  I thought a dog or deer may be in the woods. I standing on the ground working the stallion around me, look in the direction of the mares and see what I thougt was a teenager standing at the tree line. This made me angry that a kid would be that for on the property that I was leaseing.I looked again and noticed that the kid was wareing a very heavy coat. This was strange because it was 45 to 50 degrees out. From head to just above the knees was what looked like a light grey parka.I could not see below the knees. I was not afraid at what I was seeing .At the onset of the observation I thought that this was a teen age boy. The more I looked the more odd things seemed. The object stood up on two legs and swayed back and forth a few times. When it swayed I could tell that the \"hair\" was longer than expected and the swaying was not that of a human.My mind then began to try to decide what this was, a boy or what. At this time I still did not relate this with a Yeti or Sasquatch type animal. The incident took 10 to 15 seconds from first visual contact. Upon turning with the horse back to the direction of the animal it was gone. I did not see it walk to the edge of the woods or see it walk away. I do realize that this is not a alot of information but this is the first time I have ever seen anything that I could not give a name to or have seen before. I went into work on the 11 of December and mention this to some coworkers that were borned and raised here.One is a hunter. I asked with out telling him of my sighting.He told me that his freinds on many occasion have seen \"yetis\" over the years.The sightings were at least 20 miles from my sighting and they were dark brown or black. Mine being very light grey. I go to another person that I know has lived in this area all his life. I ask him, have you ever seen a animal that you did not know what it was ,as in a strange animal.He told me that he has not seen any such thing , but a few years ago the football couch and his friend drop off a young student after a game. While going home on a country road both gentlemen saw a animal that looked like a very tall big man coverd in hair. Other people make jokes when I ask  if they have seen any such sightings.What I saw may have been a teen age boy but I don't think so.I will have a camera with a zoom lense with me when I work my hoses. I will also try and find any evedence to prove one way or the other what I saw.",
  "classification": "Class A",
  "county": "Marshall",
  "state": "Tennessee",
  "location_details": "",
  "summary": ""
}