{
  "reportId": "10279",
  "title": "Family hears unusual calls",
  "date": "2004-01-16",
  "timestamp": 1074211200,
  "observed": "Last night, Jan.16,2005, I took my dog outside for a little walk. We live on 2 acres in Redwood Valley, CA.  It was dark and about 6:00 with a mod. overcast sky, the moon peeking through the clouds. We have a small dog that will usually bark in response to any other dog barking in our area.  Houses are well-spaced on our rolling hillside that's covered with a mix of oak and pines. From Hwy. 101 looking west, you see very few houses on our hillside. Anyway, as I was walking I could hear this very unusual \"animal\" sound unlike any I've heard before. It was NOT a dog howling and I'm not even sure how to describe it. We have coyotes and mountain lions and the sound would not fit the description of their cries or calls either. It had a yelling/howl quality that lasted about 5 seconds , would break off and then resume about 15 seconds later. I went in the house to get my husband so that he could hear the sound. My dog was not barking which is really unusual because he's inclinded to bark at dogs or other unfamiliar sounds.  None of the dogs on our hillside were barking either which seemed odd to me. I was kind of scared .  My husband came out and listened. His initial response was, \"Anyway, it's on the other side of that hill.\" I said, \"It's not a dog, and our dog is not barking at it.\"  He agreed it was strange but wasn't concerned. Soon thereafter, a dog could be heard barking and our dog started in with his typical barking response. The unusual sound stopped and I didn't hear it again. This is not the first time we've heard  unusual sounds that we can't identify. We woke up one night hearing whooping sounds outside the house that I can't connect with any animal I'm familiar with. My daughter has also heard whooping sounds on the same hillside where we heard the unusual sounds last night. My teenage son heard whooping sounds last summer in the manzanita to the north of our house. We had an odd experience last summer. My college aged son and his friends were imitating \"Big Foot\" sounds that they'd heard on the internet . It was about 11:00 at night when they were fooling around , loudly imitating the sounds.  About 1:00 AM, that same night, we were watching a video and we heard a scratching at the window. We all thought my son was outside trying to scare everyone. All of a sudden , water was splashing all over the side of the house. A water sprinkler pipe outside the window had been snapped off, and water was geysering out of the pipe. My son walked out of the bathroom and it turned out he'd been in the house all along. No one had been outside and we still wonder how the pipe was snapped off. Whatever had been scratching at the window had apparently broken the pipe.  We all wondered if it was a response to the Big Foot calls that the guys had been making. Anyway, here's a synopsis of a few incidents. We decided to post these after last nights occurrence of the strange, unidentifiable call.",
  "classification": "Class B",
  "county": "Mendocino",
  "state": "California",
  "latitude": 39.25,
  "longitude": -123.15,
  "location": "-123.15,39.25",
  "location_details": "",
  "temperature_high": 51.83,
  "temperature_mid": 48.935,
  "temperature_low": 46.04,
  "dew_point": 45.96,
  "humidity": 0.89,
  "cloud_cover": 0.89,
  "moon_phase": 0.81,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.47,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 7.58,
  "wind_bearing": 310,
  "wind_speed": 1.01
}