{
  "reportId": "28017",
  "title": "Hikers observe and cast possible fresh footprints in Leominister State Forest",
  "date": "2010-11-08",
  "timestamp": 1289174400,
  "observed": "I am 45 years old, have spent my whole life in the woods. I have been hunting and fishing since I was very young. On June 28th my wife and I decieded to take a walk in the woods. We were heading to a secluded resivior located aprox. 2 miles in the woods. We came upon a spot in the woods that seemed liked someone was watching us. We heard a noise come from some bushes. I thought it was a grunt from a buck. We both expected to a deer come outof the brush. I said, maybe it was a Bigfoot. She told me to shut up and keep walking. We walked for another 15 minutes and realized we were on the wrong path to the lake. We stopped, ate lunch and headed back into the woods. We had stopped at some power lines and sat in some shade. It was over 94 gegrees that day, and this was about noon time. As we walked back, we both noticed some very DEEP foot prints that did not look right. They were clearly 5 toed \"Human\" prints. In between the prints, was some deer tracks. The tracks clearly looked like the Human prints were chasing the deer prints. We both looked at each other and said, why would someone be running Barefoot, in 100 degree weather in the middle of the woods on a Tuesady afternoon? There were no other people in the woods at that time. The tracks were not there the first time we passed this spot, the noise was, the tracks were not. At this point I became very concerned that what ever made the prints was still in the area. I grabbed a big rock and told my wife to take some pictures with her cell phone. The tracks were about 6 to 7 feet apart. I could tell the first print was a right foot, that jumped out of the woods. The sixth and final step was a left foot that looked like it pushed off into the woods. No other tracks were before or after these six prints. We both became very nervous and started talking loudly and whistling. I did not want to run into this \"person\". We became a little confused and ended up on the worng path home. We walked for a couple hours, no way were we going back the way we came. Did not notice any smells or sounds. Just very quiet. No animal sound at all.",
  "classification": "Class B",
  "county": "Worcester",
  "state": "Massachusetts",
  "latitude": 42.54334,
  "longitude": -71.80123,
  "location": "-71.80123,42.54334",
  "location_details": "Leominster state forest, back side of No Town Res.",
  "temperature_high": 49.31,
  "temperature_mid": 46.275,
  "temperature_low": 43.24,
  "dew_point": 37.15,
  "humidity": 0.85,
  "cloud_cover": 0.99,
  "moon_phase": 0.09,
  "precip_intensity": 0.0191,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1000.82,
  "summary": "Rain and breezy in the morning.",
  "uv_index": 1,
  "visibility": 7.02,
  "wind_bearing": 345,
  "wind_speed": 12.37
}