{
  "reportId": "3080",
  "title": "A family's encounters with a reddish brown beast outside of Newcomerstown, Ohio",
  "date": "1997-05-01",
  "timestamp": 862444800,
  "observed": "There was several incidents that occurred at my grandparents outside of Newcomerstown, Ohio in Tuscarawas County. The first one was when my aunt was outside by the field and heard a very high pitched scream that was like nothing she has ever heard. She came in and got us and the scream sounded closer and closer then it just stopped. Another time was when my aunt was looking for her dog Cheyenne and something with a very deep tone growled at her causing her to run back to the log cabin. When my sister was taking her dog Aquilia outside for a walk the dog stopped, her ears went back, her hair stood up, and she ran back into the house. My sister looked up and thought she saw something but she was not sure. Then my cousins and I were out on the deer stand by the field and I looked toward the West and saw this tall reddish brown beast with black deep set eyes. It had hair on its face the same color and a broad forehead. I turned back around for a minute and turned back around facing the thing and it disappeared. This happened before my sisters dog Aquilia got scared. My uncle was walking and found a thick clump of black hair on the ground. My sister, friend, cousins and I were walking and found a dead deer like described in the \"Deer kills and Bigfoot\" article, stomach the same and everything. Very late at night my aunt was sitting on the porch and heard a gorilla like scream and heard dogs running after it. Then my sisters were in the garden getting tomatoes and heard a growl like the one my aunt heard. My uncle was working up in the building and heard the same growl.",
  "classification": "Class A",
  "county": "Tuscarawas",
  "state": "Ohio",
  "latitude": 40.27488,
  "longitude": -81.51749,
  "location": "-81.51749,40.27488",
  "location_details": "State Route 258 to Gravel Lick Road.",
  "temperature_high": 55.94,
  "temperature_mid": 45.38,
  "temperature_low": 34.82,
  "dew_point": 43.79,
  "humidity": 0.71,
  "cloud_cover": 0.8,
  "moon_phase": 0.81,
  "precip_intensity": 0.0071,
  "precip_probability": 0.71,
  "precip_type": "rain",
  "pressure": 1002.85,
  "summary": "Mostly cloudy throughout the day and breezy until evening.",
  "uv_index": 5,
  "visibility": 9.69,
  "wind_bearing": 245,
  "wind_speed": 15.77
}