{
  "reportId": "26580",
  "title": "Two hunters are followed by an unseen creature near Toutle",
  "date": "2009-09-12",
  "timestamp": 1252713600,
  "observed": "All I have to say is I have never been more scared in my life. I have been a hunter for fifteen years now, knowing, and enjoying the woods more than anywhere else on this planet. This incident happened saturday night, Sept. 12 down a gated logging road above a fish hatchery. It was elk season for bow hunting, and my buddy wanted to go try for an elk. I knew my other buddy was already down hunting elk near castle rock, so I said lets go down there. Since I only hunt modern firearm, I was not hunting elk, but I brought my rifle because bear season was open. We got down there saturday morning about four a.m. . We did a morning hunt, then took a break back at camp during the middle of the day. For our evening hunt we decided to head east past the town of Toutle about two to three miles. Right before a shell station on your right, we took a left. We drove for a little while until we came across a fish hatchery. We decided to turn around and park at a gate right up the road from the fish hatchery. We all walked in together (4 of us total). When we came to a Y in the road we decided to split up. We continued walking, and thats when I kept hearing something walking in the woods to my right. I mentioned to my buddy that something was pacing us in the woods, so we left that road and headed down an old grassy side road that hadnt been used in a while. When we got to the end of the road I stepped off the road to look down an embankment (trying to see the river)and thats when I heard a deep rumble of a growl, and it seemed to be right next to me. I signaled my buddy to come quick, and I kept looking in the brush, but couldnt see anything. We sat there for a minute, then we heard this thing move around, but it never came out of the brush. We decided to leave that spot and head back to a little clearing we had seen on the way in. I also noticed that all the animal sign in the area was old. There was no fresh tracks or feces of any kind that I saw in the area, which discouraged us since we were looking for elk. We went back to the clearing and sat there until it was dark. Since our other buddies went further up the road than us, we went back to the Y in the road and waited for them. When it became pitch black and they hadnt returned, we decided that we better head toward the truck. As we were walking, I heard the brush move a couple of times, again to my right. I said to my buddy, it sounds like something is in there. He said he had heard that, so we continued walking and listening. Then it seemed to get louder, like someone was just walking through the brush without trying to be quiet. For about a half mile, this thing, whatever it was, paced us and would not leave, no matter how loud we got. We walked the rest of that half mile back to back. I had a flashlight thats built into my hat, and I had that aimed into the woods with my gun pointed right in that direction. When we got back to the truck, our other two buddies were already in his truck with it running. They said they had popped out onto the main road and walked back to the truck from another direction. I want to note, whatever it was that was pacing us sounded way bigger than a cougar. I would also say that it wouldnt be a bear, since bear tend to be skiddish, and will usually run away from you. The growl that I heard was very deep, but not loud. It was a low rumble that seemed to shake me. Like I said before, I love the woods, and spent my whole life getting out camping, fishing, and hunting. I have never had something like this happen to me before. The only animal I saw the whole time was a bat, and that was when it was almost dark. I didnt even notice a bird the whole time we were down this road.",
  "classification": "Class B",
  "county": "Cowlitz",
  "state": "Washington",
  "latitude": 46.38448,
  "longitude": -122.5572,
  "location": "-122.5572,46.38448",
  "location_details": "[Edited] Off interstate 5 take exit 49, head east out of Castle Rock 6 or 7 miles to the town of Toutle. Keep going east past Toutle 2 to 3 more miles and the dirt road is to your left. right before a shell gas station that would be on your right.",
  "temperature_high": 83.18,
  "temperature_mid": 71.39,
  "temperature_low": 59.6,
  "dew_point": 54.96,
  "humidity": 0.67,
  "cloud_cover": 0.06,
  "moon_phase": 0.78,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1008.18,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.82,
  "wind_bearing": 301,
  "wind_speed": 2.44
}