{
  "id": "32536",
  "title": "",
  "date": "",
  "observed": "I am from Cle Elum Wa. and I am reporting an encounter with an unknown creature that I was sure was not a bear or animal such as that nature. This incidence took place over a two day period in the forested area of Wa. near green water area off of FS road 70 at a lake in the Greenwater Wa. area off of hwy 410. My husband and I camped at this lake every Thanksgiving weekend from 2002-2005 and on our last holiday 4 day weekend that we were there we experienced something of an encounter with what I believe to be a bigfoot. It was a Saturday morning when this started and it started with huge ear shattering deep growling howl like screams....more like warnings from something that did not want us there. We were the only human occupants in that area since it is very cold and most people are enjoying their weekend watching football and stuff at home. this lake is very isolated and a trek to get into since the road is overgrown with bushes and hard on vehicle paint jobs. We were cooking breakfast when this screaming at us started and it was such an unusual sound that it made my hair stand up and made me afraid to go into the woods to use the bathroom. There were many of these gutteral warning screams and they were watching us and I know this for fact since I was being brave and going to go down towards the lake and it scream growled at me and the force was so intense that the vibration from the sound literally knocked me back a step!I did not go down to the lake since I knew this noise was a warning! It was warning us to stay away from certain parts of the area that we were camping at. that night as we lay sleeping in our tent trailer there was a wind storm and I was waken by the sounds of our cooking gear being clanged like it was being kicked and thrown about. I was scared out of my wits when I heard what sounded like a load of logs being dumped beside the tent trailer. I woke my husband and was yelling at him to get up and lets just leave and come back in the morning and pack up and go. He said no and we stayed the night and when I got up the next morning and went outside all of our cooking stuff was all back where it had been except for some items that had been misplaced but not by the wind.  I can not explain why I heard the metal pans clanging in the night like they were bing banged together and I was thinking from the wind storm our stuff would be everywhere but it wasn't. The screaming growls started again that Sunday morning as we were moving about camp and fixin breakfast. My husband asked if I could smell a stench and I said no since I have allergies and he proceeded to go into the woods behind our camp to do his business when this thing let out a long screamgrowl and it was enough to turn my husband around and back o camp. My husband has grown up in this area and has hunted the area for many years and he said he has never heard anything like this before. My husband does not spook easily however this made him think twice. We camped there many times and have had several experiences with this wood clapping ad whistling your research suggests. Every time we go there we feel we are being watched and hear the wood claps and I have even heard heavy breathing from something eating some hot links that I thrown down the hill from camp. This is a very squatchy area and should not be overlooked since I can recall the wood claps and some whistles and even some calling in the distance not done by us and it was at dusk when we heard the calling across the way.This thing watched us for two days and scream-growled at us both that Saturday and Sunday. We packed up and left on Sunday.",
  "classification": "Class B",
  "county": "Pierce",
  "state": "Washington",
  "location_details": "It is mostly deserted in the fall because of cold and is an isolated location on secluded hillside with non friendly vehicle road.very dark at night and lots of animals and fish in lake!",
  "summary": ""
}