{
  "reportId": "36761",
  "title": "Memory told of a close encounter while deer hunting east of Salem",
  "date": "1971-11-17",
  "timestamp": 59184000,
  "observed": "Hi, my name is Kevin, I'm 52 now. I went hunting with my dad in Dent County near what now is called Lake 117 east of Salem Missouri in Mark Twin National forest. I was approx. 1/4 mile from the old farmhouse up a tree with a view from 10 ft. off the ground approx. Anyhow I remember seeing a doe running by my stand looking scared and then I saw why. It was a tall black man running after it except that was not a black man chasing a deer naked, one went to my left and I could hear loud thrashing in the thick section of woods and I assumed it had caught the animal and was killing it. Astounded I could not believe what I had just seen and then it was when I turned to my right there he stood 20 ft from my tree and was standing there looking at me and I remember thinking who are these black men running naked thru the woods? but wait this was a very hairy being with a type of crest on its somewhat of an oddly shaped head, black hair but thinner in spots and when we made eye contact it growled very deeply. I was so frickin scared I could not understand what was going on, I have goose bumps and fear still to this day 40 years later. I don't like being ridiculed I have tears in my eyes now trying to write this to people that might understand this situation. Scardest I've ever been and in my life time I have had two guns pulled on me, sorry I'm wandering from my encounter. This being of the woods had black eyes and a light tan colored nose that was somewhat triangular looking to me, so this giant tall very strong looking being turned and started running over towards the thrashing sound but I couldn't believe how lucky I felt. Just a step or two and it could of yanked me right out of the tree I was in and soon as it was out of sight I believe I just jumped out of the tree I was in and started running up the logging road back to the farm house where my dad was. I remember stopping and turning around with my dads thirty thirty and I shot in the direction of it and yelling to leave me alone and on the rest of the way back to the farmhouse approx. 300 yds it was paralleling me in the thick woods making all kinds of rackit. I still get scared thinking of this I felt I was lucky that it didn't kill me i was around 11 or 12 and when I finally got back to the farm house my dad was there having a nip, if ya know what I'm saying, he could tell something was wrong with me, and i did my best to explain to him what was going on outside so he headed out. But the beast must have headed back to the deer kill 300 yds away. Umm I'm not sure if he ever truly believed me and that really upset me and I took his whiskey away from him and said now listen dad you have to believe me what I just saw. Well the owner of the farm arrived the next day and he believed me. I was so relieved he truly believed me and i could tell. He was a local doctor and told me he had seen giant footprints in the sand on his beach of his lake what now is this conservation lake he must have left them after he passed away. But I remember him being so interested in what had happened to me and truly believing me. Dang this brings fear and tears too me still the trying too understand, what the heck was going on around me in this deer stand. Never been that scared again, it was so hard to see this and understand that it was real so I've heard that it was one in a million chance of this happening. All I can say is how lucky i was that I wasn't on the menu that day so after analyzing this I truly believe that even though they are giant, inside they won't hurt you but will harass you to leave them alone and remember never look them in the eyes he will let out a very very deep growl and your legs will start shaking uncontrollably. I believe they just want to be left alone, still curious on how humans live. Think about it they could take you with out a problem, you have no chance at all, when I think back about this that is what I have interpreted I guess I would be famous if I had shot it but i didn't have that in me and still don't think i do. I appreciate what you BFRO guys and gals have done except if you would just stay longer in a area that one or more have been sighted that's how you will get your chance at some greater evidence. I wish I had never repressed this memory. Bothers me. Also I see in 2005 a guy had heard one only a couple of miles from where I had my encounter. I believe these animals are in small groups and travel nomadically thru out the thick woods and I guess they eat a lot of deer. I know they had caught one not too far maybe 30 are 40 yds from my stand in this thick woods. I could hear them but couldn't see what was going on. Listen just give me a call and I will tell ya what happened that day. I am ready to discuss this with you pros, dang you guys are so bold. P.S. If you stick with this you will eventually get your film but you have to be ready constantly because they run fast really fast and I also don't believe this animal knows what a trail camera is. Come on just hang in there and be ready and if they are close don't look them in the eyes, he growls unbelievable. Thank you and i would like too try and accompany you guys sometime. I think if someone would shoot one that they would retaliate against humans, they just want to be left alone that's what i believe.",
  "classification": "Class A",
  "county": "Dent",
  "state": "Missouri",
  "latitude": 37.39315,
  "longitude": -91.3012,
  "location": "-91.3012,37.39315",
  "location_details": "I will take you to the tree and place this happened",
  "temperature_high": 72,
  "temperature_mid": 64,
  "temperature_low": 56,
  "dew_point": 44.93,
  "humidity": 0.63,
  "cloud_cover": 0.67,
  "moon_phase": 0.98,
  "precip_intensity": 0.002,
  "precip_probability": 0.24,
  "precip_type": "rain",
  "pressure": 1015.95,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 8.85,
  "wind_bearing": 163,
  "wind_speed": 9.88
}