{
  "id": "27323",
  "title": "Possible harrassment at a secluded cabin near Zachariah",
  "date": "2009-10-13",
  "timestamp": 1255392000,
  "observed": "I was home alone one mid-October evening.  My husband and I have a cabin located in rural Lee County, KY.  It’s a primitive cabin, no electricity, no phone, hand pumped water, no neighbors, etc.  My husband was visiting friends about 8 miles away.  Just after dark, I was sitting inside, reading a book, when I heard what sounded like two logs being hit against one another...making a loud, hollow “knocking” noise.  The “knocking” happened 3 or 4 times in a row...then it paused...”knocked” again 3 or 4 times in a row...and this was repeated for about 15-20 minutes.   I looked outside but didn’t see a thing.  You can’t hardly see your hand in front of your face at our cabin, unless the moon is out...and it wasn’t.  Just a few minutes after the “knocking” stopped, someone or something threw what sounded like a handful of gravel onto the tin roof of the cabin.  We have oak trees around our property but the branches were mostly bare at that time and they don’t hang over the roof...so nothing could have fallen from them onto the roof. Needless to say, I was scared to the bone and didn’t/couldn’t make myself go outside.  My husband left one of his guns at home for protection and I sat on our bed, with the gun next to me facing the door until he got home. When he did get home...I told him what happened.  He went outside and shot his shotgun off into the woods about 10 times.  Later this same evening, he heard something rustling around outside so he went out the front door and shot his .45 off about 12 times into the woods behind the cabin where the noises came from. The next morning, he went outside to take a shower...(we have an outdoor shower behind the cabin)...and he found one of the bullets from the .45 sitting straight up, in the middle of the shower floor like someone just walked over and set it there.  The bullet wasn’t deformed in any way...it didn’t look like it had hit or gone through anything other than the rifling. My husband has always thought there was “something” out there...and has never doubted the existence of Bigfoot.  Since that experience, we have become very interested in the Bigfoot sightings, followings, documentaries, websites, etc. and would like to one day participate in the expeditions.",
  "classification": "Class B",
  "county": "Lee",
  "state": "Kentucky",
  "latitude": 37.65805,
  "longitude": -83.79678,
  "location": "-83.79678,37.65805",
  "location_details": "located in a saddle (a choke-point) of trails, between Fixer Valley and Little Sinking Valley, off of KY 1036",
  "temperature_high": 60.08,
  "temperature_mid": 53.805,
  "temperature_low": 47.53,
  "dew_point": 52.2,
  "humidity": 0.83,
  "cloud_cover": 0.87,
  "moon_phase": 0.84,
  "precip_intensity": 0.0002,
  "precip_probability": 0.41,
  "precip_type": "rain",
  "pressure": 1022.46,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 8.82,
  "wind_bearing": 359,
  "wind_speed": 2.76
}