{
  "reportId": "30462",
  "title": "Witness remembers several incidents including a close encounter on a dark road near Danville",
  "date": "1976-10-15",
  "timestamp": 214185600,
  "observed": "A friend and I were in the woods just after night fall in the fall back in 1976. It was an old abandoned road the city never paved and it was grown over very badly. It had been used as a party spot for teens for many years. I was against being there but my friend wanted to pick up beer cans for the money. You remember back when everyone was doing that. Any way as we walked down I was shining the light from side to side looking for anything or anyone that might be down there with us. You see, for about two years straight , we had had run ins with this thing on several occasions. All our parents told us we were crazy, it was probably someone in a suit trying to scare us. We know the difference in a suit and a real creature. Well, as I shined the light to the left and came back across the road, this thing took one step to it`s left and was out in the middle of the trail. That was about 6 feet in one step. The s.o.b. was right in front of my light, about 10 feet away. I had never been that close to it before. I was absolutely terrified and yelled at my buddy and turned and started running my you know what off. It wasn`t really that tall, maybe between 6 and 7 feet. It just stood there for the couple seconds I looked at it. It never made a move towards us. Just stood there and looked.I actually only saw it for a couple seconds but it was about 4 feet wide at the shoulder and dark colored. There were other encounters thru the years if you`d like to hear let me know.",
  "classification": "Class A",
  "county": "Pittsylvania",
  "state": "Virginia",
  "latitude": 36.5587,
  "longitude": -79.36079,
  "location": "-79.36079,36.5587",
  "location_details": "",
  "temperature_high": 75.83,
  "temperature_mid": 63.485,
  "temperature_low": 51.14,
  "dew_point": 44.12,
  "humidity": 0.64,
  "cloud_cover": 0.02,
  "moon_phase": 0.73,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.21,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.19,
  "wind_bearing": 225,
  "wind_speed": 5.35
}