{
  "id": "1672",
  "title": "Two backpackers see a large, dark, human-like form on a narrow trail",
  "date": "1980-06-28",
  "timestamp": 330998400,
  "observed": "My partner and I summitted early in the afternoon of an overcast day. The familiar ascent had been particularly interesting in that we passed a herd of mountain goat with young that were grazing in the cirque meadow. We had also seen several marmots. After lunch and a nap on the summit we started down. We had descended through the Pass and were picking our way through boulders about halfway down the cirque when I turned and looked back up to where we had been a few minutes earlier. I noticed movement in the Pass. A large, dark, human-like form stood up and looked directly down at us. I stopped and asked my partner who was ahead of me, \"What's that figure up in the Pass?\" Neither of us spoke as we watched the form. The situation was very odd because we knew there was no one else on the upper mountain. Familiarity with the area and subsequent research indicates that there are no other routes to the Pass. It would be impossible to miss other hikers on the narrow exposed trail, not to mention the fact that at the outset ours was the only vehicle parked at the trail head. As we watched, the form began to vigorously wave its unusually long arms up and down and over its head. On speaking later of this odd behavior both my partner and I had clearly interpreted it to mean, \"Get the hell out of here!\" as opposed to, \"Hello there.\" The gesture was definitely felt as menacing. (Although I thought of the camera in my pack I was reluctant to take my eyes off the figure for fear I would miss something. We watched transfixed for a few more seconds until low clouds moved in to cover the Pass. We continued down through the woods to the trail head and, as when we had arrived, ours was the only vehicle at the trail head. Afterthoughts: What we saw was not a bear; its arms/front legs were way too long. It was not a human because we were the only ones there. In addition, the behavior seems very bizarre when applied to a human - if someone were trying to get our attention a shout would have made a lot more sense.",
  "classification": "Class A",
  "county": "Snohomish",
  "state": "Washington",
  "latitude": 48.1472,
  "longitude": -121.3819,
  "location": "-121.3819,48.1472",
  "location_details": "On Mount Pugh, which lies between Monte Cristo and Darrington.",
  "temperature_high": 65.08,
  "temperature_mid": 57.86,
  "temperature_low": 50.64,
  "dew_point": 48.01,
  "humidity": 0.72,
  "cloud_cover": 0.55,
  "moon_phase": 0.51,
  "precip_intensity": 0.0004,
  "precip_probability": 0.52,
  "precip_type": "rain",
  "pressure": 1020.58,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 9,
  "visibility": 9.68,
  "wind_bearing": 286,
  "wind_speed": 3.44
}