{
  "reportId": "13048",
  "title": "Scream Heard in a Cypress Swamp outside Ft. Myers",
  "date": "1982-09-01",
  "timestamp": 399686400,
  "observed": "I will tell you about an experience that I and a friend of mine had back around 1982 or 1983 mid summer time in Lee County, Florida. I have lived in Florida since I was 9 years old. I am 44 now. I have roamed all over the woods down here and so has my friend Bill. We are both well acquainted with the noises that the native animals make, what we heard that night while camping was not anything that either of us had ever heard before. I am not in a hurry to ever hear again. The location of the vocalization was approximatley 15 to 20 miles from I-75 going east on SR 82. I lived off of Shawnee trail back then and hiked the cypress swamps every chance I got. I knew the area well back then having hunted deer and hog all over that area. I still live in unincorporated Lee county near the Hendry county line. Bill and I had gone camping on a weekend during the wet season. We had to wade quite a bit of wet area to find a suitable dry place to set up camp. I lived about 1 and 1/2 miles off of S.R.82 and where we were camping then was probably another 3 or 4 miles back in the swamp. We had just gotten a fire going and it was quite dark by now. We were sitting by the fire when we both heard a deep scream coming from out of the swamps. It was like no sound I have ever heard. It was deep and drawn out and echoed back through the swamps. I am not exagerating when I tell you that even the bugs got quiet. Bill looked at me and said, \"What the hell was that?\"  I said \"I dont know but I'm going home.\"  We broke camp and left. Neither of us was carrying a weapon during that trip. I dont think I would have shot what ever it was that made that noise, but I don't ever go to the woods now without a gun. I can also provide you with Bill's contact info so you can ask him about it. We did not see anything nor smell anything just heard the one scream. I would estimate the creature was within 1 mile or less of us.  I have told my parents about this. They said it may have been a gator or panther but I know what those animals sound like. It was neither of those animals.  I know several other people that have had experiences with the skunk ape. I am not sure if they will be willing to talk about their experiences or not.",
  "classification": "Class B",
  "county": "Lee",
  "state": "Florida",
  "latitude": 26.529,
  "longitude": -81.6455,
  "location": "-81.6455,26.529",
  "location_details": "Head east on S.R.82 out of Ft.Myers FL go to shawnee trail aprox 15 miles from Ft. Myers, go south on shawnee trail till it dead ends ( it did back then I have not been out there in many years.)then back into the cypress swamp about 3 to 4 miles pretty much south south west. Its mostly pine and scrub with cypress swamp and some oak hammock high spots.",
  "temperature_high": 88.26,
  "temperature_mid": 80.815,
  "temperature_low": 73.37,
  "dew_point": 73.21,
  "humidity": 0.77,
  "cloud_cover": 0.41,
  "moon_phase": 0.44,
  "precip_intensity": 0.0089,
  "precip_probability": 0.5,
  "precip_type": "rain",
  "pressure": 1016.98,
  "summary": "Humid and partly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 8.28,
  "wind_bearing": 55,
  "wind_speed": 8.41
}