{
  "reportId": "4475",
  "title": "Nighttime sighting by motorist between Barton and Carver",
  "date": "1978-08-29",
  "timestamp": 273196800,
  "observed": "My roommate and I were driving along Hwy 224 between Carver and Barton at approximately 10pm when I saw a pair of eyes reflecting in the darkness on the river side of the road. We frequently went to Estacada at night to visit a friend who was working at the Safari Club.(We lived across from Rock Creek Sand and Gravel at the time and I had lived in the immediate area all my life). As we got closer to the reflection I could see a creature standing near the road behind some maple limbs. At first when I saw the eyes I thought it was an owl. When we went by it I saw a creature from approximately chest to top of head with limbs obscuring the lower body. The color was very dark brown, it's arms at its sides, it just stood there loking as we drove by. I didn't say anything for a mile or so then asked my roommate if he had seen something along the hwy, he answered yes and I asked him what he saw. He told me the same as what I saw. We went back the next day in daylight to check and see if it was possible it could have been real. There were no clear tracks but there was definitely a trail crossing the hwy to the river from a swamp and bluff. on top of the bluff it would have been somewhere between Damascus and Boring. The limb that we saw the creature behind was about six and a half feet tall. Two or three years earlier a friend of ours who lived on Gronlund rd. was scared by a \"creature\" while he was walking home late at night. He saw it somewhere between Carver bridge and Bakers cabin. Anyway he said it scared the hell out of him and ran the rest of the way home. I never used to believe in hairy people before I saw it myself. I would like to see one again.",
  "classification": "Class A",
  "county": "Clackamas",
  "state": "Oregon",
  "latitude": 45.3894,
  "longitude": -122.4163,
  "location": "-122.4163,45.3894",
  "location_details": "I can't remember cross rd. may nearest would be Ammiseiger or something like that.",
  "temperature_high": 84.37,
  "temperature_mid": 73.095,
  "temperature_low": 61.82,
  "dew_point": 59.05,
  "humidity": 0.69,
  "cloud_cover": 0.48,
  "moon_phase": 0.88,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.57,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 9.01,
  "wind_bearing": 306,
  "wind_speed": 5.01
}