{
  "reportId": "37974",
  "title": "Elk hunter finds large bi-pedal tracks on Mount Baldy",
  "date": "2012-11-24",
  "timestamp": 1353715200,
  "observed": "On November 24th, 2012, at 9:00 AM, I was elk hunting on the west facing slope of Mount Baldy, above a closed forest service road called Baldy Face Road. There was a complete trail of these bi-pedal tracks leading around the face of the mountain. I've taken a picture of a track with my boot next to it as a point of reference as to the size of the track. My boot measures exactly one foot, and four and half inches wide, and my average step is about three feet. I am six foot and one inches and had to leap to reach each track. I'm guessing it had a rough estimate of a five foot step, which were heading north, north east up the mountain. I know it wasn't a snowshoe because snow shoes are so long that they overlap themselves, and have a hinged claw in the middle for traction which these tracks showed no sign of. Each step was long and clean, bearing no signs of drag. I guessed the tracks to be about 4-5 days old. I side hilled the mountain heading south, then down to the road back north, only to see my tracks being the only ones up off the road since it snowed. I've never crossed another person's tracks up there before, since its a pretty secluded area that has hidden lakes for the willing hiker. But never a track like this one ever. A hoaxer wouldn't place them so far away from where people go as they would never be discovered. This place is literally the middle of nowhere .",
  "classification": "Class B",
  "county": "Broadwater",
  "state": "Montana",
  "latitude": 46.48392,
  "longitude": -111.2644,
  "location": "-111.2644,46.48392",
  "location_details": "",
  "temperature_high": 45.93,
  "temperature_mid": 37.1,
  "temperature_low": 28.27,
  "dew_point": 27.2,
  "humidity": 0.62,
  "cloud_cover": 0.6,
  "moon_phase": 0.38,
  "precip_intensity": 0.0002,
  "precip_probability": 0.1,
  "precip_type": "rain",
  "pressure": 1017.69,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 9.7,
  "wind_bearing": 259,
  "wind_speed": 8.33
}