{
  "id": "4011",
  "title": "Road crossing sighting in a farm area near Maynard; other incidents in vicinity",
  "date": "1970-11-30",
  "timestamp": 28771200,
  "observed": "I was riding in rear seat of car with 3 others, all college students. We all lived same house in Fayette. It was a fri. nite,weather called for heavy snow overnite. We all were from same area about 25 miles away,decided to head there for weekend or would be snowed in at Fayette by morning. We headed south in my brothers car, he drove, Carl [R.] in pass seat, Al [B.] in LR,and I in RR. There was 4 in.snow on road so we were going slow about 20 mph. I was leaning to center of rear seat to see out front. I saw something moving in field up ahead just in headlight range about 200 ft. ahea.  It was big and moving towards road. I hollered what the hell is that, and elbowed Al who was sleeping next to me. My brother let off gas, as we rolled on we all watched as the creature never broke stride steped over a fence at least 40 in. high, into a ditch, across the ditch, up onto road shoulder, to center road, to other shoulder, across ditch, over another 40 in. high fence, going into darkness as we passed by. It passed in front of us from right to left,about 50 ft.away when it was center of road. It was big at least 8 ft tall covered from coned head to feet with dark brown hair. It had barrel shaped body with long arms and legs. It just walked like a human taking long strides and swinging its arms. It crossed at an angle from NW to SE never turning to look at us, so we did not see its face. After passing all were in shock, someone said stop lets go look for it. A big NO!! was the reponse and we went on our way.",
  "classification": "Class A",
  "county": "Fayette",
  "state": "Iowa",
  "latitude": 42.7525,
  "longitude": -91.8043,
  "location": "-91.8043,42.7525",
  "location_details": "1/2mi so. intersection W-33 &Hwy 187 on county road W-33",
  "temperature_high": 43.22,
  "temperature_mid": 43.22,
  "temperature_low": 43.22,
  "dew_point": 36.09,
  "humidity": 0.96,
  "cloud_cover": 0.99,
  "moon_phase": 0.06,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1012.88,
  "summary": "Foggy until evening and breezy starting in the afternoon.",
  "uv_index": 1,
  "visibility": 0.89,
  "wind_bearing": 138,
  "wind_speed": 14.77
}