{
  "id": "27778",
  "title": "Possible late night campsite intrusion in the Ocala National Forest",
  "date": "1974-12-20",
  "timestamp": 156729600,
  "observed": "I was about fifteen at the time, traveling with my mom and two younger siblings (brother and sister), driving from Atlanta to Ft. Myers to visit my grandparents (as we did every December). We stopped in Ocala National Forest — I don't remember the campground because we didn't get there until after nightfall, and I remember we went to Alexander Springs the next day, which was close by. Anyway, we drove through the campground and picked one of the last spots, several empty camp spaces away from the closest camper. The night was mild (certainly compared to North Georgia), and we all had sleeping bags, so we just pitched them on the sandy ground under the stars. My mom and my brother and sister were together near the road, but I wanted some space, so I was about ten to fifteen feet away closer to the end of the space. I wasn't afraid of the outdoors; I had already been whitewater canoeing, spelunking, camping, hiking, etc. I loved to hike, and catching snakes was a particular interest. Anyway, I loved being in the woods, and I knew that even bears are scared of humans, and didn't think anything would bother us in a camp site, even if we were on the fringe, for there were a dozen or so other campers around, particularly a small group about four or five campsites away who were having a bit of a party. Anyway, it was late, probably around 10 PM, and so we got in our sleeping bags and went to sleep. I dozed off for...I don't know, maybe an hour...and suddenly woke up. It was pitch black and very quiet, except for the footsteps. At first, I thought it was some big man walking through the saw palmetto; it was definitely bipedal, which is what threw me later. I figured someone was either drunk, looking for a place to pee, or lost. I remember cocking an eye to the trees and could see no light reflected from a flashlight. I remember thinking it odd how someone could navigate the woods in total darkness without a flashlight (which is why I figured it was someone drunk out to relieve himself). After about fifteen or twenty seconds (perhaps a dozen footsteps, crunch…crunch…crunch).  I realized it was coming into our campsite; I say IT because I could now hear it breathing, and whatever it was, I realized it was not human. It sounded like something huge, like a Santa Gertrudis bull. I lay very still, listening. Suddenly I heard it very close to my head, no more than a feet away, and it sniffed deeply several times as if it was checking me out. I was suddenly seized with terror, and I have never been afraid like that before. It was an odd reaction; the back of my mind was telling me that it was probably just a bear (the only thing I could think of that would be that big) and that it was simply looking for a pic-a-nic basket. I was wide awake, and I never have had those \"night terror\" dreams; I was fully conscious. I simply did not want to move. I must have flinched, because whatever it was suddenly went silent. Although I could not hear it, I was certain that it was still there, watching me. After what seemed an extremely long time (it was only about ten or fifteen minutes), the regular noises of the woods stated to come back, and I could hear small animals rustling about the dried palmetto leaves around the camp. I quickly got up and went over to wake up my mom, and I told her that there was a bear in the camp. She grabbed a flashlight, but all we could see was a short way into the woods around the camp. She laughed at me for being scared of nothing. Well, I went to the car, locked the doors, and lay down in the back seat. I had a hard time going back to sleep. At first light we packed up and headed off to Alexander Springs, and that entire trip my mother teased by about how I was so frightened by an armadillo (yeah, an 800 pound armadillo.) I didn't think to check for prints (I did run and quickly snatch my sleeping bag where I had left it), and I neither saw anything nor smelled anything. But I convinced myself that it was a bear, for whatever it was had enormous lung capacity, but it always bothered me that it was obviously walking on two feet, and it left without making a sound.",
  "classification": "Class B",
  "county": "Lake",
  "state": "Florida",
  "latitude": 29.22079,
  "longitude": -81.80539,
  "location": "-81.80539,29.22079",
  "location_details": "Can't remember; I wasn't driving, and it was at night when we got to the campground.",
  "temperature_high": 75.37,
  "temperature_mid": 68.395,
  "temperature_low": 61.42,
  "dew_point": 58.24,
  "humidity": 0.81,
  "cloud_cover": 0.84,
  "moon_phase": 0.22,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.42,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 6.78,
  "wind_bearing": 184,
  "wind_speed": 6.21
}