{
  "reportId": "6656",
  "title": "Teenagers observe animal hiding behind trees in yard near Cape Fair.",
  "date": "2004-11-21",
  "timestamp": 1100995200,
  "observed": "It was July, 1978.  My family had just moved from Illinois to Cape Fair, Missouri a few weeks before. Our parents went back to Illinois for a funeral and my sisters (ages 16 & 14) and I (12 years old at the time) were there alone.  It was late at night around 11 or midnight when we all were startled by our dogs barking and growling on the porch.  Normally the dogs would go down to the driveway if they heard something.  This time they stayed on the porch looking towards the front yard barking and growling like I have never heard them do before.  What scared us was that the dogs were scared to go down off the porch. We turned all the lights off in the house and looked out the front windows and door to see if we could see headlights or something outside.  There was a flood light at the corner of the driveway that cast a light on the front yard.  The front yard was all uphill with a 5 ft barbed wire fence separating our yard from the pasture.  The front yard had huge black walnut trees spaced about 30-50 feet apart scattered around.  I was looking out the front window and saw a large figure standing partially behind a walnut tree.  I stared at it a few moments to focus in the dim light to see what it was.  I thought it was maybe a drunk camper who was lost.  You could walk down our back yard to the lake, so I thought maybe someone was looking for a way to the lake through our yard.  People would camp and fish very close by, so we thought somebody was lost.  All around our house it was dense forest and there was only one other house on our 1/2 mile road, so we were very isolated. My 16 yers old sister went to calm the dogs down.  The 14 year old and I were stioll looking out front.  Then after a few moments the figure dashed to the next tree about 50 feet away in about 3 or 4 strides.  I kept looking and before I could ask my 14 yr old sister if she saw that- she ran to the back porch to help my 16 yr old sister with the dogs.  By this time the dogs were freaking out.  Then I looked back to the front yard where I saw it go to another tree, then another tree-zigzagging its way up the hill towards the pasture.  Then to my amazement it cleared the barbed wire fence in one stride and was gone into the night.  My sisters were tending to the dogs so they didn't see all of what I saw.  My 14 year old sister said she saw something by the tree-but she never said anything more than that.  I don't know if they were trying to keep me from getting scared, but I think she saw it too.  I told my parents about it when they got home.  They just blew it off to a city kid seeing \"something\" in the country night.  While I lived there until 1984, I had heard stories of the \"Ozark Mountain Monster\" but thought it was just folklore. I did have several conversations with oldtimers from the area and heard stories of bigfoot sightings over the years, but never had the courage to \"go public\".  I am 37 now and do still believe to this day I saw a bigfoot.  I still get chills when I think about it and am having chills while I am typing this right now.  Too spooky!",
  "classification": "Class B",
  "county": "Stone",
  "state": "Missouri",
  "latitude": 36.73,
  "longitude": -93.51,
  "location": "-93.51,36.73",
  "location_details": "",
  "temperature_high": 54.24,
  "temperature_mid": 52.08,
  "temperature_low": 49.92,
  "dew_point": 47.1,
  "humidity": 0.89,
  "cloud_cover": 0.99,
  "moon_phase": 0.34,
  "precip_intensity": 0.0071,
  "precip_probability": 0.74,
  "precip_type": "rain",
  "pressure": 1023.24,
  "summary": "Overcast throughout the day.",
  "uv_index": 1,
  "visibility": 7.33,
  "wind_bearing": 70,
  "wind_speed": 5.73
}