{
  "reportId": "680",
  "title": "",
  "date": "",
  "observed": "Ok, I feel as if I need to qualify this statement. First of all, it was the discovery of this website and report submission form which inspired me to come forward and reveal my sighting incident. I have held off for over four years for fear of accusations of incompetence and lunacy-- after all, who doesn't poke fun at the \"freaks\" who tell of UFO and Bigfoot incidents? Second, I will confidently say that this sighting is absolutely true, and I will continue to have vivid memories of it all of my life. Third, I am a highly reputable source: I am a licensed English Teacher currently working at a large public high school in Oregon. I am educated, am of sound mind, and am not wasting my efforts here on a hoax of any sort. Finally, my most accurate narrative memory of my sighting: at the time of my sighting (see above for details), I was alone in a two bedroom residence located approx. 1/4 mile north of US Hwy. 199, on a gradual wooded slope. On this three-acre property, there are two horse pastures--one below the house and one above the house. Both pastures are surrounded by active hot- wire fences and contain two horses which may move freely between both lower and upper pastures. I was completing a research paper for a college class at the kitchen table. I had on light on, and my friend's dog (a small brown heeler) was on a 35' wire tether tied to the porch outside the small house. I was completely engrossed in schoolwork when I heard the dog outside begin to \"go ballistic.\" I was quite alarmed by this, so I immediately tuned in to the animal's actions. I will never forget what I heard: all the dogs and horses from the other residences (which were quite far away--over several rises and ridges) were shrieking nonstop. Wanting to be cautious, I went to my gunsafe and removed a large caliber pistol and a powerful flashlight and headed towards the front door. I turned off all the lights in the house and I opened the front door, carefully searching with the flashlight and pistol before exiting. What I saw unnerved me. The small heeler was focused on the lower horse pasture and steadily loosing a quiet growl. The two horsed had moved to the upper pasture and were rustling about and neighing very unusually. I squatted down beside the dog (who did not pay me any attention- -very unusual) and pointed my flashlight in the direction of his muzzle. What I saw at this time nearly stopped my heart: there was a large figure crouched down outside the outer hot-wire in the tall grass beside a telephone pole. My light was reflected back at me by two small circular markers on the pole and further dispersed by the light fog making initial identification very difficult--I immediately thought \"bear.\" To my complete shock, the dog suddenly screamed and leapt straight into the air with its hair bristled. Upon landing, it bolted under a pickup truck and whined like a puppy. As this happened (realize that this all occurred in but several seconds), I saw a creature rise up on TWO legs and begin to move along the hot-wire. I rose to a full standing position and aimed my pistol right on it. In my mind I was thinking \"bear, no, horse, no, man, no , God what the F*** is this thing?!\" I consciously tracked the creature with my pistol sights and flashlight beam (I was a Military Police Officer in the Army for over 5 years and trained in firearms tactics--it all came back at this moment, let me tell you!) for at least two full seconds in which time I SAW this HUGE THING take off in a full BIPEDAL RUN (the \"thud -thud\" rhythm and distinct movement of two legs/feet are unmistakable). I was more frightened than I can ever remember being (yeah, I am a grown man!) , and I bolted for the house and immediately armed myself with larger weapons and called my friend's father to come from Grants Pass to search for this thing. Upon his arrival, we drove down to the road outside the hot-wire where I estimated the creature to have been. Since the road was gravel, all we found was disturbed grass as if something large had moved through it--no footprints were located. For the remainder of the night and into the next morning, all the animals in the small community near Wilderville, OR were restless and noisy--the little heeler being the worst off for he did NOT calm down for a whole day. I hope this info is helpful to your research, and I hope that someday we (the population at large) can prove the existence of whatever the hell I saw that night in Southern Oregon.",
  "classification": "Class A",
  "county": "Josephine",
  "state": "Oregon",
  "location_details": "From Grants Pass, Oregon take state hwy. 199 (Redwood Hwy.) towards the coast. Drive past Rogue Community College, the Applegate River overpass, the Valley Fire Station at Wilderville, and the Oregon Dept. of Transportation Weigh Station (on the left). The residence's driveway where I was staying at the time and where the sighting occurred is on the right approx. 1/4 mile past the weigh station.",
  "summary": ""
}