{
  "reportId": "28487",
  "title": "Possible vocalization heard near Lake Cushman and Dow Mountain",
  "date": "2011-01-11",
  "timestamp": 1294704000,
  "observed": "One summer night in 2008, I was sitting on the back deck with our dog Icy at about 1 in the morning, because it was too hot to sleep. It was totally silent -- which it normally is around here at night -- and as I sat there on the wooden steps, with Icy sitting on the deck about 3 feet away from me, I heard what at first sounded like a distant siren, seemingly from the north-north-east. (The only thing in that direction from our house is Dow Mountain, with no roads except for dirt logging roads).  Icy's response to sirens is invariably the same: he lifts up his head, pricks his ears, listens intently, and then begins howling, usually in the moment just after the siren becomes inaudible to my human ears. That night, though, his response was completely different. He came quickly to my side and pressed himself against me, sort of hunching himself into an extension of my body. As I listened, I viscerally \"knew\" that what I was hearing was NOT a siren, although it did seem very, very similar to a siren sound.  I remember I was holding my breath -- and my impression was that I didn't start breathing again until the sound had completely stopped -- and I can only hold my breath for about 50 seconds, so that's the amount of time I would guess the sound went on.  The same instinct that told me that I was not listening to a siren also told me that I had never heard this sound before.  Another -- to me -- validating aspect was that my own response to it was out of character, just as Icy's was. Normally I would have sat there for another hour or so, hoping to hear it again. It was so amazing -- and I usually can't get enough of that kind of interesting mysterious stuff. But when the howling ended and I started breathing again, my first impulse was to get inside the house, quietly and fast.  I went online and Googled every kind of indigenous Pacific Northwest animal I could think of: elk, fox, coyote, deer, bear, rabbit, moose, cougar, various owls, other birds -- even wolf, which we purportedly do not have in this area -- and couldn't find any WAV file that even came close. On a chance, I looked up Sasquatch WAV files, and listened to the ones that I could find -- I think there were five -- and one of them, the \"Ohio Howl\", was a dead ringer. When I heard it coming through the headphones, chills started running up my back. That was the sound I'd heard.",
  "classification": "Class B",
  "county": "Mason",
  "state": "Washington",
  "latitude": 47.41995,
  "longitude": -123.2005,
  "location": "-123.2005,47.41995",
  "location_details": "Approximately 300 feet from Highway 119, and approximately 1.5 miles northwest of the Foothills Park area.",
  "temperature_high": 45.04,
  "temperature_mid": 38.215,
  "temperature_low": 31.39,
  "dew_point": 22.37,
  "humidity": 0.66,
  "cloud_cover": 0.53,
  "moon_phase": 0.23,
  "precip_intensity": 0.0056,
  "precip_probability": 0.91,
  "precip_type": "snow",
  "pressure": 1020.21,
  "summary": "Snow (1–2 in.) starting in the evening.",
  "uv_index": 1,
  "visibility": 7.72,
  "wind_bearing": 56,
  "wind_speed": 4.06
}