{
  "reportId": "273",
  "title": "Husband and wife hear scream while fishing",
  "date": "1994-09-15",
  "timestamp": 779587200,
  "observed": "About 7 years ago my wife and I were at a lake in the middle of the talledega national forrest in Alabama.The lake was sweet water lake.We were fishing in a small boat at the end of a slew early in the morning,we were the only ones at the lake, I think it was on a wendsday and we were all alone. We heard somthing scream, it started out as a howl and turned into a long high pitched scream and it was so loud it echoed through the mountians. It made the hair stand up on the back of our necks.But that is not all. About a year before that My stepfather and I were hicking around the same lake,we liked to fish at a spillway way on the backside of the lake,and about 1/2 mile into the hike we crossed a fire brake about 20 feet wide, now keep in mind that we are a pretty good way back in the woods,we have crossed rocks thorns and bryers and all kinds of rough ground. And right there across the dried mud in the fire brake is a set of foot prints dried into the mud.they were not huge they were about the size of a full grown man but they did look human, I just couldn't understand why a man would be this far back in the woods without shoes on.And over the years there is one thing I have thought about a bigfoot would have to grow up, so maybe it was a young bigfoot",
  "classification": "Class B",
  "county": "Cleburne",
  "state": "Alabama",
  "latitude": 33.7065,
  "longitude": -85.57415,
  "location": "-85.57415,33.7065",
  "location_details": "From I 20 you get off at the Heflin exit and go through Heflin and get on hwy 78. You will see signs directing you to Pine Glen, a camping area, and Coleman Lake soon after this point. The roads are dirt roads, but follow the signs to Pine Glen and about 3 miles up the road on the left you will see a sign for Sweetwater Lake. This road will go down about 1/2 mile to the lake.",
  "temperature_high": 86.91,
  "temperature_mid": 78.215,
  "temperature_low": 69.52,
  "dew_point": 63.8,
  "humidity": 0.71,
  "cloud_cover": 0.29,
  "moon_phase": 0.36,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.82,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 6.74,
  "wind_bearing": 86,
  "wind_speed": 4.72
}