{
  "id": "3112",
  "title": "UK Gypsies vacate Colorado campsite after encounter with 7' creature",
  "date": "2001-09-30",
  "timestamp": 1001808000,
  "observed": "This story was related to me by my Aunt last year: My Aunt and her husband are both Romany Gypsies living here in the UK, but once a year travel to Fairplay, Colorado to visit extended family - decendents of family that used to mine the area. They were staying in a Log Cabin with one of the family members, and had spent the first few days of thier trip walking the outlying forestry, and going to old mining sites and other places of interest. On the fourth day, they all decided to spend an evening out with a barbeque and invited over a few friends from a travelling show that they know from Iowa. At dusk, my aunt said that two of the travellers (J & S) returned to the barbecue, after hiking up a small valley for about 5 miles. Both were visibly shaken and upset. They told everyone that they had been followed by something at a distance of 30 ft or so for the past few hours, it smelled similar to old, damp caravan interiors and when J had shouted towards the creature, it seemed to back off slightly before violently shaking foliage. This is when they both panicked - as J could see 'fur' as the creature moved, and thought it could've been a bear. My aunt requested that everyone leave just in case the 'bear' had followed J & S back to camp, but due to inebriation most of the group were laughing, and didn't take the story too seriously. At about 10:00pm, a fire was lit, and some of the travellers started juggling firesticks or playing thier instruments. My aunt thinks this may have been a lure, as over the festivities they heard a very loud, very high pitched scream just off the small clearing. One of the more drunken members of the group started walking and shouting towards where the vocalization had eminated - he later stated that he was 'trying to communicate' - when a few of the people at close range saw what was described as 'a very tall, very powerful ape-like creature' moving at first into the clearing, and then away from the camp at great speed. It had long beige hair, approx 6\" long, and a dark area around the face and elbows. Everyone left the scene quickly and in panic - J left his very expensive juggling batons and a few other important belongings, so it is clear that they didn't want to stick around. No-one wanted to return the next day to the site, and one of our relatives waited a week before going to look for lost property. Unfortunately, new fires had been lit suggesting that campers had been in the vicinity since, and no belongings or tracks could be found.",
  "classification": "Class B",
  "county": "Park",
  "state": "Colorado",
  "latitude": 39.20834,
  "longitude": -106.0417,
  "location": "-106.0417,39.20834",
  "location_details": "Outside of Fairplay, in dense forestry at a clearing often used by caravans and campers.",
  "temperature_high": 67.98,
  "temperature_mid": 53.435,
  "temperature_low": 38.89,
  "dew_point": 33.15,
  "humidity": 0.49,
  "cloud_cover": 0.29,
  "moon_phase": 0.44,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1022.44,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 5,
  "visibility": 9.96,
  "wind_bearing": 140,
  "wind_speed": 0.75
}