{
  "reportId": "6007",
  "title": "Young boy has encounter with young bigfoot on front porch at grandparents' house",
  "date": "2003-10-08",
  "timestamp": 1065571200,
  "observed": "I was about 5 years old at the time. It was summer and the door was left open and the screen door closed. My grandfather had been in a wreck and his head had been in traction. He was laying on the couch fold out bed asleep. My grandmother and mother were in the other room with a friend playing a game of cards and I was playing with toys and watching The Price is Right (didn't have any choice - too small to change the channel) on tv. When I looked toward the door there was a 4 foot thing covered in a ruddy reddish brown fur. He was wide across the shoulders, sort of flat face watching me play with my toys. I walked up the the screen and we watched each other for a while. Its eyes almost like it was curious me like I was of it. I walked into the other room and to get my grandmother to show her this thing at the front door. But when she came it was gone. I never felt afraid of it nor did it act aggressive just curious about me or my toys. They pretty much discounted it as a child trying to get attention but to this day I can still see it in my mind every detail. And the following morning I took the toy outside and left it for the furry being. Never saw that toy again. Years later after I had gotten older I looked into native america lore and looked at information on sasquatches and put together I had seen a child. After listening to Coast to Coast I decided it was time to say something that I wasn't alone in seeing something like this.",
  "classification": "Class A",
  "county": "Rusk",
  "state": "Texas",
  "latitude": 32.27444,
  "longitude": -94.965,
  "location": "-94.965,32.27444",
  "location_details": "",
  "temperature_high": 81.23,
  "temperature_mid": 75.655,
  "temperature_low": 70.08,
  "dew_point": 66.62,
  "humidity": 0.84,
  "cloud_cover": 0.38,
  "moon_phase": 0.45,
  "precip_intensity": 0.0017,
  "precip_probability": 0.52,
  "precip_type": "rain",
  "pressure": 1015.97,
  "summary": "Foggy in the morning.",
  "uv_index": 4,
  "visibility": 5.63,
  "wind_bearing": 106,
  "wind_speed": 5.07
}