{
  "reportId": "44808",
  "title": "",
  "date": "",
  "observed": "This incident occurred in early September 2012. Bear hunting season had just begun in Minnesota and I was running a few bait stations. It was maybe 07:20 in the morning when I left my house to go to my first bait station. I have never harvested a bear and this was my most promising bait station I had. It was hit every single day from the first day it was legal to bait. I had a trail camera on this bait station the week before season for a few days so I had an idea of when the bear were coming in and the general direction they were coming from. The morning was beautiful, cool and the sun was just over the horizon. This is my favorite time of day because it seems this is when the woods “come alive”. I turn off the dirt road and start down the logging trail. My bait station was located about 150 yards through the brush. The area holds a bunch of mature poplar mixed with a few maple and balsam trees. As I was sitting at the fork about to get out of the truck I was looking down the left trail, “which over time was widened out a bit by trying to avoiding the muddy areas” when I saw it. It came across the trail fast. It was about 50-60 yds from me and if I hadn’t been looking at that second I would have never saw it. Most stories about “Bigfoot” are that he is brown or black… well whatever this was was big and gray/white in color. I kind of sat there for a second, shook it off and told myself, “No, I was imagining things”. So I get out of my truck and go to grab my bait bucket when I could hear it running through the brush towards my bait station distinctively on 2 legs. I’ve bow hunted my entire life so I know the sound a 4 legged animal makes when it runs or trots.  I realized that I was not imagining things and that it really just happened. I promptly climbed back in my truck and left. Even though my goal for many years was to harvest a bear I was too shook up to return to that bait station. All bait stations are required to have your information affixed within a certain distance of the bait station. So I knew I had to return to the bait station to get my sign. A few weeks later I had a good friend of mine come out there with me. We retrieved my sign and left. This was the last time I was in that area.",
  "classification": "Class A",
  "county": "St. Louis",
  "state": "Minnesota",
  "location_details": "NOTE: please do not reveal the exact location.",
  "summary": ""
}