{
  "reportId": "36202",
  "title": "Memory told of a tall hairy figure seen in a corn field near Lawrenceville",
  "date": "1980-12-20",
  "timestamp": 346118400,
  "observed": "I was in Junior high school for Crewe Junior High (no longer exists). I was riding on a school bus on a back road in Greensville Co. Virginia after competing in a junior high school basketball game with my teammates. We had lost the game so my coach had told everyone on the bus ride he wanted no talking on the ride home back to Nottoway Co. Well almost everyone on the bus was sleep or trying to go to sleep cause we could not talk. That is when I saw it. About 75 to 100 yards away from the road down a hill was a corn field with a scarecrow on a wooden cross in the middle of it. I saw out of the foggy window cause it was early winter a huge figure standing like a man with hair all over it. I could tell it had hair because it was thick and long from under it's arms. It had to be about 8 to 9 foot tall because it's head was at the chest area of the scarecrow on the wooden cross. It was huge and massive. It appeared to be looking at the scarecrow. As the bus drove by I sat up in the seat to try to get a better look out the window because I had the window cracked to get some air. I yelled at my coach and everyone on the bus \"did you see that?\". They all laughed and joked on me. I tried to get my coach to turn around to go back. He was so mad at the team for losing the game he told everyone to be quiet and not say another word or we would be running laps the next day. So I did not say anything else. What I saw that night has haunted me for a long time until today when I got a text message from my brother about an article he read from you guys about Big Foot sightings in Nottoway and Brunswick counties. My brother knows of the story I have told and wanted me to know that I was not the only one to have seen something like this in my hometown area. I live in Midlothian, Va now but its only 45 minutes from Nottoway Va. where  the story of the Fort Pickett sighting my brother read happened and 1 hour 30 minutes from Greensville Va.",
  "classification": "Class B",
  "county": "Brunswick",
  "state": "Virginia",
  "latitude": 36.91355,
  "longitude": -77.95074,
  "location": "-77.95074,36.91355",
  "location_details": "",
  "temperature_high": 27.67,
  "temperature_mid": 18.5,
  "temperature_low": 9.33,
  "dew_point": 3.51,
  "humidity": 0.44,
  "cloud_cover": 0.25,
  "moon_phase": 0.46,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1034.77,
  "summary": "Mostly cloudy in the morning.",
  "uv_index": 2,
  "visibility": 10,
  "wind_bearing": 16,
  "wind_speed": 10.79
}