{
  "id": "32302",
  "title": "Memory told of a possible dusk sighting at a hunting camp near Greenville",
  "date": "1989-12-15",
  "timestamp": 629683200,
  "observed": "My hunting buddy dropped me off at the hunting camp entrance.  I was not going to go into the hunting camp, rather decided to hunt along the railroad track bordering the camp along dirt road. We were probably 3 miles deep in a wooded area off main road.  I positioned myself on edge of railroad, with the tracks and very, very thick forrest and swamp bottoms directly in front of me. I had been watching for deer for maybe 30 minutes, when directly in front of me in the thicket maybe 100 feet, sound began to develop.  It was louder than anything I'd ever heard in the wild.  It sounded like a very deep growl/exhale that lasted what seemed like 20 seconds. It happened a second time about a minute later.  This time it sounded closer, but I couldn't see anything in the thicket.  I remember thinking I probably wasn't armed with enough firepower, although I was holding a 30-30 highpower rifle in my hand.  I felt as though whatever was making the noise was big and strong based on the powerful noise I was hearing.  I started walking toward where my friend was parked.  He met me walking the dirt road and picked me up.  I told him what I'd heard; he laughed and made jokes.  We left the area and didn't return until next year to do some scouting in the exact same area. We were without rifles at this time because it was before season started.  When we were walking in the swamp bottom, my friend brought up the incident and laughed some more.  It was no more than 5 minutes later when in front and to the left of us, WE heard the  noise again.  He looked at me like, \"What the heck was that?\" I said, \"That's it, that's it!\"  We turned and got out of there very quickly.  When we got to the truck, he now believed me with regard to what I'd heard the year before when we were in that exact area.  We left and started driving the dirt road just looking to see if we could see any deer, or any other wildlife that could be walking that afternoon.  As we drove back by the woodline that we had just exited 10  minutes earlier, we noticed on the woodline bordered by a field, we saw what we thought was a deer grazing at about 100-125 yards.  We stopped the truck to watch. My friend decided he would try to get closer by walking the woodline toward the deer.  As I watched him walk slowly toward the animal, I noticed the animal was moving toward him on all fours.  I told him that it was moving toward him.  He stopped and I think either clapped his hands or yelled something.  At that second, this thing stood straight up on two legs. It was white on the underside and had no distinctive shoulders. It looked as though it had a pointed head and we thought it stood about 7-8 feet.  My friend turned and ran back to the truck. We were both scared enough to leave but before leaving we tried to position the headlights toward the subject for better identification.  But it had entered back into the woodline.  We have discussed this many times over the years.  Other people/hunters have told us of encounters in this area.  Can give details!",
  "classification": "Class B",
  "county": "Madison",
  "state": "Florida",
  "latitude": 30.55044,
  "longitude": -83.48494,
  "location": "-83.48494,30.55044",
  "location_details": "private huting camp situated off Little Cat rd approximately twelve miles from Greenville",
  "temperature_high": 64.1,
  "temperature_mid": 50.925,
  "temperature_low": 37.75,
  "dew_point": 36.98,
  "humidity": 0.69,
  "cloud_cover": 0.49,
  "moon_phase": 0.61,
  "precip_intensity": 0.0063,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1018.13,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 7.49,
  "wind_bearing": 199,
  "wind_speed": 5.39
}