{
  "reportId": "16890",
  "title": "Repeat visitations described near rural home outside Princeton",
  "date": "2006-07-15",
  "timestamp": 1152921600,
  "observed": "On a hot summer evening between July-August 2006, I had the window of the bedroom open. I heard \"very close\" moaning or howling from our open bedroom window of our home around 3:45 in the morning. The howling and noise woke me from a sound sleep. I could not get my husband awake who was sound asleep at this time, I tried quietly. The howling or moaning at first sounded like that of another type of animal in pain (more like a large pig or cow at first) but changed to sound like something \"very large\" in size and getting very upset (VERY deep, angry tone growls). I did some research before contacting you and I have heard what bear sound like on various recordings. As well as, other type of animal recordings. This animal in no way sounded like that of a bear or anything else I have heard in the past. Finding your web site and listening to the recordings of moaning and such brought chills up my back!!! They sound so familiar to that night but I still cannot be certain. We have a small spaniel mix dog that sleeps in our basement garage area located under our home. Upon hearing the howling outside that night, the dog moved to the garage door area located directly under the bedroom window and barked like being startled from sleep three times. I could tell, the creature I had heard moaning and howling moved to the garage door under our open bedroom window (which is two stories high) and growled \"very deep\" at our barking dog while \"striking or smacking\" above the garage door. The dog STOPPED barking! Then I heard nothing out of our dog or from the animal outside the window again that night. I was too frightened to move and look outside. For a long time prior to this I had a strange unexplained feeling of \"being watched\" while being outside on our homes patio. This patio faces pretty dense wooded area on three angles back there. Something just made me feel uncomfortable even in daylight hours out there that I had not felt before since moving here. Although a bit odd, I no longer have this same feeling. On two different nights prior, I couldn't sleep and heard what sounded like small rocks hitting the brick outside of our home close to our bedroom area. I assumed it was just the home settling while the temperature was cooling down in the late evenings. We live in a pretty dark (not much light in this area at all) heavily wooded and somewhat quiet area just outside of town. We have several deer, turkey, rabbits, squirrel and other small game that roam throughout our woods and property.",
  "classification": "Class A",
  "county": "Mercer",
  "state": "West Virginia",
  "latitude": 37.32091,
  "longitude": -81.1271,
  "location": "-81.1271,37.32091",
  "location_details": "Southern Mercer county WV, not far from VA state line. Between US460 and I-77.",
  "temperature_high": 81.78,
  "temperature_mid": 73.985,
  "temperature_low": 66.19,
  "dew_point": 67.4,
  "humidity": 0.78,
  "cloud_cover": 0.38,
  "moon_phase": 0.67,
  "precip_intensity": 0.0019,
  "precip_probability": 0.78,
  "precip_type": "rain",
  "pressure": 1017.46,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 8,
  "visibility": 7.61,
  "wind_bearing": 284,
  "wind_speed": 5.06
}