{
  "id": "25703",
  "title": "Experienced hunter decribes a brief standoff at approx. 80 yards, in daylight, near Smithville",
  "date": "2009-03-25",
  "timestamp": 1237939200,
  "observed": "In November 1996 just a couple of days before thanksgiving my best friend and I were camping and deer hunting on Weyerhaeuser forestry land in SE Oklahoma the nearest town would be Smithville but even at that it would somewhere around 9 miles as the crow flies. (Land has since been sold to John Hancock Corp). This area is in the same general area as where my written report occurred. This area is used to grow soft pine trees for harvesting to grind into paper pulp. The total area is something around 800,000 acres. So you can imagine how big of an area this is. There are no homes or anyone living in this area at all, in fact you are not even allowed to build any permanent hunting cabins or such things. By this time of 1996 I had actually all but given up gun deer season, I was almost strictly a bow hunter. About 3 years before I was actually in a tree stand and had a bullet go over my head. Some idiot was out there somewhere (never seen him heard the shot but never seen the guy that pulled the trigger) anyway he was out there just taking pot shots. I had decided after that I would just stay with my bow hunting. However my buddy wanted me to go with him as he was alone, so I decided to go ahead and accompany him. The area that we camped in is an area that is very difficult to get to and rarely does anyone go into this area. You have to exit off a logging road and travel up this very steep clear cut that climbs up a small mountain. There is really not even a road as such that you have to travel along. At one time the loggers just took a dozer and cut a path the width of the dozer from the bottom of the mountain all the way up and then along the crest of the mountain. And this path is never maintained so it gets very rough and only a 4x4 can get through and even with that you have to drive at a speed little more than walking speed. This path travels about 3 miles and simply dead ends just at the start of the downward side of the mountain. Me and my buddy call it the dish. We call it that because you are traveling up this mountain in heavy forest make a curve then suddenly you are facing down and at the bottom is a area that very much resembles a satellite dish where it is void of trees and the concave shape of the ground gives the impression of a satellite dish. This clear area is about 30 feet or so in diameter. So anyway we make the journey up the mountain and take the treacherous path up to the dish. There we make our camp and it of course becomes our home away from home for the next few days. It was a bit odd this year because normally you see one or two hunting camps once you enter the area from the highway. But this time we seen not one camp or hunter. Now to take note the dish from the highway is 14 miles, now of course that is not straight line miles because you know how access and logging roads rarely run straight for any distance. On day 3 of our hunting trip we get up before daylight as usual and get ready to go out into nature and see if we find any deer. After all, that was why were there, even so I had seen nothing the previous two days but didn’t really care because as usual I very much was enjoying myself with the flora and fauna. I am also very interested in geology and there is much to see in that area. To imagine that area at one time was a shallow sea never ceases to amaze me. I wish when I took my first geology course in college I would have changed my major and pursued that field further. Oh sorry there got off track didn’t I. We decide which directions we were going and we plan for our rendezvous back at the dish for 12 noon. We walk together for about ½ mile camp and there we split up my buddy continues to the west along the top of the mountain and I head south down the side of the mountain. Being that it was not yet daylight and these woods are very thick and dangerous to walk in during the daylight hours due to the rough rocky terrain I was not about to do any walking until first light so after we split I only walked about 10 yards or so and sat down and waited for a few more minutes until sun up. At sun up I get up and start my hunt, I normally am not a stalker for a couple of reasons to be a successful stalker you must have coordination to walk and not make noise also you really need a lot of stamina. I possess neither of those traits. So I normally hunt from some type of stand. But I had sat for several hours the evening before and was ready to move, plus I wanted to do some exploring into a saddle I had never been into before so this day I decided to stalk. NOTE: I am using the term “saddle” here and will continue using that term; however it really is not a saddle as such. A saddle is the gap between where 2 mountains run close together. This area is on the same mountain but it has two ridges (or fingers extending out away from the mountain) making a gap and valley in between these two parallel fingers much like a saddle. Imagine if you will, make a fist with your left hand, then after you make a fist extend your index and middle finger out like you are making the peace sign. Your hand is the mountain and your two extended fingers are these fingers that extend out from the mountain. The width of this finger is I am guessing somewhere around 150 yards, but could not see all the way through because of the trees (more on this further below). I will be walking down that eastern finger which in the above example would be your middle finger. Your index finger will be the western finger or ridge. (I hate using the term ridge it is too vague). The distance between these two fingers were only about 50 yards apart at the mountain and by the time you get out to the tips they are nearly a hundred yards apart. So the technically are not parallel either they do diverge some. And the length of the finger I am on is about 300 yards. The length of the western finger is about 370 yards. Never went up there so I have no clue how wide across it is. Also the crest of that finger is about 20 – 30 yards higher than the one I am on. END OF NOTE I start walking down the mountain side and after about a half hour I reach the eastern finger of the saddle. I sit for a few minutes to rest and catch my breath before taking out down this finger of the saddle. On this finger I could view the saddle valley to my right and also could see the eastern side of the western finger of the saddle. From the top of the finger I was walking I could see very clearly down to the bottom of the saddle which was no more than 100 feet to the floor nearest the mountain and as you walked the top of the finger away from the mountain this finger sloped downward toward the valley so that by the time the finger ended the valley within the saddle was no more than 50 feet from the peak of the finger to the valley within the saddle. So from my 12 o’clock position to 180 degrees to my right (clockwise) I had a totally unobstructed view. With the exception of the trees in the saddle valley. But I had a clear enough view that if a deer was in there or came through that valley there was no way I would miss seeing it. This particular course also gave me a good look at the western finger face although with many trees on it there were several spot that had no trees and the rock strata was exposed which would give me a chance to look at to see If I could distinguish the types of rock there. I could also watch the ridge top of the western finger and see anything coming over the top. Over to my right across the top of this finger is heavily wooded with mainly hardwoods however there were some pine trees among them. This is old growth trees some of the hardwood (oaks, hickory) are quite large. It is heavily wooded enough that even in the bright sun it is fairly dark in there only a few feet in. Not dark enough that you can’t see but you certainly would not need sun glasses in there. It, just like up in the dish it gets dark in there long before the sun is fully set. There is very little under growth in this area because it is so sunlight challenged. And the spacing between trees are fairly wide so that if anything of any size moved through you would have no trouble sighting it. This tree line extends almost all the way to the edge of the finger. You would only have maybe 5 feet of space to walk the length of the finger clear of trees. From the edge of this finger I am on in some places are straight down into the valley below. The only way to get on this finger is from the direction I came or as I will speak to later would be from the very end or tip of this finger. So I slowly stalk down this finger, keeping just inside the tree line so as not to be exposed to the valley floor and the western finger. I stalk very slowly along in no hurry whatsoever. Understanding that stalking means walk a few steps stop, wait, and listen, and repeat. I stalk nearly the entire length of this finger and decide I need a break so I walk out of the tree line to a spot that is actually clear of trees (except for one tree about the diameter of basketball) for about an area the size of a large bedroom. There was this very fine looking stump there that actually looked like it was made for my fat butt and it was high enough that I did not even have to bend my knees very far to be sitting. I figured I would sit for a while and rest my tired legs then I would finish walking this finger all the way to the tip and look down it and into the valley across the way. Then head back because we were to hook back up at noon and by now it was 9:30 and I was a good 3 miles from camp and a very hard climb back up the mountain. (Why in the hell did I ever decide to walk down the damn mountain, I knew I would have to walk back up at some point)? As I was sitting on my fine stump I looked down the finger out to the tip. At the tip was a huge oak tree I am 5ft 10 and it would have took two of me to wrap my arms around this thing. As I was looking at this tree and trying to figure out how a tree can grow to that size in so little soil. I then notice just off to the right of this tree a figure walking up from below the tip of the finger. The figure was in bright sunlight so I immediately recognized it as walking on two feet. And he appeared to me to be walking with his head down. But my first thought was what a dumb ass. It is deer season and if you are in hunting you are required to wear blaze orange and this guy had none. Even if you are not hunting it is a good idea if you’re out in the woods. Now granted I had only seen one human in 3 days and that was my hunting buddy. And even though there were no humans for miles I for one would never take a stupid chance like that. I guess I should mention also that during the deer gun season, logging operations cease and the loggers go home. The company’s do not want their employees getting plugged by some knucklehead hunter. So I knew that this guy was not a logger. Then the next question came to my mine how in the hell did this guy get there? There is no logging road in that direction for a very long way. And from the nearest road it is a long ass haul to that point. And that haul would not be easy at all in fact that area is inaccessible even by an ATV. The next thought no he is not a hunter he is not carrying a rifle nor does he have one slung on his shoulders. Now remember that all these thoughts were processed in my head in a matter of micro-seconds. While this guy was walking slowly up this slope to the top of this finger that I am on. Then the next though through my mind gosh that is a cone head (from the movie) with hair. Because his head was very pointy. Next thought my god those are big assed shoulders. Next thought why in the hell is he wearing a mink coat? WTF. Next thought did god forget to give this guy a neck? It looked to me as his head was attached directly to his shoulders. Then this guy finally reaches the top and stands directly besides that big oak I was looking at just moments ago. Next thought my god that is one big MF. I have seen many football games and some of those have been up in the nose bleed section and those guys even that high up look big. But this was different I am now 83 yards from this guy and he is the biggest person I have ever seen bar none. Then the big guy looks up and looks directly at me out in front of god and everyone. It was then I realized ok I am not looking at any man but not really animal either it didn’t seem. Now let me attempt to explain what big guy did. Imagine yourself standing looking straight ahead at some target and right next to you and slightly in front of you to your right is a big tree. Your desire now is to get behind that tree with little movement as possible. What you would most likely do is simply lift your left foot and pivot 90 degrees counterclockwise on your right foot with your head and neck froze in place to watch your target while moving. That is what he done. Next thought do I have any clean underwear back at camp cause me thinks I need them. Then the flight or fight response kicked in on me but I forced myself to stop think and evaluate. I determined that at 83 yards (didn’t know it was exactly 83 yards at that time I went and marked off the distance later)(I was actually guessing at the time 100 yards)there was no way no matter how fast he was, that he could cover that distance before I put at least 3 bullets in him. (However I thought later than may have only pissed him off as big as he was). But anyway when I assured myself there was no real danger I calmed down and started thinking clearly again. The big guy was now standing behind that oak watching me then suddenly he popped behind the tree and I couldn’t see him. So at that point I very slowly got up and moved behind that little tree near me. Then I peeked around that basketball sized tree (BTW at that time I was beach ball size so you can see the tree really offered no concealment) to see what was happing. By the time I looked back up he was once again peeking out from behind the tree. Now this time I thought that poor guy is deformed somehow because there appeared to be some kind of growth just around and below his throat. Could not make it out but definitely could see the discoloration and could see that there was something there that didn’t belong. I was straining as hard as I could to make out the facial figures of this guy but try as I might there was simply no way I could make out any details of his face. My one real regret in this whole experience. Anyway we just kind of stared at each other for a couple of seconds then he popped back behind the tree. So I done the same the best I could. Here I am in an area with trees the size of Volkswagens and leave to me to pick a sapling to hide behind. After a couple of seconds behind the tree I pop out my head don’t see him but I stay in that position a couple of more seconds then the big guy pops out his head again and looks at me. Now I am really confused because the growth that seemed to be on his throat is now over on top of where a clavicle would be. I don’t know what is going on it is just too far away for me to make out fine detail. Someone with better vision probably would have been able to make things out better. Now here it becomes surreal and I don’t know if I can put into words the way the situation seemed to instantly change. One moment I am so tense you could not have driven a straight pin up my butt with a 16 lb sledge hammer. The very next second a calm came over me and somehow I just had a feeling that there was nothing to be concerned about. So while he was looking at me I purposely leaned my rifle up against the stump I was just sitting at with him watching me. I just got the distinct feeling (yes I know the least scientific thing in the world) that he knew that I meant no harm and had no intention of doing anything to him. Maybe not maybe I am just reading more into that than I should. For lack of a better word we basically played peek-boo for another two minutes popping back and forth behind the trees. I just got a feeling he would have liked to have gotten a closer look at me just like I wanted to with him. Of course that was never going to happen. I think we may have kept doing that for a while longer but something happened that changed the circumstance. After a total of just about 3 minutes he very suddenly snaps around the other direction? I was thinking what the heck. Then I heard what he heard very large SNAP coming from the woods on top of this finger. I peed. Then the big guy turns and keeping the tree between me and him he simply walks off. He did not run or even walk particularly fast, he was walking a bit faster leaving than he did walking in but not in any panic. I figured if it was something that made him want to leave the area I better figure out quick what that made that noise. So I pick up my rifle and immediately start scanning. I want so badly to walk over to the tip to see if I can a glimpse of big guy. But I don’t dare until I resolve this issue. After a couple of minutes of searching and listening to the noise I finally track to the source of the noise maker. A frigging tank rat. Damn I missed a possible chance to get a better look at big guy because of a dang tank rat. (Don’t bother looking that species up that is my personal term for an armadillo). As stated above after the incident I walked off the distance and also solved one of the mysteries. The abnormal growth on big guy was not on big guy at all. It was on the tree it was a viral knot about the size of softball. I am 5’ 9/10, standing under the knot I could barely touch the bottom edge of the knot with my fingers standing on my tip toes and arm extended as far as I could. I found no tracks what so ever even though I knew the exact location of where he walked up and back from, but the ground was hard pan and even a D9 bull dozer would have been hard pressed to leave any marks/tracks in that ground.",
  "classification": "Class A",
  "county": "McCurtain",
  "state": "Oklahoma",
  "latitude": 34.36778,
  "longitude": -94.68028,
  "location": "-94.68028,34.36778",
  "location_details": "Can show on a topo map",
  "temperature_high": 61.8,
  "temperature_mid": 53.08,
  "temperature_low": 44.36,
  "dew_point": 42.28,
  "humidity": 0.75,
  "cloud_cover": 0.24,
  "moon_phase": 0.96,
  "precip_intensity": 0.0143,
  "precip_probability": 0.89,
  "precip_type": "rain",
  "pressure": 1012.07,
  "summary": "Rain in the evening.",
  "uv_index": 8,
  "visibility": 8.59,
  "wind_bearing": 70,
  "wind_speed": 1.69
}