{
  "reportId": "35270",
  "title": "City planner sees large upright animal while touring property near Punta Gorda",
  "date": "2006-03-15",
  "timestamp": 1142380800,
  "observed": "In the spring of 2006 several members of the county’s development review team (planners, engineers and legal) were invited to tour a 90,000 acre ranch that was proposed for development.  The intent was to give the reviewers a “base-line” as to existing conditions, identify areas to be developed  and areas proposed to be established as a nature preserve. The developer provided a “swamp buggy” for the tour.  It was an  old, modified (top removed) school bus with large tires.  It maneuvered around the ranch, much of which was swamp, for a little more than two hours. The ranch extremely active with wildlife … the fields and pastures with deer and wild pigs; the swamp with large birds and dozens of gators.  Although the ranch was laced with timber and crop roads, many were flooded from a very wet winter / spring and therefore the swamp buggy was forced to take routes not often traveled.  Near the end of the tour about two miles from the ranch’s bunk houses and barns,  the driver had to tap his breaks to avoid a family of wild hogs (2 large and 3 small).  The guide, who was also the ranch manager, mentioned the wildlife was much more active than usual, offering that it was because of the heavy rains and flooded areas …  joking that “we even brought out the three little pigs for you.”  I was sitting next to where the guide was standing and I said “yeah, you even provided a gorilla”. He looked down at me but said nothing as I pointed out of the bus across a flooded area to a small rise, maybe 150 yards away.  He said nothing so I let it drop. A few days later a member of the legal staff that had taken the tour came to me and asked what did I mean when I mentioned a “gorilla” on the tour.  I explained while others were watching the hogs run to the left of the bus I was looking at the flooded pasture to the right and had seen a large bipedal standing slightly over the rise.  I described what I saw and she said “you need to talk with Rich (county attorney) …  he saw it too.  We saw exactly the same thing …  a very large bipedal (7’ or more) standing just over the rise (could see it from knees up) with it’s back to us.  It was covered with very dark hair, no neck … what I would call bullet shaped and was from 125 to 150 yards away.  It was only visible for maybe 5 seconds because as the bus kept moving heavy growth blocked the view … but for those 5 seconds it was an unobstructed view.  As the bus passed, the creature turned, assumingly to see what the engine noise was … but the entire upper body turned from the waist.  As it turned, it appeared to be holding something in its arms.",
  "classification": "Class A",
  "county": "Charlotte",
  "state": "Florida",
  "latitude": 26.85451,
  "longitude": -81.71583,
  "location": "-81.71583,26.85451",
  "location_details": "From I75 south take exit #164, take US17/Duncan Rd north 1 miles to74/Bermont Rd, go right on 17 about 15 miles. At flashing light rurn right onto SR31. Go about 6 miles, entrance to the Wilderness Park will be on the left.",
  "temperature_high": 78.88,
  "temperature_mid": 68.345,
  "temperature_low": 57.81,
  "dew_point": 50.48,
  "humidity": 0.53,
  "cloud_cover": 0.14,
  "moon_phase": 0.52,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.57,
  "summary": "Breezy and partly cloudy in the morning.",
  "uv_index": 9,
  "visibility": 9.91,
  "wind_bearing": 36,
  "wind_speed": 9.75
}