{
  "reportId": "26450",
  "title": "",
  "date": "",
  "observed": "This past weekend I was backpacking in the Buckhorn Wilderness Area, on the Olympic Peninsula, WA. We hiked about 2 1/2-3 hrs to a small alpine lake. During the first day, after we made camp, my buddies and I were goofing off throwing large rocks (which may have attracted it???). That night, I would guess around 3:30 am, I heard a faint knocking in the woods.I laughed at the idea of it being a bigfoot at first, and then it got closer, and closer, and closer until i knew something was out there. It got around 100 yards away from the camp, and went on for about an hour! At the end of the hour I thought I heard return knocks on the adjacent ridge, but can't be sure it wasn't an echo. The following morning I told my fellow campers what I heard. We found cougar tracks around the area, and they attributed the noises to that, but I knew it was no cougar banging things together. The last night in camp, everyone was a little on edge. One because I kept insisting on what I heard, and two because there was a cougar in the area. We heard a stick crack in the woods, and figured it was a good idea to go in the tent for the night. A few hours later, around 1:30 to 2 am two of use heard something walking along the rocks down by the lake (50-75 yrds). Shortly after that we both heard something hit the tent. I don't know what it was, possibly a small stone. The next morning, we woke up and went to where we heard something walk across the rocks, and found tracks! At first I thought black bear, because of the size (not huge for a \"bigfoot\"), but a closer look, I realized it was not a bear. There was no front paw tracks, no claws, and they weren't the shape of a bear. It looked a lot like a person's foot but, when I stood in the mud next to it, I sank 1/4 in into the mud. These were probably 2in in the mud! So what ever it was, it was heavy! I would guess around 400lbs, since I was 185lbs. There were 6 or 7 tracks total. I took a few pictures, and would love to forward them on to you guys to get your opinion.",
  "classification": "Class B",
  "county": "Clallam",
  "state": "Washington",
  "location_details": "[Omitted]",
  "summary": ""
}