{
  "id": "47160",
  "title": "",
  "date": "",
  "observed": "During an expedition in the western foothills adjacent to Mt St Helens, two men from our group spotted themselves in a trail depression approximately 100 yards from, and looking down our location, planning to utilize the FLIR from that vantage point to observe myself and another man who planned to spend a few hours in darkness in a known “hotspot” deep in these woods. After being on-site without artificial illumination for over an hour, at 1 AM we still could not see our hands, legs, etc. If/when we observed/heard anything interesting we would signify that observation to the remote FLIR observation post by playing the song “Jingle Bells” on the harmonica.  That song was only to be played when some form of contact was made. The two of us positioned ourselves roughly facing each other to facilitate a 360 degree field of view.  We talked about our plans for the upcoming hunting season, recapped some past events, joked, laughed and played various little ditties on our harmonicas. At approximately 1:00 am we heard the sound of a stick breaking a short distance directly behind my partner.  This was followed a few minutes later by two or three soft knocks, believed to coming from the same direction.  Approximately 20 – 30 minutes later my partner advised to look behind me. I initially turned to the right (saw nothing) then to the left and when tightly twisted around in my chair saw what appeared to be a floating red ball (with a slight tinge of orange).  The ball appeared to be in close proximity to the forest floor as it illuminated the ground in front (fan shaped pattern) with enough light to silhouette some ferns (estimated distance of ground illumination at 14-16 inches).  The ball moved slightly to the left and right and up and down (somewhat akin to a sniffing motion) then we saw what appeared to be a large index finger, again silhouetted by the light emanating from the source..  My partner started playing Jingle Bells (with some vigor) and I attempted to talk to the red ball in reassuring/comforting tones.  My partner made it about half way through another song (neither of us can recall which one) before the red ball gradually dimmed and went out.  We also observed what appeared to be the finger tip, and the first and second knuckles.  The “finger” moved slowly in our direction and toward the forest floor prior to the light source fading out. The two of us remained in the dark and marveled at whatever it was that we had just experienced and wished that the two men in the remote outpost had either been with us to see same or had some form of experience on their own.  We started playing more songs on the harmonica followed by a minute or two of silence, followed by some casual conversation followed by another tune.",
  "classification": "Class B",
  "county": "Lewis",
  "state": "Washington",
  "location_details": "Not Disclosed",
  "summary": ""
}