{
  "reportId": "1452",
  "title": "",
  "date": "",
  "observed": "The town of Cranbury, NJ held fireworks on July 5th this year (2000). My wife, our two children (ages 6 and 2), and I had driven from our nearby town to watch the fireworks from our vehicle. When the fireworks ended (shortly after 10:00 PM) we decided to take a short drive. We headed North on Rt. 535, and although it was a warm night we still had our windows down because of the fireworks. After approximately one mile, as we were passing a stand of trees on our left (speed was approximately 50 mph) I could make out a shrieking sound coming from outside. After we had passed I slowed down and asked my wife if she had heard the sound. She said that she had heard it, but with the noise from the wind rushing through the windows it hadn't registered. I decided that the sound was too odd and urgent to ignore, so I made a U-turn at the next possible point and slowly made my way back to the section of road where the sound came from. As we approached the stand of trees (now on my right), we began to hear the shrieking sound again. I stopped the vehicle near to the point where the sound was coming from. The shrieks would last about 4 or 5 seconds with a one or two second pause in between. Our immediate impression was that it was like a young woman in sheer terror or agony. After a very brief moment we decided that no, it sounded more like a hawk or an eagle. Then, again we thought it could be human, because it was just too powerful to be coming from a small animal. Unable to determine what the sound was, I decided to honk the horn to see what the reaction would be. There was no change in the shrieking so we decided that there probably wasn't a crime in progress, because the perpetrator would probably have stopped, or the victim would have intensified or vocalized their pleas. At this point about 20 seconds had passed since we had returned to the area. The sounds seemed to be coming from the far edge of the trees, about 15 yards away, so we were unable to see where they were coming from because of the dark. We decided that to determine if something or someone was in danger or hurt I should step out and yell into the trees to see if the shrieking would stop, which I did armed with my sons wooden baseball bat. The first time I hollered the shrieking faltered and the second time I hollered the sounds stopped altogether. Total elapsed time since returning to the site was probably less than 30 seconds. I got back in the vehicle and we waited several minutes and the sound didn't continue. We went for a short drive and stopped at the area a few minutes later but we didn't hear the sound again. My wife and I have discussed the incident several times and have never come up with a satisfactory explanation as to what could have made those sounds. I grew up in Canada, where I spent most of my summers camping in the wilderness, so I can easily identify most animal sounds and responses. This creature didn't seem to behave like an animal would when approached by a vehicle, a horn, or myself, until I hollered extremely loud two times. The sound was distressed, extremely loud, bordered on human, but was definitely not human, and I have no explanation for it.",
  "classification": "Class B",
  "county": "Middlesex",
  "state": "New Jersey",
  "location_details": "30 yards South of the point where Rt. 614 ends at a \" T \" intersection with Rt. 535, behind a small stand of trees on the West side of Rt. 535. The area is undergoing heavy construction, transforming former and current farmlands into large warehousing facilities and commercial sites. There are several small wooded areas remaining, and the closest residences are at least 1/2 a mile away (with the exception of an old vacant house at the intersection of Rt. 535 and Rt. 614) .",
  "summary": ""
}