{
  "reportId": "10470",
  "title": "Campers find footprint in Indian Heaven Wilderness",
  "date": "1993-08-02",
  "timestamp": 744249600,
  "observed": "When I was about 10 years old my father took me and a friend camping up in Indian Heaven. We parked and then hiked about 3 miles uphill to Lake Wapiki there. It was beautiful mid August and hot. While hiking up to the camp spot I remember having a sense of someone looking at me from the forest. I do have a big imagination though so I didn't think to much about it. We arrived at our camp spot and set everything up. We were camping next to a large dried up creek bed and I remember looking at it and following it a little ways down. Picking huckleberries and exploring the rest of the area, I spent the rest of my day just having fun. That night, after I and my friend and Dad had gone to bed, we were awakened by a stampede of deer or elk or something. There were at least 10 because it lasted about 20 to 30 seconds and they were running right through our camp. Scared the hell out of me. I remember my Dad getting up and making sure we were all right. Everything was fine and so I slowly fell back asleep. Next morning I woke up and looked around and it looked like some of our cooking gear was scattered about the camp, probably from the stampede running right through. And then I saw it what makes me believe in Bigfoot. There in the dried creek bed was a huge footprint. And i'm not talking about a human print. Though this foot print could have been made by a man, it was way too big and wide. I estimate a size 20 and it was like 4 to 5 inches across. Huge foot print. Scared me half to death. I was thinking about it and I think a bigfoot had scared the deer or elk into the stampede. So there is my story about bigfoot. I believe 100% in bigfoot. I know this story isn't all that. It's not like I saw him or anything but what i saw made me believe. ",
  "classification": "Class B",
  "county": "Skamania",
  "state": "Washington",
  "latitude": 46.0189,
  "longitude": -121.7476,
  "location": "-121.7476,46.0189",
  "location_details": "Trail leaves Forest Road 24 about 1.5 miles SE of Little Goose Horse Camp. When you get to the lake [Lake Wapiki] you curve to the left of it and we camped back there a couple hundred feet from this big pond that had a lot of frogs in it.",
  "temperature_high": 90.27,
  "temperature_mid": 74.82,
  "temperature_low": 59.37,
  "dew_point": 55.41,
  "humidity": 0.54,
  "cloud_cover": 0.03,
  "moon_phase": 0.52,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.61,
  "summary": "Clear throughout the day.",
  "uv_index": 9,
  "visibility": 9.67,
  "wind_bearing": 10,
  "wind_speed": 3.85
}