{
  "reportId": "1260",
  "title": "",
  "date": "",
  "observed": "A friend and I were driving back to Fairbanks from Anchorage..I was driving her truck-a 1980 Dodge d50 ..these trucks sit very low to the ground..It was late at night, and we were just about to the tourist Area of the Denali Park.  It wasn't winter yet,  just before a corner, my lights hit something sitting on the yellow line in the middle of the road.  The lights to this truck were grossly out of adjustment, so they were pointing right at the thing.  It was sitting in the middle of the road with it's legs pulled up to it's chest, and it's arms folded over it's knees.  It's head was between it's arms, looking toward the ground It had long, human like hair..at first I thought it was an orangutan,  Then I thought to myself, what would an orangutan be doing in the middle of nowhere in Alaska.  I've lived here almost all my life and there is no animal like this one..I thought to myself the only way that could have been an orangutan is if there's a circus out here.. I knew that was not a possibility in such a remote area. I drove right next to it and I was at it's level.  If I had been going slow, I could have touched it easily. I was freaked out and thought I must be seeing things, maybe I was tired..My friend saw it too, although neither one of us said a word until we reached the gas station in the town of Healy just passed Denali.  She said \"Did you see that..\"  and I said, \"I thought I was seeing things..\" This spooked us so bad we didn't even say anything to each other about it until we were around people.  We have talked about this, and still agree that we saw this thing. We have given up on trying to explain it to anyone else, because no one believes it..We both have decided not to bring it up because no one believes it anyway.  Why I feel this is so unusual, is there is no animal native to Alaska that could resemble this thing in anyway.  We have bears, moose, caribou, porcupine, rabbits ect..but none of these animals have knees or long reddish colored hair. I don't know how to explain it, and I've given up trying to because nobody believes it, they think your joking. I don't want to be harassed by any nuts, I just wanted to share my genuine incident in case others have seen it.",
  "classification": "Class A",
  "county": "Matanuska-Susitna",
  "state": "Alaska",
  "location_details": "The incident occurred on the highway from Anchorage to Fairbanks Alaska just before the tourist area of the Denali Park.",
  "summary": ""
}