{
  "id": "48797",
  "title": "Men exploring logging roads hear possible knocks and a branch break near Cinebar",
  "date": "2013-06-02",
  "timestamp": 1370131200,
  "observed": "On Sunday June 2, 2013, a friend of mine at the time wanted to explore some logging roads in our area and get some pictures of his jeep in action. We started out exploring many of the roads in the area, and as we travelled down one road we encountered a tree that had fallen across the road but was lodged in the trees tops on the other side of the road. We were able to drive under it after we determined that it seemed safe from falling and blocking us in. We drove a short distance further and went through a sharp right turn and found another tree across the road the same way. So we decided to back up a few feet and take a smaller side road and turn around. Once we were on the side road we decide it may be a good road to check out, however we wanted to walk up the road to make sure we could turn around, or see if we could tell how far up it went. The road was smaller than the previous we were on, and neither of us had any previous knowledge of this area. After we got out of the jeep we walked about ten feet and heard a few quick knocks which sounded like a big stick hitting a tree, almost like someone knocking on a door. We continued walking and while talking about the noise, we then became distracted by some old broken equipment that was left by the loggers. We thought it was odd that it was left because it had some scap metal value. At that time we again heard the knock behind us, and on the same side of the road as before. At that point I took a couple of pictures toward the noise, but while looking at the display screen on the camera I was using (Canon PowerShot A720 IS) I did not see anything. As our attention was focused on that area and we moved closer, we heard another sound to the left of us also on the same side of the road. It was a massive snap that sounded like at least a 6 inch thick log breaking. It was not just a quick snap, we could hear the log snapping in sections like when you cut down a tree. At that point we decided that we needed to leave and walked back to the jeep trying not to look like we were fleeing. At that point we backtracked up the hill on the road we came in on and looked down on the area. But we could not see any people, car, or anything else that could have made the noise.",
  "classification": "Class B",
  "county": "Lewis",
  "state": "Washington",
  "latitude": 46.64191,
  "longitude": -122.4607,
  "location": "-122.4607,46.64191",
  "location_details": "The area was north of Rooster Rock, Google earth gave the coordinates as: (edited-out to protect the exact location)",
  "temperature_high": 67.35,
  "temperature_mid": 57.42,
  "temperature_low": 47.49,
  "dew_point": 49.14,
  "humidity": 0.69,
  "cloud_cover": 0.66,
  "moon_phase": 0.82,
  "precip_intensity": 0.0001,
  "precip_probability": 0.07,
  "precip_type": "rain",
  "pressure": 1018.92,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 10,
  "wind_bearing": 318,
  "wind_speed": 3.08
}