{
  "reportId": "2844",
  "title": "",
  "date": "",
  "observed": "In 1987, on the night of the first day of the California x1 deer season, myself and my hunting partner were sitting around the campfire a couple of hours after dinner, just relaxing and enjoying the fire. Down to the south is a small clearing. The moon was out and we noticed some movement in the clearing. The moon gave off just enough light that we saw a figure move slowly across the clearing. Lucky, my partner, thought it might be a bear, so we didn't pay it much mind. I guess about 10 or fifteen minutes passed, when all of a sudden we heard dry brush breaking up on the side of the mountain. From where the camp is located we were on the east side of the mountain. From that point the mountain goes straight up. Lots of brush and timber. Suddenly, whatever it was started screaming and we could hear it crashing through the brush. It scared the hell out of us. Then it must have turned and headed uphill. It was still screaming but it sounded like it was getting further away. We were both too shook-up to move, so we just sat there not saying a word. I guess about 20 minutes passed without hearing anything, then all of a sudden we heard a log come flying down the mountain crashing through the brush. Then it started again: this time the screaming was louder and seemed to be closer. The wind was coming from the north, which was where the spring was. All of a sudden it smelled like something had died. It smelled like a strong urine odor. The smell was overwhelming; it was like somebody had opened an outhouse door or something. And the screaming was louder than ever. Then all of a sudden it went quiet. We stayed up another hour or so before we decided to turn in for the night. We put some more wood on the fire and got in the tent and got ready to sleep. Then it started again. It lasted about ten minutes then went quiet, but then it really got scary. The light from the fire was pretty bright and showed through the tent. We were both hugging our deer rifles, wondering what would happen next. All of a sudden we both saw a shadow come between the fire and the tent. It moved slowly and was very large. Then as quickly as it started it ended. The next morning we searched the area for foot prints but were unable to find any. What we did realize was that our pickup was parked right near the spring and there was a very large log that had not been there the day before. We figured maybe whatever it was didn't like the pickup so near to the only water in the area. It was a very dry year and all the natural springs in the area were dry, so this was the only water for miles. I have hunted this area for the last 25 years and I have back-packed in the back country all my life. I have heard just about every animal that's out there, but I have never heard anything like what we heard that night. So what do you think? Did we have an encounter with one of the big guys? Sure would like to hear what you think. Thank you.",
  "classification": "Class A",
  "county": "Shasta",
  "state": "California",
  "location_details": "",
  "summary": ""
}