{
  "reportId": "2901",
  "title": "Couple in car terrified by loud howl/scream near Carlinville.",
  "date": "1978-05-01",
  "timestamp": 262828800,
  "observed": "Sir, Back in the spring of 1978 at the age of 17 myself and my High School sweetheart were parking just off a seldom traveled country road in Macoupin County about 10 to 13 miles south of Carlinville and roughly 10 miles west of Gillespie. We were \"making out\" on a farm field access in the back seat of my car parked about 20 feet off the road. The area was fertile bottom land just about 50 feet from a bridge over a small creek. There were dense woods around with a small corn field of maybe 4 acres cut out of the fertile soil alongside of the creek. The night was one I'll never forger. In our young passion a foul stench came over the area. But the real thrill soon followed! We heard the loudest most shrill scream we could imagine. It was very very close and extremly loud. It started as several low tone grunts and exploded into the most frightning shrill scream I'd ever heard. It seemed to vibrate the old car we were in. We were both panic stricken and scared out of our minds. I jumped into the front seat butt naked and drove like hell until we were on high ground and away from any woods. I hadn't taken time to dress until we were miles away from that spot! We discussed what had happened and decided to keep the whole thing a secret. Actually we looked at each other and said something like \"this didn't happen did it???\" The whole thing gave me a fear of the woods that lasted for almost 20 years. But, as I looked back on it I realized whatever it was had been watching us, and at any time if it were a \"savage beast\" had every chance to do whatever it wanted to us. Did we go back later and look for tracks? Hell NO!!! No how no way!!! I avoided that area at all cost, day or night. Did the sound resemble your recordings? Well actually it did indeed but amplify it a hundred fold. I recall as a small child the screams of what the local Illinois farmers call a mountain lion. We had several cattle maimed and that scream was nothing like the one we heard that evening. It was just so chilling.  ",
  "classification": "Class B",
  "county": "Macoupin",
  "state": "Illinois",
  "latitude": 39.115,
  "longitude": -89.952,
  "location": "-89.952,39.115",
  "location_details": "",
  "temperature_high": 55.45,
  "temperature_mid": 44.94,
  "temperature_low": 34.43,
  "dew_point": 24.27,
  "humidity": 0.43,
  "cloud_cover": 0.64,
  "moon_phase": 0.81,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.66,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 6,
  "visibility": 9.08,
  "wind_bearing": 45,
  "wind_speed": 13.4
}