{
  "id": "51994",
  "title": "Man and girlfriend have sighting on Joint Base Lewis-McChord road near Spanaway",
  "date": "2016-05-29",
  "timestamp": 1464480000,
  "observed": "We were going fishing, on May 29, 2016. We turned right at the Roy Y Going south. It was 5:15am. We were going south. We observed and exclaimed, \"that looks like an ape sitting on the side of the road. The animal was about three feet high in a sitting, crouched position. We were going south from left to right. We saw its left arm shoulder to elbow, left leg hip to knee, lower leg obscured. The head was larger with a sagital crest. Lantern shaped jaw that protruded slightly forward. The nose looked wide. And it had a protruding eyebrow like a Neanderthal. Its ears were covered in black hair tight to the head. No visible neck. Still going left to right, we can clearly see, shiny black hair. The animal leaned forward head going low, could see top of both black haired ears. Our distance at this point is between 22 to 25 feet. The animal extends its right arm from the shoulder parallel to the ground and drops some trash from its hands. The arm had black hair all the way to the knuckles. The arm was to long to be human. When it dropped the trash, a thumb and four fingers were clearly visible.The animal moved its right arm back in front of its torso, ninety degrees of angle. Not a bear. It did this action twice. Still going left to right, the right arm from shoulder to elbow is visible, below the right arm, between right arm and right leg, right leg visible from top of buttocks to hip to knee, partially covered by green plastic garbage bag. We estimate its overall height to be between five foot six inches to six feet tall. We said moma-squatch would not leave baby that close to the road. As we lost sight of it we knew it was a juvenile Bigfoot.",
  "classification": "Class A",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 47.07405,
  "longitude": -122.4428,
  "location": "-122.4428,47.07405",
  "location_details": "Right alongside joint base lewis,McCord boundry sign.",
  "temperature_high": 63.93,
  "temperature_mid": 53.89,
  "temperature_low": 43.85,
  "dew_point": 49.45,
  "humidity": 0.76,
  "cloud_cover": 0.23,
  "moon_phase": 0.76,
  "precip_intensity": 0.0007,
  "precip_probability": 0.53,
  "precip_type": "rain",
  "pressure": 1020.37,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 9,
  "visibility": 9.79,
  "wind_bearing": 250,
  "wind_speed": 1.44
}