{
  "reportId": "4508",
  "title": "",
  "date": "",
  "observed": "A friend and I had decided to do some cross country skiing on the property owned by some neighbors.  We started out behind my house and worked our way into the woods.  There is an old logging road about a mile in that we hooked up to.  It was a sunny day in January, with a steady but light snowfall.  Along the way we had taken note of different tracks, as the area is home to abundant wildlife.  At this point we had come across several deer tracks.  We were studying the tracks and noting that most were not fresh, as they were already filled with snow.  There is a point in the trail where it splits and you can go to the right or left.  We chose right and continued back in.  This route is fairly short and takes about 10 to 15 minutes to reach the end where it abruptly stops in a an open field.  At this point we chose to turn around and start back out.  When we reached the spot where the trail had split, we were coming down a slope and nearing the fork when we noticed what looked like fresh tracks in the snow ahead.  They looked fairly big in size, so we decided to stop and have a look, thinking we may have stumbled across some bear tracks, which are not uncommon to the area.  When we reached them, both of us just stared,  They were huge!  And deffinitely NOT bear tracks.  Both of us are avid outdoor people and hunters.  Growing up in the area we are both familiar with identifying tracks.  To us it looked like our own feet (bare feet) only much larger and wider.  I'm not sure of the size, but with an educated guess I would say about 1 and a half to 2 feet in length or so.  We started to think that someone had possibly come back in and done it as a joke, knowing we were in that area.  The problem with that is, the area is accessible by vehicle but only an ATV or snowmobile, as the trails, although sufficiently wide, are no longer suitable for regular vehicles.  We found no tracks coming in or out from any vehicle, nor did we find any evidence that someone had walked in on foot or otherwise, beside ourselves.  However, no person could have made such tracks.  The tracks came out of the woods on the right side of the trail, crossed it and dissappeared back into the woods on the left.  We ventured into the brush on either side and noted that they were consistent in both directions.  There were no human shoe or barefoot prints to be found anywhere.  What really scared us was the realization that the tracks were fresh.  We had passed that same spot only ten or so minutes earlier and saw nothing, so we had to assume that whatever it was, had passed behind us after we went through.  That sent chills enough through both of us to get us moving back out double time.!  I should also note that the width of the trail is about 6 or 7 feet.  There were only 2 footpirints in the trail itself, telling us that whatever made them, had a very long stride.  To this day neither one of us has spoken of this until now, when a friend referred me to this site.  I still question what I saw, but have never been able to come up with a reasonable explanation as to what it may have been.",
  "classification": "Class B",
  "county": "Rensselaer",
  "state": "New York",
  "location_details": "The location was in a well wooded area about 2 miles behind my home and a neghbors property.  The old logging trail is used by friends for hiking, walking etc at all tmes of the year.  It is accessible only by trails across my or my neighbors land.",
  "summary": ""
}