{
  "reportId": "5610",
  "title": "Three guests at Suttle Lake Resort get long look at three sasquatches",
  "date": "2002-10-24",
  "timestamp": 1035417600,
  "observed": "This sighting took place while I was on a fishing trip with my girlfriend, another couple, and their mom. My friends were staying at the resort cabins at one of my favorite fall fishing lakes. By the time we arrived (delayed by wiring problems on my boat trailer) it was about 3 a.m.  We talked untill there was little reason to go to bed, just to have to get right back up to catch the morning bite. About an hour-and-a-half before sunrise my friend Wes and I decided to go for a little walk down to one of the streams that feed out of the lake.  I was curious to see what the fish were doing. We both had flashlights, shining them into the stream as we walked along trying to spot fish. The further we went, the more uneasy I became and I have been in these woods all of my life and never felt like this ever. I asked Wes if he felt kind of weird he said, \"Kind of.\"  We decided we'd head back. We moved to a different cabin closer to the lake. After the evening fish I returned at late light, bummed about missing a very large brown trout.  I spent most of the evening listening to fish jump and looking at stars. Wes' mom went to bed first and about 11:45p.m the rest of us went to bed. My girlfriend and I were not sleeping in the cabin with Wes and his family. We were sleeping in the back of a full size Chevy Surburban, mainly because Angela and I wanted a little privancy.  Angela and didn't go right to sleep. This was about an hour-and-a-half after everyone said good night at the camp fire. I sat up to smoke a cigarette and I was looking out the rear side window when something caught my eye. The cabins where we were staying are not very large. There was outdoor lighting attached to the middle of the roof line of the cabin. At first I thought it was the wind moving the tree branches or bushes but something wasn't right.  I then began to realize was I was seeing. I thought maybe I was a little more tired than I thought and that my eyes were playing tricks on me. Except the trick didn't go away. Just to make sure, I asked Angela to sit up and look around and tell me what she sees. I totally expected to look stupid and have her tell me she saw nothing. I did not tell her what I was seeing or where I was seeing it.  I looked down at the floor. Angela sat up and it wasn't even two seconds before she visually locked onto the same thing I did. Still looking at the floor, I asked, \" What do you see.\" Her first word was, \"Yeti,\" and with that things now felt real.   We both became excited, scared, and curious.  I was a bit more uneasy with how the bigfoot was moving and acting. It was about 50 feet away back in the tree line on the other side of the cabin, about 15 feet away from Wes' mom's truck. It was standing just out of the light, so as not be directly seen. It was about 7-1/2 to 8 feet tall, covered in hair,  very broad in the shoulder and across the chest.  It wasn't as bulky as what is in the Patterson film.  What made me very uneasy was its movements and actions. It wasn't coming forward. It had one arm up above its head and to the side, resting on a tree.  It was rapidly rocking from side to side, and bobbing up and down. Angela made a statement about getting out to maybe get closer to it.  I was in the process of telling her, \"No!\"  when the next surprise was realized. Anglea points out that there's more than one. About two feet behind the tailgate of my friend's moms truck, was crouched not one, but two of what appeared to be smaller bigfoots. They were crouched close together, sitting motionless and looking directly at us. They looked like they were younger ones, compared to the big one still rocking back and forth by the tree. They were not as broad in the shoulders or chest. Angela and I wondered what to do, quietly talking to each other for five or ten minutes. I decided to wake up Wes by yelling toward the window of his bedroom, which was in the middle of the back wall of the cabin. Wes answered back and I told him to look out his window.  At first he couldn't see anything through the window. I didn't tell him what to look for or what I was seeing for fear of him thinking we were pulling a joke or that we were totally out of  our minds. As he opened the window, I asked him, \"Do you see it?\" His response was, \"Oh, my #%&^@ God!\" Wes didn't say another word, which made me even more uneasy. I couldn't deal with it anymore.  I jumped up to the front seat and was gonna start up the rig to back them off a little.  When I got up front, I couldn't find the keys. I became a bit panicky. I found the keys and started up the Chevy with a big \"vrooom!\" and it hardly seem to bother them. I then decided if I was going to see Bigfoot, then by god, I'm gonna try to get a good look!! I was parked in such a way that I had to pull way out and swing the front end around for my lights to hit them directly.  As soon as the Chevy moved, they took off back into the trees and bushes. I then headed down the road toward a picnic aera where they might cross the road. On the way, Angela said she had enough and didn't want to be around the bigfoot anymore. I turned around, ended up taking a wrong turn finding, and myself driving cross country through the cabins and the resort. I was turned around so badly I didn't know where I was.  Angela spotted the cabin where we stayed the first night. I then began to drive out to the highway to leave because Angela didn't want to return until daylight. Just before I got to the highway, I remembered my friends at the cabin and the fact that they had their newborn baby with them.  Angela agreed we couldn't leave them there, so we returned.  Wes said that as we were driving off, something ran across the road behind us on two legs. Angela and I decided to leave the Chevy parked halfway blocking the road and go inside the cabin.  After we got inside, I asked Wes if he'd seen what we saw, because I still could not take in the fact that this really happened. Wes told me he definitely saw what he belives to be a bigfoot. he explained that he became silient because of the two smaller ones at the back of his mom's truck. After twenty minutes had gone by, I needed a smoke real bad and Wes' mom wanted something to drink. Both were in my rig.  Wes was the first to step out side. On the way back to the cabin,  we heard a bunch of comotion down toward the lake, like something running through bushes, snapping and breaking limbs. We ran to the front door of the cabin. Just as we started up the steps, I fell onto the porch, scaring Wes to death. Once inside, we talked and tried to rationalize everything that had happened. Things were quiet outside from then on, other than the fact that a raccoon thumped on our door, which startled us.  What was strange was that the raccoon seem to want to come into the cabin.  The raccoon did not touch any of the food outside the cabin.",
  "classification": "Class A",
  "county": "Jefferson",
  "state": "Oregon",
  "latitude": 44.42565,
  "longitude": -121.726,
  "location": "-121.726,44.42565",
  "location_details": "Suttle Lake Resort (east end of Suttle Lake) off the Santiam Highway (Hwy 22) east fo the Santiam Pass,  cabin # 6",
  "temperature_high": 56.91,
  "temperature_mid": 45.765,
  "temperature_low": 34.62,
  "dew_point": 36.08,
  "humidity": 0.71,
  "cloud_cover": 0.38,
  "moon_phase": 0.61,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.04,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 2,
  "visibility": 8.59,
  "wind_bearing": 242,
  "wind_speed": 0.44
}