{
  "id": "6804",
  "title": "Two ourtdoorsmen chased by a large bear like biped recount 25+ years of strange occurrences.",
  "date": "1986-06-01",
  "timestamp": 517968000,
  "observed": "My friend and I have been camping, hunting and fishing a part of Butler County that would be the last place I ever thought I would be so afraid that I would wet myself. From about 1985 to 2003 he and I have went to these woods to camp and fish the creek that runs to the river. One calm night we were camping about four miles from the nearest dirt road. We had a small fire and our tents were already up and we were talking about fishing and catching the big one when we heard a sound that neither he or I could explain. Both of us thought wolf or something? We stayed by the fire and talked some more about fishing then we got a strong odor of something like dead flesh or something like that. We then got up and took the light and started looking for the source of the smell and sound we heard. As we got closer to the middle of the forest my friend said listen....we could hear something moving towards us. We started running and could hear that it was getting closer to us. We made it to a clearing where we could see the moon and the sky very well so we could catch our breath. Then, there it was, \"a bear\" I said!! I raised my shot gun and fired it in the air but it didn't stop coming towards us (it was on two legs the whole time). We ran in the creek and out of the woods until we reached a store and called my wife to come get us. We told her what happened but she laughed at us. She later asked us if it could have been Bigfoot. We both said no back then but as time has gone by we have found small trees broken off above 10 feet and footprints that only it could make so we thought we should make this report. On August 22, 2003, my friend and I were fishing at the river and we heard the same sound we have heard for the last 25 years. We think there is a Bigfoot that lives somewhere in the woods or passes through regularly where we camp, fish, and hunt. Everyone who lives in this small city by these woods can tell you we believe this to be true.",
  "classification": "Class A",
  "county": "Butler",
  "state": "Ohio",
  "latitude": 39.49695,
  "longitude": -84.45905,
  "location": "-84.45905,39.49695",
  "location_details": "From I-75 take State Route 73 west into Trenton. Once you get in town look for the Skate Way Roller Rink then make a right follow it till you have to turn right or left then make a right. Follow it till it dead ends. There will be the woods and creek in front of you. there is 96.6 acres of woods there with about another 100 to the left and about 105 up on the hill.",
  "temperature_high": 84.36,
  "temperature_mid": 69.405,
  "temperature_low": 54.45,
  "dew_point": 63.95,
  "humidity": 0.7,
  "cloud_cover": 0.34,
  "moon_phase": 0.82,
  "precip_intensity": 0.0006,
  "precip_probability": 0.48,
  "precip_type": "rain",
  "pressure": 1009.55,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 8,
  "visibility": 6,
  "wind_bearing": 249,
  "wind_speed": 7.25
}