{
  "id": "45818",
  "title": "",
  "date": "",
  "observed": "Father:  I was driving to go fishing with my son, at a local fishing spot. The place is on the Cass county side of Lake Wright Patman. We were around a mile or so from the lake I would say. As I topped a hill and a slight bend I spotted a big black bear in the road. I stopped because bear in the area are rare. I had never seen one in the area but heard stories of them. I was excited because not only I was getting to see it but my son as well. Then very quickly the bear stood and turned toward us and to my shock it was not a bear at all. It was a huge thing not a bear. The thing was I would say between eight to ten feet tall, three and a half to four feet wide at the chest and shoulders. It had a large head with dark eyes either dark brown or black, a big flat nose and the face was a little lighter brown than the body. It was not black as I first thought but a dark brown almost black and its fur or hair was around four inches long. It looked like a guy who spends all his time in the gym. It had fists around the size of a canned ham, I say this because one hand was closed in to a fist and had something in it. I think it may have been male, because it had no breasts and might have had a bulge in the crotch area, but I wasn't focused on that. I am a religious man and have the light of God in my heart and Jesus is my lord. I immediately believed I was looking at a demon. I question that now, after talking to people who seem to know a lot about these things, and reading a lot over it since I saw it. Think me mad if you will but I slammed the vehicle in park, jumped out and started preaching gospel at the thing. I don't know if it is a demon for sure or not but either it is and the word of God hurt it or it just didn't know what to make of me, because it roared at me so loud and deep I could feel its vibration, like a teen's car radio. It threw what it had in its hand, it flew a few feet above us and a good long way back up the road, then it turned and ran with otherworldly speed. This all happened very fast, I could not say how fast but from the time I stopped till it was up and gone was not long at all. I stood there a moment longer thinking I just saw a demon. I got back in the vehicle to drive back and see what it threw at me. It was part of a cotton mouth with its head and who knows how much of it missing. I chunked it in the back and went home. During all of this my son had been screaming at me to get back in and let's go and he was freaked. He did not want me to stop when I turned around and was pushing me to go as fast as I could. I was not scared because a demon not dare confront a man of God. Yet now I'm not so sure that it was a demon. Son: I don't scare very easy and my dad seems to have no fear but spiders and he is a big guy and I am like him, big. He is around 300 and even though I'm only 14 I'm as tall as him and almost as heavy. He is a little fat but not too much. I'm all muscle and you can call us corn fed. My dads a hell of a fighter and I think me and dad together could take just about anything you can throw at us. But I wont lie, my dad would be disappointed in me if I did. I was scared as hell when we came up on bigfoot. He wants me to talk to someone because he is scared that I might be messed up for life lol. I was freaked and scared he was going to get his crazy butt killed and me too and i was screaming at him the whole time and then when we did go he stopped to get that stupid snake with it nearby and wouldn't even break the speed limit and that thing could have caught us at that speed and I just knew it would. But dad says there are demons and says that's why no one can kill one or find one and they don't leave bodies. I will never talk to anyone about this and am just doing this to make him happy. I don't even like doing this he stopped and started yelling at the bigfoot. It yelled back and took off thank god but I guess they must not be mean or it would have killed us. I know my dad can be very scary when he is mad and he was mad as hell when he got out preaching at the bigfoot. I am not crazy, my dad may be and now I think so even more than before. I don't know what it was, don't want to and pray I never see one again.",
  "classification": "Class A",
  "county": "Cass",
  "state": "Texas",
  "location_details": "I DO NOT want the exact location listed in the report because I believe it WOULD cause me problems I don't want or need nor does my son. Not only that I am unsure of these things and this is VERY IMPORTANT to me. It would cause me GREAT HARM! If a curious reader of your site went to the area looking for the thing and something happened to them because I told you about this and where it happened. Not only that but the area is a regularly used fishing, camping, picnic area and boat ramp and it would break my heart if people stayed away from it because of me. I also did not include the date because people knew we where going out there and if they put two and two together we would be revealed. Date and road number will be available on request from you professionals ONLY.",
  "summary": ""
}