{
  "reportId": "7236",
  "title": "Pre-teens encounter 2 ape like creatures while exploring the woods",
  "date": "1980-07-05",
  "timestamp": 331603200,
  "observed": "I was 12 years old and my father was stationed at Ft. Polk, Louisiana. We were living in a town called Leesville just outside of the military base.  Two friends of mine and I decided one day to explore the woods off of a highway known as Texas Highway.  I remember we were deep in the woods and we came up on a stream, quite large, about eight feet in width. From the side of which we approached the stream we were about five feet above the water and as we approached the stream the three of us immediately spotted two Creatures on the other side of the stream in a crouching posture position drinking water from the stream.  We froze in amazement of what we were looking at, and at the same time the three of us were trembling with fear knowing we were so deep in the woods and quite lost.  We were looking at two Human/Ape like figures whom were completely covered with darkish brown gray hair but the face appeared to be of lighter tone skin. From the head down the two creatures had long hair past their shoulders,with alot of long grayish hair tones, the rest of the body was short hair. They were starring at us and we were starring at them..One was of adult and we could tell it was female and the other was childlike and was of male gender in appearance. They appeared to be just as frightened as we were and after about 30 seconds of this encounter the adult creature turned to the childlike creature and made a motion with it's hand and they turned around from the stream and started running through the woods. There was never a sound made from either one that we could hear. Needless to say when they took off running we did the same in the opposite direction and didn't stop until we were out of the woods. At that time we never spoke about the incident to an adult because we were not supposed to be off on our own exploring in the woods.",
  "classification": "Class A",
  "county": "Vernon Parish",
  "state": "Louisiana",
  "latitude": 31.14195,
  "longitude": -93.2952,
  "location": "-93.2952,31.14195",
  "location_details": "The location of the woods off the Texas Highway is directly behind the Fair Grounds in Leesville. About a 45 minute walk into the woods.",
  "temperature_high": 94.7,
  "temperature_mid": 85.855,
  "temperature_low": 77.01,
  "dew_point": 73.01,
  "humidity": 0.68,
  "cloud_cover": 0.18,
  "moon_phase": 0.76,
  "precip_intensity": 0.0001,
  "precip_probability": 0.25,
  "precip_type": "rain",
  "pressure": 1017.63,
  "summary": "Humid throughout the day and partly cloudy until evening.",
  "uv_index": 10,
  "visibility": 8.04,
  "wind_bearing": 178,
  "wind_speed": 3.36
}