{
  "reportId": "35984",
  "title": "",
  "date": "",
  "observed": "While working in the crawl space under a house, I noticed movement outside 2-3 times. The last time I observed the back part of a foot, including an ankle and the lower half of a calf. It was black or very dark brown.  It was full daylight outside, perhaps 2 PM. The distance was about 30 feet. It was moving out of my view with no sound at all.  It was definitly human(oid) and not a dog, cow, or whatever, and maybe 8 feet tall, maybe more. There is a 'stick structure' near the house, hidden from direct view in the woods.  On many occasions, 8-10 times, both day and night, I have heard a barking or 'yip' sound, similar to a dog, from the site of the stick structure. I believe the stick structure to be a nest of sorts and the home location of some woodland creature. Guess who? 2-3 times I have heard 'tree knocking' sounds.  Once, I heard two knocks about 30 seconds and some distance apart approaching the nest area.  This thing is fast, about the pace of a man jogging.  On several occasions I have observed unusual behavior of other wildlife. Hearing an owl at night hooting from near the nest area-no big deal.  Hearing an owl in full daylight at 4-6PM making a fuss, not hooting, from a very different location-unusual? Once, 2 small deer were foraging very near the house in full view 30 feet away near dusk. There was noise nearby of something heavy moving about behind them and hidden from my view.  I have heard this same heavy movement, near the owl hooting location, about six or 8 times, day and night. Unusual? Would a large primate herd deer the way we herd sheep? Riding a minibike back from the neighbor's house at noontime, 1 huge and 2 large deer, 3 total, who flushed well in front of me, in full view, but not away from me.  Perhaps they were more concerned with what was behind them than the guy on a minibike.  Unusual? 4 to 6 times I have heard neighbor dogs go OFF a few minutes after I have been outside smoking. While walking to the neighbor's house a normally very calm and friendly dog alerted very aggressively to me walking up.  Not the same response I get as approaching on a minibike at all.  Unusual? One night at midnight I was awakened to the sound of a commotion outside the house. The sound was similar to a 3 or 4-way catfight with the 'yip' sound going all at once.  Similar to a catfight, but NOT a catfight.  When I went to a window to investigate, the noise stopped suddenly when I came into view.  The distance was 30 feet, the window was open, and I could have heard a beanbag drop from the location of the sound yet heard nothing more-no scurry of little feet, nothing. The next morning there was very little wind and a smell similar to a skunk wafting about. Unlike a skunk, not quite the edge to it, and the smell went away within an hour.",
  "classification": "Class B",
  "county": "Kingman",
  "state": "Kansas",
  "location_details": "Please do not post for public view.",
  "summary": ""
}