{
  "reportId": "4959",
  "title": "Nightime sighting at a Lake Milton marina",
  "date": "1972-08-01",
  "timestamp": 81475200,
  "observed": "Lake Milton, Ohio: Summer 1972 About the time my siblings and I were entering that turbulent period known as our \"teens\", my family had the great good fortune of having moved into a house flanked on either side by a pair of brothers-in-law who proved not only to be good friends with one another, but very best of neighbors to our family as well. These two men, Mr. J. and Mr. R., had married a pair of sisters decades before and, having seen their own children off to raise families of their own, took a genuine interest in my family and we children in particular. At a time when myself and my siblings were finding it increasingly difficult to redefine our relationships with the adults who were our parents, Mr. J. and Mr. R. taught us that it was possible to be good friends with an adult. They provided a certain balance and perspective during a period when tensions within our family were almost excruciating and we found it hard to talk with our parents, proved by their behavior that we children were worthwhile people in our own rights, took a sincere interest in who we were and who we were becoming, and exemplified the true meaning of being neighbors and part of a larger community. These two men displayed a sincere interest in our various interests, in our developing values and judgments, and they shared their own with us; treating us with a respect that we had not yet earned, and giving us the opportunity to develop a respect for them (and by derivation, our parents), as well.They were, in short, a God-send to our family and their value to us, as people, cannot be overstated. One of the ways that Mr. R. shared his interest, was by involving us in boating. Mr. R. was a carpenter by trade and one of his most prized possessions was an absolutely beautiful, '50's vintage, wooden boat. During the winter, Mr. R. would have his \"Anderson\" up on blocks in his garage and there he would perform loving maintenance to the machine; replacing any pieces of her hull which might have been damaged by the previous summer's boating, fixing any loosened hardware, tuning up the boat's engine and varnishing her hull. Unlike some adults, who don't want 'some kid' to so much as touch one of their expensive toys, Mr. R. would allow us to participate in his repairs and refinishing; teaching us the skills required to work with wood, hand tools, and varnish. Even more important than providing a concrete display of the trust that he placed in us, he fostered in us a respect for other people and their property that was regrettably lacking in the majority of our peers. In addition, he rewarded our assistance by taking us 'out on the lake' with him, giving us the opportunity to learn to water ski and teaching us the importance (and the  joys) of responsible boating. In the process, he taught us to rely on one another's judgment, since one cannot pilot a boat and watch a skier at the same time, and once he had managed to teach us to handle the boat safely, he allowed us to exercise our judgment by commanding the boat while he was skiing. In all respects, it was a wonderful arrangement. Myself and my siblings learned a great deal about ourselves and others, the rewards of work carefully and skillfully done, and the thrill of water sports and of piloting a well-maintained machine. For his part, Mr. R. found a great deal more opportunity to do what he loved and an eager group of youngsters who would accompany him whenever he wanted to head for the lake. From May to October, Mr. R. kept his boat docked at a small marina on Lake Milton, about a mile south of the dam and two miles east of the small town of Diamond, Ohio in Mahoning County. The marina was located on the western shore of the lake in an area surrounded by dense woodland punctuated by small farms and was accessed by a two-lane, tar and asphalt, road that followed the western shoreline. Once inside the marina, a gravel driveway allowed access to a number of permanent docks along the shoreline; doubling back past the parking lot of the bait shop at the south end of the marina and running north for a hundred yards or so along the western shore of the lake. This driveway was separated from the paved roadway by an embankment that rose from mere inches at the southern end of the marina to about ten feet in height near the northern end where Mr. R. moored his boat.The marina was set in a very sparsely populated area (in what we considered \"the country\"), at least twenty miles from any of the larger population centers, and was normally thought to be perfectly secure; despite the fact that the marina was completely unattended after sunset when the owner of the bait shop would lock up and go home. So, it came as a bit of a surprise when, one evening in late July, Mr. R. came to see my parents about borrowing their eldest son in order to catch whoever had taken to vandalizing the property. According to Mr. R., somebody, \"probably local kids\", had found themselves faced with summer boredom and had taken it into their heads to terrorize the marina; overturning trashcans and strewing garbage about, punching holes in the covers on a number of boats, tearing outboard engines off the transoms of others and throwing them in the lake. Mr. R. had, just that winter, had a new cover made for his boat and was not about to sit back and have someone ruin it for him. Instead, he was of a mind to sleep on his boat and to catch 'those vandals' in the act; teaching them better manners by calling the police or taking an axe handle to them, if he had to. To his way of thinking at least, the presence of a \"big, strapping, fourteen-year-old\" would provide him with all the additional protection he would need and much to my surprise, (my mother, in particular, taking a dim view of physical violence), my parents agreed. Since the seats on his boat folded down into couches, it took only a couple of minutes for Mr. R. and myself to toss a couple of sleeping bags into the back of his car and (to the protests of my younger brothers) head for the lake. We arrived just before sunset, explained to the owner of the bait shop what we intended to do, and, before full dark set in, made a quick tour of the marina; noticing the damage done to a number of the boats docked there. There were two areas of the marina where boats could be tied up; to permanent docks along the western shore and to a pair of floating docks which were set out in Spring and taken up during late Autumn. Mr. R.'s boat was among those situated along the shore and I noticed that these were the only boats which had been damaged. In some places, a windshield had been smashed or a handrail torn loose, while in others, a triangular hole had been poked through the boat cover or an engine had been ripped from the transom. Assuming the role of detective, something I knew almost nothing about, I examined  the damaged areas closely, trying to ascertain exactly how the damage had been done. Every tear in the boat covers had markedly frayed edges, implying that the holes had been created by pushing a blunt object through the heavy canvas rather than using a knife or other sharp object to slash them and all the smashed windshields displayed broad, circular areas of impact; as if someone had hit them with their fist, rather than with a hammer or some other tool. Nor could I detect the use of tools of any kind in tearing loose the handrails and cleats. There were no scratch marks to indicate that someone had pried these fittings loose or 'worked' the  fittings back and forth until they broke. In the case of the wooden boats, the screws anchoring the fittings had simply been ripped from the surrounding material and on the fiberglass boats, the fiberglass itself had been torn out, leaving the bolts and anchor plates attached to the rails. Obviously, whoever had been tearing up those boats possessed fearsome strength and I, at least, was becoming less and less confident in Mr. R.'s and my own ability to handle them with only a \"strapping fourteen-year-old\" and an axe handle! Even more disconcertingly, the engines, some of which had to weigh two hundred pounds, had, judging from the scoring of the wood or fiberglass, been yanked from their attachments without first loosening the clamps or undoing the safety chain. One engine, ripped from a fiberglass boat which had since sunk, could be dimly seen through the shallow water into which it had been dropped with a section of the boat's transom, safety chain, and fuel line still attached! As we continued our inspection, I became more and more alarmed and I commented on my observations. Most notably, I wondered why the boats along the shore were the only ones that had been targeted for destruction, while the others had been left completely alone. For some reason, the vandals had apparently ignored the boats tied to the floating docks, none of which were damaged, while at least half of the boats along the shoreline showed vandalism of one sort or another. Mr. R. (who was, frankly, a bit disgusted with my lack of courage in the face of \"a couple of cowardly teenagers\") dismissed my fears and surmised that the vandals, possibly drunk or stoned on drugs, had avoided venturing onto the relatively unstable floating docks; perhaps fearing to fall into the deeper water in which those docks stood. Vandals, he explained, were cowards by nature; too timid to show their faces when anyone might be around to see them. The kind of people who would break windows at a deserted marina in the middle of the night or ruin somebody else's property, but who were too frightened of authority to break into the bait shop or stare down two men. Needless to say, as a fourteen-year-old, I was flattered by being referred to as a man by someone that I deeply respected and, silently, I resolved not to disappoint him. During the previous winter, I had grown to over six feet in height, my weight had increased to almost 190 pounds and, even if I was still learning how to keep all of that mass under control, I realized for the first time that I was some inches taller and very nearly as strong as Mr. R, himself. Relying on his assessment of the situation, I made a good showing of putting my fears aside and by the time full night had settled on the lake, I have to admit that I was feeling a little bit cocky and actually looking  forward to the possibility of confronting the jerks who would threaten Mr. R.'s beloved boat. Finding Mr. R.'s Anderson, as yet, untouched, we stowed our sleeping bags onboard and he surprised me by suggesting that we take her out on the lake. At that point, I had never been boating at night, but the weather was beautiful, calm and warm, and the clear, moonless sky promised an abundance of stars which I could never have seen from within even our small city. The lake was hardly a disappointment: the water was as smooth as glass, completely undisturbed by any boat besides our own, and the night sky was unbelievable.Tooling along almost at an idle, so that we could enjoy the sights and stillness of  the lake, I pointed out stars and constellations that I could name from books, but had never actually seen before, and Mr. R. reminisced about the skies of his boyhood in (very) rural West Virginia where he had camped, hunted, and fished his summers away. To hear him tell of it, from June to September, the only time he saw the inside of a house was when he had to bathe before going to church on Sunday and to his way of thinking (at least during the summer) the night sky was all the shelter that any man could ever really need. Listening to him, I learned of a whole new dimension of the man, one that I had never before suspected, and felt a deep appreciation and friendship for a boy who had disappeared into adulthood long before I was born. A little before midnight, Mr. R. reminded me that we were supposed to be lying in wait for vandals, and we returned to the marina; turning off the position lights and shutting off the engine while still outside of the inlet in which it was located, so that we would not alert anyone who might be there. Drifting silently, straining eyes and ears for any sign of intruders, we quietly paddled into the marina and made our way past the floating docks to Mr. R.'s slip without seeing or hearing anything. As near as we could tell from the silence and by the light of the mercury-vapor lamp mounted on a pole near the bait shop, the marina was deserted except for the crickets, the mosquitoes, and ourselves. While I tied up the boat, Mr. R. went to his car to fetch a powerful flashlight that he had forgotten to stow earlier and a can of insect fogger (area repellant). We pulled the boat cover in place, fastening all but about the three feet at the stern that we would use to get back into the boat, and Mr. R. sprayed  the area around the dock and the cover in order to keep the mosquitoes at bay. Folding down the seats and spreading out our sleeping bags, we made ourselves comfortable (with the axe handle and the flashlight on the deck between us) and settled in to go to sleep. Mr. R. drifted off almost at once, while I had a bit more difficulty. The light coming in through the plastic \"window\" in the cover bothered me, as did a 'bedroom' that rolled slowly and rubbed quietly up against the plastic fenders that protected the hull from the wooden dock. It seemed like I was awake for at least an hour, but Mr. R.'s dock was at least a hundred yards from the one lamp that lit the area and the hands of my watch didn't contrast against its face well enough for me to read it. Eventually, I fell asleep, but it seemed like I was awakened an instant later by some sharp noise. Typical of sounds that awaken you from sleep, I had no idea what I had heard, but was left with only an impression of a noise. Lying quietly and listening carefully, I realized that the sound, whatever it had been, had not awakened Mr. R. and for what felt like a minute or so (but which could have been no more than seconds) I remained perfectly still. Then, I heard the sound of a trashcan rolling back and forth on the ground and the faint rustling of paper being disturbed. Sitting up slowly and craning my neck to see out the window without rising, I just managed to see past the edge of the canvas and to make out the image of a shadowy figure about 50 yards away. The figure, which was no more than a silhouette, was crouched at the opening of an overturned trashcan, about midway between ourselves and the bait shop, and was reaching into the can to scoop out the garbage within. I strained to see if the figure was alone or if there were others about, but although the scene was strongly backlit by the bright lamp, the blurring caused by the plastic prevented me from making out any real details and the view through the window was too narrow for me to see much of the surrounding area. It was pretty frustrating, not being able to see any better, and I was about to wake up Mr. R., when I noticed something very peculiar about our supposed vandal and paused for a second look. Despite the light falling on the figure's back, I couldn't see any of the  highlights which one would normally expect to see on either cloth or leather; nor could I see any of the variations in color, texture, and outline that one expects from clothing. The figure was a flat, uniform, black, like a shadow, and the bow of its back was unbroken, by either the bulge of a shirt or the tuck of a belt, all the way from the back of its head to the curve of its buttocks! I wondered, for a moment, how this could be. Even allowing for the plastic I was looking through, I knew that I ought to be able to see the outline of the intruder's clothing, but then, the figure did something even more astonishing and I forgot all about appearances. Earlier in the evening, I had walked past that garbage can, shying away from the awful smell and the swarm of flies surrounding it, but as I watched, the figure reached in, pulled out what was obviously a used paper plate, and began to lick it off. Just about gagging at the thought of the condition of whatever might be stuck to that plate, I kept one eye on the figure while reaching out to give Mr. R. a shake. He jumped a bit when I shook him, but came awake without making a sound and in a whisper, I gave him a very brief description of what I was seeing. Mr. R. slid his legs out of his sleeping bag and turned to sit up without making any more noise than my whisper, but even then, I saw the figure give a little start and begin to turn its head from side to side as if searching for the source of the sounds that I could barely hear. \"I think he heard us!\" I whispered, even more softly than before. \"Don't worry about that.\" Mr. R. breathed just as softly, picking up the axe handle and being careful not to let it scrape on the wooden deck. Lifting the flashlight in his other hand, he instructed, \"Ease back the boat cover and we'll still give him the scare of his life!\" Slipping out of my sleeping bag and silently slipping back to the stern of the boat, I eased the end of the cover back with little more than a rustle of the canvas and saw the figure clearly for the first time. At the sound of my movement, the figure swung its head around to look directly at me and leapt to its feet, coming up out its crouch and turning to face us in a single, smooth movement. It rose to stand on two feet and just seemed to keep going up and up, unfolding from its hunched-over position at the open of the can to stand taller than anyone I've ever seen - and I have a friend who's six foot-nine! Frozen on one knee at the stern of the boat, I just stared at the figure with my eyes getting wider and wider and a sick feeling forming in the pit of my stomach. The figure before me didn't exactly pose while I took a picture, but for about half a second we just stared at one another and took each other's measure. Whatever that critter was, he was not human and I'm not even certain that he was a he! The trashcan, a recycled 55 gallon drum lying on its side near his feet, must have been the best part of three feet in diameter, but it didn't come up even as high as his knee and my best guess is that he stood at least eight feet tall! The light of the mercury lamp behind him made a kind of halo around him and I could see that he was covered all over in two-to-three inch hair with the longer hair of his head hanging down past his shoulders so that it shadowed his face and hid the contours of his neck. His shoulders seemed to be twice the width of a normal man's, with a chest to match, making his thick waist seem slender by comparison but, silhouetted against the light, it was hard to tell much more than that he was HUGE! About that time, Mr. R. started to push past me, so that he could get out from under the boat cover, and the figure sprang into motion. Taking one step OVER the trashcan, it took a second stride to reach the embankment that flanked the western side of  the marina. Never breaking stride and not appearing to make any special effort, it sprang off that second step to the top of the embankment and disappeared into the thick brush that lined the roadway. There was a sort of 'crack and rustle' sound as the creature ploughed through the brush, but the sound ended as the creature reached the paved road itself and I heard nothing further. Mr. R. got clear of the boat cover and straightened up to shine his flashlight on the scene about the time that the figure leapt into the tall brush. He held the light on the top of the embankment, playing it back and forth a bit, but there was nothing left to see. \"Did you see it?\" I whispered, too frightened to raise my voice. \"I saw something!\" he declared irritably, apparently angry at my hesitation or the escape of our \"vandal\". \"I only caught a glimpse of him as he disappeared! Wha' did he look like?\" I did my best to describe what I had seen, but I'm afraid that my response wasn't too coherent. Mr. R. listened without comment, seeming to become less irritated with me as he did, then, left the boat to examine the area around the trashcan. I had no urge to get any closer to the place where that thing had been, but was too frightened to stay by myself and so, I followed him. He played the light around on the ground as though searching for something, but the ground was hard clay and didn't show any footprints; although the heavy dew on the sparse grass between the can and the embankment had been disturbed. There was garbage all over and the place reeked, but I would be hard pressed to say that there was no other smell, besides. Shining the light on the top of the embankment, we could see where the brush had been disturbed. A few broken twigs and torn leaves marked the spot where the figure had vanished, but it was hard to believe that anything so large could have barreled through that tangle of limbs and stems with so little trace. Grunting non-committally, Mr. R. gave up on his efforts to locate the creature and, standing up the  trashcan, began to clean up the mess it had left behind. I stooped to help, keeping one eye on the brush from which I half-expected the creature to emerge at any moment, but the only sound we heard was the chirping of crickets and nothing more threatening presented itself. In the process of returning the can to its proper position, I noticed a thick, two foot tall, steel post that had been driven into the ground next to the circle of bare earth where the can normally stood there were a couple of quarter-inch thick steel links welded to the post and two rusty pieces of metal welded to the last links in the chain. Turning the can, I could see where those pieces of metal had been torn from its sides when it had been overturned. \"Did you see these?\" I asked quietly, pointing out the holes left in the metal of the 55 gallon drum. \"Uh-huh.\" Mr. R. replied tersely, picking up the flashlight and heading for the boat. \"Do you think it will come back?\" I asked, eyeing another trashcan which stood just at the end of his dock. \"It's gone now.\" was all the reply that I could get out of him. Reaching the boat, he began to roll up his sleeping bag without saying another word. Following his example, I rolled up my own and pausing only long enough to secure the cover on the boat, I gratefully got in the car behind him. \"We're not gonna catch those vandals tonight.\" he commented, as he put the car in gear and turned to leave the marina, as if he thought I would give him any argument or felt that his decision to leave required any further sort of justification. \"I 'spect a city-boy like you will sleep better at home, anyhow.\" During the ride home, it was pretty obvious that Mr. R. didn't want to talk about what had happened, but considering everything that he had told me about camping and hunting in West Virginia, I figured that he had to know more than he was saying. I hesitated to press him on the subject, but about the time that we were turning into his driveway, I worked up my courage and had to ask \"Mr. R., did we just see a sasquatch?\" Mr. R. didn't answer at first, staring straight ahead as if he had not heard me until he had parked the car, taken it out of gear and shut off the engine. Only then, did he turn to look me straight in the eye. He spoke in a matter-of-fact voice that seemed loud in the silence left by the still engine. His tone wasn't unkind, but it made it clear that he would tolerate no arguments from me. \"Back home,\" he said, \"some folk used to talk about seeing 'giants' in the back- woods and 'wildmen' by the woodpile - and other folk used to call them drunks and fools.\" \"Now, I don't drink anymore and I don't think that you're a fool.\" he continued, \"I don't know what you think you saw, but I didn't see nothin' 't all; just a shadduh duckin' into the bushes - and I ain't about t' go spreadin' some wild tale on account of it!\" Despite the tone of his voice, I couldn't help but ask about the matter of the overturned trashcan. \"Coons'll tear up a trashcan worse'n you'd believe.\" He  replied, getting out of the car and signalling the end of our conversation by leaving me alone in the dark as he headed for his back door. I let myself into my own house and went to bed without waking anyone; grateful for the comforting familiarity of my own room. I slept late, getting up well after my parents had gone to work and I doubt that either they or my siblings even noticed that I'd come home in the middle of the night. I can't say if the \"vandalism\" continued after our aborted over-night stay, but the next day, Mr. R. enlisted the aid of his brother-in-law to bring his boat home from the lake, even though I was working in the yard when he crossed it and he could see that I was available to help. The boat stayed on the trailer in my neighbor's garage for the rest of  the summer; even though Mr. R. was forced to use a garden hose to flood the hull periodically to keep the wood from shrinking and every trip to the lake meant the bother of hauling the boat back and forth. I respected Mr. R.'s decision to keep quiet about our adventure and, although we still talked and still went boating, neither of us ever so much as mentioned our having camped on his boat. Since that time, I regret to say, my good friend has died, but I can't shake the feeling that he saw a good bit more than he was willing to admit - and a whole lot more than he was willing to say.",
  "classification": "Class A",
  "county": "Mahoning",
  "state": "Ohio",
  "latitude": 41.1174,
  "longitude": -80.9835,
  "location": "-80.9835,41.1174",
  "location_details": "Mahoning County, Lake Milton reservoir",
  "temperature": {
    "high": 80.14,
    "mid": 73.37,
    "low": 66.6
  },
  "dew_point": 62.91,
  "humidity": 0.77,
  "cloud_cover": 0.7,
  "moon_phase": 0.72,
  "precip_intensity": 0.0001,
  "precip_probability": 0.12,
  "precip_type": "rain",
  "pressure": 1019.9,
  "summary": "Foggy in the morning.",
  "uv_index": 6,
  "visibility": 4.51,
  "wind_bearing": 224,
  "wind_speed": 5.9
}