{
  "reportId": "20420",
  "title": "Possible nightime encounter near Lake Trafford",
  "date": "1987-06-01",
  "timestamp": 549504000,
  "observed": "Immokalee,Florida 1987 - My family and I were in having an evening of fun when we heard a horrible noise coming from the direction of where our dog was outside. My husband went out to investigate because our dog sounded as if were scarred or being hurt. When my husband got to our shed he saw a large shadow up against the siding and it sounded as if our dog were being muffled. He ran back into our home thinking it was a bear or something to the effect and grabbed his gun. He then went back outside ( us trailing close behind him) and it appeared to him as if something were running down our driveway - in the meantime our dog was hidding underneath our home. My husband fired a couple of shots towards the area he thought this creature or animal was and we heard a very loud growl howl type noise, after that it got deathly quiet. I will never forget the chills that ran up me when I heard theses sounds.The next morning we did check the area and we did find weird type footprints that looked not like human nor were they a bear or any other type of animal that I am familar with. Whatever it was it was able to make a leap from the street and across a canal and land on it's feet. The only thing that we can figure is that during the day we had taken our family fishing in the grove and we were followed back by what I honestly believe to be a bigfoot. Our home sat on a hill that when our porch light is on it can be seen from within the surrounding woods - we checked this - I believe it followed the lighting as it knew there was something there. We later found out that the people who occupied our home before us had an encounter with the backdoor being ripped off it's hinges. They assumed it was a burglary while away. We now suspect not. We were told also through my husbands supervisor that several sightings had occured not only in the area but at Lake trafford as well. Lake Trafford was less than 5 miles from where we were living at the time. I will never forget my experience with this night. I thank God my chldren were sleeping but unfortunately my younger brother was not - he was 10 at the time and I remember him being so very frightened and crying. He still remembers that night. Every since I have wanted to find proof of what we heard and to prove to myself that it was real. I am a believer!",
  "classification": "Class B",
  "county": "Collier",
  "state": "Florida",
  "latitude": 26.283,
  "longitude": -81.2521,
  "location": "-81.2521,26.283",
  "location_details": "about 5 miles from Lake Trafford in Immokalee,Florida",
  "temperature_high": 88.25,
  "temperature_mid": 82.31,
  "temperature_low": 76.37,
  "dew_point": 73.19,
  "humidity": 0.79,
  "cloud_cover": 0.52,
  "moon_phase": 0.16,
  "precip_intensity": 0.0038,
  "precip_probability": 0.45,
  "precip_type": "rain",
  "pressure": 1017.02,
  "summary": "Humid and mostly cloudy throughout the day.",
  "uv_index": 9,
  "visibility": 8.8,
  "wind_bearing": 100,
  "wind_speed": 8.01
}