{
  "reportId": "232",
  "title": "",
  "date": "",
  "observed": "In the Summer of 1970, I was taking my pony and dog for a walk in the thickly wooded area where my parents had just built a new house. It was at that time a very isolated area.  We had apparently disturbed the wildlife in the area as we were always seeing very large black snakes and other wildlife near the house.  I was not prepared, however, for the creature I encountered in the woods behind our home.  I looked up on the thickly wooded hill and saw a huge creature that resembled a gorilla or a bear.  It was dark in color and appeared to be hairy.  It was on the other side of an old fence from me.  I was very frightened. I fled the area immediately.  I wish I could describe this creature better.  I really don't think it was a bear.  Bears are not usually sighted in our area and this creature was really big and it startled me because of it's size.  I don't frighten easily and was accustomed to living in the country with wild animals.  The one thing that does amaze m e when I look back on this incident is that my dog and  pony had no reaction to this creature.  It makes me wonder if they had become accustomed to it coming around when we weren't outside.  I never saw it again but a couple of years later my mother saw something from her kitchen window that looked to her somewhat like a bear but she wasn't sure as she was not close enough to it to see features.  It was on all fours and it got into the nearby stream and walked around the bend and out of sight.  The area where we had these sightings was in Washington Co. MD.  We live near a stream and a thickly wooded area.  The stream feeds into the Conococheague Creek which then feeds into the Potomac River a few miles from our home.  My parents have lived there for 30 years now and there have been no sightings of any creatures such as the ones we observed in the early 1970's.  However, we were the first to really disturb that woods and the area is now much more developed.",
  "classification": "Class A",
  "county": "Washington",
  "state": "Maryland",
  "location_details": "The area is about six miles west of Hagerstown, MD in Washington Co. MD.  If you take I-70 west from Hagerstown, MD and get off at the Route 63 exit, you then travel north on Route 63 to US Route 40 and travel west until you get to Cedar Ridge Road which will be on your left.  You take Cedar Ridge Road and about a mile back you take a left onto Kemps Mill Road.  The woods is on your right.",
  "summary": ""
}