{
  "reportId": "25301",
  "title": "Hunter has close sighting of a primate-like creature in the Canaan Valley National Wildlife Refuge",
  "date": "2008-12-28",
  "timestamp": 1230422400,
  "observed": "I was hunting West Virginia's late antler-less deer season in the Canaan Valley National Wildlife Refuge when the sighting occurred. I had gotten to the area shortly after 3:00pm that evening, and after parking my vehicle in the \"Camp 70\" parking area I hiked up what appeared to be an old logging trail directly behind the parking area. I had already gotten a late start and wanted to get afield as quickly as possible, so I decided to stalk along the logging trail until I got further into the river bottom. After hunting the trail for roughly 30 minutes I was able to see a long distance in the river bottom to my right, so I decided to move into the bottom in hopes a deer would emerge from the thick along the river at dusk. I came across another \"road\" after leaving the logging trail, so I started walking further into the valley on it. The road was frozen and crusted over due to the cold temperatures, which made traveling quietly impossible, so after a short distance I found a small group of trees a few yards from the trail and set up in them. Shortly after arriving I heard what sounded like brush breaking 150 - 200 yards below me, towards the river. I readied myself in hopes it was a group of deer moving into the flats to feed, but nothing appeared. A few minutes passed by and I heard the sound again, and again, nothing materialized. I decided to move closer, and positioned myself in another group of small trees 100 yards or so below my first site. I had been in this grove of saplings for 5 - 10 minutes when I caught movement in a cluster of trees that was about 80 - 90 yards below me and to the left. I could see the movement with my naked eye, and immediately upon seeing it I scoped the group of trees and to my surprise saw nothing. A few minutes went by and I caught the movement again, I quickly scoped the trees, and this time I was shocked by what I saw. At first I thought it was a large man, as the first thing I saw through my scope was a vague silhouette, but when my eyes focused I could see what appeared to be a primate-like creature standing upright and staring directly at me. It only broke it's stillness to slightly move the upper portion of it's body in an up and down motion. It would bend it's knees as if it was going to sit down, then immediately straighten back up. This went on for what seemed to have been over a minute, then the creature exited the group of tree's and moved to my left (the creature's right), towards the mountain behind me. It walked across an expanse of river basin that I would guess to be 70 - 80 yards long before entering the timber and exiting my field of view. It kept watching me the whole time it was walking, only breaking it's stare on me a few times to look directly ahead of it. I initially thought of attempting to locate it's track's, but my nerves got the best of me and I started moving towards the parking lot as quickly as I could. Though the creature never actually made any threatening movements, I didn't feel safe enough to continue hunting and remain in the valley any longer after the sun went down than I had to. I immediately left the area and had no further incidents on the way to my vehicle.",
  "classification": "Class A",
  "county": "Tucker",
  "state": "West Virginia",
  "latitude": 39.10023,
  "longitude": -79.4593,
  "location": "-79.4593,39.10023",
  "location_details": "I do not know the name of the road that leads to this area of the refuge, though it is easy to find. Simply turn left off of US Route 32 in front of the small shopping center clearly visible as you start to exit Davis, upon turning left continue on a straight path until you cross a small wooden bridge. After crossing the bridge stay on this road and it will lead directly to the Camp 70 parking area.",
  "temperature_high": 58.46,
  "temperature_mid": 44.145,
  "temperature_low": 29.83,
  "dew_point": 35.53,
  "humidity": 0.59,
  "cloud_cover": 0.23,
  "moon_phase": 0.04,
  "precip_intensity": 0.0023,
  "precip_probability": 0.76,
  "precip_type": "rain",
  "pressure": 1016.51,
  "summary": "Breezy and partly cloudy until afternoon.",
  "uv_index": 2,
  "visibility": 9.45,
  "wind_bearing": 231,
  "wind_speed": 9.37
}