{
  "id": "28200",
  "title": "Father and son have very close daylight sighting in the Green Swamp",
  "date": "2009-10-10",
  "timestamp": 1255132800,
  "observed": "Me and my father were hunting at richloam wildlife management area. we had been walking through the swamps all morning and on various occasions there was a really fowl smell that would come and go. At that time I just figured it was the swamp. When we got out of the swamp we were thirsty so we decided to run to the store since we had some time before we went to where we were going to hunt the afternoon. While driving out to the store we came around a curve in the road there was something really big that stepped half way behind a scrub oak alongside the road. My dad was only going about 10 to 15 MPH and as we went by we got a good view of what it was or at least what it looked like, as he hit the brakes I could not belive what I saw. I asked my dad what that was after we went by it. And he asked me what I saw and i told him and he said the same thing and we turned around to take a look at where it was but it was gone. It left a nice size trail the way it ran. It was about 7 1/2 ft. to 8 ft.tall, about 4 ft. to 4 1/2 ft. across the shoulders, covered with dark brown hair with a Reddish tint standing on two legs. it looked to be really muscular. The face which was covered with short hair. we were able to see its eyes which were dark. the nose was flat and wide, and the mouth was wide but in proportion to its head.",
  "classification": "Class A",
  "county": "Sumter",
  "state": "Florida",
  "latitude": 28.44926,
  "longitude": -81.95577,
  "location": "-81.95577,28.44926",
  "location_details": "center grade by the power lines",
  "temperature_high": 89.55,
  "temperature_mid": 81.93,
  "temperature_low": 74.31,
  "dew_point": 74.39,
  "humidity": 0.8,
  "cloud_cover": 0.33,
  "moon_phase": 0.72,
  "precip_intensity": 0.0297,
  "precip_probability": 0.24,
  "precip_type": "rain",
  "pressure": 1016.93,
  "summary": "Rain in the afternoon and evening.",
  "uv_index": 5,
  "visibility": 9.21,
  "wind_bearing": 207,
  "wind_speed": 1.9
}