{
  "reportId": "38309",
  "title": "",
  "date": "",
  "observed": "I saw what I thought was a very large hunter walking out of the woods next to our house. The only problem was he was not wearing any orange and for some strange reason was wearing a very shaggy ghillie suit. The suit was dark brown or black and was from head to toe. I could see the hair or strings from the suit hanging off of the arms and legs and head. From the distance, I would say 200 yards I could not see the face. When the hunter saw me it froze in the trail and would not move, he acted like he wanted to blend in to the trail. I know the man that usually hunts back in the woods, he always wears orange and is not big. When I say big this guy was huge, I did not see a weapon and he was acting very strange by standing there like a statue. My first thought was why is he hunting so close to the opening of the woods, and if he has a gun and shoots the way he is facing he will be pointing towards my house. Why is he wearing that suit, and not orange, and who in the heck is this guy. I glanced towards my house thinking about a bullet striking it if he shoots, and when I looked back, probably not more than 4-5 seconds, this guy was gone. A few weeks later I had my wife stand where I was standing and I went to the woods with the largest winter coat I own on and I had her take pictures of me with her iPhone (terrible resolution) to get an idea how big this guy was. The only picture that turned out decent showed that this guy was at least twice my size if not more. I'm 5-9 without boots and 210. As I said I was wearing boots and a very bulky coat. After studying the picture I was shocked, it didn't occur to me until then that this could be something besides a person, but people are not the size of what I saw. I am still confused, I grew up in the woods have heard and seen many bizarre things but this still has me puzzled, because I can not explain it.",
  "classification": "Class B",
  "county": "Steuben",
  "state": "Indiana",
  "location_details": "",
  "summary": ""
}