{
  "id": "523",
  "title": "",
  "date": "",
  "observed": "I was alone hunting mule deer. I had been hiking for about 45 minutes to get to the spot where I had the encounter. I was sitting on a ridge between to rows of rimrock, looking into a draw that comes up the south side of Hodges Canyon. I bent over to retie a bootlace when I was startled by an extremely loud noise of short duration. I didn't have any idea what the noise was. Then I heard it again. I would describe it as a low pitched, guttural shout/growl. The volume and resonance were incredibly loud, but of short duration (about 1 to 1 1/2 seconds). I heard the vocalization about 7 to 10 times, at about 10 second intervals. Then I heard twigs breaking and brush popping, moving rapidly in my direction, just like an elk or moose was running toward me.I never saw anything, but I fully expected the animal I was hearing to come into view immediately. As the unseen creature moved toward me, I took the point and shoot camera from my backpack. I also released the safety on my .270 rifle. The distance at which I heard the first vocalization was about 200 yards. The closest point was only about 75 yards. I then saw a cow moose running up through the saddle in the ridge to the south, about 500 yards away. She was obviously spooked by the loud shout/growls. I remained motionless for about 15 minutes and didn't see or hear anything else. Then I got to my feet and threw 3 rocks into the draw in the direction I last heard the sounds. Nothing. Then I fired a shot into a bare spot on the ridge above where I first heard the sounds. Nothing. I was a little shaken, so I hiked out and told a few friends about the incident. I wanted to go back and see if I could find any physical evidence to collect or photograph. I took my SLR with a 28-200 lens and some baggies. On the way in I noticed 2 magpies fly up from the ground. Knowing this could mean a carcass, I went to investigate. I found a moose carcass that was just about picked clean. It had rained the night before, and I could find no discernable tracks nearby.The magpies had landed in the exact vicinity where I had frst heard the sounds. I then hiked up into the draw, somewhat apprehensively, to see if I could see or hear anything else. No luck. I did see an aspen, about 6\" in diameter that was broken off about 4 feet from the ground, but the break was old. I have hunted with rifle and bow my whole life. I am 47 years old and have had many close encounters with wildlife, including moose, elk, deer, bears, cougars. I am also a wildlife photographer and have extensive knowledge and experience with animals and their habits and habitat. I have periodically read through this website, as I have a keen interest in the subject. Whatever I heard is something I can't adequately describe to anyone, the most unusual thing was the volume and resonance. I also got the distinct impression, that the animal (it couldn't possibly have been human) was trying to intimidate me into leaving the area. I feel that my standing my ground, throwing rocks, and certainly firing my rifle, had the effect of intimidating the animal, at least enough that it never showed itself.",
  "classification": "Class B",
  "county": "Rich",
  "state": "Utah",
  "location_details": "approx. 3/4 mile south of Sunrise Campground at Bear Lake summit.",
  "summary": ""
}