{
  "id": "3315",
  "title": "Nighttime sighting by mother and son in Lynx, near West Union",
  "date": "2002-05-26",
  "timestamp": 1022371200,
  "observed": "The sighting occured around l0 pm at night, we live in a very rural area of Adams County, Ohio, we have a house on 60 very wooded acres.  My wife was sitting a watching TV, as were we all, we have a back window near the TV some l0 feet from where we sit, my wife suddenly said that there two eyes staring at her thru the window.  I first thought she was joking, but she wasn't, I got up and went to the window, which was closed, as it was cold, and opened the window and could not here anything or see anything, but it was dark.  At about the same time as my wife said she saw the eyes, my oldest son was getting up to go outside on our front screen deck porch, as I was at the window, my son had just gone out the sliding glass door to the porch and was lighting a cigarette, as I turned away from the window, my son, opened the door and was yelling for me as he was pointing out the porch to the separate garage building that is next to our house, he dropped his cigarette and stood there looking for a few seconds and then quickly came into the house saying that he had just seen a big hairy thing looking around the corner of the garage in his direction.  This got us all excited and somewhat scared, I had just had a knee operation so I did not go outside to investigate, I did however get a gun out and load it.  I went onto the porch but I did not here or see anything.  I was convinced that my wife and son had seen the samething, as it could have walked across the back of the house and garage and come around the corner within that time frame.  My wife described the eyes as very close together and a glowing green color and larger than a humans eyes.  My son described the creature as being very dark in color, with the hair very long and hanging down over its face, he couldn't make out any facial features.  Our deck/porch is some 4 feet raised off the ground with the garage on the ground, based on my sons description of the height of the head in relation to the basketball hoop that was on the front of the garage, the thing was in the 7-8 feet tall range.  The next day I went out looking for any signs, I found nothing at the window or behind the house and garage area at the corner, I walked across a grass field that extends out from the side of the garage and did find what appeared to be a faint impression of a very large foot in a hard clay/sand non grassy spot.  I measured and copied the imprint the best I could, I have it somewhere in a notebook, but do remember it being some 16 inches in length and some 10-12 inches in width across the top, the impression was made along the weight bearing area's with a large arch area that left no impression, the toes appeared to be small with all leaving the same type of impression.  This sighting occured in late December, around l0pm at night, and I feel that the year was l997 or l998. I also, a year or so before this sighting, being on the rear deck porch off our master bedroom, also later at night, hear a strange howling sound far off in the distance, sounding like it was near the top of the ridge some l/4 mile up the hill behind our house.  I don't think it was a coyote or dog.",
  "classification": "Class A",
  "county": "Adams",
  "state": "Ohio",
  "latitude": 38.73687,
  "longitude": -83.39134,
  "location": "-83.39134,38.73687",
  "location_details": "The nearest town that shows on a map is West Union, we actually live some 8-10 miles easterly from there off State Road 125 in the Brush Creek Township in the community known as Lynx.",
  "temperature_high": 71.32,
  "temperature_mid": 63.45,
  "temperature_low": 55.58,
  "dew_point": 54.16,
  "humidity": 0.78,
  "cloud_cover": 0.49,
  "moon_phase": 0.51,
  "precip_intensity": 0.0006,
  "precip_probability": 0.15,
  "precip_type": "rain",
  "pressure": 1019.52,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 9,
  "visibility": 8.11,
  "wind_bearing": 14,
  "wind_speed": 3.08
}