{
  "id": "12601",
  "title": "Bow hunter hears vocalizations, smells foul odor",
  "date": "2005-09-14",
  "timestamp": 1126656000,
  "observed": "I was bowhunting for deer yesterday (September 17th, 2005) in the swamp bottoms of West River in Churcton, Maryland when I heard what I can only describe as jibberish hollering coming from behind the deer blind that I was in at about 100 yards or so.  It moved east to west hollering jibberish and moving closer and closer to where I was.  I unzipped the back of the deer blind to try and see with my field glasses what was making all that noise and scaring the deer away.  I saw nothing.  The sound was getting closer and I began to feel nervous even though I had permission to hunt there. Thats when the smell of damp musty roadkill mixed with dirty diapers hit me.  I had to exit the deer blind for fresh air and an overwhelming sense of fear gripped me. It was more of a safety issue that made me exit the deer blind and nock an arrow in my bow and leave the area as fast as I could before I came in contact with whatever was making the noise.  I was unnerved by the aggresive tone in the jibberish and hollering. The fact that it was close by and I could not see it coupled with the smell and the tone of its voice, made me realize that I had best leave the area, and quickly. As I exited the woods, I walked briskly towards my vehicle and was approximately twenty five yards from my truck when I heard more loud jibberish coming paralell from me about twenty yards in the woods.  Whatever it was was following me and that unnerved me even more and I headed straight for my truck with my bow fully drawn and ready to fire at whatever was stalking me.  Again, I saw nothing.  No movement in the woods and I made my way to my truck and released my draw without shooting my arrow.  I put my bow in the back seat of my Suburban and cranked up my truck and left immediately.  I have never felt that way in the woods in my entire life.  I have hunted bear, wild pig and deer all of my life and never have I ever felt the need to flee the woods.   Until now.",
  "classification": "Class B",
  "county": "Anne Arundel",
  "state": "Maryland",
  "latitude": 38.81639,
  "longitude": -76.54514,
  "location": "-76.54514,38.81639",
  "location_details": "Incident occured in Churchton, Maryland on Shady Side Road between Shady Side Road and West River in the West River swamp bottoms.  Hardwood forest with chokecherry and underbrush thickets.  Some old growth trees exist but mainly medium growth scattered with pines and red oak.  Swamp vegitation and gallberry trees are abundant.  Area condusive to wildlife habitation and wildlife is abundant.  Deer, turkey, owls, foxes, woodland game birds like dove have been spotted in the area.  Rails,coots, snipe and waterfowl found closer to West River area along with raccoon tracks and large preditor cat paw prints have been sighted.",
  "temperature_high": 82.75,
  "temperature_mid": 79.165,
  "temperature_low": 75.58,
  "dew_point": 71.81,
  "humidity": 0.83,
  "cloud_cover": 0.82,
  "moon_phase": 0.37,
  "precip_intensity": 0.0007,
  "precip_probability": 0.65,
  "precip_type": "rain",
  "pressure": 1015.32,
  "summary": "Humid and mostly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 7.73,
  "wind_bearing": 125,
  "wind_speed": 4.82
}