{
  "reportId": "3200",
  "title": "Man recounts being chased as a teen",
  "date": "1983-08-12",
  "timestamp": 429494400,
  "observed": "I was staying the summer with an older cousin and his wife in the summer of 1983 or 1984. I was 13 or 14 at the time. They lived in the mountains somewhere out of Elmira(not sure of the exact spelling but it is close to Eugene). My cousin and his wife were new to Oregon; they had recently moved there from Bakersfield CA. My cousin was wanting to do some scouting as deer season was soon coming up, so one morning we packed a lunch and headed out into the forest from his house. In this area there was only one paved road and in the direction we headed there was only one dirt road that soon ended. There was a fairly good hiking trail that we traveled on for maybe an hour and a half then we came apon a smaller less-traveled path that we stayed on for a good 45 minutes, stopping now and again on the edge of small clearings. The forest became to thick to see very far at all. So we decided to try and make our way up onto the side of a mountain we had been traveling at the base of. After about 30 40 minutes of dead-end game trails we had gotten high enough that the forest started to thin a bit. We came to a small clearing that gave us a slight view of the valley below. We decided that we had gone far enough and decided to stop there and eat before turning back. It wasn't but just a moment after getting our food out and sitting back on an old log that we herd some rustling and snapping of twigs what seemed like just out of our sight in the dense forest. By the sound of the twigs we both knew this couldn't be a rabbit or any small animal. My cousin instantly turned and whispered BEAR. We were still for about 1 minute, then came identical noises from the opposite side of the clearing. This really confussed me as the sound were rather loud and I didn't see how it could have moved to the other side of the clearing without us hearing. My cousin then whispered TWO BEARS. He then whispered \"They smell the food.\" Just then there was a loud snap in the area of the second noises. Another the thing that was most frightening was the loudness of cracking. I thought this is one huge bear. Over the next 2 minutes I was terrified as the snapping and breaking of what must have been large branches changed position around the clearing never did the noise come simultaniously from the same spot. Not untill I heard the shot did I see my cousin with a snub nose .38 pointed into the air. As soon as he fired there came a loud powerful roar that started low in pitch and ended very high (not shrill). It was a warning I will never forget. As soon as this powerful yell,scream,bellow,??? ended we were on our feet running in the direction we had come from. After about 50 yards to our horror there came another yell and I was sure this thing was following us. We began running full speed. I instantly started getting scratched and stuck by the thick forest. We were running downhill and at about 150- 200 yards there was it again screamed. It seemed so close but we never saw anything: no movement, shadow, shape --nothing. We were now running as fast as we possibly could not on paths. I can only describe it as reckless abandon. Several times I lost my feet and rolled and dove through ferns, trees and thorny bushes. I became separated from my cousin but never slowed up as this scream would repeat approx every 20 seconds. Once back on the trail, my cousin emerged about 50 feet from me. We still ran for what must have been a mile before this thing let up and started giving us some distance. But every time we started to stop or even slow it would yell as if to say, \"Not yet -- get going.\" It was the tiredest I had ever been. My lungs throat were were way past hurting. I was so tired I was dizzy.  I felt as if I would pass out any moment. We made it back to the house where his wife waited at the door,  having heard the shots and screams. I was ripped to shreds from the forest. My cousin refused to believe it was something like bigfoot although he knew it was no bear. He thought it was some pissed off crazy mountain man. I knew not there wasn't a man alive that could have kept up with us,let alone make that noise. I only went outside 2 more times in the next week I was there, once to go to the library and then to the train home. We went to the library to research what this could have been. My cousin said it was a panther but I don't think he actually believed this. He wouldn't let me talk to anyone about it.",
  "classification": "Class B",
  "county": "Lane",
  "state": "Oregon",
  "latitude": 44.09462,
  "longitude": -123.3724,
  "location": "-123.3724,44.09462",
  "location_details": "",
  "temperature_high": 82.86,
  "temperature_mid": 68.64,
  "temperature_low": 54.42,
  "dew_point": 54.62,
  "humidity": 0.68,
  "cloud_cover": 0.16,
  "moon_phase": 0.15,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.34,
  "summary": "Mostly cloudy in the morning.",
  "uv_index": 8,
  "visibility": 9.66,
  "wind_bearing": 356,
  "wind_speed": 10.37
}