{
  "reportId": "22651",
  "title": "Multiple witnesses see multiple figures on the edge of a small lake in the Mallard Larkins Roadless Area",
  "date": "2001-09-03",
  "timestamp": 999475200,
  "observed": "We were on a back packing trip in the Mallard Larkins Roadless area of Idaho,  and it was high noon , beautiful sunny day,  and we were on a pack trail that was climbing above Heart Lake. We came to a lookout,  and looked down on the lake. We saw what at first appeared to be two people standing in the high grass next to the lake,  with what looked like their dog.  They were standing still all next to each other,  as soon as my friend said,  \"Hey check out those people down there,\"  they heard us and started to run as fast as they could. At first they were running like kids,  jumping over logs, and through the swamp. One was larger than the other. Their arms were long.  As we watched them run I noticed that their pet was running just like a bear. They were all one color -- Brown. We were close enough to them to tell they were not wearing clothes. All this lasted about 15 seconds at the most. This is what I was saying once they started running. \"Look. They are kids . No ... they're too big to be kids.  Their dog is running like a bear. Those people are all brown, and... \"     then they ran into the trees. I looked at my friend and said, \"Did you see that?  \"What did we just see?\"    We pondered for a minute,  and then I said, \"Maybe we just saw bigfoots ... Lets go take a look.\"  My friend said,   \"No way,  I'm not going down there if those were bigfoots.\" We talked about what we saw.   Why would humans run away like that at the sight of another human?   Why were they all one color from head to toe? Why would those people be standing out in the bog of a lake?  Fishermen sit on rocks.  And the way they were running with their arms long and stretched out, jumping over logs and such. And what's up with the little bear following them?. They were all standing next to each other perfectly calm, until they heard us up on the cliff. The larger of them ran the fastest, then the other, and then the 4 legged one was running way behind them.  If it were a dog ... usually dogs will run faster than the humans.",
  "classification": "Class A",
  "county": "Clearwater",
  "state": "Idaho",
  "latitude": 46.94,
  "longitude": -115.586,
  "location": "-115.586,46.94",
  "location_details": "Look on a Topo  Map, at Heart Lake is where we saw them",
  "temperature_high": 79.76,
  "temperature_mid": 65.15,
  "temperature_low": 50.54,
  "dew_point": 40.74,
  "humidity": 0.44,
  "cloud_cover": 0.08,
  "moon_phase": 0.53,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1012.5,
  "summary": "Clear throughout the day.",
  "uv_index": 6,
  "visibility": 9.99,
  "wind_bearing": 225,
  "wind_speed": 4.05
}