{
  "id": "24892",
  "title": "Father and son hear strange sounds while camping near Oregon Caves",
  "date": "2009-03-02",
  "timestamp": 1235952000,
  "observed": "I write this email with a little apprehension of what my son and I heard in late August 2006. My 16 year old son (at the time) and I were on a three day hiking trip in the Siskiyou Mountains of Oregon. We were hiking on trail # 900, to a snow shelter cabin we've been going to for about the last 10-12 years at the time. It is called Greyback shelter off of trail #900 or Obrien Creek Trail. The entire area is wilderness and you can reach the Oregon caves from the same main trail # 1207, also called the Siskiyou/Rogue division trail. On the southwest side of the cabin there is a huge meadow where there used to be another cabin built in the 40's by cattlemen. On the third and final morning we woke up in the shelter where we had camped. And, I had to answer natures call, my son was just getting woke up when I told him I would be back in a few minutes. I walked to the meadow where there is an old outhouse type thing just to the back of the old cabin that stood there, and well... After, I had finished, I remember feeling like I was being watched, and I walked toward the path that connected the two cabins in the meadow. The meadow is beautiful, so it being about 8:00 - 8:30 AM, I stood at the base of the meadow to enjoy the scenery.  Then, above me I heard a screeching howl/guttural like sound, that lasted a couple of seconds and ended abruptly, and began again, it seemed like it went on for about 2-3 minutes. I stood there looking up to the area I heard the sound and could not see anything, which was weird because it is relatively open meadow with rolls and dips. I didn't recognize the animal making the sound. Like so many of your reports that I have read, I'm a hunter, hiker outdoorsy kind of a guy. And, I had a hard time identifying the sound, still can't. But, it kind of freaked me out. I pulled my pistol and quickly, cautiously went to the cabin were my son was, and We never go to mountains without a firearm, He had heard the sound as well, and he had pulled his weapon, he knew it was me coming I was calling him to let him know it was me, as I came around the cabin I saw my son looking in the same direction as I had when we both heard the sound, he was as white as a sheet. We were both very visible shaken. He then asked me \"DAD, what the hell was that?\" I know my son is a teenager, I know he cusses, but not around me at the time. We ate and uneasy breakfast and packed our gear and headed out, a lot earlier than we would normally. All the way down the trail back to my truck we constantly check our back trail, it only being about a mile and half down and out of the area it was probably my longest hike. We have not been back to the cabin since, and that was just over 2 years ago. I would also like to add that the sounds we heard that day are similar to two of your sound clips 1973 Puyallup and the 1978 Snohomish county whoops/ howls. But, with a little more guttural grunt that ended abruptly, it did not taper off like a coyote, fox, wolf or elk; it just stopped and started again. My name is B. H., and I lived in Medford, Oregon. Think what you will of me and my son, but we know what we heard that day and we do not know what made the call. We are no longer on the fence of \"do\" or \"do not\" we believe it was a Sasquatch.",
  "classification": "Class B",
  "county": "Josephine",
  "state": "Oregon",
  "latitude": 42.125,
  "longitude": -123.2916,
  "location": "-123.2916,42.125",
  "location_details": "Take hwy 238 out of Medford and head towards Jacksonville, follow Hwy238 out towards Ruch. Turn left on upper Applegate Rd. follow to Carberry Creek Rd, that is also called county 777 Rd. Follow to the junction of FR 10 (Thompson Creek rd.) and FR 1005 and FR 1020. Follow road 1005 all the way to end of the road, which ends at Obrien Creek. Trail # 900 Trail head.  Follow Trail # 900 to trail junction #1207, here is a sign that tells you how to get to the Greyback Snow Shelter at the fork of 900 and 1207. Follow foot path to shelter and you will see the other trail/path that will take you to the meadow where the Krause cabin used to stand. My son and I would be honored to take an investigator to the spot before the winter weather hits, if you would like.",
  "temperature_high": 52.15,
  "temperature_mid": 46.285,
  "temperature_low": 40.42,
  "dew_point": 42.33,
  "humidity": 0.81,
  "cloud_cover": 0.79,
  "moon_phase": 0.2,
  "precip_intensity": 0.0172,
  "precip_probability": 0.7,
  "precip_type": "rain",
  "pressure": 1005.96,
  "summary": "Light rain and breezy starting in the evening.",
  "uv_index": 3,
  "visibility": 7.47,
  "wind_bearing": 177,
  "wind_speed": 13.96
}