{
  "reportId": "16870",
  "title": "Daylight sighting by motorist of a juvenile north of Whitehall",
  "date": "2006-12-06",
  "timestamp": 1165363200,
  "observed": "My experiece happened in the fall of 1998. I was driving on a back road between Whitehall and Strum,WI. in Trempealeau county, just past the Rod & Gun club. It was close to sunset getting near dusk, but still enough light to see around the pond and edges near the woods.  The teraine is very wooded and there are very sharp corners so you have to really slow down. I always see wildlife on this road, so I drive very causiously. As I approched the sharp corner my head lights locked onto a pair of eyes in the tree about 10 feet off the road, directly in front of me. I thought it must be an owl. At about 20 feet from the corner a body started to drop down form the tree branch that the eyes were attached to. I could not believe what I was viewing. The creature looked like a child covered in hair. A height of 4-4.5 feet long. It dropped, hit the ground in a crouched position, did not full stand, but turned and ran up a revine. It took about 30 seconds for the whole thing to happen. But is something that is burned in to my mind forever. To this day I truely know I saw a child bigfoot. The face was covered in hair as was the body. The color was kind of a reddish brown.",
  "classification": "Class A",
  "county": "Trempealeau",
  "state": "Wisconsin",
  "latitude": 44.4049,
  "longitude": -91.3171,
  "location": "-91.3171,44.4049",
  "location_details": "Take Hwy.53 north out of Whittehall, to county road D north about 2 miles turn left toward the rod & gun club. go past the rod & gun. It happened on the road just before you turn the corner.",
  "temperature_high": 24.31,
  "temperature_mid": 12.875,
  "temperature_low": 1.44,
  "dew_point": 12.24,
  "humidity": 0.67,
  "cloud_cover": 0.65,
  "moon_phase": 0.57,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.05,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 1,
  "visibility": 9.48,
  "wind_bearing": 315,
  "wind_speed": 11.95
}