{
  "reportId": "26522",
  "title": "Woman describes vivid early morning sighting just below Independence Pass",
  "date": "2009-09-01",
  "timestamp": 1251763200,
  "observed": "(Job title edited at witness request for privacy).  I am currently on a contract in Rifle Colorado.  My home is 5 1/2 hrs south of Rifle so I stay in my camper 5 days a week.  This morning, I left my home at 0245 as per usual.  I stopped in Buena Vista to fuel up and get a coffee.  As I came thru the little town of Twin Lakes, I was just feeling tired and the more I drove, the sleepier I got.  So before I started up Independence Pass, I thought I would pull over and get some fresh air.  (I had just noted that it was 36 degrees on the truck temp. gauge and even took a picture of it on my phone, to send to my brother in Virginia).  I pulled over to the left side of the road.  As I got out of the truck, I noticed movement in the meadow directly in front of me.  Not more than 3-4 miles below here, I had just seen a buck deer so I was thinking that I had probably flushed another deer.  As I walked to the rear of my truck, I continued to look out in the meadow and that is when I saw this thing move.  At first I thought it was a bear but it rose straight up and that is when I knew it wasn't a bear.  A bear's front legs hang in front of their belly when they stand and these did not.  The \"arms\" hung to the sides just like a person.  Only if this was a person, he was really tall.  It was furry and a deep brown/red in color. I was so frightened that I thought I would throw up.  As I moved back toward my truck door, it tipped its head back as if it was smelling the air.  When I opened the truck door, it turned, bent over and picked something up and began to run on two legs across the meadow away from me. Not running like sprinting, but running at a pace that he could probably continue for hours. Honestly, the thing that struck me most about this was the way it picked up, whatever it was, and carried it with both hands clasped together in front of its torso. By now I was back in my truck, shaking and tearful. I live in my camper 5 days a week.  I move from State Park to State Park.  I see wildlife daily.  I just saw a black bear Sunday evening and I know what they look like when they stand, how they grunt and grumble.  I know how they lumber and run...this was not a bear.  It was like nothing I have ever seen.",
  "classification": "Class A",
  "county": "Lake",
  "state": "Colorado",
  "latitude": 39.1006,
  "longitude": -106.5445,
  "location": "-106.5445,39.1006",
  "location_details": "Base of Independence Pass.  This is the border of Lake and Pitkin County. Just off the road, Hwy 82.",
  "temperature_high": 74.31,
  "temperature_mid": 60.33,
  "temperature_low": 46.35,
  "dew_point": 29.88,
  "humidity": 0.36,
  "cloud_cover": 0.23,
  "moon_phase": 0.41,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.45,
  "summary": "Partly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 9,
  "visibility": 9.7,
  "wind_bearing": 265,
  "wind_speed": 5.21
}