{
  "id": "35671",
  "title": "Bow hunter remembers possible intimidation behavior near Grand Rapids.",
  "date": "1979-10-01",
  "timestamp": 307584000,
  "observed": "This incident took place over 30 years ago (1979 or 1980) on the western side of the state, near Grand Rapids. It was the opening  of archery deer season ( that would make it Oct?) and I and two other fellows, one a coworker of mine at the time, drove up from our place of business near Detroit to a state forest (can’t recall the name now) located just (north?) of Grand Rapids. It was raining cats and dogs (!) that afternoon we left and when we got into the area that night, my coworker stopped at his parents house to pick up a small trailer for us to use while we camped in the state forest. We pulled up the next morning, set up camp and then staked out areas each of us wanted to hunt (my coworker was fairly familiar with the area but I was not). Nothing unusual happened that day and we finished hunting (with no result) and then stayed in the trailer that night. The next day I picked out another site not far from the trailer, a fairly large clearing a few hundred feet in diameter (the forest was a mix of hardwood and evergreen, if I recall) with a wide easement for power lines that had been cut into the woods that ran directly in front of the blind that I had set up under a tree ( I think that power line easement figures into what happened but at the time I had no idea of its significance). The morning went by and we (the other two fellows had staked out blinds in other parts of the forest )  took a break for lunch, driving to a small town, the name of which I can’t recall.  When we got back (early afternoon, probably about 1 p.m or so) I staked out my blind again, the afternoon being sunny and mild. That’s when it happened.  Suddenly, off to my two o’clock position, at the edge of the clearing, but back in the forest and out of sight, the most horrible and weird racket began. It sounded as if logs and tree branches were breaking (although I could not actually see anything, only hear) and from inside the canopy of forest came another STRANGE, loud, vocalizations (I remember being under the impression that there were more than one “person” involved out there),  almost as if someone was incoherently, intoxicated (it was the only way I could describe it at the time). These noises went on for perhaps 3 minutes and then stopped as quickly as they had begun. After that utter silence. Nothing else. After a few minutes I got up with my bow, knocked an arrow, and went over to the general spot to investigate but there was so much dead fall and brush there that I couldn’t get into the forest very far so I turned around and came back. That night I talked to my companions about what happened but nothing they could tell me shed any light onto the subject except that the three of us were the only other people in the area, so I ruled out it being other hunters. It wasn’t until a few months ago that I ran across the BFRO website and a TAPE RECORDING of the “vocalizations” that I heard that day (or something very, very close to it).  I was flabbergasted when I heard the recordings of  the so-called “Samurai chatter”. THAT was the vocalization that went along with the other noises that I heard. It’ taken over thirty years to clear up that enigma. While I had almost no knowledge of Bigfoot at the time, looking back on it, I suspect that one or more of the hairy things was traveling up that power line cut and spotted me sitting in the blind, then took to the forest again and stopped and tried some vocalizations and tree branch breaking in an attempt to intimidate me into leaving the area. They didn’t count on my ignorance; instead of leaving, I walked towards them to investigate. If I had known, at the time, what was probably in those woods, I would have headed back to the trailer and locked myself in.",
  "classification": "Class B",
  "county": "Kent",
  "state": "Michigan",
  "latitude": 43.153,
  "longitude": -85.5995,
  "location": "-85.5995,43.153",
  "location_details": "",
  "temperature_high": 73.48,
  "temperature_mid": 64.595,
  "temperature_low": 55.71,
  "dew_point": 48.55,
  "humidity": 0.74,
  "cloud_cover": 0.33,
  "moon_phase": 0.34,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1010.44,
  "summary": "Mostly cloudy starting in the afternoon.",
  "uv_index": 4,
  "visibility": 8.4,
  "wind_bearing": 34,
  "wind_speed": 2
}