{
  "id": "37304",
  "title": "Best friends recall watching their dirt bike being canvassed by a hairy biped while camping at Lake Mills",
  "date": "1972-07-29",
  "timestamp": 81216000,
  "observed": "In  summer of 1972 , my friend and I decided to camp out by Lake Mills. The site we chose was about 100 yards from the lake off the dirt road that went around the lake. Someone had cut down some pine trees and nailed two sheets of plywood to them about three feet off the ground. We drove our supplies out in my dad's car and went back to my house before the sun set we rode my 1972 Honda 350 to the site. We had a large fire pit about 4 feet across and we had a big fire going. The structure was about 20 feet from the fire and my motorcycle was parked on the center stand another 15 feet to the other side of the fire. We stayed up quite late cooking, listening to the radio and talking. We stoked the fire up and went to bed around 2:00 A.M.. At approx. 4:00 A.M. I was awakened to the sounds of sticks breaking and brush being moved. Approx. 40 feet to my right a creature came right out of the brush and walked right over to my bike. The seat was approx. 32 inches off the ground and this creature started to gently touch the bike. Its chest was 2 feet above the seat as it was bent over the bike. I covered my friend's mouth with my hand and held the back of his head so he would not blurt out. I shook him and said look, look. I took my hand off his mouth and he said what the hell is it. I said I don't know, but as soon as it leaves we are getting the hell out of here. I was whispering when I woke him because I did not want it to come after me. When it finished touching the bike it stood up and walked straight off through thick brush. Branches were snapping and it just pushed growth aside like it was nothing. We waited about 10 minutes then snuck over to the bike, took it off the stand and I hit the starter and we were gone. My dad was furious that I had left his stuff and demanded we go get it. We drove my dad's car back to get the stuff but I would not get out of the car. I turned on the high beams and my friend got the stuff. I was terrified by this event. I to this day am reluctant to camp out. I still live in Florida and even when I am out at night in my yard relive that fear. The creature was covered in a slightly reddish brown fur and I would estimate it was 8 feet tall Approx.",
  "classification": "Class A",
  "county": "Seminole",
  "state": "Florida",
  "latitude": 28.62323,
  "longitude": -81.12898,
  "location": "-81.12898,28.62323",
  "location_details": "Hwy 50 to Hwy 419 , approx. 6 miles to Chuluota",
  "temperature_high": 91.29,
  "temperature_mid": 83.4,
  "temperature_low": 75.51,
  "dew_point": 74.61,
  "humidity": 0.8,
  "cloud_cover": 0.09,
  "moon_phase": 0.61,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.69,
  "summary": "Humid throughout the day.",
  "uv_index": 12,
  "visibility": 9.63,
  "wind_bearing": 167,
  "wind_speed": 8.84
}