{
  "reportId": "3636",
  "title": "",
  "date": "",
  "observed": "I lived in Colorado for 29 years. Eighteen of those I spent working at ski resorts. Over the years I've seen hundreds of deer and elk as well as dozens of bear, everything from cubs to large 400 pound males. In the last 4 years I've had 3 separate sightings of 4 creatures that I hesitate to identify. My third sighting occured in November 2001 between Vail and Eagle. I was driving west on I-70 with my girlfriend who was sound asleep next to me. It was around 10 p.m., a day or two after the full moon. It began to snow very hard, almost whiteout conditions at times. Somewhere after Vail and before Eagle the snow stopped for a few minutes. Even though it was night, it was very bright out due to the large moon and all the fresh snow. As I rounded a long curve in the highway my headlights hit two figures walking in the middle of the Colorado River. My first thought was, \"Oh no, these people have wrecked in the river and they're trying to cross back to the highway.\" I started to pull my Jeep to the side of the road and when I got even with them I saw two fuzzy looking people with very long arms walking down river. I could only see them from the knees up but it was obvious they were human in shape, upright, with elbows and knees. I stopped the car pretty quickly just past them and put on my emergency flashers. There was no break in the snowbank on the side of the road so obviously there was no wreck. With my girlfriend still asleep, I got out and stood on the edge of the bank looking up river for the two figures. It was maybe 20 degrees out and when they didn't round the bend I figured I'd back the car up to them. As soon as I put my reverse lights on a semi-truck came around the corner and almost hit us, so I parked again and sat there for a couple of minutes. I had a camera with a flash. I figured I might get a picture since it was so bright out. But I couldn't bring myself to wake my girlfriend up to tell her I was going to run back up the highway to take a picture of Mr. and Mrs. Bigfoot and I wasn't about to leave her there sound asleep on the side of a snow covered highway. So when it began to snow again I put the car in gear and just drove home. Of my three sightings I find the third one the most compelling. I suppose someone in costume could have fooled me on the first two sightings. However, someone in costume walking in the middle of the Eagle River at night probably wouldn't survive very long. ",
  "classification": "Class A",
  "county": "Eagle",
  "state": "Colorado",
  "location_details": "Sighting occurred off I-70 between Minturn and Edwards.",
  "summary": ""
}