{
  "reportId": "41447",
  "title": "Campers on Mount Graham are frightened by late-night visitor",
  "date": "2013-06-16",
  "timestamp": 1371340800,
  "observed": "I was camping at Mt. Graham about 1:00 am when I awoke and heard some rhythmic tapping of some type.  About 30 yards away in a very wooded area. Seconds later I heard steps walking around my tent. No breathing occurred just the sound of something walking. And it never went into the reflection of my tent and my lantern light. My sister, husband, son and their hound dog were in a tent 10 feet away and I could hear their dog whimpering.  I awaken my dad and told him I think its a bear. So we got our shoes, gun and flashlight. My 3 nieces were sleeping in the tent adjacent to my sister's tent. Then from inside this tent my niece screamed. (Later they told us they all heard steps and heavy breathing, and heard sounds from two individuals she said sounded like they where communicating and could hear them run away.) When we heard my niece yell in fear we got out of the tent fast with our flashlight aiming in their direction. But it was gone. It had to move extremely fast or just be hiding and did not make a sound because we were out of the tent in 2 seconds of the scream. We were already getting up to check some noise and do the late night restroom when at 4:00 am we could hear rocks and chattering within 1 second about 50 yards in the dense wooded area.",
  "classification": "Class B",
  "county": "Graham",
  "state": "Arizona",
  "latitude": 32.70722,
  "longitude": -109.9648,
  "location": "-109.9648,32.70722",
  "location_details": "Mt. Graham at Riggs Lake Elevation 10200 ft.",
  "temperature_high": 97.85,
  "temperature_mid": 84.035,
  "temperature_low": 70.22,
  "dew_point": 43.04,
  "humidity": 0.27,
  "cloud_cover": 0.06,
  "moon_phase": 0.26,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1009.81,
  "summary": "Clear throughout the day.",
  "uv_index": 15,
  "visibility": 10,
  "wind_bearing": 255,
  "wind_speed": 3.59
}