{
  "id": "26224",
  "title": "Hunter remembers possible howls and footprints near Baker City",
  "date": "1991-04-10",
  "timestamp": 671241600,
  "observed": "It was hunting season 1991 we left camp in the morning just before daylight. We drove to a spot that we had just found a few days before. We parked are truck up on top of a ridge and hiked down a draw that leads into a canyon. I started down to a sidehill above the draw while my dad and brother headed down the draw. After being seperate from each other for about 15 minutes I was up above the draw a ways, and I was standing there looking around the hillsides when I heard a kind of moaning howling sound which to me at that time sounded like a man yelling \"help\"very slowly and weakly like they were hurt. So I started to head back down into the draw to make sure it wasnt someone needing help. About 30 seconds went by and I heard it again so I stopped to listen I heard it a little louder this time since I was farther down the draw. This time I had a very weird feeling go through me I felt uneasy and almost a scared sensation but I still thought it was someone yelling \"help\". I eventually met up whith my dad and brother and asked if they had heard that yelling sound they said yes and that it was very close to them which they thought sounded more like an angry moaning sound and then heard a pop about as loud as a 22 rifle but it wasnt a rifle. So we made are way down to the bottom of the draw where the sound had come from,  we came to a barbed wire fence around which the ground all around had been torn up quit a bit and the top strand of wire had been broken in half;  which we looked at and could tell it was a fresh break-- we couldnt find any tracks that we could identify. We figured it was a buck or bull that got its horns stuck in the wire and had made the sound that we heard we had never known of them making this sound but what else could it have been we figured. So we finished the day hunting. The next morning we went to the same spot and about an hour into the hunt we came across a large foot print in a cow pie all the print was there except the toes which were off the cow pie it was then that we come to the conclusion that we must have heard the day before whatever left this foot print.The track was about 12 inches without the toes and around 6 inches wide.",
  "classification": "Class B",
  "county": "Baker",
  "state": "Oregon",
  "latitude": 44.68557,
  "longitude": -118.0891,
  "location": "-118.0891,44.68557",
  "location_details": "",
  "temperature_high": 40.74,
  "temperature_mid": 34.835,
  "temperature_low": 28.93,
  "dew_point": 22.99,
  "humidity": 0.67,
  "cloud_cover": 0.63,
  "moon_phase": 0.86,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.61,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 9.69,
  "wind_bearing": 314,
  "wind_speed": 7.25
}