{
  "id": "41195",
  "title": "Woman hears possible vocalizations in the James A. Reed Memorial Wildlife Area",
  "date": "2013-05-19",
  "timestamp": 1368921600,
  "observed": "I was taking pictures in the James A. Reed Wildlife Area just outside of Lee’s Summit Missouri yesterday, specifically around Bodarc Lake. I was intrigued since the wildlife area is fairly close to where I live. I decided to take some pictures. I crossed the dam over to the south side of the lake where I encountered two men fishing. I spoke briefly to one of the fisherman about the fish he’d caught that afternoon and the weather which was rather threatening. I wished him luck and headed west along the tree line when I encountered the other man. I spoke, but he seemed preoccupied so I walked on. I turned toward the tree line and started taking pictures into the woods after about the fourth picture I heard what I can only describe as a kind of a grunting snorting sound followed by a low but deep growl it was unlike anything I’d ever heard before. It sounded so close, but I didn’t see anything in the woods. I was petrified I turned and headed back towards the two men. I asked them if they’d heard anything one of the men was a little hesitant and really didn’t answer me the other man said yes it was probably a cougar. I told them to be careful and left just before I crossed the dam I stopped to take a picture of a large footprint in the mud. Already shaken by the experience and definitely inexperienced I failed to lie something down beside the footprint to gauge the size of it. But to be honest the only thing I wanted to do was put as much distance between me and those woods as possible. I crossed the dam to my car it was then I heard the same sound coming from across the lake in the vicinity of where I had been. It was muffled because of the distance, but still surprisingly loud that same grunting snorting growl.  The fisherman must have heard it as well because they were coming across the dam at a fairly fast pace. We didn’t speak again they got into their truck, me into my car and we left.",
  "classification": "Class B",
  "county": "Jackson",
  "state": "Missouri",
  "latitude": 38.524,
  "longitude": -94.1927,
  "location": "-94.1927,38.524",
  "location_details": "The incident took place in the James A. Reed Wild Life Area.",
  "temperature_high": 83.14,
  "temperature_mid": 72.415,
  "temperature_low": 61.69,
  "dew_point": 64.53,
  "humidity": 0.77,
  "cloud_cover": 0.17,
  "moon_phase": 0.3,
  "precip_intensity": 0.0188,
  "precip_probability": 0.74,
  "precip_type": "rain",
  "pressure": 1005.44,
  "summary": "Rain in the evening and overnight.",
  "uv_index": 9,
  "visibility": 8.9,
  "wind_bearing": 170,
  "wind_speed": 7.61
}