{
  "id": "3612",
  "title": "Two fishermen have truck shaken early one morning, outside of Auburn",
  "date": "1978-04-01",
  "timestamp": 260236800,
  "observed": "I went with my brother-in-law in the middle of the night, up to Alta Sierra, to sleep for a few hours, then start fishing right at dawn. We were in his flatbed truck that he used for his construction work. I slept in the cab, and he tossed a sleeping bag in the bed of the truck. Around five in the morning (we were both asleep) the truck shook violently back and forth, side to side. The bed of the truck probably moved at least a foot to a foot and a half, about three or four times in a row, quickly. I woke up, and sat straight up, thinking he was playing a trick on me. Right then, the drivers side door opened, and he jumped into the truck, scared out of his wits, screaming \"did you do that\". Obviuosly not, since there I was in the cab, and at that instant, we both realized that no human would have the kind of strength to move the truck that much. All of a sudden, we smelled a strong, rancid smell... the now familiar skunk/excrement smell. We both realized that whatever shook the truck, was out there somewhere. It was totally black out, no moon, no light of any kind, and we never saw anything. (We didn't have a flashlight to look around, so we just sat there shaking for quite a while. He didn't get back into the bed of the truck, needless to say!) We couldn't figure out what happened. He said maybe a bear ran into the truck, but I didn't think a bear had the strength, and it wasn't a \"thud\" or whatever, it was 3 or 4 full-strength shakes, then the shocks quickly rocked a little and the truck stopped moving. This is a heavy construction truck, so the suspension is strong enough and stiff enough, that you can pile full pallets of bricks, sand, cement, etc., VERY hard to move that truck with your hands. If you stood on the bed, and jumped up and down with all your might, you would not move the bed anywhere near as much as this moved. I tried it myself. I wish we'd seen something that night, but I never did even equate it with bigfoot until a year or two ago. I'm not sure what it was, but it was big, curious, strong, roams around at night, and smelled like hell! I mean, really really bad smelling.",
  "classification": "Class B",
  "county": "Placer",
  "state": "California",
  "latitude": 38.90222,
  "longitude": -121.0803,
  "location": "-121.0803,38.90222",
  "location_details": "Take HWY 49 out of Auburn, CA, towards Grass Valley. Turn right at Alta Sierra. (I wish I could give specific directions from here, but it was a long time ago, and I wasn't driving. I remember we made our way to a small beaver pond. There was just beginning to be houses built around here, and I think the area is probably much more developed now than it was 20+ years ago...)",
  "temperature_high": 55.84,
  "temperature_mid": 48.56,
  "temperature_low": 41.28,
  "dew_point": 44.23,
  "humidity": 0.77,
  "cloud_cover": 0.92,
  "moon_phase": 0.79,
  "precip_intensity": 0.0029,
  "precip_probability": 0.77,
  "precip_type": "rain",
  "pressure": 1010.24,
  "summary": "Light rain in the morning.",
  "uv_index": 5,
  "visibility": 9.35,
  "wind_bearing": 186,
  "wind_speed": 8.82
}