{
  "reportId": "14100",
  "title": "Knocks heard in the Ocala National Forest",
  "date": "2006-03-11",
  "timestamp": 1142035200,
  "observed": "The incident that my friend and I experienced was weird but not uncommon. It was a follow-up trip from a BFRO expedition and just lasted the weekend. There were about 12 expeditioners and it was in Central Florida. The first night didn't see much action. The next day which was saturday was when a friend and I decided to check out a location where sightings had previously occurred. We all visited this location before and saw or heard nothing. On this day we drove up to the sight because my friend had not been there. As soon as we got out of our vehicle we heard a loud whack! We both looked at each other and nodded our heads. About 20 seconds later we started to hear rythmic knocks. My friend was quite shocked at what he was hearing. That was when we decided to get out the baseball bat. I told Matt that whatever we heard responded back the same way we did. As this went on I decided to go out and investigate. That was what we were there for so I walked around the area. I saw no tracks or anything around the sandy areas so I decided to go beyond this area into the woods. Matt and I kept radio contact the whole time. Another member of our trip was also monitoring our conversation from a couple of miles away. Once I got into the woods there was alot of fallen leaves on the ground and every time I took a step I made alot of noise. The freaky part is that when I would stop I could distinctly hear something moving about 60 yards in front of me. It sounded bipedal and it's steps were louder than mine. Meanwhile back at the truck, Matt was still hearing knocks. I kept making excuses fot what it could be. There was a slight breeze blowing through so I figured maybe the trees close together were maybe bumping. That excuse went out the window when the knocks turned rythmic. Also the walker I heard made me assume that maybe possibly I was walking onto someones property. My other friend who was listening to our talk stated that the whole area was nothing but woods and eventually I would run into a lake. He knew this because his cabin was only a mile or so away. The walking continued fot about 8 to 10 minutes. After it stopped I decided to book. I thought it unwise for me to wander further into the woods alone. As soon as I got back Matt stated that the knocks had also stopped. The remainder of the trip went pretty dry. We have established our own Florida chapter and will have to follow-up on this sight.",
  "classification": "Class B",
  "county": "Lake",
  "state": "Florida",
  "latitude": 28.966,
  "longitude": -81.649,
  "location": "-81.649,28.966",
  "location_details": "We all expeditioners know it as the sinkhole and it is near FR 445 N.",
  "temperature_high": 82.09,
  "temperature_mid": 71.61,
  "temperature_low": 61.13,
  "dew_point": 61.1,
  "humidity": 0.71,
  "cloud_cover": 0.28,
  "moon_phase": 0.4,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.85,
  "summary": "Partly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 7,
  "visibility": 9.3,
  "wind_bearing": 136,
  "wind_speed": 6.66
}