{
  "id": "7939",
  "title": "Powerful vocalizations heard near town of Albion, NY",
  "date": "2002-08-22",
  "timestamp": 1029974400,
  "observed": "The town of Albion is small, there are woods, fields & streams just on the outskirts of town. With the time being around 2:00am in the morning, there were no sounds of any traffic or industrial sounds. The weather was excellent; no clouds, not the slightest breeze. My girlfriend and I had turned in for bed at around 1:30-1:45 am. We were talking to each other, just little chit chat when we both heard a far off howl/moan! At that time of night and that there was no wind to disturb the trees and hamper what we heard, it sounded like it came from the south maybe a mile or a mile and a half. The sound started low and kept going up in pitch for about 5 seconds. We both looked at each other and said \"What the hell was that?!\" Now what really freaked us out is that it did it again, only at around 6-7 seconds! It was like, \"Ooooaaaaaaaaaaaaaahhhhhh-----\" Now I consider myself an excellent observer with a very keen ear. I can hear things that most people either don't, or just overlook. What we heard was NOT anything mechanical nor was it a whistle. It sounded like it traveled over some distance; not like it was down the street. I am very fimiliar with all kinds of traffic noises that are associated with small towns. Even before we had heard it, we both had noticed how silent it was for quite some time. After the howl/moan, there was an echo. The sound went up in scale and didn't go down like a siren or anything like that. It wasn't a cry for help or a wolf nor any coyote (I have heard a coyote three times, once from only 200 yards)",
  "classification": "Class B",
  "county": "Orleans",
  "state": "New York",
  "latitude": 43.2265,
  "longitude": -78.1946,
  "location": "-78.1946,43.2265",
  "location_details": "The incident took place right in town, but being so early in the morning it was dead quiet; no traffic noise, no wind, nothing.",
  "temperature_high": 77.3,
  "temperature_mid": 69.98,
  "temperature_low": 62.66,
  "dew_point": 66.47,
  "humidity": 0.86,
  "cloud_cover": 0.7,
  "moon_phase": 0.49,
  "precip_intensity": 0.0079,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1015.94,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 7.98,
  "wind_bearing": 212,
  "wind_speed": 3.75
}