{
  "reportId": "5331",
  "title": "Upright creature walks on two legs towards hunter near Mt. Rainier National Park",
  "date": "2002-11-16",
  "timestamp": 1037404800,
  "observed": "Im a gunsmith in Seattle WA. I was out deer hunting on 11/16/02 east of GREENWATER WA. off of FSRD.73 approx. 12 mi. in off of RT.410 high up on a mountain 200 yds from Mt. Rainier N.P. Approx. 8:30am I was slowly working my way down the frozen dirt rd watching for any movement when about 300 yds down the road my eye caught a movement. It was black & coming toward me. At first glance I thought it was a bear but as I watched it I could see it was walking upright so I assumed it was a man.& I thought \"What the hell is this idiot doing up here in the middle of nowhere during deer hunting season dressed like that without a stitch of blaze orange on..God, he's even wearing a black stocking cap He's just begging to get shot. It kept walking towards me and I was taking small quiet baby steps toward it. All I could see that wasn't black was a kind of round lighter gray area where its face was. I didnt think it could see me cause I was headed down hill & the uphill road was at my back.It was windy & overcast& was even snowing on the peaks above & behind me.After it walked toward me..some 50 yds.to about 250 yds..all of a sudden it stopped & I froze in my tracks cause I knew it had seen me. In the blink of an eye it leaped from my side of the road( I was in the left tire track walking downhill) All the way across the road cleared the road & 4 or 5 ft. to the thick trees & disappeared. When it lept or bounded, I could see no distinction between the two legs. So I quickened my pace as I thought \"What the hell was that!!\" I got to a small grass road where there was a place where another campsite was About 60 yds from where this thing hit the trees,I made a mental mark where it went in, The grass road went in about 40 yds and then I was looking straight down off the ridge. I sat down on a pile of big deadfall and waited, figuring it would either come toward me or away from me..as it sure as hell wouldnt go over that ridge. After 20 mins. or so, I walked back out to the dirt road and went down to where I thought it had gone into the trees..as the mud in the dirt rd was frozen, I couldnt find any tracks..hell, I wasnt even leaving any tracks..I searched up & down the tree line it was so thick w/ under brush I couldnt find any tracks there either..But I knew that if it was a bear or any big animal w/ claws, it would have left at least claw marks when it leaped!",
  "classification": "Class A",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 47.0019,
  "longitude": -121.6279,
  "location": "-121.6279,47.0019",
  "location_details": "East on Rt. 410 out of Enumclaw WA. Past Greenwater to FSRD. 73 turn right on 73 go across bridge over Huckleberry creek(approx. 5 mi.) keep going straight uphill to mile marker 9 50 yds. past the mile marker go left on the dirt rd.about a mile I saw it about a half a mile from the end of the road",
  "temperature_high": 49.83,
  "temperature_mid": 45.925,
  "temperature_low": 42.02,
  "dew_point": 40.46,
  "humidity": 0.86,
  "cloud_cover": 0.6,
  "moon_phase": 0.4,
  "precip_intensity": 0.0152,
  "precip_probability": 0.86,
  "precip_type": "rain",
  "pressure": 1010.8,
  "summary": "Rain in the morning and afternoon.",
  "uv_index": 1,
  "visibility": 7.15,
  "wind_bearing": 191,
  "wind_speed": 8.1
}