{
  "reportId": "8121",
  "title": "Hunting & fishing guide has afternoon encounter in deep woods near Lugerville",
  "date": "2004-07-14",
  "timestamp": 1089763200,
  "observed": "This is totaly unbelievable, it has happened again. I can not even believe this myself, one sighting in a lifetime is hard enough but when this thing shows itself to me again, I'm starting to think maybe it is hanging around in the same type of woodland areas that I do. I am a Pro. woodsman and most of my outdoor treks take me away from all other human interferance, another words I go where other people do not want to go or will not attempt to go. The reason for this is that in my area the public are getting more and more populated in the areas that I choose to hunt or just get away, so I travel in deeper woods and swamplands away from there interferance. Well as I said I have seen this thing again, and this time it was about 3 miles from where I had spotted it the first time during hunting season. This sighting was as though it was curious or that it was following me, staying in the shadows moving only when I moved. Although this time at first it took me by complete suprise, I remained calm and also let myself observe this thing's every noticed action, trying not to let it have any knowledge that I was watching it as well. I would move taking a slow pace for about 50 yards at a time, turn to my side and kneel down acting like I was picking at the ground. It would stop and watch me from the shadows, as I move another 50 yards and watched it, it would wait till I would get about another 50 yards then it would stop and simulate what I was doing, it would crouch down and paw at the ground where I was kneeling. It would continue to sniff at the air and try to catch scent of me. After about a hour of this cat and mouse it dissapeared. I got a real uneasy feeling when I notice it about 75 yards to my right it was flanking me. This action made me very nervous, I have seen this with coyotes tracking a wounded deer. The thought ran in my mind that it was hunting me, but this feeling passed as I kept moving on. Again it would only move when I would move, perhaps it knew that its movments would be hidden by my coinciding movements, or it was trying to get in a direction of catching my scent. I kept moving in a southeast direction, stopping every 50 yards acting like I was digging and rutting around on the ground, keeping my head down and turning looking up with my eyes and not moving my head up. I thought it was gone but noticed it behind a uprooted tree root system peeking through a hole in the roots. It was closer now and was not aware that I new its location, at only about 30 yards I could make out its eyes and the right half of its face. The eyes seemed to be the color of a whitetail deer, no whites only dark. I moved on and after about another half an hour I was getting close to a area that loggers had clear cut, and it was gone. I sat in the area for at least another hour but it did not appear to me again. While I was watching this thing I got a chance to observe it and notice a lot of its features and charicteristics. Its height is only about 6 to 6 1/2 foot, it stays in the shadows, has dark brown hair with blackish streaks almost like what you could call brindle. Walks with a hunched over ape like character. I did not notice any smell. And it made no sound. I am convinced that this is a creature that with some time I can get close enough to again. No one can tell me that this freek of nature does not exist. It has showed itself to me twice.",
  "classification": "Class A",
  "county": "Price",
  "state": "Wisconsin",
  "latitude": 45.775,
  "longitude": -90.444,
  "location": "-90.444,45.775",
  "location_details": "1 mile north of Lugerville grade road and 1/2 mile east of rock creek road, deep woods.",
  "temperature_high": 77.12,
  "temperature_mid": 64.92,
  "temperature_low": 52.72,
  "dew_point": 57.21,
  "humidity": 0.7,
  "cloud_cover": 0.18,
  "moon_phase": 0.91,
  "precip_type": "rain",
  "pressure": 1012.87,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 8,
  "visibility": 9.94,
  "wind_bearing": 337,
  "wind_speed": 6.87
}