{
  "id": "11762",
  "title": "Daylight sighting by motorist couple in the Montura Estates area.",
  "date": "1982-02-01",
  "timestamp": 381369600,
  "observed": "My husband and I were returning home from the store. We were in no hurry so we took the long way around. We liked to see if any new homes were going in. Montura Estates at that time was very scarcely populated.  It is a very large area and then what people that lived there were widely scattered. Very heavy pine woods, palmettos and cypress swamps. It had been raining earlier and still was drizzling off and on. I saw a person come up out of the woods further up the road and start walking in same direction we were traveling. I remember thinking who would be out  walking on a day like that. We were traveling very slow. This person then crossed road in front of us and still continued traveling same way. As we got to where we had to turn we slowed up even more. That's when I realized that this person was still heading south on Hacienda. He had crossed over Hunting Club Ave that we were turning on. That is when I really looked at this person for there was nothing out that way at all then.  I then saw that there was hair blowing on its legs, long hair.  I then realized that it had hair all over its body. It was black or very dark. Its hair on its head was long and seemed angled to its shoulders. Its arms were held close to its sides. Very big, over 6 ft. tall. 300lbs or more. The trees were very tall and even the palmettos were very thick and tall so I`m not sure how tall. By this time we had come to a complete stop and it was out of sight as we were in the middle of our turn and the trees blocked our view.  I turned to my husband. We hadn`t said a word till then. He said was that what I thought it was?  I said I think so. We backed up but It was gone. We looked down Hacienda all the way to the end and back. We traveled down Appaloosa Ave. We looked for a while but never saw it again. When we returned home we told our children but then we said our eyes must have been playing tricks on us as it couldn`t have been what we thought we saw it must have been a tree along the road. My husband told his aunt and uncle and they looked at us like we were crazy, so again my husband said it was a tree. He never talked about it again. I never told anyone either. Id like to add that when I realized what I was looking at that I was 100-150 feet away. I think it must have heard us when my husband stopped car as the brakes squealed a little.",
  "classification": "Class A",
  "county": "Hendry",
  "state": "Florida",
  "latitude": 26.61979,
  "longitude": -80.60976,
  "location": "-80.60976,26.61979",
  "location_details": "off hwy 27 west to CR833 about 7 miles to entrance to Montura Estates. Enter and go to Hacienda Ave. Turn Right this should be south. Along this road is were we saw it enter and walk to Hunting Club Ave.",
  "temperature_high": 79.83,
  "temperature_mid": 75.93,
  "temperature_low": 72.03,
  "dew_point": 68.95,
  "humidity": 0.83,
  "cloud_cover": 0.66,
  "moon_phase": 0.26,
  "precip_intensity": 0.0209,
  "precip_probability": 0.51,
  "precip_type": "rain",
  "pressure": 1020.38,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 7,
  "wind_bearing": 141,
  "wind_speed": 7.56
}