{
  "reportId": "4484",
  "title": "A series of sightings, screams, and smells near an abandoned strip mine",
  "date": "1978-07-01",
  "timestamp": 268099200,
  "observed": "In the late 70s I used to walk to my friends house via a swampy area. One night around 10 PM, I started walking to his house. About halfway there I heard this very strange sound. It was like a low pitched growl that became a high pitched scream. Being only 12 years old I started running my ass off back home trying to get away from whatever it was. I could hear it following me and there was a smell in the air that was awful. At one point it sounded like it was 20 feet from me!! I finally made it to my backyard and whatever it was never came out of the woodline to show itself to me. Then, about a month later, while riding my bike to my friends house the long way I heard it again. That sound just made the hair on the back of my neck stand up just thinking about it. This thing just never seemed to go away during the summer months. My older brother thought I was pulling a fast one on him with this story until one night that changed his mind completely. He was out at the old makeshift cabin we built back there with a friend. They both heard something come up behind them and when my brother turned around it was right there. When they turned to run the creature grabbed my brother and ripped a mark on his back. He had three claw looking scratches about an inch or two long. They ran back down the hill until they hit the road and just like before it never left the cover of the woods. He said it stayed there and bellowed out an awful scream that scared them to death. I have never seen him that visibly scared in my entire life. One morning around 3 AM my brother slipped outside to have a smoke (since mom and dad didn't allow us to smoke). After about three minutes I heard banging on the back door. Just before the banging on the door our dog started acting very strange. It ran under the bed and started whimpering like something was wrong. When I opened the door the awful smell was in the air. It was like a mix between a skunk and rotten flesh. My brother almost tore the screen door off the hinges. He looked back to the yard and said, \"Look..there it is.\" I looked in the direction he was pointing and there was this huge hairy thing walking out of the woods with the moonlight on its back. It looked around seven to eight feet tall. When it walked it looked slumped over and we could see its arms moving as it walked out of the woods and through my neighbors yard. That was just one of the many things that happened by our house during the three summers this thing was coming around. ",
  "classification": "Class A",
  "county": "Stark",
  "state": "Ohio",
  "latitude": 40.67979,
  "longitude": -81.51075,
  "location": "-81.51075,40.67979",
  "location_details": "State Route 21 south out of Navarre to Hensel Road. Make a left and follow about 100 yards to Shelter Road and turn right. We lived the right hand side about two houses before Redmont Drive. The strip mines and woods were right behind the houses in the area.",
  "temperature_high": 71.54,
  "temperature_mid": 66.11,
  "temperature_low": 60.68,
  "dew_point": 54.84,
  "humidity": 0.67,
  "cloud_cover": 0.88,
  "moon_phase": 0.88,
  "precip_intensity": 0.0003,
  "precip_probability": 0.28,
  "precip_type": "rain",
  "pressure": 1016.91,
  "summary": "Overcast throughout the day.",
  "uv_index": 6,
  "visibility": 9.02,
  "wind_bearing": 90,
  "wind_speed": 6.88
}