{
  "reportId": "33784",
  "title": "Car pulling camper hits something on US 129 South of Live Oak",
  "date": "2000-07-15",
  "timestamp": 963619200,
  "observed": "About twelve years ago we were on a very remote and desolate stretch of highway, southeast of Live Oak, Florida, headed south. It was about 1:15 AM. There were four of us in an older model Monte Carlo pulling a Coleman travel trailer loaded with cave diving gear, (probably weighing in around eight-hundred pounds gross). A Tennessee State Trooper was driving and I was shotgun. The two men in the back were asleep. Suddenly, right out of nowhere, (with only our headlights for illumination), a tall, huge “black form” rushed from the right edge of the roadway and came toward us, (in a perpendicular path as if to cross the highway). It was so quick that the driver had no reaction time whatsoever! While the car missed this erect, but stooped, huge black form the trailer obviously got it. The trailer sounded as if it had exploded and I saw, in the glow of our brake lights, that the entire trailer became airborne and went about as high as the roof of the car! “What did we hit?” was the question yelled by the sleepy owner. The other sleepy passenger yelled, “What the hell?” The trooper calmly looked over at me and in an astounded voice asked, “What the hell was that? Did you see that?” I replied quietly, “I saw that and I have no idea what that was!” The owner asked from the back seat, “Was it a bear? I’ll bet it was a bear!” The trooper, in total agreement with me replied, “I don’t think so. It was too big!” Well, all the while we had been braking to a stop. We all got out, checked out the trailer, checked the passenger side of the car, looked for a corpse, looked for blood, looked for hair, but found nothing at all! The best I remember we even turned around and drove back past the point of impact but saw nothing! It will be passed off as a bear, (I am certain), but I do not believe a bear could possibly be that big, move that fast, or suffer that kind of impact without being injured. (Just my opinion) I have never thought about this being a bigfoot until a year or so ago and then it all sort of began coming together for me. (Whatever it was, it was huge, black, fast and one tough son-of-a-gun!)",
  "classification": "Class B",
  "county": "Suwannee",
  "state": "Florida",
  "latitude": 30.13156,
  "longitude": -82.96643,
  "location": "-82.96643,30.13156",
  "location_details": "A major two-lane heading south probably southwest of Live Oak, FL.",
  "temperature_high": 94.59,
  "temperature_mid": 86.23,
  "temperature_low": 77.87,
  "dew_point": 74.01,
  "humidity": 0.76,
  "cloud_cover": 0.34,
  "moon_phase": 0.47,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1008.47,
  "summary": "Humid throughout the day and partly cloudy in the morning.",
  "uv_index": 11,
  "visibility": 6,
  "wind_bearing": 247,
  "wind_speed": 5.05
}