{
  "id": "9862",
  "title": "While driving between Trinity River and Cleveland, couple has morning road-cross encounter",
  "date": "2004-11-26",
  "timestamp": 1101427200,
  "observed": "As a son of residents of Liberty County, I am reporting a possible encounter for my parents. Not clearly remembering which day, but it was early May when my parents seen something strange.  As they were traveling West from Romayor towards Cleveland on FM 787, they seen a large creature run swiftly across the highway into the woods. It was in the morning, around 9:00, when a huge brownish-red haired creature crossed 70+ yards in front of them.  As quickly as it happened, my father said it moved in a swift leaping motion. It had huge long arms, which one arm hit the ground to help it move faster. It had a wide, slouching, pear-shape body with long legs. Its fur or hair was brownish-red, like very dark and old dead pine needles. However, it was too far to describe or see its face. Describing the location of the encounter was near 4 miles west of the Trinity River. It was just a half a mile past the Rayburn town sign near a 100 yard stretch of woods and a pipeline trail. It was crossing from the North through the woods to the south which seems to be pipeline trail that leads to Highway 105. Not being sure on what they saw and being in a hurry had only made them slow down and look down the trail. However, there was no trace of it as they passed by. The next day I came over to visit and I remembered them telling me they had seen something cross them in Rayburn. They've told many family and friends and every time the story has been very accurate.  However, I haven't seen anything like that.",
  "classification": "Class A",
  "county": "Liberty",
  "state": "Texas",
  "latitude": 30.41667,
  "longitude": -94.86667,
  "location": "-94.86667,30.41667",
  "location_details": "Coming from Cleveland, travel East on FM 787 for 12 miles until you pass a green sign saying RAYBURN and the Rayburn Baptists Church.  Looking to the right there will be a pipline trail.  If you come to a steep hill and another sign that says DOLEN, you went too far.",
  "temperature_high": 71.7,
  "temperature_mid": 67.42,
  "temperature_low": 63.14,
  "dew_point": 55.63,
  "humidity": 0.79,
  "cloud_cover": 0.58,
  "moon_phase": 0.49,
  "precip_intensity": 0.0026,
  "precip_probability": 0.53,
  "precip_type": "rain",
  "pressure": 1013.72,
  "summary": "Mostly cloudy throughout the day and breezy in the afternoon.",
  "uv_index": 2,
  "visibility": 9.59,
  "wind_bearing": 153,
  "wind_speed": 10.18
}