{
  "reportId": "2461",
  "title": "",
  "date": "",
  "observed": "While backpacking near the horse trails and access point in the county below Brown County I experienced a confrontation with a bipedal primate. It was early March of 1998 and I was alone. Around seven oclock in the evening after hiking several miles I set up camp in a wooded area about 100 yds. from the horse trail. Darkness was descending quickly so I was in a rush to set up camp and prepare my supper. After gathering firewood and getting my fire started for light and cooking I suddenly began hearing leaves and brush rustling below me and to the east along a ravine that I camped above. At that moment I thought to myself that it was a bit early for mushroom hunters and probably to dark for them to see any. Perhaps its a deer? Anyway, I grabbed my knife for protection and grabbed the flashlight cautiously approached the ravine where the noises were coming from. I yelled out in the direction of the sounds and aimed my flashlight and to my astonishment viewed a very tall upright human looking being hiding behind a clump of trees close to the stream. The creature stood about seven feet tall as I could see his silhouette from the left side of the trees. He was leaning forward and exposing his head to view me. He or it was approximately 40 feet from my position and the light from my flashlight shined into its eyes.I could see that he had dark hair covering his Conical shaped head and dark eyes in the front of his skull. I knew immediately that this couldn't be a man. I was very frightened and yelled out again in hopes of scaring him off. He ran into the stream and away from me about 6 feet before ducking behind another tree. I continued to follow him with my flashlight and screaming at him with threats. This went on for 2 or 3 minutes before he took off running down the creek out of sight. The rest of the night I stayed awake near my camp fire fearing a return visit and waiting for daylight to return to my truck. I would have packed out that night, only my truck was in the direction that the hairy biped fled. And I was miles in.This entire situation was very frightening to me because I always thought that if Bigfoot existed it would be in the Cascades or the Canadian Rockies.",
  "classification": "Class A",
  "county": "Brown",
  "state": "Indiana",
  "location_details": "Near Bedford south of Brown County in the Hoosier National Forest.",
  "summary": ""
}