{
  "reportId": "1377",
  "title": "",
  "date": "",
  "observed": "I was riding in a car full of fellow teenagers out in the country just laughing, talking, and goofing around. It was a moonlit night, and we were foolishly driving without headlights, sometimes stopping, and then continuing on with or without headlights. The car was quite full with perhaps 6 people total in the car, three of which were in the front seat. I was sitting in the passenger seat nearest the door, and I remember having very little room to move. At one point we were driving very slowly with the headlights off, and then the driver suddenly turned the headlights on. I can't remember now if he had seen something or had just randomly turned the headlights on, but as he did, those of us in the front seat saw a huge beast coming up and out of a dry irrigation ditch. This was one of those big ditches about 6 or 8 feet deep and perhaps 10 feet wide. The creature was slightly in front of us and to the right of the car about 20 feet off the road. We were immediately stunned (mainly because we thought we were all alone out in the country), and so the driver hit the gas and we sped away. I don't think anyone got a very good look at it except me, due to the fact that I was pinned against the passenger door and window. I was so scared, but continued to look as we passed by. What I saw scared me beyond belief. It appeared to be a huge man with dark hair covering its body, and with a leathery face. We had obviously startled it too, because it stood still, it's eyes wide and it's mouth open, almost as if it was growling or screaming. I could not see what it did once we had passed. Discussion in the car afterward included talk of a werewolf or other horror film creature, or perhaps of a man dressed in a gorilla-like suit. This did not look like a costume to me, and if it was, the man underneath was very large, though I can't make any estimates on just how tall. At the time, we had not heard of Sasquatch, or if anyone had, it was not mentioned as a possibility. I only report this incident upon the urging of a friend, who has become interested in tracking Bigfoot sightings in Colorado. I personally dismissed the event as unexplained, though I did not feel it was a hoax.",
  "classification": "Class A",
  "county": "Weld",
  "state": "Colorado",
  "location_details": "Rural road in Weld County, just west of Greeley, Colorado",
  "summary": ""
}