{
  "reportId": "30645",
  "title": "Motorists have possible late night sighting south of Otterville",
  "date": "1997-10-11",
  "timestamp": 876528000,
  "observed": "It has been several years ago but I really feel the need to tell someone this story. Several years ago when I was in my mid twenties or so me and a friend saw something on our way back from dinner in Hardin. As we were driving (at night) we passed it on the side of the road. Our headlights hit it and I remember it's feet were straddling the white line on the side of the road. It's back side was facing us. So we never saw the front of it only it's backside. It was like it was bent over eating or picking something up and as we passed it stood up. I still have the vivid vision in my mind. When it was standing up straight, about where it's hips were, was as tall as the hood of my friends truck. Which was a small Ranger type truck. It had longer black looking fur. It had legs that seemed to have no shape. Just straight and long. She was driving and I said \"what was that!\" after we had passed it. She said \"I don't know!\" I said turn around! She said terrified \"No way!\". I then said \"turn around turn around\"! She did but when we went back there was nothing. We told some friends about the incident but got laughed at and teased. We decided that we would keep it between us. This is a true story. I never believed in bigfoot or things of that nature. But I can't help remember what I saw with my own eyes.",
  "classification": "Class B",
  "county": "Jersey",
  "state": "Illinois",
  "latitude": 39.02775,
  "longitude": -90.4049,
  "location": "-90.4049,39.02775",
  "location_details": "Between Otterville and Grafton.",
  "temperature_high": 83.56,
  "temperature_mid": 76,
  "temperature_low": 68.44,
  "dew_point": 61.84,
  "humidity": 0.72,
  "cloud_cover": 0.51,
  "moon_phase": 0.33,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.79,
  "summary": "Partly cloudy until evening.",
  "uv_index": 4,
  "visibility": 7.94,
  "wind_bearing": 142,
  "wind_speed": 8.27
}