{
  "reportId": "2464",
  "title": "",
  "date": "",
  "observed": "I'm a deer hunter and been hunting these woods for more than five years. I use the same tree stand every time I now every nuance of the area. What I'm trying to say is I was at the height of my senses and nothing was getting by me. I was standing in my tree stand my right hand holding my 12 gauge rifled barrel shotgun, when the creature let me know he had been watching me. I had been in the stand about 2 hours. The sound was the deepest, evil sounding voice I had ever heard. It started like a demon taking deep breaths, this really shook me up. Its voice seemed amplified in comparison to anything else I have ever heard. After the two deep exhales it started to snort and bellow unlike any thing I had ever heard before. My eyes never moved I watched the direction in which the sound was coming from, but it was getting dark in the woods so I couldn't see very deep in the woods but I did catch a glimpse or shadow of something about 7 to 9 feet tall standing upright, move swiftly. It was at this time my safety went off and I drew my weapon on the movement I tried to scope in whatever was out there. Once I was looking through my scope it bellowed even louder. I still couldn't get a clear fix on anything and I'm not the type of hunter that fires with out confirmation of a target, even though I was extremely scared. Never in my life have I been scared in the woods, especially when I'm holding such a powerful weapon. It was at this time it tore out of there sounding like I was right next to a clydesdale, over 400lb, animal, what ever it was. I have been too scared to go and see if there was any tracks but I plan to check sometime this week. What is really amazing is how something so big got right up next to me (with in 25 yards) and I never heard it coming, but when it left it was louder than a freight train. If it was trying to communicate with me it said everything really well, vocalizing right at me and making it known that this was its territory.",
  "classification": "Class B",
  "county": "Fountain",
  "state": "Indiana",
  "location_details": "Indiana, Fountain County, 8 miles northeast of Attica",
  "summary": ""
}