{
  "reportId": "28370",
  "title": "Memory told of a possible encounter and footprint found along Horse Creek north of Pawnee",
  "date": "1978-08-01",
  "timestamp": 270777600,
  "observed": "This was circa 1978. As my friend and I were walking from his house along his 1/4 mile driveway that meandered through the woods along side of the creek we had heard some odd noises that caught our attention. At this point, we had been running through the woods for a few years together, felt extremely comfortable in them and knew many sounds and sign. Neither of us could identify these sounds. I do not recall the sounds exactly, but, it seemed to be some tapping noise, somewhat subtle and not alarming, yet it seemed clearly something out of the ordinary. So we decided to hop the old overgrown fence which paralleled the driveway, penetrate the overgrowth and go into the woods to investigate. Heading in the direction from which the sounds had been coming we soon noticed that some of the patches of grass that had managed to grow under the canopy of trees was matted down. The matting looked quite fresh as all the blades were still quite green and showing no signs of atrophy or recovery. While clearly other patches of grass nearby were exactly as one would expect, not matted down. We then spread out a little bit as we normally did when investigating the woods. Shortly after this I spotted a footprint, classic human shape with five toes, in some dried mud. Clear as day, there it was. Unlike the fresh appearance of the matted grass, this had been here awhile as the \"mud\" which had originally received the print was now thoroughly dry.  I called my friend over while I looked at it thinking, this doesn't make any sense, who else would be back here and why would they be barefooted? We again spread out and now I was head down and focused on finding more foot prints. Shortly thereafter, I heard a crash in the trees and my friend yelled, \"Run, run for your life!\" And maybe it was this comment that etched the memory of that day firmly onto the memory banks. I could tell in my close friends voice that he was dead serious. For that matter, he was never a BSer anyway. I lit out of there, running through the underbrush, past trees and hopped the old fence at a faster pace before or probably since. Reaching the relatively safety of the clearing the driveway offered and turned and yelled encouragements for my friend to get out of there. I could see him now, emerging from the underbrush, the expressions on his face said this was no joke. Just as I saw him begin to emerge and before he hopped the fence a large crash of breaking timber happened from directly behind him. Although overgrowth was relatively dense, I could see he wasn't causing the sounds of the smashing logs. Something had apparently broken a good sized tree or log directly behind him. There was no mistaking the sound of it, or the movement in the undergrowth behind him and to his right, but, what it was remained shrouded by the forest growth.  He made it across the fence and upon reaching where I was apprehensively standing, snapped back around and we stood shoulder to shoulder peering into the forest both uncertain of what exactly had just happened. I do know these to be certain:  Fact: Unidentified sounds were coming from the woods.  Fact: The grass had the appearance of being freshly matted  Fact: There was what looked to be a human footprint completely intact and showed the entire outline of a foot with five toes. It seemed only 10-12 inches long  Fact: Something or somebody was smashing up some decent sized logs and it wasn't us.  Fact: Somebody who doesn't scare easy was sure spooked that day.  Fact: An Illinois State Trooper came out that day to investigate our story. The trooper seemed to lose interest when my friend said that whatever he saw was about 7' tall.  The Unknown:  Was it a hippy, hillbilly or prankster who simply liked to walk barefooted around woods that had old rusty barbed wire among other occasional rusty or sharp artifacts? Or was it a Bigfoot? This remains the unknown.",
  "classification": "Class B",
  "county": "Sangamon",
  "state": "Illinois",
  "latitude": 39.65749,
  "longitude": -89.56981,
  "location": "-89.56981,39.65749",
  "location_details": "Coming from Pawnee. Go North on Pawnee Rd. Turn east onto Delay Rd and follow until it ends. Go north 1/10 of a mile and turn right/east onto Lost 40 Road. Follow about a 1/2 mile and just before a bridge across \"Horse Creek\". There should be a driveway just to the west of the bridge and on the north side of Lost 40 Rd. This driveway leads back onto the old Lost 40 property which was some years ago bought out by the city of Springfield for the Lake 2 project. As such, this may be public land now.  The area of the sighting occured about 100 -150 yards up the driveway/north of Lost 40 Road just to the east of the driveway and west of the creek.",
  "temperature_high": 78.58,
  "temperature_mid": 74.45,
  "temperature_low": 70.32,
  "dew_point": 65.75,
  "humidity": 0.79,
  "cloud_cover": 0.81,
  "moon_phase": 0.93,
  "precip_intensity": 0.0126,
  "precip_probability": 0.63,
  "precip_type": "rain",
  "pressure": 1016.02,
  "summary": "Heavy rain overnight.",
  "uv_index": 5,
  "visibility": 7.17,
  "wind_bearing": 182,
  "wind_speed": 4.12
}