{
  "id": "691",
  "title": "",
  "date": "",
  "observed": "I already submitted a report of this incident but thought I'd provide a more detailed account of what happened after reading some of those submitted by others. And after searching my memory of 20 years ago a bit more thoroughly. Just after sunrise my wife and I were laying in our tent talking. The tent was situated in a clearing next to the Wilson River right along the edge of the tree line. We were the only people camping in this clearing and it was very remote from other camping areas, which is why we chose it. Off in the distance at an angle behind the tent and deep in the forest we heard what sounded like someone breaking large sticks or small logs against the trunk of a tree. We thought this odd due to there not being any trails or roads where we heard this. Why would anyone be out there? Also we were the only ones around to the best of our knowledge as this was not close to any campgrounds. The early hour also added to the strangeness of the sounds we heard. After maybe a couple of minutes of hearing this, the sounds became more intense and changed to what sounded more like very large branches being snapped and small trees actually being uprooted and pushed over. The sounds slowly moved towards us at this point. I thought there must be someone driving some kind of machinery through the forest and plowing over anything standing in the way. Perhaps a Cat being used to forge new access for a logging operation. As it got to within maybe 150 feet of our tent I realized there was no engine sound. It kept coming closer. When it got to within what sounded like 50 feet or so, the sound of trees being uprooted and broken stopped and was replaced with the sound of very heavy and slow footsteps still coming closer to the tent. The sound continued approaching until it was within maybe 3 or 4 feet behind the tent then it stopped as if examining our tent or just waiting. Unfortunately the tent had no windows to look out so we just laid there being as silent as possible while I clutched my hatchet and held my breath. I can't be positive because we were both very frightened by this point but I thought I could hear what sounded like something huge breathing just a couple of feet off the back of our tent. This may have been my imagination though. We were both petrified. My wife said she didn't hear breathing. After a pause of 15 to 20 seconds the footsteps began to angle off into the forest again. When the footsteps seemed to be 15 or 20 feet away, I quietly got up and crawled out of the tent to see what had made this racket. I walked around the back of the tent still clutching my hatchet and peered into the forest. It was too dense to see very far so I started to venture into the woods towards the direction of the footsteps which I could still hear fading off in the distance. I followed for 20 or 30 feet and could see nothing. That's when the fear got the best of me and I scrambled back to the tent.We remained in the tent for at least another hour before venturing out. I kept peering into the forest but didn't see or hear anything again. By now, friends who we were expecting began to show up so we felt a bit safer. When my curiosity finally got the best of me, I ventured into the forest towards the direction of the crashing and snapping sounds we had heard coming towards us. No one would come with me. After going for 50 or more feet in that direction, I came upon a huge tangle of fallen old growth logs with a very dense stand of smaller trees and dense underbrush on the other side where the sound had originated. Several smaller trees had been snapped off or pushed over. No machine could ever have crossed over the fallen logs, as they were several feet in diameter.And I know of no machine that makes footsteps. Then fear took hold again and I ran to the safety of the clearing without looking for footprints. I never went back into the forest the entire weekend after that. We could only explain what we heard as being a sasquatch. The only problem I had with this theory was that I has always thought if these creatures existed they would be very silent and reclusive avoiding humans whenever possible. Certainly not crashing through the forest like a bulldozer. These sounds were intentional. I can't say for certain what we heard, but I do know without any doubt that it was not a human, machinery, a bear, an elk, or anything else that might be commonly found in these forests. I've spent much of the last 20 years trying to come up with an explanation for what we heard. I have none other than a sasquatch. Why it made such a racket is beyond me",
  "classification": "Class B",
  "county": "Tillamook",
  "state": "Oregon",
  "location_details": "Along the Wilson River a mile or so below the Jones Creek campground",
  "summary": ""
}