{
  "id": "436",
  "title": "",
  "date": "",
  "observed": "Sunday night.  I came out of the house to smoke a cigarette; it was an exceptionally cloudless, cool evening.  As I entered the yard I was immediately aware of a loud din coming from the woods about 1/3 of a mile off.  The sound of barking dogs is not unusual and is often accompanied by wolves, but this night the barking/howling sounded frantic.  Above all of this noise was a loud wailing like nothing I had ever heard before.  The source of this wailing held its position for about two minutes and then proceeded to move northeast around the lake covering a long distance in a very short time with great disturbance to the underbrush followed by a violent crushing of ice which seemed to indicate that whatever it was tried to cross a part of the frozen lake.  Each cry was quiet powerful and the duration I would estimate at about 15 seconds.  After changing positions the sound did not die out but simply stopped at the edge of the lake.  Immediately the dogs stopped barking and the wolves howling.  Dead silence.  A few minutes later the woods erupted in a cacophony of barking, howling and now birds (loons and owls)!  The wailing did not start up again but you could feel that it's presence was still there.  Afterwards, as the days went by, I tried to discredit what I'd heard but the sound was so strange and awesome that I don't think I could be convinced that what I heard was not unique.  It was not a dog, wolf, bear, coyote, deer, bird, rabbit, llama, or wild cat. I grew up at this location and lived there from 71-89, then living there on and off for the next eight years.  Eventually I moved to San Francisco, but return to that place two or three times a year.  Throughout my residence, I and others have occassionally felt a heavy omnipresent dread and foreboding, and the feeling of being watched.  There are places in the forest no one ever enters because of this.",
  "classification": "Class B",
  "county": "St. Louis",
  "state": "Minnesota",
  "location_details": "Omitted to protect privacy of the few residents",
  "summary": ""
}