{
  "reportId": "1584",
  "title": "Loud knocking of wood striking another piece of wood",
  "date": "2000-03-13",
  "timestamp": 952905600,
  "observed": "R. and I were walking up the road at about 6:30 pm. We were doing a follow up investigation of the area after hearing of a sighting of bigfoot. We had some wood and paper but I forgot matches at the truck so we had to turn around and walk back to the truck. We had walked through a half mile of woods and through a clearcut about half mile wide. On the way back to the truck and upon leaving the clearcut and entering the woods, I felt the hair raise on the back of my neck and I thought it might be because it had gotten dark and my senses were playing tricks on me. But after walking through the woods a quarter mile and getting closer to the truck, we both heard very distinct and loud knocking of a piece of wood striking another piece of wood about 12 - 15 times. The noise was coming from near my truck. Then we heard two more and it stopped. We got to my truck and I realized I had left my dome light on. We grabbed my spotlight and waited near the truck for a half hour to hear more knocking and we also knocked two pieces of wood together ourselves but couldn't get a reaction. I shined the spotlight into the forest and suddenly we heard what sounded like a big man take off at a sprint though the woods. I know what deer and elk sound like and this sounded like two feet running through the woods at a sprint. This was no deer or elk. My heart started pounding. We waited at the truck until 8 pm when another truck came down the road so we left. We didn't hear anything else but noticed the dogs would start barking in certain areas and then stop but I didn't think that was significant evidence of anything unusual.",
  "classification": "Class B",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 47.00444,
  "longitude": -122.5386,
  "location": "-122.5386,47.00444",
  "location_details": "",
  "temperature_high": 55.81,
  "temperature_mid": 49.845,
  "temperature_low": 43.88,
  "dew_point": 40.29,
  "humidity": 0.83,
  "cloud_cover": 0.88,
  "moon_phase": 0.27,
  "precip_intensity": 0.0235,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1017.32,
  "summary": "Rain starting in the afternoon and breezy overnight.",
  "uv_index": 2,
  "visibility": 7.89,
  "wind_bearing": 174,
  "wind_speed": 3.42
}