{
  "id": "56480",
  "title": "Men have early morning sighting on way to job site near Manchester",
  "date": "2016-11-21",
  "timestamp": 1479686400,
  "observed": "Ok so I would like to keep this somewhat discreet because my family still to this day use what I told them as a joke against me and I don't need everyone in my town talking about me cause this just sounds ridiculous. This happened near Toms River NJ. Me and my buddy were on our way to a job in Browns Mills and we're traveling down route 70 which is known as the pine barrens. It was sometime between 6/7 am and about 7 deer came shooting out from the right side going left across route 70. I didn't slam on brakes cause it was like 50 feet in front of us but I stopped pretty fast and I kid you not there was a big hairy grey and brown thing that came running right up to about 3 feet from the pavement and it stopped and turned around and ran the other way back into the woods. Since I seen this I started watching that finding Bigfoot show but their videos and pics are always something black. This thing was light grey and brown and it was huge! I mean huge like 8 foot tall and big like fat big. It could not be a guy cause it had like hair all over its face! Like I didn't even see its eyes or lips or nose.  It was like hair for a face. We seen this thing at about 25/35 feet. I know it was real cause my man was like totally in sync with describing it to each other. It was all we talked about the rest of the way to the job. It was like what I was thinking he was saying and vice versa.  This was two months ago and that was it. Hope this helps you!",
  "classification": "Class A",
  "county": "Ocean",
  "state": "New Jersey",
  "latitude": 39.98216,
  "longitude": -74.36187,
  "location": "-74.36187,39.98216",
  "location_details": "U can post it and if u wanna call me cool but I don't want my full name involved in anything. I'm stressed enough and don't need any more smart jokes.",
  "temperature_high": 44.18,
  "temperature_mid": 41.095,
  "temperature_low": 38.01,
  "dew_point": 20.67,
  "humidity": 0.45,
  "cloud_cover": 0.25,
  "moon_phase": 0.76,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1007.8,
  "summary": "Breezy throughout the day.",
  "uv_index": 1,
  "visibility": 10,
  "wind_bearing": 281,
  "wind_speed": 18.33
}