{
  "id": "1591",
  "title": "Sounds heard answered by another more distant source",
  "date": "1996-01-01",
  "timestamp": 820454400,
  "observed": "From 1/01/96 to 8/22/98 I have heard the sound that was broadcasted on the segment of Evening Magazine, 3/02/99, regarding the Bigfoot investigation. I have worked extensively with exotic animals and lived in the wilds of Alaska, Colorado and Washington. I know that the cries I have heard while living at my current address are unlike any I have ever heard in my life. The only other time that I have heard anything similar was when I tuned into last nights program and listened to the recording that was replayed by the investigators in Aberdeen. I was relieved to know that what I heard was not my imagination and I could discontinue coming up with feeble excuses to explain what the noise was. The cries always occurred late in the evening, west from where I live. I am situated on top of Peacock Hill just north of Gig Harbor. Always the cry was answered by another one in the distance. One evening it was so close that it woke me up from a deep sleep. Unfortunately my dogs were awakened by it too and ran outside to silence it. I wish that I had had the sense to record it. You would find it identicle to the recordings you have now. Every evening I listen for it. My bedroom window faces the direction of where the cries came from. I keep it opened all night and have a recorder by my bed.",
  "classification": "Class B",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 47.3724,
  "longitude": -122.5819,
  "location": "-122.5819,47.3724",
  "location_details": "",
  "temperature_high": 49.78,
  "temperature_mid": 48.255,
  "temperature_low": 46.73,
  "dew_point": 44.75,
  "humidity": 0.92,
  "cloud_cover": 0.97,
  "moon_phase": 0.38,
  "precip_intensity": 0.0006,
  "precip_probability": 0.6,
  "precip_type": "rain",
  "pressure": 1027.87,
  "summary": "Overcast throughout the day.",
  "uv_index": 1,
  "visibility": 7.85,
  "wind_bearing": 164,
  "wind_speed": 4.84
}