{
  "id": "33789",
  "title": "Memory told of a close encounter while frogging at night on the upper St. Johns River",
  "date": "1990-11-23",
  "timestamp": 659318400,
  "observed": "I was flipping threw the channels last week watching some late night TV when I saw a program called Finding Bigfoot.It brought me back to the day my mind about that giant changed for me.I only told my mom what I saw.It really changed my life about the unknown.I was running my airboat on the upper St. Johns River doing what I like to do best frog jigging on a Friday night. It wasnt the first time I was out on the river at night,I use to run the north and south parts of the river all the time.I still do just at night I make sure I have a running buddy with me.Anyway I was coming up on the oak's.The oaks are located right next to Duda's property.Just a wee south of Lake Winder. I figured I would pull up into the oakhead and drink a few cups of joe before I started to gig.Out of the corner of my eye I saw something bolt into the cabbage palms.I figured it to be a hog,I really did not know what it was the last thing on my mind was it could of been the big guy.Anyway I ran up on dry ground about 15 yards spun my boat around so it was pointed toward the river and shut it down.I just poured a cup of joe when I herd something about 10 yard behind me.It sounded like it was wrestling with a cabbage palm.Or maybe rolling around in a bunch of palms.Then out of know where I herd a thump right next to me boat.I looked but did not see anything then again I herd it behind my boat then something hit my rudders I turned on my head lamp and saw mud on my rudders I then saw a bunch of mud fly over me and hit my bow I shined my light in the direction of where it was coming from and I saw his face.I lost all feeling in my body I just about passed out I was lost I didnt know what to do.I was in total shock.I just about peed my pants I was so scared.I never in my natural born life moved so fast to crank my boat and got the heck out of there.I almost sank my boat when I hit the river. I just went north knowing I would be in the lake.I was scared to drive home so I parked in the middle of Lake Winder and took a few sips of drink to calm my nerves and try to talk my self out of what I saw,I stayed there untill first light.When I got home I went and seen my mom and had to tell her what I saw. I told her the story because it scared me so.I am a man and I am tuff but that scared the living heck out of me.I figured I should share my story just like others are on that tv show.",
  "classification": "Class A",
  "county": "Brevard",
  "state": "Florida",
  "latitude": 28.20954,
  "longitude": -80.83882,
  "location": "-80.83882,28.20954",
  "location_details": "The Oak's Upper St.Johns River",
  "temperature_high": 76.49,
  "temperature_mid": 69.82,
  "temperature_low": 63.15,
  "dew_point": 62.37,
  "humidity": 0.79,
  "cloud_cover": 0.9,
  "moon_phase": 0.19,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.21,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 7.33,
  "wind_bearing": 250,
  "wind_speed": 4.45
}