{
  "reportId": "26566",
  "title": "Man observes tall, white hair-covered creature during a family gathering near Lake Ontario",
  "date": "2003-09-20",
  "timestamp": 1064016000,
  "observed": "My family had moved from the city of Rochester to Wolcott, a small town about 50 miles east of Rochester in July 2003. We were living in an old farmhouse on approx. 77 acres of woods & creeks near Lake Ontario. This incident happened sometime between the 18th-20th of September. My sister's birthday is the 20th and I recall a small group of family and friends were visiting the house for that occasion. My future-stepfather took a small group, including his brother, my four sisters, and a few other friends out for a \"tour\" of the property. I was not present, I had stayed behind at the house. As the group returned to the house, my stepfather lingered behind in an area of the property where a strip of woods runs between two fields. My stepfather was in the field closer to the house, we'll refer to it as field #1. He noticed to his left something in the woods and turned to see a tall, white, hair covered creature standing just off the path in the woods. He ran ahead and told his brother, but did not tell the rest of the group. His brother rushed into the house to get me, telling me that something was in the woods and I should come see. I followed him outside where my stepfather relayed the story to me and the three of us walked back to the area of his sighting. As my stepfather showed me the spot where the creature had been standing, we all noticed that the creature was still present, but had moved further back, to field #2. At this point, the three of us were standing in field 1 and looking through a small strip of trees at the creature in field 2, maybe 200 yards away or so. My observations of the creature are as follows: It was approximately 7' tall, covered in hair, white but with a dark area on the face, think and lanky, with a head that came to a slight conic shape. It was too far to distinctly see its face but there was a definite darker colored area where the face would have been. The creature was clearly observing us, as it paced back and forth, looking around trees, standing up taller, ducking down, etc. to get a better look at us. After approximately 45 seconds, the creature retreated to an area where we couldn't see it clearly. I walked through the trees into field 2 to get a better look at it, but it had disappeared. The area where it had been walking was matted down, but there were no distinct prints. Judging by nearby trees, I estimated its height to be 6.5 - 7 feet.",
  "classification": "Class A",
  "county": "Wayne",
  "state": "New York",
  "latitude": 43.27314,
  "longitude": -76.89331,
  "location": "-76.89331,43.27314",
  "location_details": "East on Route 104, near town of Huron.",
  "temperature_high": 67.62,
  "temperature_mid": 58.16,
  "temperature_low": 48.7,
  "dew_point": 54.06,
  "humidity": 0.75,
  "cloud_cover": 0.48,
  "moon_phase": 0.81,
  "precip_intensity": 0.0006,
  "precip_probability": 0.21,
  "precip_type": "rain",
  "pressure": 1020.75,
  "summary": "Partly cloudy until evening.",
  "uv_index": 4,
  "visibility": 9.53,
  "wind_bearing": 253,
  "wind_speed": 8.73
}