{
  "reportId": "60",
  "title": "Missing Cattle and large footprints found",
  "date": "1994-05-13",
  "timestamp": 768787200,
  "observed": "These two gentlmen, brothers, recluses age 50's phoned me and explained these events. They own and operate a cattle ranch. They have over 200 acres of interspersed Old growth Douglas Fir and graze. There is virtually no access (by vehicle) to their land, because of swamps, creeks and no roads, except the drive onto the innitial property. I have hunted the area around their place and know it well. Also locals would not venture on their property because of their reclusness and temperment - this is why I rule out fowl play! During the months from MAY thru early JULY they (the brothers) had been experiencing calv's missing from herd.The herd numbers over 200 head I believe and the weight of the calv's that turned up missing from time to time during this 3 month time frame,were 300 - 400 lb. calv's. No blood, no body parts at all were ever found,just missing cattle.The brothers also stated that the cattle would always come running to the brothers when the cattle saw them in the pasture to round them up for the evening feeding, but the brothers had noticed that when the events, early on, started happening the cattle, upon seeing the brothers - at a distance, 100 yards or more would run in panic. Immediatly I could see the \"Possible\" reason why, being that the brothers were bipedal in nature also. After a couple of years, and this occured the same time -may thru july, the third year on e evening on a round up the brothers finally found a calf that had just been killed and left. They determined it must have just happened because it was warm. They also felt that they showed up and probably scared off what ever had done this because, an animal had never been left before! A vet, among other qualified persons had a thoruogh exam of the calf. It was skinned, there were no teeth marks, there were no claw marks. The animal was killed by having it's neck broke. Now this calf was in the 300 - 400 lb. range, I don't know any man thats man enough to take on that feet. The examiner also found a very obviouse and DEEP bruise mark running in a 45 degree anle from spine down along rib cage. The out side lines of bruise were very paralel to each other and 6-8in. apart. Like something had kicied the cow in the ribs or hit it with a post, tree whatever that was 6-8 in. wide. That would take alot of POWER. Besides, the blood bruise extended all the way into the inside of the rib cage. Analysis of the lung indicated some sort of respitry ailment or disease assosiated with cougars or the Feline species. How ever no bite marks or claw marks were found anywhere on the animal. Tracks were also found, 3 sets total. Two were from an adult, one set 17in. the other 15in. The third set was much smaller 10in.",
  "classification": "Class B",
  "county": "Skagit",
  "state": "Washington",
  "latitude": 48.64056,
  "longitude": -121.8053,
  "location": "-121.8053,48.64056",
  "location_details": "Up the Baker hwy., about 12 miles north from Hwy 20.",
  "temperature_high": 57.99,
  "temperature_mid": 50.77,
  "temperature_low": 43.55,
  "dew_point": 44,
  "humidity": 0.72,
  "cloud_cover": 0.83,
  "moon_phase": 0.09,
  "precip_type": "rain",
  "pressure": 1018.03,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 8.91,
  "wind_bearing": 205,
  "wind_speed": 3.38
}