{
  "reportId": "20363",
  "title": "Campers describe a possible approach to a camp near Lake George, Adirondacks",
  "date": "2001-08-15",
  "timestamp": 997833600,
  "observed": "I was camping with my wife and two other couples at Jabes Pond, Hague, New York (near Sabbaths Day Point), Adirondacks. We were having a great time. Yes we were drinking.The time was between 3:00-3:30am.  Four of the six campers hit the sack just before 3:00am. Let me paint a picture  of the environment. The lake is shaped like an L on top of a small mountain, surrounded by pine trees, crystal clear water. There is a swamp on the northwest side of the lake. It's a gorgeous place. The six of us canoed out to the camp site, only three maybe four sites on this lake.  No other campers were there. We did what all young campers do -- build a big fire, drink, eat and be loud.  We were doing this till about 2:30AM. Then the girls went to bed. There was only two of us standing. We were stuffing our faces before we went to bed. I walked down to my tent.The tent was set up right on the lake shore, I mean one maybe two feet away from the water. The tent is square and flares inward at the chest level. Two of the four sides of the tent were facing water. So I climb into the tent and as I am just about to lay next to my wife my wife says, \"Steve, Steve, Steve!\"   My head hits the pillow and I am looking up into the tent. I hear water splashing next to the tent and my wife says something is out there. I hear branches being moved and what ever is out there is behind our tent.  I WAS FREAKING OUT. I am laying on my back in the sleeping bag and I look up and I see an elbow being draged down the side of my tent. I am shiting my pants, then I hear thud, thud, thud, thud, thud of something running away. NO MORE ROOM TO WRITE",
  "classification": "Class B",
  "county": "Warren",
  "state": "New York",
  "latitude": 43.7268,
  "longitude": -73.52,
  "location": "-73.52,43.7268",
  "location_details": "follow split rock road, turns to dirt, fork in road bear left, keep going into the woods, easy to find",
  "temperature_high": 80.42,
  "temperature_mid": 67.02,
  "temperature_low": 53.62,
  "dew_point": 51.19,
  "humidity": 0.65,
  "cloud_cover": 0.09,
  "moon_phase": 0.87,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.63,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 9.59,
  "wind_bearing": 161,
  "wind_speed": 2.41
}