{
  "reportId": "33559",
  "title": "",
  "date": "",
  "observed": "Reading another report of a Bigfoot sighting in Delta County, MI 1982 has prompted me to report the following. My family has property in Delta County (near Cornell - UP Mich).  One evening during hunting season (November 1982) I was at the camp alone.  It was approximately 11:00 at night.  We had no electricity and was playing solitaire with a kerosene lamp for light and a wood stove for heat. I was planning on spending night and getting to my hunting blind in the morning. A fairly loud \"whack\" startled me. Something had hit the window/screen behind me.  I turned around and looked at window but I couldn't see anything.  I walked to window and peered outside but it was dark and couldn't see anything.  I figured it was just \"the wind\" or something so sat back down.  A few minutes later it happened again.  Another fairly good \"whack\" to the window.  This startled me even more.  I started to think possibly someone was playing a practical joke on me.  The camp is approx 30-40 feet from any trees and no branches could be \"brushing up against\" the cabin. There is an apple orchard near it. Maybe 100 yards away. I shined a strong flashlight outside and couldn't see anything. After a couple of minutes I closed drapes as tight as I could and sat back at table with loaded rifle next to me. A few minutes later I heard a large whack against the window and also multiple whacks and hits, dragging down the side of the camp!  This flat out scared me and I grabbed my rifle and yelled as I walked out the door with flashlight in hand.  I circled the camp a couple of times calling out.  (saying things like \"who's out here?!\"  If you are playing around you need to be careful because I will shoot your *$$!\"). Well I was scared. I packed my things and locked up camp and left that night.  The gate (about a 1/2 mile or so from camp) was still locked.  (you needed a key to get onto property). I don't have any idea what/who did that but a bigfoot sighting 1 month earlier/same year (nearby - within a mile) reported here on this site prompted me to post this report. Maybe relevant (maybe not). Also - I think I will mention this...perhaps it has no relevance to Bigfoot.  The same year out in my blind I heard a really strange sound.  It sounded kind of like an elephant trumpeting.  It was probably about 50 to 60 yards behind my hunting blind. I have never heard of a bigfoot making that kind of sound but that is as close as to the sound I would describe it.  It didn't sound exactly like an elephant trumpeting but close.  I heard it twice.  Once close and then one more time further in the distance. Very weird but  -  that's what I heard and that's the best way I can describe it.  Very loud.",
  "classification": "Class B",
  "county": "Delta",
  "state": "Michigan",
  "location_details": "North from Escanaba on County Road 426 to around E Rd",
  "summary": ""
}