{
  "reportId": "46401",
  "title": "",
  "date": "",
  "observed": "This statement is true & accurate to the best of my recollection.  This incident happened on Monday following the 4th of July weekend of 2014 after my wife, daughter, son in-law & grand kids left our cabin in Kalkaska for home which is 180 miles south (of the cabin) in Laingsburg, MI.  My son age 21, who was a real disbeliever in bigfoot, stayed behind with me.  As soon as they left, I mixed bleach & water in a pump sprayer & started bleaching our cedar log cabin.  I thoroughly rinsed the bleach off with a garden hose after about 10 to 15 minutes. I like to do this a week or two before I put the finish sealer on it.  It was getting late in the day, there was about a half hour to 45 minutes of daylight left, when I heard what sounded like a stone or something hitting a fallen over shed that was to my left & behind me about 10 to 15 feet away. That caught my attention right away because I had thought just before that something or somebody may be messing with me because as I would turn to my left to reach down to pump more pressure in the pump sprayer I noticed a small stone about the size of a nickel slowly come to rest a couple of feet from my pump sprayer. I took a long steady look around me & saw nothing that stood out, but I was on a mission - I wanted to get the cabin bleached so I could leave for home. I then started the generator to get the water pressure up so I can rinse off the bleach.  I grabbed the hose & started rinsing.  The hair on the back of my neck stood up. I would often turn & look real quick behind me and then I seen the ferns parting, coming in my direction but not directly at me & a stone came to rest. I thought maybe my son might be messing with me because I have told him about a lot of strange things that have happened up here. So I yelled for him to knock it off. Then it happened again, another stone & another.  I went around to the front of the cabin to shut off the generator which is on the front porch.  I noticed my son was sitting in my truck about 30 feet away from the opposite side of the cabin where I was rinsing the bleach off, messing with his i-phone with the window up. I shut off the generator & was walking towards the truck as a stone hit & rolled off the front porch. I rushed to the truck to get him to get in the cabin. He thought I was joking at first. Then he seen I was serious then he experienced it himself. We got in the cabin, it was last light, I could still see out the windows and stones were still being tossed & now they were hitting the cabin but not hitting the windows. As I sat at the dinning room table I seen something large & dark move fast from the other side of my driveway to behind my truck. I grabbed my 44 mag,  reached in my pocket and sounded the truck alarm to scare it off.   By then it was real dark out so I closed the drapes. My son went to his bedroom and his bedroom wall was hit. The cabin was at times being hit by stones on at least 3 sides within seconds of each other. There had to be at least 3 throwing stones. My son was terrified. I immediately called Kim Fleming, she was there earlier just after my family left for home. My son counted at least 19 stones hitting the cabin, it is not uncommon to have my walls or door hit very hard & I mean whopped hard after dark, it will shake the log cabin & it scares the HELL out of anyone there. I bought the property in 1986, had a 25 ft. travel trailer there until I built the cabin in 1995-96    I have a little over 47 acres there. Lots of bears & cedar swamp.",
  "classification": "Class A",
  "county": "Kalkaska",
  "state": "Michigan",
  "location_details": "(Specific directions omitted for privacy reasons.) Cabin is set back off the road on the left side.",
  "summary": ""
}