{
  "reportId": "721",
  "title": "Series of reports (6) concerning the Skunk Ape.  Photos of the creature and footcasts",
  "date": "1997-07-17",
  "timestamp": 869097600,
  "observed": "DATES: (#1) 7-16-97 at 2:00 pm, (#2) 7-18-97 at 2:30 pm, (#3) 7-21-97  Between 7:20 am & 7:45 am, (#4)  7-21-97 at 7:45 am (#5) 7-24-97 (#6) 8-17-97 Steve Goodbread is a tour guide for Pelican Tours. On Wednesday 7-16-97 around 2:00 pm, Goodbread was driving a tour bus, with a group of tourist, along  Turner Road.  Goodbread arrived at an area where there is a burned out wooden  bridge across the canal on the east side of the road.  Goodbread and the tourists observed a large brownish colored creature behind some brush near the bridge. The creature continually stood upright on two legs, was approximately 7' tall, had hair covering it's entire body (except for the face) and was rocking back & forth.  Goodbread advised that the creature resembled a gorilla. Goodbread indicated that the creature was shaking the bushes and appeared to be irritated by their presence. The creature was approximately 70 to 80 yards away. Goodbread continued to watch the creature for about 15 minutes.  Goodbread repeatedly eased the tour bus forward and backward so as to allow visibility, of the creature, to everyone on the bus. Goodbread attempted to get one of the tourist, with a telephoto lens on her camera, to exit the bus and take photographs of the creature. No on would get off the bus. Goodbread now feels that exiting the bus might have been a bad idea. Goodbread finally drove away, leaving the creature at this location.  Goodbread later returned to the area and found a road where he could drive into the swamp. Goodbread did not locate the creature again. Goodbread feels that the creature might have been a hoax but states that it would be nearly impossibly for a human to withstand the heat, at that time of day, in a suit. This is also an area that is heavily populated by alligators. Goodbread states that they have been observing a large number of  deer and hogs moving out of the swamp because of the high water. Goodbread feels that he is in a little disbelief of what he saw, although  he believes in the possible existence of the skunk ape, and prefers not to associate the creature with his tours. Dow Roland is a tour guide for Everglades Day Safari. Rowland was driving a tour bus on Friday 7-18-97  around 2:30 pm , with a group of tourist, along Turner Road. Roland observed a brownish colored bipedal creature about 300' west of the  road, at the edge of the brush. Roland described the creature as being  approximately 7' tall, long brown hair, standing upright when walking or  running, having a smooth face and resembling a gorilla.  Rowland's observation, of the creature, was brief before it ran into the brush. Rowland's initial thought was that it was someone in a gorilla suit playing a prank.  Rowland was on his return trip at the time of this sighting.  A few minutes later Rowland returned to the same area, on Turner Road, with another group of tourists. Rowland was near the area where he had first observed the creature. Rowland again observed the creature on the west side of Turner road. This time the creature was approximately 150' from the road and again the observation was brief before the creature ran into the brush. The creature appeared to act  nervous. Rowland believed this to be the same creature that he had previously observed. Rowland indicates that he was still shocked and  in disbelief that this could be a real creature. Rowland finished the tour without observing the creature again.  After completing the tour, Rowland retrieved his camera and returned to the area on Turner Road. Rowland drove up & down Turner Road but was unable to locate the creature. Rowland was driving south near the area of his other sightings, preparing to give up his search, when he observed a white convertible driving north. The convertible passed him and continued north bound.  Rowland looked in his rear view mirror and observed the convertible stop suddenly then drive off. In an instant Rowland observed the creature appear at the west edge of Turner Road, approximately where the convertible had stopped. Rowland turned around but the creature had again disappeared into the brush. Rowland was unable to locate the creature again. The next day, on Saturday 7-19-97, Rowland told David Shealy of  his observations. David Shealy is the owner/operator of the Florida Panther Gift Shop located on Highway U. S. 41 one mile west of Turner Road. Jan Brock is a Collier county realtor who lives in the area of Ochopee,  Florida.  On the morning of Monday 7-21-97 Brock was traveling south on Burns road, sometime just prior to 7:45 am, in route to work.  Brock traveled through this location just prior to Vince Doerr.  Brock was approximately 2 miles north of U. S. 41 when she observed a creature, that she indicated was approximately 1000 feet in front of her car, cross the road.  Brock first observed the creature at the west edge of the road.  The creature crossed the road, heading east, and disappeared into the thick brush and trees on the east side of Burns road.  Brock described the creature as about 7' tall, covered with a furry coat of thick dark brown hair and what appeared to be a patch of off-white or light colored hair on it's chest. Brock explained that she has often times traveled the roads, observed the wildlife, and has seen numerous animals in the Everglades.  Brock compared the light colored chest patch, on the creature, to similar coloration that she has observed on bears that have been laying on the local limestone roads.  Brock further explained that this creature was definitely not a bear, that it's legs were too long to be a bear and that it walked upright the entire time of her observation. Brock recalls that she noticed that the creature looked in her direction but she was too far away to view the physical characteristics of any facial features.  Brock drove to the location, where the creature had crossed, and stopped her car.   Brock rolled her window down part way but did not exit her vehicle.  Brock looked around for the creature and for signs of any footprints.  Brock was unable to observe any further signs of the creature.  Brock commented that she had heard of the pungent odor, reportedly emitted by the Florida skunk ape, but she did not smell anything abnormal.  Brock drove on to work without any other sightings.  Brock's family has owned property, in this area, for many years.  Brock used to bring her children, when they were young & before they built a house there, to the area for picnics and weekend camping trips.  This would have been in the late 1960s.  Brock explained that her children would often claim that they saw a bigfoot creatures around their property and in the swamps.  Brock advised that her family has never been bothered by the creatures.  Brock does believe that the creatures exist and does not fear them. On  7-21-97, Vince Doerr, driving south from his home toward U.S. highway 41 in route to work, observed a Skunk Ape cross the road approximately 600' to 800' in front of him. The creature was moving from east to west at a slow pace. The witness arrived at the crossing sight, exited his vehicle and took a photograph, of the creature, approximately 80 yards away in the swamp. The picture is of the rear and upper torso of the creature. The creature was approximately 7' tall, bulky, reddish dark brown in color and continuously walked upright.  This photo is not entirely clear, the alleged creature is circled in the center of the photo.  In the future the BFRO will be doing enhancements on the photo, we will update the report when the enhancements are complete.   David Shealy learned of fire chief Vince Doerr's sighting, and associated it with what Dow Roland had told him earlier.  On Thursday 7-24-97 Shealy went to the area, on Turner Road, where the creature had been observed. Shealy is a long time resident of the area and is familiar with the swamp. Shealy began searching the area.  He found, what he believed to be, hair on some brush. The brush was along side a path. The hair was brown  in color and approximately three inches in length. The hair was later lost. (The information can be explained by the researcher.) Shealy located several large tracks in the area. Shealy was able to take plaster casts of two of the tracks. The footprints measured  approximately 13.5\" in length, approximately 6\" in width at the toes and approximately 3\" in width at the heel. (The researcher, in this case, has examined and photographed the plaster casts.) A couple (names confidential) was out watching birds and wildlife when it began to get dark. The couple prepared to leave the area and turned on their headlights. They were traveling north on Turner road when they observed a creature cross the road approximately 100 to 200 yards in front of them... They drove to the area of the crossing and turned their vehicle towards the west side of the road, in the direction that the creature had traveled.. As they turned their car, the headlights caught an object about 30 yards from the west side of Turner road. As the couple looked closer, they realized that it was a very dark complexioned man-like creature that they described as being well over 7' tall, 300 to 400 pounds and looking like a linebacker for a football team.... The creature constantly kept it's back to the vehicle and moved out of the headlights... As the couple moved the car, to place the creature back in the headlights, it again moved out of the light... The couple became concerned and left the area... When the couple were asked about further details, of the creature, they advised that they never saw the face and were unable to advise as to body hair.  The couple reported this information to a local wildlife naturalist and tracker... The couple refused to give their names or any contact information, advising that they did not want to be harassed.",
  "classification": "Class A",
  "county": "Collier",
  "state": "Florida",
  "latitude": 25.91695,
  "longitude": -81.29691,
  "location": "-81.29691,25.91695",
  "location_details": ": (#1)Ochopee, Florida... Collier County... east side of Turner Road..  1 & 1/2 to 2 miles north of  highway U. S. 41... at a burned out wooden bridge located on the east side of Turner Road... two miles west of Burns Road... three miles east of junction highway 29...east of the Turner River (#2)Ochopee, Florida.. Collier county... Burns Road... 1 & 1/2 mile north of U.S. highway 41... two miles east of Turner Road... five miles east of US. highway 29 (#3) Ochopee, Florida.. Collier county... Burns Road... 1 & 1/2 mile north of U.S. highway 41... two miles east of Turner Road... five miles east of State highway 29 (#4) Ochopee, Florida... Collier County... west side of Turner Road...1 to 1 & 1/2 miles north of  highway U. S. 41... south of burned out wooden bridge located on the east side of Turner Road... two miles west of  Burns Road... three miles east of junction highway 29...east of the Turner River (#5) Ochopee, Florida... Collier County... west side of Turner Road...1 to 1 & 1/2 miles north of  highway U. S. 41... south of burned out wooden bridge located on the east side of Turner Road... two miles west of  Burns Road... three miles east of junction highway 29...east of the Turner River (#6) Ochopee, Florida... Collier County... Turner road..... 3 to 4 miles north of Highway U. S 41",
  "temperature_high": 90.47,
  "temperature_mid": 83.975,
  "temperature_low": 77.48,
  "dew_point": 74.14,
  "humidity": 0.78,
  "cloud_cover": 0.45,
  "moon_phase": 0.41,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.66,
  "summary": "Humid and partly cloudy throughout the day.",
  "uv_index": 10,
  "visibility": 9.3,
  "wind_bearing": 92,
  "wind_speed": 3.28
}