{
  "reportId": "13699",
  "title": "Possible knocks heard near the Flat Tops Wilderness area of White River National Forest",
  "date": "2005-10-17",
  "timestamp": 1129507200,
  "observed": "My father and I were elk hunting in October 2005 in the White River National Forest near the Flat Tops Wilderness.  This area is in Rio Blanco county outside of Buford, CO.  My father has hunted there most years since the 1970's.  I have been a dozen or so times since the 80's.  The area is along the [edited] at about 10,000 feet.  Very remote, few hunters.  We backpack in and camp in the primitive style.  Our site is [edited]. My father killed an elk and asked if I could meet him one morning to dress it and haul it down a steep slide.  The slide is an open area that extends up the side of a mountain about 1/2 mile.  It is steep and as a result has a central corridor that is devoid of trees.  It is surrounded on both sides by dense forest growth.  It is rocky and very rugged. I met him one morning at about 1030 am to help out.  When I arrived he told me he had heard a series of very loud knocks sometime before I arrived.  He said it was up the slide toward the rim and the flat tops area on the top of the mountain.  He said that they were very loud and sounded like a man hammering on a tree with a hammer.  He said that the knocks were so unusual, he thought I was up above him messing around with him.  I told him that I had not been, and then jokingly commented that bigfoots are   said to make sounds like that. Anyway, we started working on the elk and I was there about a 1/2 hour when we heard the knocks again.  This time, they were to our left (south), at the same elevation on the moutain we were on.  They came from dense growth and seemed to be no further than 100 yards away.  There were 8-10 knocks, very rythmic, and quite loud.  They were strange and obviously not made by anything we could identify (unless it was a 200 pound woodpecker).  They sounded like a rock hit against wood -- very clear and crisp.  No other unusual sounds.  We have had a couple other unusual occurances and perhaps I will submit them.  At any rate, I checked your site and to my suprise, found that the knocks on your \"Whoops and Knocks\" sound bite are hauntingly similar.  Best Wishes!!",
  "classification": "Class B",
  "county": "Rio Blanco",
  "state": "Colorado",
  "latitude": 40.00385,
  "longitude": -107.4381,
  "location": "-107.4381,40.00385",
  "location_details": "(edited at request of witness and for further investigations)",
  "temperature_high": 64.29,
  "temperature_mid": 48.96,
  "temperature_low": 33.63,
  "dew_point": 33.23,
  "humidity": 0.61,
  "cloud_cover": 0.04,
  "moon_phase": 0.51,
  "precip_intensity": 0.0001,
  "precip_probability": 0.28,
  "precip_type": "rain",
  "pressure": 1021.07,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.98,
  "wind_bearing": 150,
  "wind_speed": 0.36
}