{
  "reportId": "2379",
  "title": "Man recalls childhood experience with bigfoot",
  "date": "2003-10-22",
  "timestamp": 1066780800,
  "observed": "Our family has some property down in deep East Texas at the top of what is called the Piney Woods region.  We have about 200 acres with open pasture fronting a farm-to-market road and pushing back into the middle of the property and heavy woods in a U shape on the sides and back into the back of the parcel.  There are two stream that originate on the land and another that passes through; two in the east woods, one in the west.  On the east side the woods are many miles deep going back across other properties and all the way over to some river bottom land where the Neches River runs through that part of the country. Anyway it was early spring before the leaves had come out and everything was still fairly dead looking except the evergreens.  I was out playing 50 yards from the trailer on the outside ring of a tall stand of large trees and about 250 yards from the edge of the forest.  It was about dusk, just before dinner time, but there was enough light to clearly see down into the edge of the forest.  I kept getting the willies or the feeling that something was not quite right and for some reason I was drawn to look to the east woods tree line - like I felt I was being watched, but I don't think I would have put it that way at the time.  I just stopped playing ( I had just come down from climbing a sweetgum tree and was looking for lizards at the base) and kept looking at the tree-line several times.  About the second or third time this happened I noticed a low evergreen shrub (in the shadows of the woods even evergreens look kinda grey/brown or just darker than the surroundings) or at least a dark pear shape that I took to be like a small bushy cedar just inside the forest canopy - I thought something like \"that sure looks like a big person shaped bush . . . \" and probably thought it looked creepy or something.  A few moments later the feeling was so strong I stood straight up and looked right at that bush - no scanning the line - that bush was what I focused on. I must have stood there stock still for a solid 20 count just staring at this shape when I got the shock and, frankly, the fright of my young life!  The damned thing stood up and ambled off into the woods!  Down into a streambed and up the other bank off into the forest to be exact!  It looked just exactly like a very large man wearing a solid dark fur parka pulled up over it's head only there's just no way it was a dude in a coat - there was no variation in clothing, no lines, waving flapping wrinkling nothing.  I can tell you I was jolted with fear like nothing you can imagine - first to realize I had been observed for all that time and second by something big and very monster looking to me at the time (I was eleven).  After it was gone I ran into the house crying that I had seen a monster in the woods.  My father dismissed the entire affair as a black cow down in the woods, but I've been out in those woods all my life and even had the cows come up on me in the woods while I was camping out - that was no cow. On a side note, although I've never again seen anything fishy down at that property, there have been reports in Rusk County over the years, which is just one county south of Cherokee County.  Also, when my father and I were discussing this event recently my dad pointed out something I thought a bit odd.  We have sometimes heard the thunderous pounding of our entire herd of cows running up through the pasture away from the woods, always at night, and always up from the woods.  Who knows, maybe there's something passing through.",
  "classification": "Class A",
  "county": "Cherokee",
  "state": "Texas",
  "latitude": 31.90791,
  "longitude": -95.01264,
  "location": "-95.01264,31.90791",
  "location_details": "",
  "temperature_high": 89.99,
  "temperature_mid": 72.925,
  "temperature_low": 55.86,
  "dew_point": 55.89,
  "humidity": 0.61,
  "cloud_cover": 0.01,
  "moon_phase": 0.89,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.5,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.74,
  "wind_bearing": 267,
  "wind_speed": 3.55
}