{
  "reportId": "408",
  "title": "Daylight sighting by hikers in the Loveland Pass area (Cont. Div.)",
  "date": "2000-08-26",
  "timestamp": 967248000,
  "observed": "A friend and I and my dog were hiking in the Loveland Pass of Colorado.  We parked on highway 6 where it crosses the continental Divide and hiked south along the divide for about five miles.  We meandered down into one of the valleys carved into the divide on the eastern side.  We were looking for pioneer artifacts from the many who passed through this area on the trek to California. We had descended below the tree line where the valley peteres out into a boggy meadow.  This meadow runs down to a stream to the immediate east.  The stream is large at this point and I think this is the same stream that can be seen from Interstate 70 at the Eisenhower tunnel several miles north at the Loveland ski resort.  Dense brush and tree cover run along the opposite bank. We began to hear what we thought were noises from a large animal across the stream.  We tried approaching the source of the noise, but as we moved closer the sound moved away downstream along the opposite bank.  I started catching glimpses of a large, hairy, brown and black animal and thought we were following a bear.  My friend had the same idea and our pace slowed to a halt.  The animal then moved a little closer to us and appeared to watch us for several seconds.  Its height made it look like a bear reared up on its hind legs.  It then turn and moved off downstream through the brush in a long, loping, two legged gate that would have been impossible for a bear.  We did not care to follow. Adding to my belief that what we saw was not a bear or other wild animal is the fact that my dog did not bark or show any of the aggressive excitement he usually displays upon encountering a wild animal.  He actually drove an adult black bear, which was pillaging garbage cans, out of a campground several years ago.  During our encounter in Loveland he only showed the polite interest he shows in people in the woods.",
  "classification": "Class A",
  "county": "Clear Creek",
  "state": "Colorado",
  "latitude": 39.67095,
  "longitude": -105.8199,
  "location": "-105.8199,39.67095",
  "location_details": "",
  "temperature_high": 76.78,
  "temperature_mid": 64.56,
  "temperature_low": 52.34,
  "dew_point": 51.01,
  "humidity": 0.65,
  "cloud_cover": 0.47,
  "moon_phase": 0.9,
  "precip_intensity": 0.0026,
  "precip_probability": 0.56,
  "precip_type": "rain",
  "pressure": 1014.03,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 9,
  "visibility": 9.86,
  "wind_bearing": 227,
  "wind_speed": 2.49
}