{
  "reportId": "3895",
  "title": "",
  "date": "",
  "observed": "This is a resubmission of my report of August 25, 1997. In the first incident, two sisters, daughters of (edited), who is in her 80s, were on their way to their mother's place to pick up children for a birthday party.  As they turned on to the dirt/gravel road to the house they saw something sitting by the left side of the road.  When the car lights illuminated it, it stood up to a height estimated to be 7' or more.  One of the sisters refused to look at it after one glance.  It was reported to me that the eyes seemed red in the headlights.  It was hairy all over with a kind of pointed head, long arms, and no neck.  It moved of toward the river.  The sisters turned into their mother's drivway and did not see it again.  They were very frightened and were sure it was not a bear or a human.  This happened in March of 1997, as I recall. My husband and I were visiting our \"adopted\" family in August 1997, having arrived there on August 21st.  We were in our pop-up camper, parked by the river and behind the brush arbor across the driveway from Grandma's house.  Next door to her house lives her son and his family.  Her son was away on a fire, along with his son, but his wife and daughter were at home.  On August 21st, we had set up our camp, ate, visited, and went to bed early - around 11:00 p.m.  Everyone was asleep except me and I was drifting into sleep, when I felt a very strong jolt to our camper which made everything rattle.  I thought it might be a horse or cow, but the impact was higher than a horse or cow, like at the roof line.  I was too scared to move, but didn't know why.  Nothing more happened, so I went to sleep and told my husband about it the next morning. (He sleeps like a log.)  On Saturday, August 23rd, the whole group of us, maybe 20 people, had cooked and eaten outside and after cleanup we all sat around the fire in the brush arbor, enjoying the cool evening and visiting with old friends.  I was talking and way off somewhere kind of remember hearing a sound like a baby crying.  The little girl sitting next to me said \"Did you hear that?\"  I responded that I didn't hear anything, and she said \"that wierd howl.\"  Immedately the adults stood up and told the children to go to the house, that is was time for bed.  They all heard \"it,\" whatever \"it\" was.  My husband and I and our two little granddaughters sat there for a short while, wondering what was going on, and then went into our trailer and went to sleep.  The dogs barked and howled almost all night.  The next morning, Sunday, August 24th, I woke up and went to the house for coffee.  All of the family members were already there, talking.  I listened for awhile and the topic of conversation intrigued me, so I asked what everyone is talking about.  Dead silence.  I jokingly said that it sounded to me like they were talking about Bigfoot.  One and then another of them began to talk about it, and I said \"why didn't you tell me?\"  Their response was that they didn't want to scare us off.  I told them I'd been interested in this for years.  Then the stories came out, such as the first one cited herein.  Two of the grandchildren, the previous night, had been on their way to their grandmother's house.  As they turned off from the main highway to the old highway, where there is a sharp, left-hand curve in the road about 50 yards in, and where the remains of the old highway continues to a deadend to the right, they saw the being.  It was right at the curve where they saw crossing in front of their vehicle, a very large, hairy, long-armed figure, which they observed to them cross the deadend portion of the road and crash up the hill through the brush.  They continued on to Grandma's house.  As we all sat and listened to this, and everyone of us believed them, L. S. a son-in-law, suggested that we all go look for sign at the site where this occurred.  L. is an Eskimo from Selawik, Alaska, and he is a hunter.  I wanted to go but was still in my pajamas and robe, so I told them to go without me.  When I got there they were gone so I returned back to the house.  When they returned, Lewis said there were droppings, tracks, and matted down grasses, and chicken feathers, but no sign of bones or other scraps.  His view of the droppings, as related to me then, is that they don't belong to a bear or any other animal he knows of.  They contained seeds and plant materials, and bore a resemblance to human feces except for size and quantity. Before we got to Mescalero, in early August, (edited) said she woke up early one morning and noticed a huge handprint on her dining room window, which is a large window beneath which the table sits.  She went outside to clean it off so the grandkids and others wouldn't see it and be scared.  Grandma is proud of her flower garden of lilies, and she said the flowers were trampled down by something heavy.  Again, there were no horses around. In the kitchen on August 24th, I was told that howls and screams occur frequently at night, and that they have all heard them and cannot identify them.  All remarked about the bad odors they have smelled on nights when the dogs, which are tied up, have barked and barked.  One of the granddaughters was sitting in the living room one night, watching TV, when she happened to look out the window to see something looking in at her.  All she could say was that it was big and hairy. The family advises that these strange sounds and occurrences began in their area about November of 1996.  There is plenty of cover in this area, including a wash, or arroyo, in which Grandma and her daughters go to gather tea, which activity they told me they were now afraid to do.  They told me that easy access to the river, etc., is why there are sightings.  They do not lieve there is anything they have done, in \"Indian Way,\" to have caused this.",
  "classification": "Class A",
  "county": "Otero",
  "state": "New Mexico",
  "location_details": "Edited by request",
  "summary": ""
}