{
  "reportId": "27009",
  "title": "Woman recalls daylight sighting while driving and a possible incident at a home east of Gaylord",
  "date": "2010-07-26",
  "timestamp": 1280102400,
  "observed": "I think it was in the spring of about 1998-99, my ex-husband woke me up at about three in the morning. We lived in Atlanta at the time, which is about half way between Gaylord and Alpena. He woke me up and was visibly shaken, he was saying \"Come here to the back porch, you gotta hear this\". I went with him to the sliding glass door on the back porch and heard the most God-awful sound I have ever heard in my life. We had 40 acres on a corner lot and this was comming from the state owned woods to our south-west. It sounded like someone or something was dying. It was terrible and it went on every 30 seconds or so for almost an hour. I have heard the other animals in the area before....bobcat, coyote, fox, birds, etc., this was nothing like that! It was very eerie and haunting. Also, that following summer when I was comming home from work, I was comming down one of the many dirt \"back roads\" to get home and I saw, what at first I thought might be a horse, running very fast through some VERY THICK swamp. I truned to look at it and it was out of sight or had stopped and was hiding. I think it might have decided to squat down and hide once the car stopped. It was HUGE and moving faster than any person or bear could.",
  "classification": "Class A",
  "county": "Montmorency",
  "state": "Michigan",
  "latitude": 44.94835,
  "longitude": -84.165,
  "location": "-84.165,44.94835",
  "location_details": "About 5 miles south of the town of Atlanta on County Road 480. The corner of 489 and Shoreline Drive (road that goes down to Avery Lake).",
  "temperature_high": 81.57,
  "temperature_mid": 70.615,
  "temperature_low": 59.66,
  "dew_point": 58.69,
  "humidity": 0.71,
  "cloud_cover": 0.08,
  "moon_phase": 0.52,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.75,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 9.26,
  "wind_bearing": 257,
  "wind_speed": 2.52
}