{
  "reportId": "30089",
  "title": "Memory told of a possible encounter while deer hunting east of Manistee",
  "date": "1962-11-15",
  "timestamp": -224985600,
  "observed": "I was deer hunting in a swamp, back end of the Clay Bank Swamp.  I was by myself and in my favorite spot that I had picked out when I was about 14, I usually go in before daybreak and don't come out until dark, pack a lunch with me.  The day was normal, several does, no bucks. About a half hour before dark I heard a loud scream just off to the north of me, I had never heard a sound like that before in the woods, a minute later a branch was broke off a tree in the same direction, it was not a small branch as it cracked loudly.  At first I just watched closely in that direction wondering what the heck was that?  And then caution set in, as like I said I had never heard anything like that,  I hunt with a Krag 30-40, so I took the safety off and wrapped my thumb around the bolt to prevent accidental discharge and then I was going to wait for dark,  but again caution told me to get out of the swamp,  then butterflies set into my stomach because of the unknown and I had the urge to run,  but I refused as I have been in the woods most of my life hunting and know that running will set off a chase with a predator, so I walked slowly and constantly rubber necking to see if I could see anything, I didn't.  When I got to my car I started the engine, left the door open, set my 357 Smith & Wessen on the roof where I could reach it, set my Krag up there also, took off my coat and put it in the back seat, unloaded the Krag and put it away, all at the time watching where I had come from.  What I did see is this, whatever was in the woods followed me back to my car, I did not see it directly but it was about 35 yds standing behind some heavy swail, I could see the form, it was on two legs, quite broad and about 8 ft tall.  I picked up my 357 got in the car and left, I did not unload the pistol until I was at least a 1/4 mile away.  I also did not hunt in that swamp again for several years.  I hunt there again now as I feel whatever they are (which I believe is a Sasquatch) they are not dangerous.  I do hunt there again now and am unafraid.  This happened in Late November of 62 or 63.",
  "classification": "Class B",
  "county": "Manistee",
  "state": "Michigan",
  "latitude": 44.1708,
  "longitude": -86.10335,
  "location": "-86.10335,44.1708",
  "location_details": "about 12 miles east of Manistee and a mile south of M 55",
  "temperature_high": 53.15,
  "temperature_mid": 45.255,
  "temperature_low": 37.36,
  "dew_point": 37.81,
  "humidity": 0.79,
  "cloud_cover": 0.84,
  "moon_phase": 0.64,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.42,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 7.11,
  "wind_bearing": 163,
  "wind_speed": 2.75
}