{
  "id": "52031",
  "title": "Family reports strange ongoing activity near Greenville",
  "date": "2016-07-08",
  "timestamp": 1467936000,
  "observed": "I have not had a visual incident, but several strange experiences around my area recently have led me to try want to talk to someone who might know what is going on. Here I'll list the experiences: 1. I have a small orchard next to the forest in back of my house. 2 years ago, a young pear tree was bearing fruit for the first time, loaded with pears, there must have been 20-30 pears on it. I checked them one evening and decided that the next day I would come out and pick them. The next morning, I came out with a basket and every one of them was gone. Not only gone but every branch that had had a pear was broken. The top branches were about 10ft high so what ever took the top pears had to be tall. At the time, I didn't even consider a bigfoot and thought it might be a moose which we have go through the yard periodically. But I have not heard that moose eat pears and certainly not every one on the tree. Usually when deer eat my apples, they rarely eat more than 1/2 an apple at a time. Since that time I have put an electric fence around the orchard and the tree is recovering. 2. My workshop is down the street from my house, in my barn. About 1.5 years ago, I was walking up from the barn to the house and it was pitch black, in the evening. I could only barely see the road. Just before my house there is a patch of hemlock trees. As I passed the trees I encountered a very strong scent of wet dog. It had been raining all day but had stopped but everything was wet. The smell was overpowering and so strong that I stopped to see what it was. I peered into the trees but couldn't see anything. I walked past the trees and past the smell, walked back to the trees and the smell was still there. The trees are about 15-20 ft from the middle of the road where I was. I have to say I was a bit afraid as we do have some big bears around and didn't want to aggravate one, but I doubt a bear would have stayed still. My experience with bears is that they don't like being around humans and the ones around here are certainly not afraid of humans and usually just walk away. Whatever this was didn't move. So I went into the house. I definitely felt like I was being watched. 3. 1 year ago my wife and I were woken up around 1 am to the sound of a screaming woman in the woods, or what sounded like one. It was very loud, certainly louder than a woman would have been able to make, and it woke both of us up. After the screaming stopped, there was a pack of coyotes who yipped for a while from the same area. Then another sound of the woman screaming, then more coyotes, then more screaming and then more coyotes, then nothing. We went back to bed. We had heard the woman screaming sound before, years ago, in the middle of the day, and had gone out to find out what was going on but found nothing. We do have cougars here though and it may have been one of them. 4. A few weeks ago, at about 10 pm, my wife, myself and my son were sitting in the living room. It had been raining and foggy all day and was still drizzling out. It was pitch black and we couldn't see anything outside. All of a sudden, a rock hit the side of the house nearest the woods. It must have been about the size of a large marble. We immediately opened the door, but it was totally quiet and nothing more happened. 5. My daughter was visiting two weeks ago, and she was here for a week. She came on a Sunday and the next Friday she complained to me that she hadn't been able to sleep because of the screams in the woods. She asked me if I had heard them but I had slept through them. She said they were about midnight to 1 am and were accompanied by the sounds of a pack of coyotes. She described the screams but I of course cannot repeat them on this note, however, when she tried to repeat them, they are like nothing I've ever heard. She said they repeated for four nights. On Friday night, we stayed up trying to hear them but they did not reappear. 6. My daughter's dog stayed with us last fall for 5 months. She is a small black lab and loves to explore our field near the  woods. But many times, during the day even, when we went to let her outside, she refused to go out the door. She would sniff and then back away from the door. I still don't know why. Some days she would go out willingly, and some not. 7. The most recent was a few days ago. It was our first day above 90 degrees and I was traveling down Rte 31 north from Greenville along the Souhegan river. I was looking down the river on the right as the river arced away from the road and saw, some distance down the river, a large animal on all fours standing in the river.My first thought was that it was a bear. It was large, as the black bears we've seen around here are quite large. But it was cinnamon colored, quite a light color and the fur was at least 4\" long. I couldn't see its head. One of the bears here stood up against the screen door of my next door neighbor and my neighbor is 6'2\" and the bear stood as tall as he is, and I thought as I looked at this animal that it was at least that big. I know cinnamon is a variation of black bears, but the fur didn't look right, it was much too long and shaggy. The fur was so long that I couldn't see the joint between the legs and body. I should have stopped to get a better look but I was in a rush and didn't. 8. The last experience I had was in March. I was walking in the forest on a trail. In the distance, I heard someone hit a tree with a stick three times. I remembered that this is what bigfoot sometimes do from the online reports. I thought about that, and then walked on. About 100 feet later, it happened again. I thought, \"If this is a bigfoot, I don't want to meet him today\". I finished my walk without incident. So in sum, what is all this? Am I imagining something or what? Any suggestions? Do you have any similar reports from near here (southern NK)? I know bigfoot has been cited near here several times in the past in nearby towns. Xxxxx Xxxxx",
  "classification": "Class B",
  "county": "Hillsborough",
  "state": "New Hampshire",
  "latitude": 42.78378,
  "longitude": -71.77646,
  "location": "-71.77646,42.78378",
  "location_details": "Not far from Russel-Abbott State Forest",
  "temperature_high": 71.77,
  "temperature_mid": 65.405,
  "temperature_low": 59.04,
  "dew_point": 59.33,
  "humidity": 0.79,
  "cloud_cover": 0.44,
  "moon_phase": 0.15,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1011.75,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 8,
  "visibility": 8.99,
  "wind_bearing": 72,
  "wind_speed": 5.76
}