{
  "reportId": "23745",
  "title": "Man recounts boyhood sighting at home near Jigger",
  "date": "1980-06-15",
  "timestamp": 329875200,
  "observed": "I was about 8 years old, myself, my sister and her friend both about 12 were playing in the woods behind our house. There is a brake behind our house which is a runoff of turkey creek. We played in the woods often and thought nothing of it. It was a clear sunny day, and the first thing I remember is hearing alot of limbs break like something big was moving through the woods. My sister and her friend both became frightend and I noticed that and I became very frightend as well. I remember them saying it might be a bear, because black bear had been seen in those woods. We decided to get out of the woods as quickly as we could. We all started running back up to the house. When we made it back into the yard we all felt pretty safe. Then I heard my sister say what is that? I looked, and standing at the edge of the woods in between two trees I saw this tall, black,thing. I guess it was at least seven foot tall. I could see its eyes, and its scalp was almost pointed. It just stood there and looked at us. The edge of the woods was probably about 300 yards from where we were standing, and I can remember it like it was yesterday. It stood there and looked at us untill we decided to go in the house. I have never seen one again, but I know they are real. I have had dreams about bigfoot ever since.",
  "classification": "Class A",
  "county": "Franklin Parish",
  "state": "Louisiana",
  "latitude": 32.0131,
  "longitude": -91.14448,
  "location": "-91.14448,32.0131",
  "location_details": "Hwy 128 about 1mile east of Jigger, LA. (Specific details left out.)",
  "temperature_high": 93.23,
  "temperature_mid": 80.77,
  "temperature_low": 68.31,
  "dew_point": 66.25,
  "humidity": 0.62,
  "cloud_cover": 0.13,
  "moon_phase": 0.1,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.74,
  "summary": "Partly cloudy until evening.",
  "uv_index": 11,
  "visibility": 7.71,
  "wind_bearing": 199,
  "wind_speed": 7.97
}