{
  "reportId": "13212",
  "title": "Possible pre-dawn vocalization heard by hunter near Ferrum",
  "date": "2003-11-13",
  "timestamp": 1068681600,
  "observed": "I have grown up in the outdoors and been hunting and fishing my entire life. From a childhood spent in North Georgia to stints in West Virginia and now (for the past 16 years) in Virginia, I have spent a great bit of time in the woods. I know animals and flora and that is why what occurred back in the fall of '03 has bothered me so much to this day, enough to finally submit this report. My former roommate's father owns the property this incident took place on. I have had access to it since I was 15. It's a small sportsman’s paradise of nearly 200 acres and a 5-acre bass pond. I had hunted it every fall since '94 and had fished there for years before that. I hit the woods, completely scent proof, at about 3:30AM and hiked from the farmhouse appx. 600 yards back to the deer stand I was planning on using that morning. I stopped short about 100 yards to apply a drag rope (doe in rut scent) and then crossed the creek bridge and walked a wide pattern out in front of the stand to put out several scent markers on the game trails. This took perhaps 15 minutes and no game animals were spooked. I then headed back towards the tree stand, tied off my rifle and gear to a safety rope, climbed the stand and pulled up my gear. This would give me a full hour and a half to let the woods settle down and help my presence go unnoticed. What happened next has cost me countless nights of sleep and still gives me chills every time I think about it. Once in the stand I went about the business of sorting out my gear and making sure everything was where I would need it, binoculars, grunt caller, etc. Out of nowhere came the most god awful, blood-curling scream/yell/growl that I had ever heard in my life. The morning calm was completely shattered and it sounded close. I immediately ran the a mental list in my mind as to what it could be, but nothing I had ever heard before could match this in either pitch, depth, or duration. It lasted for at least 5-7 seconds. I was scared. It started so high and just kept expanding in pitch into a howl that ended in a menacing guttural growl. Before the sound was even over I realized/felt extreme danger. The real fear was from the fact that the volume was so loud and it came upon me so suddenly that I knew it was close, too close, within say 25 yards. Following the \"howl\" there was complete silence. I immediately felt to close to the ground, for whatever reason (in a 17ft. tree stand), and carefully stood up so that my feet were not dangling off the seat. I pulled out my mag light and started scanning the area to my front and right that the sound seemed to come from. I tried to listen for further movement while scanning, but realized that my ears were actually ringing from the howl. I remember thinking (from previous survival training) to keep cool and not panic, and figure this out. I quickly chambered a round and checked to make sure the safety was on my rifle, a Winchester model 70 in .300WSM. I then continued scanning between the woods to my front and the pine thicket to my immediate right with my flashlight. I just felt so vulnerable, and remembered thinking that this rifle might not be enough so I fetched my S&W.40 handgun from my backpack and secured it to my belt (now I know that it's unlawful to carry a sidearm during rifle season, but there are black bear on this property and I wasn’t going to leave myself without an option). It took several moments for my hearing to return and when it did I heard distinctive movement back in the pine thicket to my front and right, maybe 20 yards into the trees. Then nothing. That’s when the smell hit me. I'm not sure I noticed it at first because I had been handling deer scents, but I smelled what I can only describe as a \"rotten cabbage/ripe dumpster\". It didn’t last long, and there was no noticeable wind at the time of this incident to carry this scent. I stood there in that tree stand for the next two hours until first light and then got the hell out of there. I'm not the type to scare easily and I was right back out there two days later, but didn’t think to check for tracks or any other evidence. The game was still scarce. I've been back several times since then to fish the pond and nothing out of the ordinary ever occurred during those trips. I totally forgot about this incident for nearly a year. It bothered me so I just didn’t think about it. That changed when I caught a documentary on T.V. concerning bigfoot/Sasquatch. The BFRO was mentioned and I found your website out of curiosity. I was stunned when I read the report (also in Franklin Co.) that you had listed, but was even further stunned when I listened to some of the recording in your database. Several (from '73 and '78 I think) sounded similar to the very beginning of the howl during my incident, but the sound I heard was so close and loud and went so deep at the end that they are tough to compare. Whatever made that noise had one hell of a set of lungs though. I was also surprised about the smell that \"they\" supposedly emit when threatened. I had no idea. That was the icing on the cake that made me think that I might have possibly had an encounter. I've always been someone comfortable in the woods, and for the most part I'm still that person, I'm just a little more aware of what could possibly be out there.",
  "classification": "Class B",
  "county": "Franklin",
  "state": "Virginia",
  "latitude": 36.94165,
  "longitude": -80.04166,
  "location": "-80.04166,36.94165",
  "location_details": "From Roanoke: 220 South to Rocky Mount, then 40 West past Ferrum College",
  "temperature_high": 44.36,
  "temperature_mid": 37.63,
  "temperature_low": 30.9,
  "dew_point": 20.47,
  "humidity": 0.38,
  "cloud_cover": 0.15,
  "moon_phase": 0.64,
  "precip_intensity": 0.0001,
  "precip_probability": 0.16,
  "precip_type": "rain",
  "pressure": 1014.57,
  "summary": "Breezy throughout the day.",
  "uv_index": 3,
  "visibility": 9.86,
  "wind_bearing": 292,
  "wind_speed": 17.9
}