{
  "reportId": "2368",
  "title": "Hiker has detailed sighting on Bear Mountain.",
  "date": "1993-07-01",
  "timestamp": 741484800,
  "observed": "It was in July'93. I was hiking up on Bear Mt. near my families home in Eastern Ky. I had my pair of binoculars I had just bought and wanted to try them out on a high view. As I rounded the cliff, I was looking down this hollow that leads into a briar thicket. I had been hearing this odd \"tapping\" noise all the while, and saw this dark brownish figure near a log close to the thicket some 250 yards away (I have a hard time determining distance, so it could more or less) At first I thought it a rare sighting of a black bear, but when I looked at it through the bin's, I couldn't believe what I saw. It was sitting on a log with it's back to me, with a rock in its hand beating on this logs side. It had a back that was at least 2.5 feet across and covered in short, thick reddish brown hair. It looked like a giant hair covered man with no neck. With the bins I could see in good detail, so there was no mistake. The hands looked human, four fingers and a thumb, the skin a dark greyish color. The head was conical, like a lowland gorilla. Suddenly this thing must have smelled or sensed me, because it stood up and looked in my direction. It had a bulged forehead near the eyebrow, large round dark eyes, and a flared gorilla like nose. The jaw was slightly long to the chest, but did not protrude at the mouth. the nose and eyes areas was free of hair, the skin a dark grey. but from the nose, mouth, and chin were covered in hair. (Sort of like a hairy ninja hood). The creature was HUGE! I later looked at a tree it was standing near and it had to be near 7ft tall. It stared up the mountain at me, and made a peculiar motion with its head, waving it from side to side, and seemed to hunch over a bit with its arms dangling at it's knees. It then turned and dashed off threw the thicket. I never saw it again. Needless to say, I got the hell out of there.",
  "classification": "Class A",
  "county": "Madison",
  "state": "Kentucky",
  "latitude": 37.53705,
  "longitude": -84.2552,
  "location": "-84.2552,37.53705",
  "location_details": "",
  "temperature_high": 86.1,
  "temperature_mid": 79.36,
  "temperature_low": 72.62,
  "dew_point": 71.32,
  "humidity": 0.79,
  "cloud_cover": 0.77,
  "moon_phase": 0.42,
  "precip_intensity": 0.0011,
  "precip_probability": 0.13,
  "precip_type": "rain",
  "pressure": 1013.33,
  "summary": "Humid and mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 6.18,
  "wind_bearing": 207,
  "wind_speed": 4.9
}