{
  "reportId": "1517",
  "title": "Horse-riding witnesses see hairy bipedal animal cross trail on Blackfeet Reservation",
  "date": "1982-10-02",
  "timestamp": 402364800,
  "observed": "I can hardly remember the date,but I do remember the events leading up to the sighting. It was a very warm fall day when my cousiins and myself decided to some huntng on horseback. The area that we hunted was the foothills of the rockies on the Blackfeet Reservation in Big Sky Country. We had decided half way into the trip to just take a ride a wait for lady luck to bring us something during the ride. All day was pretty good as far as the ride went but I know that everybody still had the idea of getting a deer on their mind. We had decided to ride hime through a brushy trail hoping to run into some game before we made it home. Most of the day was gone and the evening sun was warimg our backs as we made our way home. As we approached the trailhead my cousins horse was relectent and fought the briddle bit for awhile. We thought it was just because of it being green broke. Once inside the brush a good ways into it our horses started stepping very softly and snorting once in awhile as if something didn't agree with sence of smell. I could see the opening of the trail and it would also be the end of the trail. One of my cousins was just about to say something when our horses began jumping in different directions like they were scared of something, the first thing on all our minds was, A BEAR! We began looking in different directions trying to get find the location of the bear. I don't rememder who was the first to sight what it was we saw, I just heard him swear and ask the rest of us to look. We looked in the direction he was pointing and saw this very tall thing running on two legs beside us and then turned in front of us. The thing crossed the trail in front of us about 40 feet and stopped at the edge of the brush, it just stared at us as if in the same amount of amazement as we were, and then just disappeared into the trees just as fast. The best way I can describe it as probably the hairiest man I have ever saw well past 6 feet tall. It was hard to determine the size but the branches the we found broke the next day were from 6 feet to about 8 feet in some places some foot print were found in places where the ground was soft and along the trail we followed towards the mountians. This was the only sight we had since then and this was when I was 14 years old I am now 30 and probably the first one to tell anyone what we saw that day.",
  "classification": "Class A",
  "county": "Glacier",
  "state": "Montana",
  "latitude": 48.36139,
  "longitude": -113.1236,
  "location": "-113.1236,48.36139",
  "location_details": "the foothills of the rockies on the Blackfeet Reservation in Big Sky Country",
  "temperature_high": 57.19,
  "temperature_mid": 49.395,
  "temperature_low": 41.6,
  "dew_point": 38.79,
  "humidity": 0.64,
  "cloud_cover": 0.78,
  "moon_phase": 0.48,
  "precip_intensity": 0.0001,
  "precip_probability": 0.3,
  "precip_type": "rain",
  "pressure": 1010.78,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 9.95,
  "wind_bearing": 239,
  "wind_speed": 13.6
}