{
  "reportId": "9712",
  "title": "Early evening encounter near Riverdale",
  "date": "1984-07-15",
  "timestamp": 458697600,
  "observed": "I am now 33 years old. At the time that I encountered this creature, I was 13. I will write it as it happeded. Me and my family lived in a rural community on the outskirts of Riverdale Ga. Behind our house there was many acres of woods. At that time that area belonged to  a man named Mr. Jackson. There was a huge lake there also, it was called Jackson's Lake. Mr. Jackson was a cattle farmer. His cattle were on the other side of the lake. There were many trails in those woods and me and my friend Daniel played in them many, many times. It was very easy to loose yourself out there all day. My encounter happened when I walked through these woods to a trailer park that was called Chatue Manner. The trailer park still exists today but is under a different name. I went to visit a friend. I started to notice that it was getting late, and my father had told me that he did not want me in those woods after dark.  This struck me and mother as strange, because we would always be in the woods. My mom would even go in those woods to pick blackberrys. At any rate I decided to obey my father - as I did not want to hear his mouth. I walked to the back of the trailer park and there you have to cross a big raveen. It is like 10-15 ft. down and then up again. I was covered in vegetation and that Georgia red clay. Down in the raveen was a creek, so you would get a little scuffed up. After I crossed that I went up a trail that went up hill by the lake and that curved around and led to my house. After passing the lake, and turing the curve I encountered my father. He said \"What are you doing out here?\" I said I was just coming back from Pam's house. He said \"Well hurry up and get home\". I left him standing there and started for home. I turned back to see what he was doing and he was walking toward the lake. I just kept walking toward my house - when on my right side I heard rustling in the foliage beside me. The foliage was mostly dense tall pine trees with all kinds of honey suckles and black berry vines and muscidine vines. That was the place where me and mom would come to pick blackberrys. I tured and looked and I saw this creature. This thing was massive. I could see him. He was only a few feet away from me. He stood parallel to me.  I was heading north to my house. He too was faced north. I was on a heavily walked clear trail, whereas he was in the shrubs. These little pine trees were taller than him. He was at least 7-8 feet tall. His arms were huge, like the size of thighs, they were very long. His chest was massive as well. This was no skinny creature. I looked at him. He looked at me, and off, off, off, I went running up the trail. I was so scared!!! When I started to run, he did too. He ran right beside me in the shrubs. I would look to my right and see him and the thing would make a loud sound.  It's like he would exhale and let out a very deep grunt/roar.  I kept running and he kept running beside me in the shrubs. This thing was completly hairy and it's face was dark but I could tell it was human-like because its head was like that of a human head but hair all over - but not on the face. When I had reached the part of the trail that forked off into an open field of tall grass/wheat like stuff, that is where he stopped. He would not come out of the shrubery. I looked back and seen him crouched there staring at me as I ran and he just was there in the shrubbery. When I made it home I ran in the house shaking like a leaf, and my mom was making supper. I told her what had happened and what I had seen. And she went to look out the dinning glass window. It was a sliding glass window and she said she did'nt see anything. She asked where my father was and I told her. Then she sat down with me at the dining room table and told me that was the reason that he did not want me in those woods. She said that he had told her that he had hemmed it up in a tree one night and that he just stood there in front of it and screamed at it and it would'nt come out of the tree. I never told anyone other than my mother and Daniel and now my 4 boys about that. But there was something in those woods and me and my father werent the only ones that knew it. One day I was watching TV after school (this was before any of this happened) and my father come in and told me to come and help him. I said why? Me and my father DO NOT get along very well. He said because Benji, our dog had got caught in a bear trap on the other side of the lake. I said \"WHAT?\" He said yes. So we went and tried to free benji and my father had took a macheti. He said he could not open the trap, so he was going to cut his foot off. I said NO!! So I pulled the trap w/ all my might and my father got benji out. Now why had someone set a Bear Trap in the woods? There are no bears in Georgia. The biggest animal besides that Thing I had seen were deer and cows. And the cows were on the other side of the lake, they could not come across one side because of trees and the other side because of a big steel fence. And other times before I had ever encountered this being, Me and my family would go walking in the woods and sometimes we would cross the steel gate over to Mr. Jackson's land and treck about a mile to a very sandy clear creek. That was the side where the cows were. On many different occasions we would come upon a cow laying on the ground dead with its whole stomach torn out. That was very weird to me, but because I was young and did'nt know much and since my parents did'nt say much I never put 2+2 together until my later 20's. There was something in those woods but it's probly long gone by now. There are houses all around that lake and Mr. Jackson no longer lives in his house. The creek where these things happened is called Camp Creek. The lake was called Jackson's Lake. It was private to him. Although me and Daniel would always play around the woods and the lake. The name of the street was and is Lyle Dr. The town Riverdale Ga. I will never forget when that creature chased me but when I got to that opening I knew that he didnt want to hurt me. Because I know by his massive size and that massive sound that he could have just ripped me apart had he wanted to. Needless to say that I did'nt go in the woods much after that. You are the first people that I have ever told besides my mom and my friend and my kids.",
  "classification": "Class A",
  "county": "Clayton",
  "state": "Georgia",
  "latitude": 33.32442,
  "longitude": -84.2532,
  "location": "-84.2532,33.32442",
  "location_details": "If you are in Atlanta - you go 75 south to Ga. Hwy 85 and you follow it into Riverdale. Hwy 85 eventually intersections Hwy 138. At that light make a right. Go straight to the 3rd street on the left and that is Lyle Dr.",
  "temperature_high": 87.27,
  "temperature_mid": 79.92,
  "temperature_low": 72.57,
  "dew_point": 70.97,
  "humidity": 0.76,
  "cloud_cover": 0.58,
  "moon_phase": 0.58,
  "precip_intensity": 0.0111,
  "precip_probability": 0.64,
  "precip_type": "rain",
  "pressure": 1019.54,
  "summary": "Humid and partly cloudy throughout the day.",
  "uv_index": 9,
  "visibility": 7.72,
  "wind_bearing": 223,
  "wind_speed": 3.62
}