{
  "reportId": "19206",
  "title": "Three Creatures observed Ripping Limbs and Bark from Trees in the Monongahela National Forest",
  "date": "1994-10-15",
  "timestamp": 782179200,
  "observed": "Many years ago while camping in Monongahela National Forest in the fall with my family, my son and I decided to walk around part of the lake at night time. It was a beautiful bright night. the temperature was in the 50's. We came upon a marshy area just off of the trail. There was a meadow at the edge of the lake. We heard a loud commotion, and sticks breaking. We stopped to look thinking that it may have been campers looking for firewood. I saw two very large black upright creatures ripping branches and bark from the trees. It appeared that they were eating the bark. My son and I were about 125 feet away at the most. I was so scared and in disbelief, I quietly told my son (he was 10), to move slowly down to the ground. We crouched behind a rock and watched over 15 minutes. I have never sweat like this in my entire life, I was so frightened. The smallest of the two had a arm reach about 10 to 12 feet. The larger of the two was several feet higher. All of a sudden, the two stepped back into the darkness of the woods and a third one stepped out. This one was unbelievably tall. We only watched a few more seconds and I told my son \"We have to run\". We ran nonstop back to my family's camper. My dad did not believe us. He thought it was a bear. I told him that there was no way it was a bear. Even a grizzly was not as tall as the smallest ones arm reach. I grew up in the area and I spent alot of time in the woods and it takes alot to frighten me! The next day I went to the same spot and found several feet of tree branches and smaller limbs at the base of several trees. The trees had been stripped of branches and bark. Through the years I stopped talking about it because I felt like no one believed me or my son.",
  "classification": "Class A",
  "county": "Greenbrier",
  "state": "West Virginia",
  "latitude": 37.5313,
  "longitude": -80.01335,
  "location": "-80.01335,37.5313",
  "location_details": "Route 92 north to Sherwood lake Recreation Area. The meadow was near the picnic area close to the dam.",
  "temperature_high": 66.42,
  "temperature_mid": 53.27,
  "temperature_low": 40.12,
  "dew_point": 42.69,
  "humidity": 0.66,
  "cloud_cover": 0.4,
  "moon_phase": 0.38,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1022.79,
  "summary": "Partly cloudy starting in the evening.",
  "uv_index": 4,
  "visibility": 9.67,
  "wind_bearing": 50,
  "wind_speed": 7.6
}