{
  "id": "568",
  "title": "Loud low moan then rose quickly to a high pitched scream heard",
  "date": "1990-09-22",
  "timestamp": 653961600,
  "observed": "My cousin and I had been descending the slope until we were about 1/2 mile from the crest where we had camped along a logging road. We decided to sit and rest for a few minutes with our backs to a large fir tree. We were pointed downhill and there was a good breeze blowing the tree tops together. We had been sitting for about five minutes when we heard something behind us and to the right at a good distance away (several hundred yards at least). There were limbs snapping and tree tops knocking together and then something we couldn't recognize. It started as a loud low moan than rose quickly to a high pitched scream that lasted about 15 to 30 seconds in duration. We looked at each other and we were scared and curious. We tried to figure out what it might have been but we figured maybe it was the trees rubbing together or something similar. It certainly didn't sound like any animal we had ever heard or heard of. We remained sitting there for a few more minutes (2 or 3) when we heard it again. This time it sounded as if it was literally on the other side of the tree from us! It started out as a much louder low moan and rose again to a high pitched scream that lasted at least 15 to 30 seconds. My cousin and I were scared s***less. We were sitting with our rifles loaded and ready to bolt if the creature came into sight or reached around the tree. Like I said, It was so close sounding we thought it was right behind us. It seemed as if everything became real quiet, and then we heard whatever it was move off away from us, crunching through brush. We never did see the creature but then we weren't interested either. We high tailed it back up the slope to the loggng road where we met the rest of the hunting party. They had been further away and hadn't heard or seen anything.",
  "classification": "Class B",
  "county": "Lewis",
  "state": "Washington",
  "latitude": 46.71,
  "longitude": -122.3442,
  "location": "-122.3442,46.71",
  "location_details": "Literally at the very top of Cougar mountain. I can't tell you how to get there specifically because my cousin drove and we went through forest roads from Yelm to get there.",
  "temperature_high": 88.72,
  "temperature_mid": 71.705,
  "temperature_low": 54.69,
  "dew_point": 50.91,
  "humidity": 0.59,
  "cloud_cover": 0.03,
  "moon_phase": 0.12,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.87,
  "summary": "Clear throughout the day.",
  "uv_index": 4,
  "visibility": 9.02,
  "wind_bearing": 13,
  "wind_speed": 3.14
}