{
  "id": "39279",
  "title": "",
  "date": "",
  "observed": "The time and date was Friday, Jan. 25th at around 5 or 10 past midnight.  I was sitting at my desk which is on the same wall as my front door, maybe 1 foot away from my front door.  I was actually playing an online game when I had to take a break and use the bathroom.  My bathroom is located on the left side of my front door down a short hall.  I got from the desk and turned to go down to the bathroom and as I crossed in front of the front door, something... I don't know what... caught my attention.  I turned to look out the window of the door which I have a habit  of doing anyway, and saw the thing.  Now mind you, all the lights were off in the house except for the monitor for the computer and the T.V.  Now, my window in the front door is probably 4 inches wide by by maybe two and a half feet tall.  Anyway, like I said, I looked out the window and saw the thing.  I call it the thing because I am still not quite sure what I saw, but, I do know for a fact what I think I saw.  I have stated before that it looked kind of like a Captain Cave man, but I guess it looked more like an over grown cousin It from the Addams Family.  It had what looked like a dark brownish to black hair everywhere, no neck that I could really tell of or see and really long arms.I couldn't really see any facial features because of all the hair.  Its hair on its body and arms meshed so well together it really did look like an over grown cousin It.  Keep in mind also that I have several street lights nearby the house and when the moon is out, even when there are clouds in the sky I can still see in the front yard pretty good so I know it wasn't a shadow, it was way to solid and it wasn't haze build up from the cold outside because I hadn't opened the door yet.  Back to the thing.  Now I stand around 5 foot 8 inches, so I figure to the bottom of my chin is real close to 5 feet.  From the bottom of my door to the ground is right at 3 feet.  It looked to me like the thing was at least up to my chin to the top of its head, so I am roughly figuring this thing was at least 8 feet tall.  My steps are 4 feet wide hand rail to hand rail, the thing was as wide as my steps.  It looked as if were bent over like it was looking in the door, but, it was standing at the bottom of the steps on the ground so I cant be sure what it was doing.  Now my desk is like I said about a foot from the door on the right side of the door, but where my monitor, keyboard and desk is is on the far side of the desk about 4 feet from the door.  Between the monitor and the door on the desk is my printer and various other stuff including my camera.  I turn my head to find my camera and grab it to maybe get a picture of the thing because I know if I tell anybody they will think I am crazy. By the time I find my camera, grab it and look back, it's gone.  I look out the window real good in the yard and turn mu porch light on and see nothing.  I slowly open the front door to get a really good look, still nothing.  It's as if this thing has vanished. So I close the door and go on to the bathroom.  When I come back and sit down I can hear what i can only describe as sounding like thunder but not nearly as loud or as long, maybe a couple or few seconds at a time.  I am the only one up at this time of the morning so no one else that I know of saw or heard anything.  I know I am not crazy and I have 20/20 eye sight. I was in the army in my younger days.  I have traveled a lot of places and seen many strange yet wonderful things, all of which have a reason for why they are, where, what or how they are.  This thing, I have never in my life ever seen anything like it before... anywhere, and I have seen hundreds of pictures between the web and that show where they hunt for big foot on Animal Planet.  I know I sound like a wild lunatic about now but that is what I saw and heard.",
  "classification": "Class B",
  "county": "Randolph",
  "state": "North Carolina",
  "location_details": "Please don't post",
  "summary": ""
}