{
  "id": "30198",
  "title": "Man tells of his two encounters 30 years apart",
  "date": "1983-08-01",
  "timestamp": 428544000,
  "observed": "I am an emt-b and a former firefighter from the greenup county ky area. I have had 2 encounters in my lifetime with, what i believe to be, bigfoot/sasquatch. I have told people i have had the encounters, but i have never told any of the details, mainly because I knew no one would believe me if I did. The second encounter, I never really saw the creature, but i know it was there...my first encounter was quite the opposite. i saw the creature up close for at least a few minutes, it was in short, terrifying. My second encounter happened while i was ginseng hunting in late summer. i was right on the outskirts of daniel boone national forest at the rowan/lewis county line in ky just a few hundred yards from cranston rd. i had been in this holler making my way up to the ridge looking for roots for about an hour or so when i heard some brush move about 50 to 75 yrds up the hill from me. i strained hard to see what had made the noise, thinking it may be a deer or maybe even an elk or bear, but saw nothing. As i continued my zig-zag pattern towards the top of the ridge, I heard the noise again. i looked again and saw a flash of black and the brush moved slightly. My next thought was \"bear\" and not having a firearm with me, i decided it would be best to start back down the hill. as i did, i kept an eye on the area I had seen the movement and to my horror, I realized it was following me down the hill all along making sure it stayed hidden. I could see glimpses of black and the brush and branches move the whole time I was retreating. I know that there is the possibility it was a bear, but what made me so uneasy is the fact that the brush and branches this thing was disturbing were 5 to 6 feet off the ground! knowing that black bears only stand around 3 feet high on all fours and knowing that bears don't move far on two legs (much less several hundred yards) I really believe what was following me down the hill was a bigfoot. my first encounter was in lawrence county ky when i was around 8 years old...i know it was a long time ago, but I know what I saw and i will never forget it as long as i live. we were staying with relatives (I'm not sure of the exact location now) in an isolated holler between two hills with no other houses around. there were quite a few people there and the little house didn't have adequate sleeping room, so we put sleeping bags on the floor in the rooms and my cousins and I slept in the floor beside their parents bed. i have always been the first person awake no matter where i sleep and this morning was no different. It was just breaking daylight, the windows in the bedroom were open because it was hot there in august. As i lay there wondering what we would do that day, i saw a figure pass by outside the window next to the bed. My first thought was someone was up and had to run outside for whatever reason, but as soon as that thought was finished, the figure was looking in the open window by the dresser. Words cannot describe the horror i felt. I had never heard of bigfoot at that time, so i was sure king kong was standing outside looking through the open window. I stayed frozen with fear, knowing if the beast saw me watching, it would attack (that was my thought anyway). The next thing i knew, it reached its arm through the window and grabbed a piece of jewelry from off the dresser. the noise it made caused one of the adults to switch positions in the bed and like a shot, it was gone. I told everyone what had happened and they told me it had been around there for years and not to be afraid, because it had never harmed anyone or anything and that it was more afraid of me than I was of it. I don't know about that, but i do know what i saw. After this incident, I started learning about bigfoot and was and still am convinced that the creature is real.",
  "classification": "Class A",
  "county": "Lawrence",
  "state": "Kentucky",
  "latitude": 38.1078,
  "longitude": -82.73412,
  "location": "-82.73412,38.1078",
  "location_details": "The second sighting happened right at the rowan/lewis county line (rowan co side) just across the road from the daniel boone natl forest parking area",
  "temperature_high": 84.31,
  "temperature_mid": 75.855,
  "temperature_low": 67.4,
  "dew_point": 67.22,
  "humidity": 0.71,
  "cloud_cover": 0.77,
  "moon_phase": 0.74,
  "precip_intensity": 0.0105,
  "precip_probability": 0.56,
  "precip_type": "rain",
  "pressure": 1018.52,
  "summary": "Light rain in the evening.",
  "uv_index": 6,
  "visibility": 8.55,
  "wind_bearing": 223,
  "wind_speed": 6.79
}