{
  "id": "31005",
  "title": "Early morning walker witnesses a sasquatch pouncing on a snake east of Crossville",
  "date": "2005-06-01",
  "timestamp": 1117584000,
  "observed": "I live in a retirement community known as Fairfield Glade on the Cumberland Plateau in East Tennessee. Knoxville is the nearest large city and is 65 miles east.  Our little community is surrounded on almost three sides by a state forest and the Catoosa Wildlife Refuge.  We have an over abundance of \"protected\" wildlife of all kinds (including too many deer, in my opinion) that venture, at will, into our community.  Always the bold tomboy, I preferred to get my exercise by hiking the heavily forested back roads and trails near our home instead of playing golf as my husband did.  I never hiked more than 6 miles from home, and always in the early morning.  One morning, I was approximately 4 miles from my home when I came upon an unexpected sunny clearing that seemed to have been an old road or path at one time because it was grassy and void of underbrush or trees.  On my hikes I am normally under a full canopy of very tall trees.  So the sunlight was an unexpected pleasure.  As I rounded a curve and my eyes caught the filtered sunlight from the clearing, I observed a large ape-like creature jump from the woods and pounce at something on the ground.  I abruptly froze.  In a flash, the creature stood back up holding a long snake by the head.  Just as quick as this happened, the creature disappeared back into the cover of the woods alongside the clearing.  I remained still for a moment contemplating whether the animal had seen me and how best to protect myself.  I literally heard my heart beating.  I quickly ruled out tree climbing and decided the only alternative was to turn in the opposite direction and run as fast as my legs would carry me. I ran nearly all the way home.  I was so disturbed by what I had seen, I decided that no one would believe it, so I never told anyone.  That was about 5 or 6 years ago, and my husband has since died. Over the years, I have tried to convince myself that I really didn't see the thing that has so frightened me that morning in the woods.  I tried to convince myself that I had somehow imagined it; however, the vivid memory persists.  To this day, I have never set foot in any woods again, essentially breaking a very longstanding and much revered habit that day.  I am still fearful of seeing that creature again.  I have always been a sober-minded individual, not at all given to making up fantasies or stretching the truth as I know it.  I was completely caught off guard and stunned the other day when an ad spot for your show came across my TV screen. After watching your show, I am now convinced that I actually did see what I thought I saw that day on my last hike. Your show also brought to mind the night a few years ago.  This happened well after my experience in the woods.  My husband and I were sitting on our deck looking up at the stars, so clearly visible up here on a clear night in the dark woods of the Cumberland Plateau.  We were quietly listening for the Whipoorwill who nests every year in the woods across our street.  He calls relentlessly for a mate every night during season.  Piercing through the peace and tranquility we heard the most horrific deep bellowing scream from what seemed like some distance away.  We had both been leaning way back in our lawn chairs admiring the night sky, and almost fell out of our chairs in shock.  I remember my husband abruptly stood up and said we should go inside and he added that he had never seen a mountain lion big enough to scream like that.  I did not make the mental connection to the scream we heard and the creature I had seen a few years prior until I saw your show and heard your team members calling out to bigfoot.  Oh my gosh!  That was the same sound!  I must confess that I am a reluctant convert!",
  "classification": "Class A",
  "county": "Cumberland",
  "state": "Tennessee",
  "latitude": 35.97231,
  "longitude": -84.88466,
  "location": "-84.88466,35.97231",
  "location_details": "It was within a few miles of the community stables and Dorcester Golf Course, roughly between Fairfield Glade (Peavine Rd), I-40, and the village of Crab Orchard, but beyond the FFG subdivisions.",
  "temperature_high": 71.33,
  "temperature_mid": 65.505,
  "temperature_low": 59.68,
  "dew_point": 58.55,
  "humidity": 0.8,
  "cloud_cover": 0.75,
  "moon_phase": 0.83,
  "precip_intensity": 0.0129,
  "precip_probability": 0.96,
  "precip_type": "rain",
  "pressure": 1012.52,
  "summary": "Rain overnight.",
  "uv_index": 7,
  "visibility": 7.11,
  "wind_bearing": 84,
  "wind_speed": 6.22
}