{
  "reportId": "51934",
  "title": "",
  "date": "",
  "observed": "The incident that happened to my wife and I was on 5/27/16. I was woken up at three in the morning by a screaming distress sound that was coming from outside our open bedroom windows at the rear of our house, after the sound happened again I woke my wife up wondering if our dog was left out,  then she heard the noise a couple times. I got up and went to our rear sliding door in our kitchen where we keep our dog kennel. As I left the room my wife was startled and heard a repetitive hollow knocking sound from outside our bedroom windows which I did not hear because I was between rooms. As I got to our dogs kennel I startled our dog awake, I then turned on our rear outdoor lights and porch light. When I opened the slider I heard a lot of commotion at our tree line which is around 150' from the house. My first thought was a pack of coyotes. After listening for a few seconds, the noises escalated and the trees began to shake in 3 to 5 spread out areas of my tree line. It made the hair on the back of my neck stand up. I shut the slider and went to get my shotgun. I loaded it and went out to my back deck, which is about 6 to 8 feet off the ground.. At this time my wife came out to the kitchen to listen out the window. As I was on the back deck the noises continued. It was as if whatever was out there had no fear of me. I felt like there were multiple sets of eyes on me. As I stood there I could hear breaking limbs, tree shaking and what sounded like a creature with serious power. My 12 gauge felt like nothing and I knew I better get back in the house. The noises carried on for a half hour. I decided to shut off the rear deck light because our house was dark inside and it felt like they could see us. When I walked over to shut it off my wife, who was standing at the slider with the door partly opened about a foot, heard a heavy sound of something running towards us. She slammed the slider shut and jumped back. I've never seen a fear like this come over my wife.  I then quickly opened the slider with my shotgun in hand and heard an aggressive, deep grunting sound that went off 3 times quickly. It was right beside the deck and felt like it was in my face. I slammed the slider. My wife ran to our baby's room and I could hear what sounded like a group of 3 to 5 creatures slowly heading back into the woods. I've been in the woods my whole life and know this area and wildlife well. I've never encountered anything like this. We didn't see anything. The following day we noticed some bushes pushed over at the edge of our deck and several freshly broken branches around the tree line.",
  "classification": "Class B",
  "county": "Hillsborough",
  "state": "New Hampshire",
  "location_details": "Witness does not want his name or location shared.",
  "summary": ""
}