{
  "reportId": "24822",
  "title": "",
  "date": "",
  "observed": "My husband, parents and I had set up a camp in the Medicine Bow National Forest.  Our camp consisted of a fire ring, cooking table, large tent and 3 vehicles.  My parents slept in the tent and we slept inside our truck.  My husband awoke at 5:30am to go elk hunting.  He got dressed in the truck cab then exited the cab and continued to get his hunting gear ready.  He had gotten a late start and it was beginning to lighten up outside.  I sat up in the truck for a second and out the back window saw a black figure run between my parent’s tent and the 3rd vehicle.  I only saw the figure for ½ a second and I only saw the torso up.  I had just woke up and around the edges of the truck window had a little fog around them, so I initially I thought it was my husband, but he was still standing between the truck and the 2nd vehicle.  I laid back down and got to thinking about what I saw.  I sat back up and started watching my husband move around the camp.  He was wearing his camo overalls and a camo coat.  The way he moved was slow and sluggish compared to what I saw earlier.  My husband soon left to go hunting.  Maybe 10 minutes later, my brother pulled into the campsite and parked his vehicle and walked into the woods to go hunting.  He to was dressed in camo and was nowhere near as smooth and fluid as what I saw running. The animal I saw was black.  It almost looked like it was wearing a hoodie (hood up).  There was no distinction between the head and the shoulders.  It was smaller than my husband both in height and in weight.  My husband is 6 foot, 230 pounds.  It looked slender.  What impressed me the most was the speed and the smoothness of the running motion.  This thing was FAST. I can not imagine another person being in our camp.  There was a road up a hill next to our campsite and hunters were driving by here and there. Probably no more than 4-5 cars all morning.  There were hunters all over the forest.  The keys were in our 4-wheeler and all the vehicles were unlocked, so if it was a person nosing around, there was nothing left out the night before for someone to steal from camp other than the vehicles. It took me about 15 minutes of running the scenario through my mind over and over to realize what I saw.  It was too late to get out and look for the animal.  So I stayed in the warm truck a little longer until my parents started moving around camp.  I looked all over the campsite for any prints but found none.  It had rained a day before and the ground was somewhat wet, but I was unable to leave a footprint myself.  I even tried jumping to make a print.  I weight 150 pounds.  My father made comment that something was making noise all night by the creek.  He thought it was probably a porcupine.   I asked my husband if he saw anything and he did not (he’s not the most observant person).",
  "classification": "Class B",
  "county": "Carbon",
  "state": "Wyoming",
  "location_details": "Camp site off Hwy 70",
  "summary": ""
}