{
  "id": "33867",
  "title": "Memory told of a possible encounter while fishing near Salkum",
  "date": "1981-05-15",
  "timestamp": 358732800,
  "observed": "My cousin and I where fishing on the Cowlitz near (SAULKUM) next to the trout hatchery river bank and we were about forty yards from each other. I kept getting the feeling that we were being watched. I did not speak to my cousin because the noise from the river was so loud. I thought I might of heard something close to me directly behind me so I looked back only to see the trees move like something was walking through them.This area was at the bottom of a cliff with sort of a small point along the river and I was on the tip point. The trees were mostly 30 plus foot alders and thick under brush. After seeing the trees moving I could make out something large in the brush but it was concealed just enough to block my perfect view. So as I looked at my cousin he was looking at me with a scared look on his face and motioned his head toward the area this thing was in and I pointed at the trail and motioned him to go back toward camp.The subject at this time was behind him he did not see any shape or anything he sensed something and then heard something. As he started running down the trail I joined in behind him and pulled my knife out and told him if something gets me dont stop. As we were running down the trail I looked back over my shoulder several times after say 50 to 60 yards into the trail and saw nothing then I looked again before slowing down and when I looked back there was an arm and hand reaching for me as it came out onto the trail right behind me I yelled at my cousin run its behind us dont look back just run. I looked again and it was gone. We continued back to camp and told my grandfather that i think we just got chased by a bigfoot and his response was \"are you smoking dope there is no such thing as big foot \".  I was 16 at the time and an avid sportsman hunting in the woods by myself for years always going into my area to hunt before dark with no flashlight. so this isnt a case of a scared little boy. my cousin and I went back the next day and looked around we did find tracks in the soft dirt at the bottom of the cliff face however they had no details the soft dirt filled the prints. I am a gifted tracker and have been all my life I am the one in the family that always gets called to track wounded animals or to locate animals that had been seen and lost. I am woods wise and not one to let the imagination run wild. I know what I saw that day and if the public thinks I am full of it well I know the truth.That was 30 years ago however I will never forget it nor will my cousin, it freaked him out and he did not see what I saw. I am a fan of the show and I thank you for all the long hours spent in the field to bring this topic into the limelight. I had two more encounters last year along the Cispus river near (Mount Adams) with my cousin. We were up in Cispus river valley near (Cat creek) and even over the water I could hear a scream twice and the snow was about one and a half feet deep on the roads and there was no sign that other people had traveled this area. My cousin did not want me to respond. Then just up the road about 3 miles on a different trip a few months later and while on a hike in a timbered area with snow about 3 feet deep as we went along an old logging road we started hearing tree knocks and other than us and a few plants as well as a few birds it was silent dead silent. The tree knocks seemed to be about 30 to 40 yards on our right in thick brush only to hear a response tree knock on our left and ahead of us about 60 to 80 yards. then we stood there and I asked them if they wanted me to respond to the knocks with more knocks or a call and they both asked if I please would not respond and they wanted to leave. I took them back to camp and let it go. I did make a hike later by myself to look for tracks and to try to get a response to tree knocks. Well no response to the knocks and the snow was disturbed by something large but again no visible detail the snow was powdery and lots more had fallen by the time I returned. I was also carrying my video and still camera when I came back but like I said nothing there where no other vehicle or human tracks in the area. I will be returning to the area this year as I do every year but this year I will be on a mission to look for more evidence and I will be calling and tree knocking because I will be alone this time so no limits this time. Thank you (Name removed by investigator)",
  "classification": "Class B",
  "county": "Cowlitz",
  "state": "Washington",
  "latitude": 46.48508,
  "longitude": -122.7372,
  "location": "-122.7372,46.48508",
  "location_details": "along highway 12",
  "temperature_high": 55.14,
  "temperature_mid": 47.055,
  "temperature_low": 38.97,
  "dew_point": 43.29,
  "humidity": 0.81,
  "cloud_cover": 0.79,
  "moon_phase": 0.4,
  "precip_intensity": 0.0069,
  "precip_probability": 0.81,
  "precip_type": "rain",
  "pressure": 1009.19,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 9.46,
  "wind_bearing": 170,
  "wind_speed": 2.63
}