{
  "reportId": "24061",
  "title": "Family gathering interrupted by 8-foot tall visitor at the kitchen window",
  "date": "1979-08-10",
  "timestamp": 303091200,
  "observed": "I was 11 yrs old and we often visited my dads family during the summer break. We arrived about 11pm and were all sitting around talking (4 men, 3 women & 5 kids).  I noticed my grandmother kept looking over her right shoulder towards the large kitchen window.  She suddenly grabbed my grandfathers leg and whispered \"Benny, there’s something in that window\". My grandfather looked at the window and calmly went into his bedroom. He called my father and uncles in after him. I got up and went in also as my granddad was taking guns off the rack and he said, \"There is something at that back window; we got to run it off\". My dad and his brothers smiled at each other, thinking it was a joke until granddad loaded his double barrel 12ga (paw-paw did NOT play with guns). My dad & uncles took the guns and ammo handed them and started for the front door. I being the oldest grandson tagged along at the rear (with an unloaded .22 rifle) feeling like I was one of the men.  I remember feeling scared but also brave going out in the dark to deal with this bear or whatever it was. Granddad and uncle got to the rear of the house, turned the corner and froze in their tracks. My uncle said \"Daddy what the hell?\" My grandad fired both barrels one after the other. I dropped my gun spun around, heading back to the front door which was locked tight! I was pounding on the door and screaming, “Let me in!” I looked to my left and where the roof meets the wall of the house I saw the outline of one shoulder and a head and two small greenish yellow eyes reflect in the porch light. During this time the men were at the rear of the house, the women and kid's were inside screaming because of the shotgun blasts, and I was pounding on the front door all, within about 5 seconds of the shots. My dad came around from the right side looking for me. I pointed to it and he put me behind him, yelling for them to open the door. In about 30 minutes we were all back in the house and pretty well freaked out. None of us slept well that night. I do remember my granddad talking to himself saying, \"Wonder where them dogs got off to?\" A couple Years later, I asked my granddad what is was he saw that night and he said it was not a bear that’s for sure. By the way, the kitchen window is about 8 feet off the ground due to the slope of the mountain.",
  "classification": "Class A",
  "county": "Mercer",
  "state": "West Virginia",
  "latitude": 37.445,
  "longitude": -80.17,
  "location": "-80.17,37.445",
  "location_details": "about 8 miles from town limits.",
  "temperature_high": 88.35,
  "temperature_mid": 78.6,
  "temperature_low": 68.85,
  "dew_point": 68.86,
  "humidity": 0.74,
  "cloud_cover": 0.27,
  "moon_phase": 0.59,
  "precip_intensity": 0.0082,
  "precip_probability": 0.59,
  "precip_type": "rain",
  "pressure": 1016.35,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 8,
  "visibility": 4.32,
  "wind_bearing": 252,
  "wind_speed": 5.96
}