{
  "reportId": "6644",
  "title": "Deer hunters have daylight sighting near Seminole.",
  "date": "1974-11-04",
  "timestamp": 152755200,
  "observed": "In the fall of 1974, my father and I were driving the backroads on a rainy, wet and cold day, looking for deer.  We stopped at an intersection and my Father made the comment \"What in the world.\"  We carried a deer rifle with a high-powered scope and my Father placed the rifle on a sand bag over the drivers side mirror and looked through the scpoe with his mouth open and told me, you have got to see this. I took the rifle placed on the passenger side mirror and watched in amazement as a creature stood in the distance pulling leaves off a tree that hung over the dirt road on which it was standing.   My father asked what I thought and my first thought was It's a bear but, as I watched I realized a bear did not have long arms that could reach 3 feet over it's head.  To our amazement 2 smaller creatures joined the other creature, playing in the water that had collected in puddles on the dirt road.  The smaller creatures were waist high to the larger and ran and played as the larger creature pulled the leaves from the branch above it. To this day I'm not certain how long we watched but, I remember I slept with my light on the the next several days.  At the time we did not get any closer than maybe 1/4 of a mile.  We were in agreement that the rifle we had did not appear to be adequate protection if we were closer to this creature.  A week later we found enough courage to to drive to the exact spot where we had seen the creature.  The branch that the creature had been pulling leaves from was over 11 feet in the air.  (That ensures it was no bear.)    We have told 1 or 2 people that we know and they think we are - well, full of it.",
  "classification": "Class A",
  "county": "Seminole",
  "state": "Oklahoma",
  "latitude": 35.26808,
  "longitude": -96.60222,
  "location": "-96.60222,35.26808",
  "location_details": "The area had very few homes at the time and the road was lightly traveled.",
  "temperature_high": 51.53,
  "temperature_mid": 45.005,
  "temperature_low": 38.48,
  "dew_point": 40.75,
  "humidity": 0.79,
  "cloud_cover": 0.66,
  "moon_phase": 0.66,
  "precip_type": "rain",
  "pressure": 1015.68,
  "summary": "Mostly cloudy until afternoon.",
  "uv_index": 2,
  "visibility": 9.16,
  "wind_bearing": 333,
  "wind_speed": 10.25
}