{
  "reportId": "5085",
  "title": "Family has nighttime sighting near Gainesville.",
  "date": "2004-12-05",
  "timestamp": 1102204800,
  "observed": "I was just a kid when I saw it.  I was sitting in the back of an old Chevy Citation at the time it was pretty new, my uncle was driving and my aunt was in the passenger seat and my little cousin who was around 4 or 5 at the time was sitting in the back with me, were coming home and I believe from visiting family or something.  My aunt & uncle lived down this old dirt road around 2 miles and right before their driveway which was on the left was and old dry branch or creek that ran across the road and it did not have a concrete slab to cross over it so you had to slow down a little to cross.  Directly to the right of the creek was an old driveway leading to an old abandoned house which no one had lived in for years.  It was dark so naturally we had the headlights on and as my uncle began slowing to pass over the rough gravel something in the corner of my right eye came into view.  My aunt kind of screamed but not loudly because we were amazed and terrified.  Something that looked to be around 8 foot tall, (I know as a 10-11 year old kid it was huge) came across the branch which led out of the old driveway and not running but walking briskly came directly in front the car.  We all just stared as it was some dream.  It was swinging it's arms a little and acted like we were not even there.  It walked across the creek and crossed the water gate which I don't remeber if it went under or over but what I do remeber is the branch had washed out the bank of my uncle's yard and his perimter fence was quite tall if you were staning in the branch and this bright red haired thing jumped over from the bed of the branch like nothing and into my uncles yard.  Mind you were still watching in the car.  We could see it walk up thru the yard and up the hill until we lost sight of it with the headlights.  My uncle turned into the drive and we had all locked the doors.  My aunt and uncle went thru the count of 3 thing and we open the doors and ran inside.  We got inside and my uncle got his hunting rifle out and went outside with his flood lite and looked for it and on his way back which he didn't walk far he tripped on the chord and it came unplugged then he yelled and got up and ran into the house and locked the door.  To this day if you ask him about what he saw he will say he saw something but he doesn't know what it was or that somebody was playing a joke on us.  My aunt will tell that she saw bigfoot and so will I.  My little cousin was to small to remeber much but I remeber and to this day I don't go out into the woods without a weapon.  To the best of my ability this is what it looked like.  It was around 7-8 foot tall, completly covered in red hair and 1 feature I remember is it looked like it's arms were almost as long as it's legs and that it was not afraid of us.  Also at that time there was a man I do not remember but lived in the area and was at the local store there in Souder, Mo. and was telling everyone he had seen bigfoot and no one believed him so none of us ever made much mention to it except to family or close friends.  But I believe. I know what I saw.",
  "classification": "Class A",
  "county": "Ozark",
  "state": "Missouri",
  "latitude": 36.615,
  "longitude": -92.425,
  "location": "-92.425,36.615",
  "location_details": "From 60 highway East from Springfield, Mo. take 5 Highway South to 95 Hwy. North and it is approx. 6 miles  then left county road.  Can't remember the # of the road.",
  "temperature_high": 59.27,
  "temperature_mid": 53.76,
  "temperature_low": 48.25,
  "dew_point": 39.71,
  "humidity": 0.87,
  "cloud_cover": 0.6,
  "moon_phase": 0.78,
  "precip_intensity": 0.0134,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1012.9,
  "summary": "Rain in the afternoon.",
  "uv_index": 1,
  "visibility": 6.36,
  "wind_bearing": 144,
  "wind_speed": 5.37
}