{
  "reportId": "1630",
  "title": "Separate Iowa incidents over time in Floyd County area",
  "date": "1977-08-01",
  "timestamp": 239241600,
  "observed": "I have three diffrent reports to give 2 are back in 77 and one just last year..the reson for this reporting is  that these sighting have all been in the same area.the DNR of the area has had at least 6 diffrent reporting if you wish to check into them.the six plus one sighting contact the dnr of floyd county in floyd county iowa.  story1 fourth week of August 1977. Late saturdaynight,it was pitch black outside,fishing for catfish i always carry a flash light when we go fishing because at night you can see the racoons fighting on the cedar river.We where camping at idlewild park.We where fishing no more then 100 yards from the camp sight.there was 4 of us to start with F.W., S.W., D.W. and myself (K.W.)after awhile F.W. and D.W. left, leaving me and S.W alone. after awhile, S.W. decide it was time to go back to camp. when she got up there was a loud noise across the river,whats that S.W. asked.so i shined the light across the river which was about 150 feet from us.I started to shining the light at the river edge slowly lifting it into the low overhanging limbs .then i seen them big red .i replyed to S.W. it was probally a bear eyes Then the limbs started moving and the eyes started dropping down closer to the rivers edge, and then you could see a large body, I said its probably a bear. About then the whatever straightened up and walked right at us, the eyes were 6-7 feet above the water, and then the thought came to mind, dont bears while in the water generally walk on all fours? You can call this animal very dark brown or blackish color. It waded about fifty foot out raising it's feet out of the water bringing them down flat on the water, kind of a sploosh-sploosh effect. Then it turned down river and started walking at a faster rate. As I raised the light up towards it's head, it kept on walking turning it's head us and giving a low guttering sound at us. I said to S.W. \" I dont know about you, but I am getting the hell out of hear\". As we were headed back to camp you could hear sploosh-sploosh-sploosh- in about half second intervals. When we got back to camp you could still hear it going down the river. Somebody mentioned whats all that splashing noise? When we got back to camp we heard a dog howling. From what I could see of htis animal, when standing on land it would have been seven foot tall, and a quick estimate of it's wieght around four to five hundred pounds. I dont pretend to be an export on it, but I know what I seen. I had never seen it befor and I have never seen it again, but whatever it is, it was alive, it was real and it's out there somewhere. The next morning there is a Farmer who lives a quarter of a mile south of the campground, He showed up about 10:00 a.m.,and asked what we were doing-we asked what he was refering to.He mentioned that his dog was getting old and that last night his dog howled from 11:00p.m. to daylight and had never done it before.  E.W. September 1977 Finally got a good rain, on a wednesday, about 3 inches. But even the sand pits where my Dad worked started to dry right up. The pits were close to the river and the water level fluxuated with the river depth. Ten days later my dad called me and said to come on up, I've got something to show you. Anyway, I showed up about 9:00 a.m. and my brother, F.W. showed up shortly after i did. We had out kids with us, but Dad said I want to show you boy's something and you kids stay here with your Grandma and Mothers. We were getting uneasy, knowing he did'nt want the kids with us. He said to follow me, wher he worked was about 400 yards from his house he ran a dragline and dredged gravel with it. As we walked up to the first the edge of the pit and all around the waters edge was fresh slick mud. As Dad walked down around a slope, he mentioned to come on down, he showed us where something had walked into the shallow water. The tracks going was in were smeared because of the soft mud, now he said look a this. The water was clear like a fish bowl. In the water and all around were frog legs whatever it was pocked the froggs up by the legs, ate off the head and torso & threw the legs down.  Now he said look at these footprints, as it waded out of the pool and was leaving, it's prints became clearer and clearer. The big toes pointed slightly outward, the prints were about 10 inches long. The first four toes were in line except for the little to which set back about 1 inch and in the fresh mud you could see hair markings around the outside of the foot. The prints were 18in. form heel mark to other foot front,  and the footprints pointed outward as it walked up on the sand ledge and then entered small willows growing in the lower parts of the big pit. We followed it through the pit.Then it crawled up a 20ft. sand and rocky endbankment, entering into a small wooded area with small dead and live elms, mostly grass and small vegetatation . You could easily see where it was walking knocking down the grass. The tracks were fairly fresh because the gras weeds were still laying flat. We hurried as fast as we could, but it got to the river and crossed a large shallow riffle. This would be th Shell Rock River. Whatever it was, was smart enough to walk around the mud wash. This is where all the mud goes after being washed out of the sand and gravel. It's about 1 acre in size and is posted keep out danger, if you walked out in the mud, it's just like quick sand. Now tell me what that was. I have been a fisherman ,trapper and hunterfor fifty years and neverseen anything like it. i jokingly told my brother whatever it was, was real lucky or it can read. We estimate the weight at around 60-80 pounds . we had the feeling something was watching us, like maybe this was a baby and ma-ma was just out of sight watching us. It's probably a good  thing we did not catchit. No odors. Do you know what it is like to have the hair satand up on the nape of your neck and can't see the reason why?  E.W.     June of 2000 sight of unkown animal about 6-7 foot tall, from a distance black hauiry greature,which stood on 2 legs and was able to cross the cedar river in west idle wild park was seen by B.W. and his girl friend .this is when the Floyd DNRs where called .to our suprise they said there had been six stange sightings in the last month or so. these storys are true .my wife has relatives in Charle City IA that say there where many reported sightingsof a unknowm creature.we would like you to respond to these storys .you can get actual storys from these people.",
  "classification": "Class A",
  "county": "Floyd",
  "state": "Iowa",
  "latitude": 43.17215,
  "longitude": -92.76577,
  "location": "-92.76577,43.17215",
  "location_details": "2 sightings at Idlewild Park in Floyd County is the first sighting, happened within 100 -200 yards from East Idlewild Park campgrounds. The thrid sighting was at West Idlewild Park which is about 2 miles upstream. The second sighting was in Clarksville IA in 77 of footprints.at the Knocksville Sand and Gravel Pits .These areas are well wooded and hard to get around in.  Very few, if any, other people go to any of these places",
  "temperature_high": 83.4,
  "temperature_mid": 72.185,
  "temperature_low": 60.97,
  "dew_point": 53.98,
  "humidity": 0.67,
  "cloud_cover": 0.31,
  "moon_phase": 0.58,
  "precip_intensity": 0.002,
  "precip_probability": 0.53,
  "precip_type": "rain",
  "pressure": 1016.47,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 7,
  "visibility": 9.83,
  "wind_bearing": 232,
  "wind_speed": 6.77
}