{
  "reportId": "11514",
  "title": "Evening sighting by motorists north of Flagstaff.",
  "date": "1990-07-01",
  "timestamp": 646790400,
  "observed": "About 15 years ago my girlfriend at the time and I took a trip from our home in Albuquerque NM to Los Angeles to visit my mother. On our trip home we decided to stop by the Grand Canyon in Arizona because she had never seen it. We got there pretty late in the afternoon and we stayed to view the sunset over the canyon. We departed for Flagstaff soon after it had gotten dark. We headed down a less traveled stretch of road as a short cut. I do admit that I don't remember the highway number, but I will look it up. The road had next to no traffic on it and my friend and I took advantage of the time to talk. The highway was very curvy and we had just come out of a turn into a fairly long straight away when we noticed something walking down the right side of the road on the shoulder. Note the rest of this took place in amatter of a few short minutes although it seemed like an hour. What we saw was walking upright like a man, but was noticibly larger. As we got closer my girlfriend said \"is that a bear?\" It was at that moment that it became visible that our companion on the road was covered head to toe in brown to light-brown fur (hair). It was also at that moment that I realized what we were looking at. I had seen enough TV and heard enough hunting stories from my dad. I stopped the car. Our headlights now shown into the area that the bigfoot could see them and it stopped as well. We were about 50 yards apart at this point maybe closer. It then turned to face us. I'll never forget this moment it is burned into my memory. At first the animal turned it's head slightly to look back, but it's head seemed to be attached at the chest so it had to turn completly to face us. We didn't make a sound. We were in complete shock. Our friend was about seven feet tall and was covered head to toe in hair. The body was somewhat without definition as in I didn't make out features like hips or gender. The arms seemed to be abnormally long...maybe to just above the knee. The face was mostly hairless and looked...well without something else to compare it to kinda like a charactor from Planet of the Apes. Not exactly, but this creature deffinatly was from the ape family with just a touch of human looks. The eyes seemed to glow a bit green like a cat or dog in the headlights. It stood there for a matter of seconds and I could tell that it was thinking about it's next move. It ran it's tongue across the front of it's upper teeth in pondurance. It took one small step in our direction. My girlfriend went bizerk. She screamed in horror. It stopped it's forward movement, looked around, and headed into the woods near the road in a couple of strides. We never got another look at it. My girlfriend quickly got it together and wanted out of the area. I agreed. We took of and i made a wide turn around the area that the Bigfoot had once stood. I never got the feeling that it ment us any harm, but was very curious about what we were. You couldn't convince my girlfriend of that though. The event shocked here for life and she refused to ever talk about it again. To this day I'm sure she has blocked it out. I on the other hand will never forget it. It did take me years before I could tell my wife about my encounter. I am only posting my story for my own therapy and the hope that it will help someone else who has gone through something like this.",
  "classification": "Class A",
  "county": "Coconino",
  "state": "Arizona",
  "latitude": 35.656,
  "longitude": -111.938,
  "location": "-111.938,35.656",
  "location_details": "On a curvy stretch of two lane highway. I think it is Highway 180. Maybe 15 miles from the Grand Canyon.",
  "temperature_high": 93.27,
  "temperature_mid": 79.24,
  "temperature_low": 65.21,
  "dew_point": 46.37,
  "humidity": 0.31,
  "cloud_cover": 0.31,
  "moon_phase": 0.31,
  "precip_intensity": 0.0063,
  "precip_probability": 0.68,
  "precip_type": "rain",
  "pressure": 1013.88,
  "summary": "Rain starting in the afternoon, continuing until evening.",
  "uv_index": 10,
  "visibility": 9,
  "wind_bearing": 211,
  "wind_speed": 1.65
}