{
  "id": "28381",
  "title": "Campers hear multiple whooping sounds at Linville Falls",
  "date": "2011-06-17",
  "timestamp": 1308268800,
  "observed": "While on vacation, my family and I were camping at Linville trailer lodge and campground in Linville North Carolina. On June 15th, 2010 we were all sleeping in our pop up camper. At 2:00 am I was woke up by the sound of an animal to the south east of our camper. Its calls were 4 short whoops followed by 1 double whoop. After listening to that for a couple of minutes I heard another one calling from the North West. Its call was 3 short whoops followed by a double whoop. While listening to that one, another from the North West started calling. Its calls were 2 short whoops followed by a double whoop. After a couple of minutes I could hear them calling and moving towards the north east. It sounded like they were with in 100 yards of our camper but I was the only one that got woke up. On June 17th we got ready for bed about 9:00 pm. around 9:30 pm I could hear the same calls as the second and third animals from 2 nights before, they were much further away this time. My 8 yr old daughter heard them also and asked what kind of animal makes that sound? I did not answer her. After we got home I got onto your web sight and played the whoops and knocks from the Sierra Nevada Mountains, my daughter came running from her bed room and said that is what I heard the other day. Then I explained to her what it was she heard.",
  "classification": "Class B",
  "county": "Avery",
  "state": "North Carolina",
  "latitude": 35.95865,
  "longitude": -81.95195,
  "location": "-81.95195,35.95865",
  "location_details": "heavy wooded area around campground",
  "temperature_high": 82.33,
  "temperature_mid": 73.005,
  "temperature_low": 63.68,
  "dew_point": 58.03,
  "humidity": 0.71,
  "cloud_cover": 0.16,
  "moon_phase": 0.57,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.27,
  "summary": "Partly cloudy starting in the evening.",
  "uv_index": 12,
  "visibility": 9.59,
  "wind_bearing": 254,
  "wind_speed": 2.24
}