{
  "reportId": "16489",
  "title": "Camper describes trees shaken and possible encounter near Waverly",
  "date": "2002-09-07",
  "timestamp": 1031356800,
  "observed": "I've been an avid outdoorsman in the Pike and Ross county areas for years. (Bow Hunting) On many, many occassions I have heard the growls, screams, holwls, and drum-like beatings; mostly in the early morning hours between (1am and 3am). Several times I have observed \"something\" moving across the edge of my vision, and when I tried to find tracks, or make a determination as to what actually occured; the only thing that I could find was scratch marks high up on trees. Since there are no grizzly bears in that particular area, it was easy to guess what made these tears in solid wood. INCIDENT: Near Lake Jackson (SE of Waverly): My friends and I were hunting/camping beside an old gravel pit surrounded by high cliffs and ponds. During the late evening hours we all smelled a peculiar \"wet dog/skunk\" odor emmanating from across the small pond. My best friend and I armed ourselves (feral dog do roam the area) and proceeded to the other side of the pond. There is a small dike that runs from one side to the other. Halfway across the dike there was a series of frightening growls coming from the edge of the treeline. Immediatley after bushes and medium size trees were being violently shaken, as if in a warning for us to stay away. (We took the advice and retreated back to our side of the pond) The rest of the night was spent listening to soft moaning, somtimes howls, and on one occassion rocksw and tree limbs sailed across the pond towards us. The next morning we once again armed ourselves and checked out the area across the pond. There were no trail-signs, no hair, nothing that would indicate a track. (And-I am a decent enough tracker). Throughout the next few years I returned to that area many times, and always had this very keen sense that I was being watched. Sometimes to the point that my hair would stand on end. There are still certain deep hollows (600' deep) that I ABSOLUTELY) will not go into. In one particular hollow; everytime I go down into it, there seems to be a sense that I am in danger. A survey of the area was startling: The hollows; which range from 25' to 900' deep, run along the entire region into WV and parts of PA. One could litteraly walk state to state, and never emerge into sunlight. I have since moved from Ohio to Wyoming. and I am sure the locals (many of whom have substantiaed my thoughts on this) still hear the screams and wolf-like howls.",
  "classification": "Class B",
  "county": "Ross",
  "state": "Ohio",
  "latitude": 39.10495,
  "longitude": -82.79665,
  "location": "-82.79665,39.10495",
  "location_details": "Near and around Lake Jackson. Also several howls in the area around Hay Hollow. The SCARRY HOLLOW (my name for it) is located on top of Hay Hollow. EXACTLY located across from (NW Line Of Sight) from old white church.",
  "temperature_high": 93.19,
  "temperature_mid": 77.855,
  "temperature_low": 62.52,
  "dew_point": 58.88,
  "humidity": 0.58,
  "cloud_cover": 0.06,
  "moon_phase": 0.02,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.06,
  "summary": "Clear throughout the day.",
  "uv_index": 7,
  "visibility": 9.68,
  "wind_bearing": 101,
  "wind_speed": 2.64
}