{
  "reportId": "12824",
  "title": "Two sets of tracks found near Lake DeGray.",
  "date": "2005-10-16",
  "timestamp": 1129420800,
  "observed": "Wednesday, October, 12, 2005 our neighbors dogs were very active and barking all night.  The next morning about 5:30am my own dog was barking in the backyard.  I opened the door to calm her down and I heard something in the back of our property near the fruit trees.  It was very heavy sounding and I could hear branches breaking as it departed.  The next morning around 8:30am my husband went to his truck in the backyard and heard something behind our shop take off running.  He thought it was a hunter and ran to the back to listen.  He thought it sounded like it was on two feet.  He said it stomped very heavily as it was running through the woods and he could hear snorting.  Sunday, October 16th, I went walking around the neighborhood road and discovered several sets of large and small barefootprints on the gray slate road in front of our house.  At first I thought it was a childs footprint until I looked closer.  There were two sets.  The largest measured 13.5 by 7 inches and the small print measured 9 by 4 inches. I took pictures of all the prints and measured each print.  They consistenly measured the same size.  The large print is about 3 inches wider than my husbands foot and he's a big man.",
  "classification": "Class B",
  "county": "Hot Spring",
  "state": "Arkansas",
  "latitude": 34.31611,
  "longitude": -93.17056,
  "location": "-93.17056,34.31611",
  "location_details": "This area is in the Arlie Moore area of the corp land surrounding Lake DeGray.",
  "temperature_high": 81.28,
  "temperature_mid": 67.135,
  "temperature_low": 52.99,
  "dew_point": 53.28,
  "humidity": 0.67,
  "cloud_cover": 0.03,
  "moon_phase": 0.47,
  "precip_intensity": 0.0001,
  "precip_probability": 0.15,
  "precip_type": "rain",
  "pressure": 1018.76,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.26,
  "wind_bearing": 72,
  "wind_speed": 2.85
}