{
  "id": "15844",
  "title": "Possible sounds heard, etc., in Kickapoo State Park",
  "date": "2005-10-01",
  "timestamp": 1128124800,
  "observed": "This is a two part report of what may be easily explained,or not.  My first odd experience was in Kickapoo State Park, in Vermilion County Illinois,in Oct.2005. I was fishing at a pond in the park, when I heard two BIG splashes in the river about 50 to 75 yards behind me. My first thought was a deer bounded across the river, then I heard the most awful scream I've ever heard. Almost immediately after the scream, I could hear what sounded like a scuffle in the dry leaves. After the rustling in the leaves stopped, I could hear what sounded like a large cat breathing hard or \"purring\". I don't know how else to explain it. [We don't have large cats in our area.] The purring sound lasted maybe a minute, then I could hear this creature moving away. I'm an old Boy Scout, and have spent alot of time camping in this area, and I know most of the sounds in the night woods. This sound flat out scared me. It bothered me enough that I went home. I got home and my wife asked me why I was home so early. I told her the story, and thought that was the end of the story. Untill.... the following spring, fishing along my favorite stretch of the same river, I run across a tree that had been snapped over (I can take you to it). That may very well be explained by spring flood waters, but I find it odd, the direction it is snapped. In early summer (late May,early June) I was driving through the park, and smelled a terrible musky stench.There are alot of deer in this area, but you almost have to be standing next to them to smell them.   I don't think we have enough wooded habitat to harbor these kinds of animals, but it is a large enough area for them to use as a \"highway\". I have not observed any footprints on the soft sandbars. I'm not a jumpy type of person, but I no longer go to my fishin' hole alone.",
  "classification": "Class B",
  "county": "Vermilion",
  "state": "Illinois",
  "latitude": 40.1527,
  "longitude": -87.7424,
  "location": "-87.7424,40.1527",
  "location_details": "Vermilion County  - Kickapoo State Park [specific directions edited out per request of witness]",
  "temperature_high": 79.24,
  "temperature_mid": 68.29,
  "temperature_low": 57.34,
  "dew_point": 48.3,
  "humidity": 0.64,
  "cloud_cover": 0.01,
  "moon_phase": 0.94,
  "precip_intensity": 0.0004,
  "precip_probability": 0.15,
  "precip_type": "rain",
  "pressure": 1019.99,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.72,
  "wind_bearing": 168,
  "wind_speed": 5.31
}