{
  "id": "4393",
  "title": "Early morning sighting of large, upright animal on rural bridge in Southern Georgia",
  "date": "2002-06-10",
  "timestamp": 1023667200,
  "observed": "Last December in Brooks County Georgia in the early hours of the morning I was driving home to Florida on Clyattville Road. I was approaching the longest bridge between ROCKY FORD ROAD & Rt 53, I saw something that looked like very tall man standing near the side of the bridge. I had my bright lights on, so I flashed my lights to warn this pedestrian at this hour that I was approaching. I then tapped the horn, but this very large figure didn't run. It appeared as I drew closer to be reaching for something beyond the bridge, (perhaps leaves of the trees) I began to slow down as I approached the bridge, fearing this very big man was drunk, and would stagger in front of my car. But as I approached the object I saw this was either a GIANT of a man in a shaggy fur coat, or a HUGH animal I had never seen! It was standing on two feet, and its arms were long, this I noticed as it turned its head toward the car, it dropped one arm to its side. I cannot describe its face, because I was \"SCARED\" nearly to , because as it turned its head my lights reflecked in its eye, and it glowed RED, instead of green, or yellow, as I am used to seeing from animals I had viewed at night on the road. I was scared so bad I raced home, but didn't mention this until weeks later to even my husband, because I was trying to rationalize this in my mind as fatigue, night illusions whatever I could label it. Besides I was afraid of being told I was crazy. I am a professional that needs to remain sane in the public's eye! I would very much like to get some feed back on this, but I positively do NOT want my name, or profile mentioned on the internet! I am willing to work with anyone that is serious about finding what this is,but I must maintain a low public profile, because not only am I a professional, but I am a woman! But I am NOT a crazy woman, I know positively what I saw!",
  "classification": "Class A",
  "county": "Brooks",
  "state": "Georgia",
  "latitude": 30.67,
  "longitude": -83.412,
  "location": "-83.412,30.67",
  "location_details": "This occured on Clyattville Road between Rocky Ford Rd. and Route 53",
  "temperature_high": 86.25,
  "temperature_mid": 78.025,
  "temperature_low": 69.8,
  "dew_point": 67.73,
  "humidity": 0.76,
  "cloud_cover": 0.4,
  "moon_phase": 0.99,
  "precip_intensity": 0.0028,
  "precip_probability": 0.62,
  "precip_type": "rain",
  "pressure": 1016.9,
  "summary": "Partly cloudy until evening.",
  "uv_index": 8,
  "visibility": 9.06,
  "wind_bearing": 60,
  "wind_speed": 7.27
}