{
  "reportId": "25137",
  "title": "Memory told of a possible late night sighting while driving near Hurlock",
  "date": "1999-04-15",
  "timestamp": 924134400,
  "observed": "This incident occurred on a surf trip to Ocean City Md. with my high school friend and surfing buddy but we had gone up rt. 404 into Delaware to cut down from Rehobeth beach. I'm not sure where EXACTLY but it was between a number of farms and on a road off of 404 which we considered a shortcut. The area was dense pine trees and I would guess it was late spring as there was no traffic at all and usually in summer there was even at the time we were travelling, between 3 and 4 AM. We were moving at about 60 to 70 MPH and looking out for deer and were very much awake. I saw a pair of eyes off in the woods some ways up, perhaps 100 meters when I noticed them and as we were closing rapidly I braked fairly heavily. My friend and I saw what I can only describe as an absolutely enormous hairy creature moving VERY fast from the passenger side of the road to the left side. I would estimate it to be at least 8 feet to the shoulder and hunched forward, almost on four legs but definitely NOT a quadruped. It was positively terrifying and we both looked at each other and said \"WHAT THE HELL WAS THAT?!?!\". I will never forget the size of the thing. Neither of us have any idea what it was but both of us were outdoorsmen and camped regularly and experienced in the woods. For many years afterward we have speculated what it was and I think I may have told three or four people about it but never was taken entirely seriously.",
  "classification": "Class B",
  "county": "Dorchester",
  "state": "Maryland",
  "latitude": 38.63295,
  "longitude": -75.80465,
  "location": "-75.80465,38.63295",
  "location_details": "near pine forest and creeks",
  "temperature_high": 60.11,
  "temperature_mid": 53.85,
  "temperature_low": 47.59,
  "dew_point": 39.04,
  "humidity": 0.63,
  "cloud_cover": 0.6,
  "moon_phase": 0.98,
  "precip_type": "rain",
  "pressure": 1008.88,
  "summary": "Rain starting in the evening.",
  "uv_index": 6,
  "visibility": 8.49,
  "wind_bearing": 217,
  "wind_speed": 1.35
}