{
  "reportId": "34555",
  "title": "Woman recalls her nighttime face to face encounter at her window outside Tulsa",
  "date": "1966-08-15",
  "timestamp": -106704000,
  "observed": "I had 2 girlfriends spending the night. It was a hot summer evening and we were laying across the bed, instead of with our heads by the headboard, with the window open to catch the breeze. We were talking and laughing, as young girls do, looking out the window occasionally. Approximately midnight, we had settled down some and were just quietly talking about what we had done that day. My mother and sister were sleeping in an adjacent bedroom and we were trying not to wake them. We heard something outside and the three of us raised up to see if we could determine what it was. First it was just footsteps we heard, then the bushes in front of the window moved, shook, and then a large hair covered face rose in the window. The head was huge and my first thought was that it was an ape but realized it wasn't. My two friends rolled away from the window and began crying. I was so completely frozen with fear that I could not move. There was only a screen and a few inches separating me from this creature and I live to this day with that face etched in my memory. The eyes especially, staring directly at me and the smell of something musky. I slowly was able to move and turned and began screaming hysterically. My mother ran to the room turned the light on, we ran out to the living room. We began describing the creature to her and she called the police.  They came to our house, searched the area and never found a thing. The experience changed me forever. I tell all of my grandchildren this story and one of my grandsons encouraged me to put this on the web. So here it is. The description of bigfoot, that I have heard over the last few years, fit the creature I saw face to face and I will never forget it.",
  "classification": "Class A",
  "county": "Tulsa",
  "state": "Oklahoma",
  "latitude": 36.13222,
  "longitude": -95.79677,
  "location": "-95.79677,36.13222",
  "location_details": "On the edge of town, new housing. West of Cincinnati near end of 46th st. N.",
  "temperature_high": 94.8,
  "temperature_mid": 85.26,
  "temperature_low": 75.72,
  "dew_point": 71.69,
  "humidity": 0.7,
  "cloud_cover": 0.41,
  "moon_phase": 0.96,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1012.67,
  "summary": "Humid throughout the day and breezy starting in the afternoon.",
  "uv_index": 8,
  "visibility": 10,
  "wind_bearing": 196,
  "wind_speed": 14.39
}