{
  "reportId": "13961",
  "title": "Possible stalking of boar hunters at night outside Okeechobee",
  "date": "2003-08-15",
  "timestamp": 1060905600,
  "observed": "Hello. I live in okeechobee co. florida. I am a christian and a family man and this report is as factual as I can make it, as god is my witness. I was not alone when this account occured. here are the details. Me and my hunting buddy were hunting boar with dogs one evening a few sommers back. We were on private land and not allowed to be there wich is why I suppose I never got to see what scared us so bad, I will explain. Me and tim were huntin all nite, mostly letting the dogs run and we just sit and listen for baying and then run to the dogs, catch the pig and release it. well this evening we had just left the treeling bordering a swampy area and were crouching down resting and smoking, Id guess it was 3am. Suddenly as we sat there, we heared what sounded like footsteps. We stood up and looked and listened, they immediately stopped.. we both whispered \"what was that\" to each other fearing a game warden or the owner of the land..then we heared a palm frond move and two distinct steps.We looked at eachother and ran three steps, stopped looked wide eyed, unsure of what we were hearing. then we heared a frond move and three steps and again it stopped. We turned, ran two and stoppped then we noticed it was immitating us, stopping when we did etc and comming closer. again we turned and took a step and it took a step and stopped. Me and tim looked at eachother and ran as fast as we could, we knew it was a game warden or a person, it had to be. we stopped after 200 yards or so and turned and looked there was nothing behind us but along the tree line we had left ( we were now 250yds across the swampy opening across from the tree line) about at 2 O clock position in the distance we coul hear something smashing its way through the undergrowth and breaking everything it touched heading away from us... we would always talk about it and I personally regret running, I had a strong light, I should havetried to get it closer, I think I could have, it was interested and following us. I know it was no animal, was easy to tell because you could hear it clear the path and then take distinct steps.. each step the exact count of our own. that is my story but I would like to add this. Timmy has been dog hunting every nite for 5 or more years  and after this incedent he described a  swtrange encounter where he was with three other people who all saw the same thing... He stated that one nite while hog hunting during a half moon him and the guys were stopped and resting when tim noticed an outline at the bottom of a tree.. all the guys looked and they became concerned and frightned because there was the distinct outline of a huge man sitting at the base of that tree, plainly outlined sitting on his butt, feet streight out in front of it..Tim said it had huge shoulders and was just eanourmous..he said \" We freaked out and ran like hell\" funny thing is it was again private land and at first they thought it was a warden, but after a few mins they had no idea what it was but became extremely afraid of that massive torso sitting at the base of that tree watching them. ( I am beginning to notice there is almost always a tree involved in these sightings) I believe timmy, there is no person I know who has covered more ground in pitch black woods than him and we spent a few together doing it. Honestly it has haunted me since and led me here to study and make an effort of my own to discover this being. That is all I have, take care. George",
  "classification": "Class B",
  "county": "Okeechobee",
  "state": "Florida",
  "latitude": 27.35644,
  "longitude": -80.96515,
  "location": "-80.96515,27.35644",
  "location_details": "I do not wish to disclose this as I may return",
  "temperature_high": 85.68,
  "temperature_mid": 80.275,
  "temperature_low": 74.87,
  "dew_point": 75.05,
  "humidity": 0.83,
  "cloud_cover": 0.32,
  "moon_phase": 0.62,
  "precip_intensity": 0.0127,
  "precip_probability": 0.48,
  "precip_type": "rain",
  "pressure": 1020.02,
  "summary": "Rain in the afternoon and evening.",
  "uv_index": 8,
  "visibility": 9.37,
  "wind_bearing": 88,
  "wind_speed": 7.07
}