{
  "reportId": "27307",
  "title": "Man and son have encounter while setting off fireworks near Pottsboro",
  "date": "2006-07-04",
  "timestamp": 1151971200,
  "observed": "I have never spoken to anyone about this incident and really don't care who believes me or not! A long time has passed since my encounter and I don't remember much about the events leading up to and after the incident, however, I can still hear and feel fear when I remember the specific encounter. I was enjoying a weekend on Lake Texoma, Texas with my family, outside of Mill Creek Marina, near Pottsboro Texas. Fourth of July weekend and we had several family members enjoying the weekend with us on the boat dock. As night fell we could not wait to watch fireworks pop into the night sky over the water, we had also purchased a large number of fireworks and were disappointed when we were told we could not pop them off near the dock. So we decided to take a small dingy over to the other side of the lake, which is next to an unpopulated area of woods directly across from our dock, about two-hundred yards away. We figured if we could row over to the isolated beach we could pop them off without incident and our family could see them in the air. My son and I rowed over to the beach and began to set up our area to pop them off, so we began our show, we could hear our families cheers echo across the water from the dock, cheering as each folley went off in the air. Between lighting each selected firecracker, silence feel around us and all our family could see was our flashlights in the distance. My son was only 15yrs old and he was consumed with the fireworks, me on the other hand was watching for safety and keeping an eye on the dingy, you know just being a dad. Between fireworks I started to hear behind me in the dense woods a crackling noise and a sound I can only describe as a grunted or wooshing grunt sound very loudly, I sorta ignored it a first and then I began to pay more attention, my son concentrating on the next firework to light he was not registering the noise, suddenly the noise got much louder and my son stated, \"What was that Dad?\" I grabbed the flashlight and shined into the dark woods, it was so thick and dark, I could not see anything, the noise kinda stopped for a bit and I told my son, I think some farmer has some cows or something in those woods. The breathing and grunting noises reminded me of cows grunted or making bellowing noises. As a few minutes passed the noises seemed to be getting closer and reality set in, no fences and dense woods, I knew the area and several miles of dense woods was all that show on the local maps, so I began to constantly pay attention to the noises. My son was in the process of lighting another firework and I heard crashing of branches and grunting, a fowl smell, like body odor, I raised the flashlight into the woods and briefly just fleetingly between some trees, I saw a large, very large outline shadow of a man or wide man, with a shaggy appearence, no features only the outline, may have been a man for all I know, but if it was, it was one big dude, very wide in stature, in the middle of nowhere, with nothing to do but scare me. I looked back at my son and he was still trying to get the firecracker lit, I grabbed him, calmly told him to get into the dingy and we paddled away fast, despite my sons complaints, we left the folding chair, the remaining fireworks and a small cooler, I left and did not look back until I was well away from the bank. I got back to the dock across the lake, took out my map in the boat and surveyed the area around me, the map showed only dense woods, no camping grounds or marina's, only a dense wooded area unpopulated about 3 to 4 square miles in depth. Part of this area is zoned for bow hunting by the Hagerman Widelife refuge. My son still wonders what the noises were and I still get creeped out everytime I think about that night, something or someone was in those woods and took upon themselves to make noise because we had invaded that part of an unpopulated area, since that holiday night, I have heard others say they have heard people mention some sitings of bigfoot, but nothing substantiated. ",
  "classification": "Class B",
  "county": "Grayson",
  "state": "Texas",
  "latitude": 33.81435,
  "longitude": -96.76199,
  "location": "-96.76199,33.81435",
  "location_details": "West on FM987 10 miles outside Pottsboro Texas, near Mill Creek Marina",
  "temperature_high": 88.49,
  "temperature_mid": 81.1,
  "temperature_low": 73.71,
  "dew_point": 70.05,
  "humidity": 0.72,
  "cloud_cover": 0.35,
  "moon_phase": 0.28,
  "precip_intensity": 0.0128,
  "precip_probability": 0.75,
  "precip_type": "rain",
  "pressure": 1015.71,
  "summary": "Rain starting in the afternoon, continuing until evening.",
  "uv_index": 9,
  "visibility": 9.85,
  "wind_bearing": 146,
  "wind_speed": 2.74
}