{
  "id": "3336",
  "title": "Person awakes to a 'howling' or 'wailing' sound just outside the house; he compares the sound to a recorded howl of a bigfoot",
  "date": "1998-03-31",
  "timestamp": 891302400,
  "observed": "I was spending the night at a friends house, after a day's hunting in the nearby woodlands and swamps. It was about 3:00am in the morning, when I awoke to a 'howling', or 'wailing' sound  just outside the house, coming from the direction of the woods. This lasted for probably 30 seconds to a minute. My buddy, sleeping on the floor a few feet away, was not awakened by the sound. I was frightened, so I did not get up to investigate. It took my at least an hour to fall back asleep. I never associated this sound with 'bigfoot', until now. I downloaded the \"Howl.wav\" (http://BFRO.net/AVEVID/MJM/ohsket.htm) file from your web site. It has a eerie howling sound, with dogs obviously reacting to the noise. I had chills when I heard this, because it was very similar, if not identical to the sound I had heard that early morning. I have played it over and over again. I am a hunter and outdoors man, and I had never heard an animal make this sound before. It was definitely 'organic' in origin. I never thought about Bigfoot living in this part of the state, because the surrounding areas are somewhat populated. There are, however, lots of rural swamp lands and forest areas. Although I have no further evidence to back up my claims, I thought this would be worthy to report. I'd be interested to know if Bigfoot really could exist in a coastal woodlands area, rather than the mountainous regions that the creature is normally associated with.",
  "classification": "Class B",
  "county": "Pender",
  "state": "North Carolina",
  "latitude": 34.3924,
  "longitude": -77.7485,
  "location": "-77.7485,34.3924",
  "location_details": "Near Hampstead, Pender County, North Carolina. North of Wilmington, NC, on the south-east part of the state. Nearest major road is Highway 17 (Market Street).",
  "temperature_high": 78.44,
  "temperature_mid": 72.55,
  "temperature_low": 66.66,
  "dew_point": 61.55,
  "humidity": 0.75,
  "cloud_cover": 0.31,
  "moon_phase": 0.14,
  "precip_intensity": 0.0004,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1018.18,
  "summary": "Partly cloudy until evening.",
  "uv_index": 7,
  "visibility": 8.91,
  "wind_bearing": 186,
  "wind_speed": 11.14
}