{
  "reportId": "2935",
  "title": "Father and son see large footprints outside Orick",
  "date": "1969-09-01",
  "timestamp": -10540800,
  "observed": "I grew up in the woods of the Pacific Northwest.  My father also grew up there. He was born in Klamath Falls, Oregon, but grew up in the eastern SF Bay Area.  He has a BS in Forestry, A Masters in Zoology, and A PHD in Entomology, and worked as a research scientist with the U.S. Forest Service.  For most of his 20-30 years of service, my father did research on insects that predate timber harvest species in California and Oregon.  When he did his research (usually in the summer and fall) my younger brother and I would accompany him into the woods.  My father was and is a great woodsman, a hunter and fisherman, who taught my brother and myself all about the forests and what types of plants and animals lived there.  My father was also a man of science and this is important to note as will become evident later. At the end of each summer season, my family and some other forestry families would get together and take several weeks of vacation.  Most often, we would load canoes and float down the lower 15-30 miles of the Klamath River to its mouth.  My father and I would fly fish for steelhead in the riffles during mornings and evenings and we would spend the hot hours of the day canoeing, exploring, resting, etc. These trips would often take one to two weeks to complete.  During one of these trips (probably in 1969 or 1970, I was about 8-9 years old I think...) we made camp on the river bar at the mouth of Tek-Tah creek.  There was a good flat bar there, and at that time of year, the creek was flowing under the sand and apeared dry. One afternoon, while everyone else was napping, my father and I took a walk up the creek bed to see if the creek was flowing on the surface somewhere inland.  About two hundred yards upsteream, the creek did come to the surface and flowed sluggishly thruogh a series of large pools. I remember my dad telling me that these pools were probably full of baby salmon and steelhead waitng for fall rains to allow them to swim down to the main river and out to sea.  My dad had a very scientific mind and he would describe natural processes in great detail when we had the patience to listen. As we proceeded inland up the creek, we rounded a bend and entered a long, sandy bar on the east side of a long arching pool in the creek. As I looked across the surface of this bar, I saw a set of tracks in the soft sand. These tracks caught my attention because they were very large, and the space between them seemed very long, like if I laid down next to them, they would almost be further apart than the legth of my body.  The tracks also seemed to sink alot deeper into the sand than the footprints of my dad, who is pretty big (6',2\"). The tracks began at the water's edge at the lower end of the bar, and proceeded diagonally across the bar in a straight line to the far end of the bar. My father had never told me any stories about bigfoot  (he would deny the existence of any animal that was \"unknown\" until science recognized it anyhow) and to my knowledge, I had not heard of any such animal at that time, nor had I any thing more than a passing interest in these types of things then, but these tracks...thier size, gait, and the way they led across the bar in a strieght line...they made a funny impression on me.  My father was also very interested in the tracks, he asked me please not to walk near or in them, then asked me to sit down while he spent several minutes comparing his foot size to them, and trying to match thier spacing by walking next to them.  He seemed very tense, as if he sensed something, or was trying to figure something out.  Eventually, I got bored of sitting and got up and followed him. When I finally caught up with him, we were half-way up the bar.  He had stopped looking at the tracks and was instead looking intently at the timber ahead and at the southern edge of the bar.  He was very quiet and tense.  I have never seen my father frightened or worried about anything before, or since for that matter, but watching him the way he scanned the surrounding forest so intently, made me very nervous and excited.  I broke the silence and began to ask him what he thought made the tracks and what was he trying to see in the trees...He turned around, almost jumping a little in suprise, and told me to be quiet.  then he looked around some more, and started back towards the camp with a qick pace, grabbing me by the hand, and saying these are the tracks of a big bear, son, and we should leave this area alone from now on.  Then he told me not to come up the creek alone, and not to tell Mama or my brother or any of the others anything about what we saw, that it might worry them or something, and that he would speak no more of this matter.  Just like that! Well the older I get the funnier that incident and those tracks seem to me. I have hunted for many years and have seen and tracked many animals in the woods since that time, and have never seen anything like that since.  I am thirty eight now, and my father has retired. I asked my father about this incident last year, and he was silent and pensive for a long time, then he told me that he does'nt remember this time or seeing anything other than bear tracks. I don't know what we really saw that day, but I do know that it scared my dad, and he has never ever spoken to me the way he did on that day, or behaved that way since.",
  "classification": "Class B",
  "county": "Humboldt",
  "state": "California",
  "latitude": 41.30056,
  "longitude": -124.0644,
  "location": "-124.0644,41.30056",
  "location_details": "To get to this place, you must float down the Klamath river from Johnson's Bar (I think that is the name of the place, it is or was as far down river as you could drive on the Karok indian reservation road from the confluence of the Klamath and Trinity Rivers)approx. 1-2 miles to the mouth of Tek-Tah Creek on the southern side of the river. Then you must walk up the bar of Tek-Tah Creek about 1/2 miles or so to a place where the creek canyon curves to the east and the creek itself flowed against a steep curved cliff or hillside. The cliff was about 150 yards long and perhaps 50-100' high. the creek flowed against this cliff and formed a deep (maybe 6-7') arched pool about 100 yards or so long.  On the eastern side of the creek was a large bar made of fine dry sand and some gravel.  This bar was as long as the pool, and was maybe 50yards wide at its largest spot. The creek was flanked on bothe sides by steep and desnse timber and brush.  There may have been some debrees on the bar, but I can't remember (It is strange what you can and cannot remember after so many years...).  At the northern end of this bar is where I saw the tracks.",
  "temperature_high": 74.24,
  "temperature_mid": 64.07,
  "temperature_low": 53.9,
  "dew_point": 49.66,
  "humidity": 0.64,
  "cloud_cover": 0.4,
  "moon_phase": 0.69,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.76,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 5.23,
  "wind_bearing": 347,
  "wind_speed": 2.58
}