{
  "id": "1120",
  "title": "Sasquatch encountered standing by porch",
  "date": "1971-06-01",
  "timestamp": 44582400,
  "observed": "This is a true story which I remember very well, even though it has been around thirty years since it happened.  I owned three dogs at this time, two hounds and a squirrel dog. They turned up missing for about three days. On the night of that third day I had a wind-up alarm clock set inside of a washpan because I was so hard to wake up. Sometime between 10:00 and 11:00 p.m. my wife shook me awake saying the dogs must be back. She heard some growling noise real close to the house. When I heard the noise, I told my wife \"that ain’t no dog\". It was the weirdest growling sound I ever heard. I jumped out of bed so fast I hit the dishpan and it went across the floor and made a lot of racket. I looked out the window through the window screen and there was what must have been a bigfoot creature of some sort. It was not a bear. It was a very moonlit night, so I know I couldn’t mistake a bear for something else. And it was not human! It was covered in long wavy hair on its body, but much less hair around the facial area. It had a humanlike face and yet it wasn’t human. Suddenly it turned its head (not its body) just its head and just stared in my direction. I started to feel a panic coming on, but I knew I had to do something. I raced to get my shotgun, ran out the front door. I was sure I could reach the yard in time. But it was gone, even though there shouldn’t have been time for it to past the clearing of the yard. So I fired the shotgun into the air just in case it was still close by. Less than one day later our dogs returned to us.",
  "classification": "Class A",
  "county": "Oregon",
  "state": "Missouri",
  "latitude": 36.6,
  "longitude": -91.2,
  "location": "-91.2,36.6",
  "location_details": "14 miles east on highway 160",
  "temperature_high": 78,
  "temperature_mid": 69.5,
  "temperature_low": 61,
  "dew_point": 65.35,
  "humidity": 0.8,
  "cloud_cover": 0.74,
  "moon_phase": 0.27,
  "precip_type": "rain",
  "pressure": 1013.78,
  "summary": "Mostly cloudy throughout the day and breezy in the afternoon.",
  "uv_index": 7,
  "visibility": 8.54,
  "wind_bearing": 211,
  "wind_speed": 5.85
}