{
  "reportId": "5136",
  "title": "Multible witnesses hear loud screams and have rocks thrown into camp near Cle Elum lake",
  "date": "2004-12-07",
  "timestamp": 1102377600,
  "observed": "I was on a two day camping trip with several other adult volunteers and a group of about ten inner city youth.  We went out past Roslyn from Cle Elum toward Salmon La Sac and the Wenatchee National Forest.  There were many small dirt roads off Salmon La Sac road leading down to the resevoir on the left.  We decided to camp down one of these small road between the resevoir and the main road.  It was not a campground, but had some decent places for tents and had been used by campers before as evidenced by a fire ring.  There was another tent camper a few hundred yards away.  The weather was poor.  It began raining on the trip up and kept raining and drizzling off and on the entire time we were out there.  After unpacking all our gear and getting camp set up we began to notice medium sized rocks (golf ball to baseball sized) flying into our camp.  At first we thought it may have been one of the kids goofing around, but after an hour or so we had accounted for all the kids and the rocks kept up.  We continued to have rock thrown into our camp until the next morning.  In addition, roughly ten times during the night we heard very loud screams coming from further down our side of the resevoir.  We were a little worried because we weren't sure who or what was screaming.  If we weren't so far from a town we would have called the police for fear that someone was being hurt.  We took turns keeping watch until morning because of the wierd stuff going on.  At daybreak we decided to cut our trip short and head home.  The weather, rocks, and screams were just too much for some volunteer counselors to handle.  I didn't think of the possibility of sasquatch until several years later when I heard recordings of sasquatch screams that closely matched what we had heard that night.",
  "classification": "Class B",
  "county": "Kittitas",
  "state": "Washington",
  "latitude": 47.3991,
  "longitude": -121.1008,
  "location": "-121.1008,47.3991",
  "location_details": "From Cle Elum take highway 903 through Roslyn.  Highway 903 turns into Salmon La Sac Road.  We camped several miles down the road between the road and the resevoir.",
  "temperature_high": 39.98,
  "temperature_mid": 38.72,
  "temperature_low": 37.46,
  "dew_point": 33.99,
  "humidity": 0.89,
  "cloud_cover": 0.95,
  "moon_phase": 0.85,
  "precip_intensity": 0.0197,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 997.36,
  "summary": "Light rain in the evening and overnight.",
  "uv_index": 1,
  "visibility": 5.47,
  "wind_bearing": 146,
  "wind_speed": 4.64
}