{
  "id": "25531",
  "title": "",
  "date": "",
  "observed": "[Editor's Note - Matt Pruitt: Even though the incident occurred many years ago, I have omitted the details that describe the exact location of the incident, as the area is private, and is still occupied.] This was in 1971 and I was 19 at the time.  The location was outside the town of Myrtle Point, Oregon on [omitted] where my parents lived on 10 acres.  I didn't live with them at the time, but had walked to their place from town that day and met them on the road as they were driving into town.....they were going out for the evening and told me I could spend the night at the house and they'd see me later on. It was late in the afternoon when I arrived at the house and just went in and watched TV for awhile.  After about an hour or so, I heard the dogs barking.....they often barked at deer that would come near the house, so I peeked out the window behind the couch where I sat to see if I could see them.  I didn't see anything, but smelled what I thought was the septic tank.....it was awful.  Back to watching TV....it was getting darker now and I could hear the dogs again, but they were screaching and saw them run past our front door (the door was all glass panes) and heard them run into the garage.  That smell again and it was stronger and I looked out the window again to see why the dogs ran away, but still saw nothing. Soon I heard a noise outside the window I had been looking out of.  Someone was walking on the plank just outside the window and sounded like he was headed toward the front door, so I sat back and looked to see who it was. I saw a tall, dark figure walking past the door, but in it's stride, it's head turned and saw me watching.  It stopped at the door and turned toward me.  It stood there watching me and in my fear I must have passed out, because the next thing I remembered was my parents picking me up from the floor....how I ended up there, I'll never know, but my folks said I was white as a ghost and were afraid when they saw me, that I was dead. My dad ran out the door right away with flashlight in hand, when I was able to tell them what happened, but I was sure it had been hours past and it had rained.  He came back with nothing. The creature was taller than the door, but was slightly hunched when it was walking past the door.  The eyes were small compared to the size of its head and piercing.  It had hair all over, but I could see its skin easily and I could see that it was a female by its breasts, which had less hair.  Its face was rather flat and the head was long.  It had a short neck.  I'll never forget those eyes. I can't really remember the season or month, but it was a couple of months after I graduated for highschool.",
  "classification": "Class A",
  "county": "Coos",
  "state": "Oregon",
  "location_details": "The house was later sold by my parents (years later) and that same house burned down.....the new owners built a new home on the same site and cut back many othe the trees.",
  "summary": ""
}