{
  "reportId": "2779",
  "title": "A Local Writer Discusses Her Experiences Pursuing Local Reports and Legends",
  "date": "1981-02-15",
  "timestamp": 351043200,
  "observed": "My book, \"Night-Side of Gold,\" was written from hindsight remembrance of encounters with Bigfoot during an 8-year mining venture in the Santa Lucias along the coast of Southern California. Now, in the Lagunas around Julian, in San Diego County, I have been actively pursuing reports of Bigfoot in these mountains and the Anza-Borrego Desert below, and most particularly within a certain Indian Reservation. In February, 1981, I happened to be at the right place at the right time to meet a young Indian who talked openly of his interest in Bigfoot and said he had seen him on his reservation and knew the location of caves where Bigfoot hid, and he would take me there - now! He guided me up a fearfully storm-wrecked road. My ancient van was not designed for such, nor my senior years to cope, but once started there was no turning back. Disaster seemed certain but I would die TRYING! We reached a small flat. \"Park here,\" my escort said. \"Now we hike down a canyon.\" He hiked ahead rapidly and I eventually caught up with him - napping under a bush. Below him, a small stream followed a darkened canyon around a bend. I had parked in bright sunshine and in less than a mile we had descended into sunless gloom. \"The caves are over there, but I am NOT about to go there.\" Until my guide refused to enter a taboo area, I had not really believed his story. I knew that no money or incentive on earth will induce an Indian to enter taboo ground. \"Okay, now we wait. Have a seat.\" I said to him, \"What are we waiting for?\" He said, \"To watch. He comes out this time of the day and walks around. He drinks from those old rock-troughs I showed you by the road. Sometimes he hangs out by that wrecked house where the road loop starts. You in a hurry?\" I told him no, but that I was not about to drive back down the road in the dark. We hiked back to my van which was completely concealed in the brush until you reached the road. It was dusk when I drove out of the Reservation. After a week of heavy storms had eased up, I sought out my Indian escort. Unlike before, he was neither friendly nor talkative. Briefly I was then told, \"My people are complaining. Our tribal spokesman is very displeased. You will not be welcome to return, with or without your friends - and trespassers risk being shot.\" So, I backed down for awhile - but I was not \"out.\" For three months I planned for a return trip. A friend obtained permission from a well-known Indian to drive up the mountain just to take pictures, to stay on the road and not to wander around the reservation. I had studied the map well but a certain hunch compelled me to request we reverse our direction. After a steep turn, we were blocked - but good - by a heavy pick-up in the road next to a parked bulldozer. In front stood five Indians - shoulder to shoulder, spanning the road, with their backs to us. \"Looks like we've got trouble,\" my escort said, very quietly. He stepped out with a cheery greeting and, as a Forest Service firefighter, was recognized. Two men approached me. \"You see Bigfoot this morning?\" They knew who I was. \"No, and I came up here just to shake hands with him.\" That brought welcomed laughter, then a statement, \"I have seen him. He comes up from the canyon below the flat you just passed. He doesn't come out very often.\" This confirmed what my first Indian guide had told me. The \"sticky\" situation was smoothed out but not to the extent that we could continue to explore. I am presently biding my time for the right moment to return.",
  "classification": "Class C",
  "county": "San Diego",
  "state": "California",
  "latitude": 32.71528,
  "longitude": -117.1564,
  "location": "-117.1564,32.71528",
  "location_details": "",
  "temperature_high": 75.32,
  "temperature_mid": 65.04,
  "temperature_low": 54.76,
  "dew_point": 52.05,
  "humidity": 0.7,
  "cloud_cover": 0.61,
  "moon_phase": 0.4,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.99,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 6.99,
  "wind_bearing": 317,
  "wind_speed": 4.08
}