{
  "id": "9873",
  "title": "Woman reports sighting at the edge of backyard",
  "date": "2004-07-20",
  "timestamp": 1090281600,
  "observed": "In mid july 2004 I was on my back porch it faces east and it faces a mountain I live in the woods on the side of my house where the creature was the house is scarecly wooded and the land is flat.  The sun was shining. The reason I went out side is this, my dogs started to bark and run through the house they got half way through the dog door stopped an whined. I thought that was odd so I went and sat on the back porch. Then I saw the tree to my left move and the tree was about 300 yards away from me or less I am bad with measurements.  So I watched the tree to see what caught my eye and then I saw the creature.  It was behind the tree looking out from behind it.  It's head was in the banches and it was hunching.   Is's head was large and it had a definate brow I thought I was seeing an oranatang.  Except it was about 6 and ahalf feet tall.  It was moving it's head aroud the tree to watch me as I stood up to get a better look. It's hair was a rust color like to color of dead pine needles, It's eyes were haunting. And it was completely silent.  It was watching me while I was watching it.  I sat back down.  I watched outside for about 6 minutes and didn't tell the person on the phone. Then I went in the house and watched throught the window to make sure it wasn't a trick of shadow.  Then the creature moved in front of the tree, staying hunched over but watching me in the window. I watched a few more minutes and then went to the back of the house when I went back it was gone.  While this was going on my kids were in the front yard playing in the water.  I think if the creature had been aggressive it would have made some sort of move. but it d=seemed peaceful. It seemed to be curious I think it was young to be in such a vulnerable open area. When my husband came home we went out to the tree and all of the knapweed was completely trampled down around the tree. We didn't find any hair though.  I look every day To see if it ou t there again but to no avail.",
  "classification": "Class A",
  "county": "Missoula",
  "state": "Montana",
  "latitude": 47.06032,
  "longitude": -114.0717,
  "location": "-114.0717,47.06032",
  "location_details": "We live just inside the Flathead Indian Reservation near Evaro.",
  "temperature_high": 80.05,
  "temperature_mid": 66.12,
  "temperature_low": 52.19,
  "dew_point": 53.51,
  "humidity": 0.64,
  "cloud_cover": 0.39,
  "moon_phase": 0.1,
  "precip_intensity": 0.0016,
  "precip_probability": 0.73,
  "precip_type": "rain",
  "pressure": 1015.28,
  "summary": "Partly cloudy until evening.",
  "uv_index": 8,
  "visibility": 9.81,
  "wind_bearing": 275,
  "wind_speed": 3.78
}