{
  "id": "25662",
  "title": "Hiker spots a bigfoot in the mountains east of Butte",
  "date": "2007-08-15",
  "timestamp": 1187136000,
  "observed": "I live in Butte, Montana. This is a city mostly on a hill, but stretches down into a valley. On the east side, there is a great stretch of mountains known as the east ridge. This is where I was when I saw a sasquatch. In the middle of the hill, south of the Lady of the Rockies, there are two smaller hills jutting out of the middle of the hill. I was on the northern side of the southernmost small peak, heading down to go back to my vehicle. I was heading through some trees when I looked to the north at the other hill. This hill comes up further out from the main mountain than the hill that I was on. The peak is therefore more west, and then heading east it slopes down, flattens out, then heads back up the main mountain. I was looking through these trees I was heading through up at the flattened part of that hill. I was looking right at this tree. I'd say it was a good ten feet tall. I'd say I was about 200-300 yards away from this tree. He must have seen me, because when he walked out from behind that tree, I could tell he was looking right at me. And something about the way he timed it tells me he wanted to scare me. I'd say he was about 8 feet tall, judging from the distance, and he walked just like the saquatch in the old video of him walking through that small clearing in the forest. You all know the one. Probably the most popular one out there. His arms swayed back and forth, hanging limply from his shoulders. He walked about 15 feet then disappeared behind another tree. I have no doubt in my mind of what I saw.",
  "classification": "Class A",
  "county": "Silver Bow",
  "state": "Montana",
  "latitude": 45.9754,
  "longitude": -112.4554,
  "location": "-112.4554,45.9754",
  "location_details": "On the East Ridge, south of The Lady of the Rockies. About in the middle of the hill.",
  "temperature_high": 87.61,
  "temperature_mid": 69.43,
  "temperature_low": 51.25,
  "dew_point": 29.09,
  "humidity": 0.32,
  "cloud_cover": 0.09,
  "moon_phase": 0.09,
  "precip_intensity": 0.0025,
  "precip_probability": 0.84,
  "precip_type": "rain",
  "pressure": 1015.38,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 4.32,
  "wind_bearing": 86,
  "wind_speed": 0.4
}