{
  "reportId": "36850",
  "title": "Honeymooners feel bone rattling growl while hiking the Appalachian Trail",
  "date": "2012-10-17",
  "timestamp": 1350432000,
  "observed": "October 16, 2012, between 2 and 3 am.  My wife and I were on our Honeymoon in Linden, VA. We rented a cabin for the week. During the night, I woke up to a sound similar to what I thought was our dog dragging a suitcase across the hardwood floor.  But she was in fact, in bed with us, on point looking out the bedroom window. The draggin sounds were long footsteps coming from outside. We listened to them for about 20 seconds or so as they were getting closer.  A silhouette then quickly, but smoothly, passed right by the window.  We quietly listened until we could not hear anymore footsteps, and then talked about what it may have been for a little while until we decided to just go back to sleep (our dog ALWAYS growls and barks at people, but she didnt, so we figured it was just an animal, or a tree limb swinging past the window).  October 17th, 2012, 1pm.  We decided to take a walk on the Appalachain Trail being it runs just a couple hundred yards from the cabin.  About 35 minutes into the walk, we both heard the most bone chilling growl.  It was so low in tone that we actually felt it in our joints and ribcage.  it lasted a few seconds before we high tailed it out of there.  There was no way after hearing that, that I was going to stick around, unarmed, with my family.  The growl wasnt loud at all, it was just bone rattling deep.  Listened to hundreds of soundbytes of animals to compare to, but nothing came even halfway close to what this was.  Ive personally heard wild cats, dogs, and bear through years of hunting, but this was something almost out of this world sounding.  Note that nothing was seen on the trail that day, but dont blame me for getting outta there ASAP.  All I could think about was getting back to the cabin with my wife safely.",
  "classification": "Class B",
  "county": "Warren",
  "state": "Virginia",
  "latitude": 38.9593,
  "longitude": -78.02081,
  "location": "-78.02081,38.9593",
  "location_details": "109 Trillium Trail Rd, Linden, VA.  About a mile southwest of cabin at stated address.",
  "temperature_high": 68.05,
  "temperature_mid": 57.595,
  "temperature_low": 47.14,
  "dew_point": 44,
  "humidity": 0.78,
  "cloud_cover": 0.1,
  "moon_phase": 0.08,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.76,
  "summary": "Clear throughout the day.",
  "uv_index": 4,
  "visibility": 9.1,
  "wind_bearing": 172,
  "wind_speed": 1.9
}