{
  "reportId": "993",
  "title": "",
  "date": "",
  "observed": "At 12:00 noon the witness, Jackie Hutto, heard noise and agitation from the dogs that he keeps in a dog pen at the back of his families property. At first, Jackie went to the door of his home and yelled at the dogs to quiet them down. After about 5 more minutes of the barking, Jackie went to investigate to see what was wrong. When he arrived at the dog pen, he saw a large black animal pulling on the wire of the pen, Jackie walked around the corner of a tool shed there at the pen to get a better look at the animal. When he looked around the corner of the pen he saw a 8-8.5 foot tall bigfoot (He measured its height by the fence, which is appox. 9 feet tall) pulling at the wire on the pen, then the bigfoot turned to look at Jackie, when it turned it turned its whole body toward Jackie, not just its head. Jackie screamed and ran toward the house, looking over his shoulder as he ran. He saw the bigfoot turn and run toward the forest, he mentioned he heard it grunting as it ran, and he also heard its footsteps as it ran, like a loud thumping sound. When Jackie screamed, his brother, David (16) ran outside to see what was wrong, when he did he saw Jackie running toward him, and the bigfoot running toward the forest. The witness was close to the animal, thus he got a good description. Jackie described the creature as 8-8.5 feet tall, covered over most of its body in black hair. Its face and chest were bald, and the skin was thick looking and brown in color. He said the teeth were clenched and were big, \"blocked shaped\" and stained, and its eyes were big and round. The boy said that creature was clearly a male, judging by its genitalia. He also noticed a worn spot on each knee of the creature that was about the size of a 50 cent piece. Jackie also mentioned that the bigfoot smelled like a goat. No footprints were found, the witnesses didn't return to the spot where the incident occured until the next day, due to the scare they recieved earlier. A thunderstorm came through the night of the incident, so the next morning, no evidence was found.",
  "classification": "Class A",
  "county": "Orangeburg",
  "state": "South Carolina",
  "location_details": "",
  "summary": ""
}