{
  "reportId": "11313",
  "title": "Turkey hunters surprised by loud vocalizations near Wenatchee",
  "date": "2005-04-17",
  "timestamp": 1113696000,
  "observed": "While Turkey Hunting in the Ingersol (Colockum Wildlife Area in Central WA.)on 4-15-05 I came across some fecies with a diameter of about 2\". Which at the time I thought to myself it must be a Huge Bear. The following day 4-16-05 I walked about a mile down a fire guard road above where I had seen the fecies. The fog was coming in and I had not seen any Turkeys so I turned around and headed for the truck. The Fog was getting thick and I could only see about 35 yards.About halfway to the truck the wind changed and was blowing down the hill. I smelt this awful musty skunky smell and the hair on the back of my neck stood up. I quickly turned facing the smell with my shotgun slung but I did not see or hear anything.Again I could only see about 35 yards because of the Fog.At this moment I felt it was the smell of a Sasquatch. Then I got to thinking about the Fecies and told myself it must be a Bear. That evening I called my Nephew because he was going Hunting with me Sunday 4-17-05. I told him their must be a Large Bear in the area because I saw the fecies on Friday and on Saturday I had smelled him.Sunday mourning we arived at Daylight where I had seen 5 Turkeys the day before.We got all of our gear ready and hiked about 300 yards up the hill. I took out my Turkey Box Call and started Yelping with it.A Howl started below us about 150 yards a Coyote that turned into a Wolf that turned into a roaring blood curling sceam! I am 47 Years old and have Hunted the Cascade Mt.Range all of my life! I have NEVER heard anything like it in my entire life. My nephew turned and looked at me He's 16 and said what is that? I looked him strait in the eye and said it is a Sasquatch. The Length and the Volume and the Depth of the Howl could not be duplicated by a human being.I asked my Nephew if his gun was loaded and if he wanted to try to get a look at it? He said yes.We moved a little closer toward the scream but did not see anything. It was in scatered Pine Trees.We headed back up the ridge and West aways and stopped. Again I took out my Turkey Box Call and started yellping. Again about 400 yards up the canyon we heard a Deep Long Howl. The creature was making his way up the draw at a high rate of speed.I yelped on the Turkey Call again and he Howled again!!!He was moving away into thicker Timber this time he was 500 to 600 yards away and we never heard him again.",
  "classification": "Class B",
  "county": "Chelan",
  "state": "Washington",
  "latitude": 47.2637,
  "longitude": -120.2238,
  "location": "-120.2238,47.2637",
  "location_details": "about 3.3 Miles up the Ingersol Road.  N 47 15.824 W 120 13.426",
  "temperature_high": 59.46,
  "temperature_mid": 49.12,
  "temperature_low": 38.78,
  "dew_point": 31.61,
  "humidity": 0.55,
  "cloud_cover": 0.25,
  "moon_phase": 0.29,
  "precip_intensity": 0.0013,
  "precip_probability": 0.11,
  "precip_type": "rain",
  "pressure": 1014.7,
  "summary": "Partly cloudy until evening.",
  "uv_index": 5,
  "visibility": 9.64,
  "wind_bearing": 276,
  "wind_speed": 6.56
}