{
  "reportId": "25924",
  "title": "Possible encounter and vocalizations heard by bowhunter near Metropolis.",
  "date": "2008-11-26",
  "timestamp": 1227657600,
  "observed": "I believe that I had an encounter this past Fall in Massac County. I was bow hunting some public land called Sielbeck just the day after Thanksgiving when I believe I encountered a large, two legged creature just after dark on my way out of the woods. I startled the creature that was positioned just a few yards behind my parked truck. There was a large White Oak tree that had produced a large acorn drop just behind my truck and I assume it was there eating acorns. I approached my truck with my flashlight turned off and I was being very quiet due to several deer that were in the area. I layed my bow down and took my tree stand off my back and layed it in the back of my truck. My tree stand made a small noise when it contacted the bed of my truck and seems to have startled something that crashed through the woods making an lot of noise as it ran off the hill. It was definitely two legged because I remember thinking what was this person doing running away through the woods from my truck. It stopped at the bottom of the hill and screamed at me from about 80 to 100 yards. I am 45 years old and have hunted in the woods for as long as I can remember and I have never heard anything like this. The next day I was lucky enough to harvest a deer and in the excitement of doing so did not investigate the encounter. The animal crossed a small dirt road and a pasture fence at the base of the hill and screamed several more times. It appeared to move about 50 yards at a time and turn toward me and scream each time. It did this at least a dozen times as I listen in amazement. I have not reported this to anyone that compiles data regarding events such as this, only to a few friends. Of course they laughed at me but they know that I am a savvy hunter that always harvest my share of deer every year with my bow so they knew that Ii encountered something I could not explain. I consider myself a pretty good outdoorsman and I struggled for months about reporting this but I finally decided that as rare as something like this seems to be it would be a shame for me not to mention it. I know there are a lot of skeptics out there but if me reporting this put some visibility on this occurrence in this area and triggered someone to investigate and actually discover what this creature is I would be very happy. I am from Alabama and plan to hunt there again and you can bet that I will be looking for signs of something out of the ordinary. I do not always articulate myself very well so I hope that I have given some pertinent details to what occurred. Thanks and have a great day.",
  "classification": "Class B",
  "county": "Massac",
  "state": "Illinois",
  "latitude": 37.228,
  "longitude": -88.7476,
  "location": "-88.7476,37.228",
  "location_details": "",
  "temperature_high": 57.88,
  "temperature_mid": 43.405,
  "temperature_low": 28.93,
  "dew_point": 30.17,
  "humidity": 0.72,
  "cloud_cover": 0,
  "moon_phase": 0.97,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.75,
  "summary": "Clear throughout the day.",
  "uv_index": 2,
  "visibility": 8.97,
  "wind_bearing": 190,
  "wind_speed": 1.41
}