{
  "reportId": "29565",
  "title": "Man describes several compelling incidents while hunting in the Withlacoochee State Forest",
  "date": "2010-09-16",
  "timestamp": 1284595200,
  "observed": "I have hunted in most of the management areas in and around this state. I was on a bow hunt in the Citrus wildlife management area. I go out 1 hour or so before daylight. I had put my stand out the day before and just parked in pitch black dark area. I got out and walked to the other side of the suv to get my stuff out, before I could do that I heard something jump out of the bushes behind me. I stood motionless and a strong smell of defecation was there. I talked about the smell and it disappeared. I opened the door and got my flashlight to see what was there and it was gone. By the time daylight rolled around there was six or so more cars that had come through and wipe out all tracks that I could have found. This was the first of 5 incidents of it.   2. Two weeks later I moved my stand to a different area due to all the other hunters. I went out an hour before daylight again and parked got in my stand and waiting for daylight. Right before daylight I heard a call unlike anything I have ever heard before. I have heard hogs, deer, and all other types of animal calls including bears. This call was not like any of them. As the morning went by more cars and hunters came into the area. I heard something big running towards me and it sat down 20 to 30 feet in front of me on the only blind spot I had. I waited for about ten minutes and figured another hunter had sat there, so I cleared my throat to see if it was human and it got up and ran off real fast. I couldn't see it. 3. Two or three weeks later I decide to go fishing at the gulf and was driving past the area I hunted at when out of the wood line a big hairy, black bigfoot ran in front of me with my bright lights on. It took 3 leeps from woodline to woodline. the run is what floored me. The knees almost hit the ground before it came up again and out to the side of its foot.",
  "classification": "Class A",
  "county": "Citrus",
  "state": "Florida",
  "latitude": 28.78812,
  "longitude": -82.40295,
  "location": "-82.40295,28.78812",
  "location_details": "I measured 2 tracks for you but no pics. I got a camera phone now.",
  "temperature_high": 92.04,
  "temperature_mid": 82.675,
  "temperature_low": 73.31,
  "dew_point": 69.78,
  "humidity": 0.7,
  "cloud_cover": 0.19,
  "moon_phase": 0.29,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.05,
  "summary": "Partly cloudy in the evening and humid throughout the day.",
  "uv_index": 8,
  "visibility": 9,
  "wind_bearing": 88,
  "wind_speed": 4.81
}