{
  "id": "30570",
  "title": "Recollection of being driven from woods by possible vocalizations while squirrel hunting near Dangerfield",
  "date": "1998-10-15",
  "timestamp": 908409600,
  "observed": "One early October morning, back in 98, after tending to the chickens at the farm.  Me and my Grandfather went squirrel hunting.  We drove a couple miles down Fm 130, between Dangerfield and the community of Carterville, to Kelley Creek Bottoms. My grandfather was getting up in age and did want to climb up the hill with me, so he stayed in the wood line along the road.  I went a couple hundred yards into the woods and turned east to go up the hill.  After killing two squirrels and walking half way up the hill, I noticed I had found myself in a patch of dead woods.  No wind, no birds, no coons, possums, squirrels, deer and no bugs in my ears.  It was DEAD.  I’ve been in them before and it scared the hell out of me.  So I start making my way up the hill as fast as I could, so I could see my surroundings better. When I got to the top of the hill I heard a scream/howl that scared me stiff.  I thought it was a mountain lion at first but I’ve heard them and this had too much bass in its voice.  The scream/howl came from the south side out the hill towards the bottoms.   It screamed/howled five times then got quiet.  I couldn’t see anything.  The second set of howls was a lot closer and louder.  It howled 3 times, and again I couldn’t see anything.  The third time it howled, it sounded like it was right on top of me.  Still, I couldn’t see anything. Needless to say, I didn’t stick around after it howled the third time.  I took off running down the north side of the hill to where my grandfather was.  I could see him booking it up on the farm road, headed back to the truck.  We got to the truck at the same time, I come darting out of the woods and got a 20 gauge in my face for my troubles.  I asked my grandfather if he had heard the howling up on the hill and he said yes he had and we were leaving.",
  "classification": "Class B",
  "county": "Cass",
  "state": "Texas",
  "latitude": 33.05685,
  "longitude": -94.52925,
  "location": "-94.52925,33.05685",
  "location_details": "9 miles northeast of hughes springs tx 4 miles west of carterville tx",
  "temperature_high": 81.03,
  "temperature_mid": 74.58,
  "temperature_low": 68.13,
  "dew_point": 61.73,
  "humidity": 0.79,
  "cloud_cover": 0.13,
  "moon_phase": 0.85,
  "precip_intensity": 0.0021,
  "precip_probability": 0.5,
  "precip_type": "rain",
  "pressure": 1015.66,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 4,
  "visibility": 5.76,
  "wind_bearing": 146,
  "wind_speed": 6.92
}