{
  "id": "8406",
  "title": "Encounters with a hairy creature in the same area as the well known \"Minerva monster flap.\"",
  "date": "1978-08-01",
  "timestamp": 270777600,
  "observed": "I grew up in Stark County Ohio in Paris Township from 1973 until I went away for school (1990) and then got married. The famous \"Minerva Flap\" happened in my back yard. The strip mine that was behind the Cayton families home where most of the sightings occurred belonged mostly to my family. We lived on the other side of the strip mine from the Caytons. I went to school with some of the Caytons but never asked about what had happened as there were many rumors floating around the community. Many more people in the area were having encounters but were unwilling to report it because of the ridicule the Caytons received, not to mention all the idiots running around ready to shoot anything with two legs and a pulse. I can't speak for the others but I will tell you what was happening on my family's property and the two sightings I had. The strip mine was owned by my aunt and uncle along with the rest of their farm. We lived next door on a large plot with three mobile homes back in the woods. My family lived in one, my grandparents lived in another and a different aunt and uncle, along with my cousins, lived in the third, all about 60 yards apart. In the late 70's we had our cornfield smashed down and a partial footprint was found. My cousin and I had discovered it and thought the area where the corn had been looked like something had rolled in it. Because of the excitement in the area, we were not alowed outside by ourselves. No one in the community knew what to make of everything. Even though I was young, I clearly remember the fear everyone felt. After a few years had passed there was not a lot of activity. My first sighting came in about 1984. It was such a close encounter I will have to explain the details as best as I can, so you can understand the situation. My brother and I shared a bedroom in the mobile home. We had a bunk bed and it was against the outside wall which put the top bunk right in the middle of the window. This next part is hard to explain if you have never seen how the windows in an older mobile home would open. One window is really a series of smaller windows that would crank open. As you would crank, the bottom of each of the smaller windows would begin to push out tilting the bottom of the windows out and leaving the top stationary. (I hope everyone is still with me.) Keeping all of that in mind, you know how at night windows in your house act as a mirror because its dark outside but the lights are on inside. Okay, I have explained all of this to tell you what I saw. My brother and I were getting ready for bed. I was already on the top bunk and my brother was not in the room yet. There was a night light on in the room and the window was cranked open so I would ordinarily see the reflection in the room, but since the window was open, and because of the tilt, I now could see the reflection straight down. The window in our room was made of two smaller windows, one on top of the other. I was inside of a sleeping bag, which will turn out to be a nightmare in a few moments. I could hear something coming up the drive way about 30 feet from our room. We had a dog outside loose, and I thought it has him. I heard it leave the drive way, and start heading straight for our window. Still thinking it was my white collie, I looked at the window reflecting down and expected to see him walk underneath. Instead, what I saw was black hair taking up the entire window. Now I was still looking for an explanation, and thinking this was my dad I said \"Dad\" and instead of hearing my dad answer from outside my window, he answers from his bedroom down the hall so I looked back at the reflection and there was a hand in between the two parts of the window. I would not say the hand was reaching for me, I got the impression it was feeling the glass. Well, needless to say I had seen more than I wanted! The problem was I was inside of a sleeping bag and couldn't do anything quickly, but with a hand 1/3 the size of one of the windows, and only inches away, I wasn't hanging around! I flipped over the rail in one motion, sleeping bag and all. I was so scared I still couldn't get free, so I hopped down the hall in my bag. My dad met me half way telling me to calm down. I told him what I saw, he grabbed a gun and went out the back door. He circled the house and came in, he said he saw nothing. The windows are about two and a half feet wide and about one and a half feet tall. I only saw the hand for about one-second before I bailed. I would have to say it was about 1/3 the size of the window. The hair was black and partially growing down the fingers. I did not see the palm. The hand looked very much like a man's only much, much bigger. I have an uncle who is 6 foot 6 with large hands but these were much bigger! The skin looked dark gray to black, but again I only saw it for a second. The thing that sticks most in my mind was the fingernails. Very clear, I think it's what made me realize in that second that this was no joke. They were long, but not like claws. The next incident happened in 1989. I was on an outing with my girlfriend at the time and her family. They were dropping me off at my house and usually wait for me to get in the house before leaving but this time her father was driving and left as soon as I got out. As they were driving away I realized I didn't have my keys with me. The whole property was dark but my dad's car was there. I thought this was very odd so I tried just knocking on the door. Sure enough my dad opens the door. My dad pulls me aside, because my brother was still young and he didn't want to scare him, and asked if I was here earlier? I told him no, this was the first I was home. He said they were watching TV and someone was playing around with the door knob on the patio. The light to the patio was broken at the time so he shut off the lights inside so they could see out. He said he didn't see anything so he locked the door, left the lights off and he and my brother sat on the floor in his bedroom and played video games. That's what they were doing when I got home. Now, I didn't think too much into it at the time so I blew it off. I hadn't had dinner yet that night and microwave was broke. So I was going to run next door to my grandmothers to use her microwave. Her house is about 60 yards away. She was on vacation so her place was dark and locked up. The only light was from a neighbors pole light about 150 yards away. My brother went over with me because he was going to warm up some food too. We walked over, unlocked the door, nuked our food and was shutting off the lights to leave. That's when it took place. I shut the door to lock it, and I couldn't get it to turn to lock. My brother was standing behind me holding the food and getting impatient. I turned around to tell him to chill out while I lock up, when I noticed about 40 feet behind him someone was standing there. The neighbors light was behind and to the right of what I was looking at. I kind of dismissed it at first and kept trying to lock the door. Then it hit me, I know there are no trees where this thing was and we were about three to four feet up on a porch and this thing was bigger! I turned again to get a better look, and this time I see it start to walk to the right behind a shed, the same direction we needed to go to get home. Hindsight being 20/20 I should have taken my brother back into my grandmothers house. I don't know why that didn't even cross my mind as an option. All I could think was I needed to get my brother home as quickly and as safe as possible. I needed to get to my dad and our hunting rifles. I actually turned and finished locking the door, it must have been shock. I didn't want to panic or scare my brother, since he hadn't seen anything, so I told him let's see who can get back home the fastest. So we ran and I let him beat me so I could stay behind him, and keep him in sight. It only took us a few seconds to cover the distance but I was watching the whole time for anything. I saw nothing. We got in the door and that's when my adrenaline kicked in. I began shaking and couldn't stop till I got my nerves calmed down. I pulled my dad aside and told him what I saw. Like before he got a gun and told me to give him 30 seconds outside then turn on the back porch light. He went around the entire property and saw nothing. Well, my dad still thinks I'm nuts, but then I came to find out from my mom that back in the 70s one night there were these god awful screams coming from our woods that just wouldn't stop. So my dad got his rifle and drove the car back by the woods. All he could see in the head lights were bushes and trees shaking very violently. The next day my mom said he went back to see if he could find anything. The only thing she told me was he found a couple of dead animals but she did not know what they were. It wasn't until the late 90's when I found your website and seen the full reports from our area. Now I seen that the reports included the sighting of two panthers with the two Sasquatch that were seen. My grandmother's mobile home was closest to the woods, and I asked her recently if she ever heard anything. Before I could get anything else out, she said one summer night she had to close her windows to go to sleep because there was a cougar roaring in the woods. She said she was sure it was some kind of cat. Again I don't know if she was hearing the screams sometimes associated with a sasquatch or if she really did hear some kind of large cat. There have been no further incidences on the property that I am aware of.",
  "classification": "Class A",
  "county": "Stark",
  "state": "Ohio",
  "latitude": 40.7343,
  "longitude": -81.15622,
  "location": "-81.15622,40.7343",
  "location_details": "My families property is just off of Route 30, northwest of Minerva. By the way on the Cayton report the directions are wrong. Paris Township does not go east of Minerva. I'm not sure if this was just a mistake or if it was done intentionally. You can verify this with a map of Ohio.",
  "temperature_high": 81.54,
  "temperature_mid": 73.22,
  "temperature_low": 64.9,
  "dew_point": 60.65,
  "humidity": 0.71,
  "cloud_cover": 0.46,
  "moon_phase": 0.92,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.41,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 6.57,
  "wind_bearing": 204,
  "wind_speed": 4.86
}