{
  "id": "45566",
  "title": "Hunters in the Big Cypress National Preserve observe large biped traversing their recent path",
  "date": "2013-12-15",
  "timestamp": 1387065600,
  "observed": "On December 2014 I was out hunting with my nephew in Big Cypress National Park. We entered the hunting area into Monroe station, we walked the trail that day and there's an open field pass on the trail to the right. We cut through the open field it was a very nice day but we didn't see any game. We were there till 6 pm between 6 pm and 615' we were heading out through the middle of the field towards Tamiami trail to cut through the woods onto the trail. It was still good light out, just before we entered the woods my nephew decides to go across the other woods to see the other side of the field while I wait for him. I was out in the open, I was away from the tree line about 60 yards. I noticed a movement from the distance when I look it was walking big steps right where we had hiked, from what it seemed like it was following us in the distance. I was really scared, I started shouting for my nephew. But wouldn't get my eye off of it. It stood behind a tree moving its head gently side too side looking at me. I was gonna point at it with my rifle too see it through my scope but I didn't because at the same time I thought what if its a ranger on a ghille suit? I didn't want to point at him with my rifle. My nephew came running when he got to me he told me did you see that in the woods. I told him no, look at where I'm looking and tell me my eyes aren't playing tricks on me. He looked, and looked at me, cocked his gun and we ran into the woods to cross over to the trail. By the time we got to the trail running it was night fall. Luckily there was a man in a buggy with his wife. And gave us a ride out...what I saw was approximately 4 street blocks away. Its head was kinda square, its arms would hang down about where I thought its knees would be.",
  "classification": "Class B",
  "county": "Monroe",
  "state": "Florida",
  "latitude": 27.45883,
  "longitude": -80.79379,
  "location": "-80.79379,27.45883",
  "location_details": "It's the trail on Monroe station in big cypress. Monroe station is north of the Oasis visitors center on the left hand side of the big cypress national park",
  "temperature_high": 73.18,
  "temperature_mid": 64.075,
  "temperature_low": 54.97,
  "dew_point": 66.97,
  "humidity": 0.88,
  "cloud_cover": 0.11,
  "moon_phase": 0.45,
  "precip_intensity": 0.0089,
  "precip_probability": 0.66,
  "precip_type": "rain",
  "pressure": 1015.57,
  "summary": "Rain until afternoon.",
  "uv_index": 4,
  "visibility": 8.92,
  "wind_bearing": 254,
  "wind_speed": 3.84
}