{
  "reportId": "2435",
  "title": "Several people witness 7 to 8 foot tall creature on an old mining road",
  "date": "1994-10-15",
  "timestamp": 782179200,
  "observed": "We were racoon hunting we had turned our dogs out and let them get a head start on us...we gave them a half-hour or so to let them get far enough ahead of us..we then got in the truck and started out the road, you can only drive about 10 miles in a truck untill the road becomes too narrow to pass, we got to where we had to turn the truck. (there were 8 of us in the truck 3 in the cab and 5 in the bed)  We called the dogs but got no response, so we waited...about 30 to 45 mins later the dogs came running back to the truck with their tails tucked between their legs like sometings had scared them to death. Now we didn't think anything about this, passing it off as a bobcat that had spooked the dogs..we loaded the dogs into the truck and started back out of the mountain.  We had only made it about 100 to 200 feet when the driver of the truck slammed on the brakes ( we weren't going fast ) I was in the back of the truck not knowing what was going on..I looked into the back glass and saw the 3 in the front of the truck pointing up ahead of us so we ( the people in the back ) stood up and looked, what we saw was huge, standing about 7 1/2 to 8 feet tall, the color was hard to tell with the shadows but I would say it was either black or dark brown.  After about ten seconds the driver put the truck in reverse and backed up 50 feet or so..we all got out of truck and asked one another if we had all saw it..we all did, but we werent sure what we had saw, some said a bear, some said 'bigfoot'.  after about 10 mins. of talking about it we got back into the truck and drove back to where it had stood.  We got out of the truck and walked up to where we had saw it. There was a hole of water in each side of the road but in the center was mud and in the mud was a very large footprint, not a bear track, it looked like a huge human footprint about 15 to 16 inches long. it had a very large big toe and only three small toes.  We looked in awe at this track until we heard sticks breaking, this scared us..so we jumped in the truck and flew away...we stopped a few miles away..we had a flat tire, while changing the tire we all wanted to go back and see if we could see this thing again....So after we changed the tire we headed back...we stopped the truck right before the place we saw the footprint..we got out and looked and you could barely see it.. when we drove through it we had destroyed it..but this told us something..what we had saw had made the footprint, the print was fresh when we had saw it the first time..if it wasn't we would have destroyed it the very first time we went by the spot....We have went back a number of times trying to see this thing again with no luck...maybe someday.... By the way, Great web site... I would like to say that I would have never thought that I would see something like this, if it was a \"Bigfoot\" or not..I know that it wasn't a bear and it wasn't anything that modern science knows about... I would never have gave any thought to a story like this being true, but after seeing something first hand that I have no answer for I beleive that there",
  "classification": "Class A",
  "county": "Pike",
  "state": "Kentucky",
  "latitude": 37.26532,
  "longitude": -82.69576,
  "location": "-82.69576,37.26532",
  "location_details": "Near Virgie Kentucky, nearest road is 1469,  on an old auger mining road less than 10 miles North east of the Jefferson National Forest",
  "temperature_high": 70.12,
  "temperature_mid": 57.875,
  "temperature_low": 45.63,
  "dew_point": 46.17,
  "humidity": 0.67,
  "cloud_cover": 0.38,
  "moon_phase": 0.38,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.71,
  "summary": "Mostly cloudy starting in the afternoon.",
  "uv_index": 4,
  "visibility": 9.47,
  "wind_bearing": 86,
  "wind_speed": 5.88
}