{
  "reportId": "4307",
  "title": "Late night sighting by children at a home in Calcutta",
  "date": "1971-06-30",
  "timestamp": 47088000,
  "observed": "This particular incident occured when I was young, approximately 27 years ago. Due to the age of this report, I doubt it will be of much research value however do not dismiss this as a child's fantasy. I was 7-8 yrs. old but I remember it in explicit detail. I have experienced one other possible contact myself other than the one I am reporting now but I will wait to see if your organization is interested in old reports to summarize it. As I said, I was approx. 7-8 years old at the time. I had heard of bigfoot before and seen pictures on TV but had never seen one before. My neighbor (who was a year older than me) was spending the night. We were in my bedroom on the second floor of my parents home around 0200 hrs. We had not yet gone to sleep and decided to \"raid the icebox\" and went downstairs to the kitchen. The livingroom/kitchen area is one big room sectioned off in the middle by a counter. I went into the livingroom and turned on the pole light which was right beside one of the large livingroom windows. The light, being right next to the window, would illuminate a large part of the backyard. Since we had no exterior floodlights, we often played late at night in the backyard using the light from that window. When I turned the light on, perhaps more out of habit than anything else, I took a quick glance into the yard. What I saw was a very large, dark brown, hairy creature. It was visible in the light for only a few seconds as it was walking away from the house and eventually out of the light. Both my friend and I saw it and we ran for the bedroom and stayed there until morning. I never told my parents about it and I have mentioned it to several  friends over the years in conversation and they have all laughed about it. I estimate the creature to have been about 8-9 feet tall. I gauged this by the height of an oak tree that the creature walked by (within 8-10 feet of) which my dad and I had  tranplanted there. The tree was around 15 feet tall and the creature was approx. 2/3 the height. The physical dimensions of the creature were enormous. I had never seen anything like it. I had seen apes at the zoo but this was nothing like that. The arms, shoulders and especially the legs were 2-3 times the size of any appendages that I'd ever seen, very muscular. The entire creature was covered in dark fur, not matted but not \"furry\". The arms were very long and although the creature walked upright, the hands (as the creature walked) hung almost to it's knees. There was no break in the fur from the head through the neck to it's back...it was just one solid piece of fur. The neck was larger in width that the head, which gave it a triangular shape from the top of the head to the shoulders. When the light came on, it somewhat startled the creature as it turned around to look my way but did not break stride as it walked out of the light. However, when it turned, it did not just turn it's head as you would expect, but somewhat turned it's entire upper body from the chest up. It was quite common for us neighborhood kids to sleep outside during the summer but it was several years before we were to do that again.",
  "classification": "Class A",
  "county": "Columbiana",
  "state": "Ohio",
  "latitude": 40.6807,
  "longitude": -80.57164,
  "location": "-80.57164,40.6807",
  "location_details": "Columbiana County, Ohio...in Calcutta ( four miles north of East Liverpool, Ohio)",
  "temperature_high": 85.74,
  "temperature_mid": 77.98,
  "temperature_low": 70.22,
  "dew_point": 65.22,
  "humidity": 0.64,
  "cloud_cover": 0.64,
  "moon_phase": 0.25,
  "precip_intensity": 0.0027,
  "precip_probability": 0.22,
  "precip_type": "rain",
  "pressure": 1016.71,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 7.36,
  "wind_bearing": 204,
  "wind_speed": 9.02
}