{
  "reportId": "5495",
  "title": "Large prints found in mud and then vocalizations heard south of Yakama Reservation",
  "date": "2003-03-18",
  "timestamp": 1047945600,
  "observed": "I have always known about these creatures but, never really gave it much thought til it happened to me. I was working for a local rancher in Klickitat Co, just NW of Goldendale WA. My boss said that there had been cattle getting out in this pasture land he rented from someone, we keep cattle out there during the summer, and was to feed out everyday at least twice a day, this pasture land was about 5 miles , NW of a once town called Block House . Well he sent me out there to investigate and check the fencing, and find out where they were getting out . So I hop into my truck stretchers in hand and more barbed wire to fix the fence. Once I had reached this pasture land I stepped out of my truck and noticed a strange smell, smelled like someone had just shit them selves .I didn't give it much notice and started walking fence line heading W. I stopped for a cig and something didn't feel right , like someone or something was watching me. I got up and started N on the fence line got half way through checking the N side fence when I saw why the cattle was getting out. There had been a tree thrown through the fence and was down.This tree was about 14 -15 inches in diameter laying where the fence used to be. I thought this was odd, and upon futher noticing, there was a brownish reddish hair on the barbed wire. I have been around cattle all my life and never seen this before, the hair smelled awful. So I finally got the tree moved but was no small chore, it was heavy ever than hell to lift but being 6'6'' 240 lbs I was in good shape .But still it was hard for me move it, but eventually I got it moved. All the time I felt like I was being watched from afar. I didn't like the feeling I was getting, so I quicky mended the fence and finshed checking the fence line on the N side, then turned back to the E, and came down to a small creek and noticed these huge footprints in the still wet mud. They looked fresh like an hour or two old, but the size of these were bigger than mine I wear a size 12 to 13, and placed my foot next to the footprint in the mud, and it was so much bigger than mine . I knew that this wasn't normal cause the left foot where the big toe is looked like it was being dragged . Well this isn't a poss, I thought theres no way a human could make this print it was about a size 19 or 20. I was saying, to myself that I know Shaq hadn't been here cause he's the only human that wears a size 22 triple E so I knew something not human made this. At this time I heard a grunt coming from where I had just been fixing the fence and it had scared me. I walked fast, and I mean nothing short of running flat out back to my truck which was parked about 2 miles away.I got back to my truck and noticed that tools , like shovel, and plastic gas can and empty soda cans thrown out of my truck bed like someone was looking for something or helping me clean out my truck bed. I picked everything up threw it all back in the bed of the truck, and just as I was getting ready to get in, I heard this high piched scream coming from where I had just been so that was it, I was gone. I never heard anything like that in my life. As I was driving back down the road, I thought please don't let that fence break again ,cause I didnt want to have to come back here unless someone was with me. That was the last time I ever went out there. A few weeks later I changed my job and enlisted in the U.S.ARMY, but that day will stick with me forever. People dont believe until it happens to them.  Well, that day made a believer out of me that there's something out there, and if it doesn't want to be found, you're not going to find it,    it finds you .",
  "classification": "Class A",
  "county": "Klickitat",
  "state": "Washington",
  "latitude": 45.9358,
  "longitude": -120.9855,
  "location": "-120.9855,45.9358",
  "location_details": "I know exactly how to get there but I don't remember the Hwy leading W out of Goldendale but stay on it then you come up to block house. Drive through and keep following the hwy for about 4 miles you come to a sharp 20 mile corner and instead of taking the corner go straight off the road.  It becomes gravel road.  Follow it for about 5 miles then you should come to an old run down homestead off to your left that open field is where this took place ...This is known as the Grayback mountain range  leading up to Mt Adams",
  "temperature_high": 54,
  "temperature_mid": 45.175,
  "temperature_low": 36.35,
  "dew_point": 36.22,
  "humidity": 0.76,
  "cloud_cover": 0.4,
  "moon_phase": 0.52,
  "precip_intensity": 0.0017,
  "precip_probability": 0.53,
  "precip_type": "rain",
  "pressure": 1023.72,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 3,
  "visibility": 9.61,
  "wind_bearing": 191,
  "wind_speed": 2.69
}