{
  "reportId": "10357",
  "title": "Two men report powerful vocalizations behind neighborhood",
  "date": "2005-01-23",
  "timestamp": 1106438400,
  "observed": "Firstly, let me say that I am an educated man who works in the medical field at our trauma hospital in Montana.  The other witness is a Deputy Sheriff.   Both of us are in our mid-thirties, married and have children.  Neither of us however, drink, use drugs, or in any way were incapacitated during the time of the 'sighting'. It would also be relevant to tell you that I grew up in Washington where I spent countless summers camping, hiking, and enjoying the outdoors.  My good friend grew up in Oregon and spent a great deal of time hunting, camping and recreating in the outdoors. We both now live in Missoula, Montana and have never heard the sounds like we did last night, on 01/23/2005. My buddy and I returned from a coffee at Barnes and Noble and he was dropping me off in my driveway near 2030 hours.  The moon was pretty full last night and it was cloudless, so visibility was pretty good.  Behind my new home, which sits on nearly two acres, is a large hill that descends on the other side to a partially wooded area in a canyon where deer are seen all the time.  The heavier, more dense forest starts less than a mile away, and in fact heads into the mountains. As we conversed in my driveway, the COMPLETE silence was broken by this god-awful howl/growl/moan that echoed the whole valley. The volume was overwhelming.  Immediately, my dog, as well as multiple dogs on the road, began barking and almost seemingly panicked.  Now please let me tell you that we get elk, deer, bear and mountain lion around here pretty consistently, but never any reaction from the dogs like this. We went behind my house where my dog was no longer barking, but instead just shivering and looking up at the hill - just as 'it' did it again.  The sound is so incredibly similar to the 'howl' you have on your site that it is eerie. A third series of growls (and let me tell you they were deep and extremely loud) soared across our neighborhood. I let my dog have refuge in his fenced kennel where he retreated to his doghouse.  My dog is a year old lab who has grown up exposed to many wild animals. We waited but the noise finally stopped after 1-2 minutes.  We both commented on how the hair on the back of our necks were sticking up and that neither of us had heard ANYTHING like that before in all our years. My friend left and I headed into the house where I felt compelled to load hollow point slugs into my shotgun.   For nearly thirty minutes I noticed my dog staring up on the hill but did not hear another noise for the remainder of the night.",
  "classification": "Class B",
  "county": "Missoula",
  "state": "Montana",
  "latitude": 46.75889,
  "longitude": -114.08,
  "location": "-114.08,46.75889",
  "location_details": "South of Missoula",
  "temperature_high": 46.8,
  "temperature_mid": 34.095,
  "temperature_low": 21.39,
  "dew_point": 30.11,
  "humidity": 0.82,
  "cloud_cover": 0.52,
  "moon_phase": 0.45,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1023.29,
  "summary": "Mostly cloudy until afternoon.",
  "uv_index": 1,
  "visibility": 6.6,
  "wind_bearing": 246,
  "wind_speed": 1.2
}