{
  "reportId": "3086",
  "title": "Large creature leaves 12\"+ handprints on camper trailer during rainy night",
  "date": "2001-09-08",
  "timestamp": 999907200,
  "observed": "We pulled into camp on a rainy night about midnight. Cows were in the camp, so as they were leaving we heard - at least what I told my nephews - a bull really upset with us. It was a throaty, gutteral huffing noise. Only the pitch never varied to a higher one at the end, like a bull bellowing. Only the so-called bull never left with the herd. That, and I never recalled seeing a bull in the herd. Then, after 15 or 20 min. of the huffing in front of us, it got quiet.  Then my Sister heard a noise behind her in the woods, that sounded like an angry growl. I told her it was only the dogs growling at something. She informed me both my dogs were right there with her, and it wasn't them. So, she pulled out a pistol and turned and faced the direction it came from, and I went to get my rifle, and slung it across my back. Then, it got quiet and we didn't hear anymore of that during the night. Whatever it was knew what a gun was. My dogs never barked or went to investigate anything. They stayed right with us. They are watch dogs at my home, and have been camping numerous times. They seemed to want our protection this time. The next night, we heard some stirring out in the woods, became real uneasy because everything went dead silent. So, we went hastily to bed in the camper, dogs and all, and locked down. During the night, my Sister said she had been looking at the sky, and stars, and when she looked back again, she said all she could see was like a \"black mat\" over the window. She and her boys said they heard the dogs growling low, and the boys said they saw \"something black\". The next night we broke camp about an hour before dark, and once more everything became deathly quiet again, and the feeling like we were being watched. We finished loading about dark, and as we started to leave, it came a downpour, so I was coming down off the mountain about 5 to 10 mph. At one point my Sister commented about one \"bushy pine tree\" in a grove of aspen trees, when the headlights flashed. About halfway down a vehicle caught up with us, and informed me the doors were open on my trailer. We stopped to close them, and my lock was broken. When we got into town, we stopped at a gas station, and there I noticed handprints and muddy smears on the camper. They we too big and too high for any of us to reach. One of the handprints was very clearly one of a primate. That is where I noticed the lock had been twisted until it broke, instead of just popping off, like I thought at first. Obviously, we were going slow enough for it to follow us, and check out our trailer. We had just built the camper on the trailer, and it was a nice shiny sheet-metal one.  The door is on the rear of the trailer",
  "classification": "Class A",
  "county": "Montezuma",
  "state": "Colorado",
  "latitude": 37.4625,
  "longitude": -108.2083,
  "location": "-108.2083,37.4625",
  "location_details": "In the Jersey Jim Lookout tower area.",
  "temperature_high": 71.41,
  "temperature_mid": 52.715,
  "temperature_low": 34.02,
  "dew_point": 23.19,
  "humidity": 0.33,
  "cloud_cover": 0.08,
  "moon_phase": 0.68,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1012.52,
  "summary": "Clear throughout the day.",
  "uv_index": 9,
  "visibility": 9.89,
  "wind_bearing": 311,
  "wind_speed": 5.57
}