{
  "reportId": "24266",
  "title": "",
  "date": "",
  "observed": "One day, my son and his friend ran out of the woods next to the house out of breath and scared.  They said they had seen \"something big\".  I asked them what color and my son said brown.  I assumed it was a deer or wild pig as there are many around, just told them to be careful, and brushed it off. A month or so later, there was a show about Bigfoot on TV and my son came to me and asked if there were Bigfoot in Florida.  I told him no and that they stay up North.  I didn't want him to be scared of the woods.  I didn't tell him about the Florida \"skunk\" ape sightings. About 6 months later, my neighbor called me to ask if I or my family had ever seen anything unusual in the woods.  I was sitting in the car with my son waiting for school to open.  My neighbor told me about the sightings he and others had last fall.  My son heard the conversation and started interrupting, telling me he saw it. My neighbor heard him over the phone and started giving me questions to ask.  Height?  Very tall, taller than parents.  Color?  Reddish brown.  Was there a bad smell?  Yes.  I asked him what did the ears look like, were they pointy, rounded or what?  He said he didn't see any ears, just head and hair. My son and friend were playing in the woods when he saw something moving in undergrowth.  He saw the back of something that looked like it was on all fours.  As the back was large and tall, he decided to move closer to the house.  He felt very nervous.  As they were leaving, it seemed as if the something was moving toward them.  He also remembers sticks being thrown.  He urged his friend to move on.  Then at one point, he turned to look and he saw this large thing looking at him from behind a tree about 10 ft back.  It was standing up and very big, tall.  The tree was at least 2 ft in diameter yet it had wrapped one arm all the way around it.  There were many vines and branches on the trunk so he didn't get a good look at the body, but he insisted it was standing on two feet, not hanging on the trunk.  He said the eyes spooked him.  He started running and his friend followed.  That is when I saw them coming out of the woods, all out of breath. I asked him why he didn't tell me he saw Bigfoot when he came out of the woods, instead of saying something big.  He said that he didn't know there was such a thing as Bigfoot.  Then when he saw the show on TV, he asked me if they were in Florida and I had said no.  So he filed it away until my conversation with my neighbor reminded him.",
  "classification": "Class A",
  "county": "Pasco",
  "state": "Florida",
  "location_details": "At edge of Cypress Creek Well Field.  A 7,400 acre conservation area.  Water is piped to St. Pete while the land is open to hikers, horses, and bikes.  Flatlands, swamp, and creeks during the wet season.",
  "summary": ""
}