{
  "id": "663",
  "title": "",
  "date": "",
  "observed": "My brother in law and I were bow hunting in the deschutes national forest there are endless amounts of dirt forest service roads throughout the central oregon region.  We would drive down these roads and find a promissing spot get out and walk the area.  there are a lot of old fire areas and we found one we had not been to before it was a burnt out section of forest approx 1500 acres in size located about 2-3 miles from the base of Paulina Peek & newberry crater & about 1 mile in from hwy 31 and about 1 mile in from a dirt powerline road and on the south west section of the fire.  The burned area was very wide open and we were nere some small rock outcrops, there was a catline  road around the fire and this is what we parked on.  It was approxametly 1:00 and we had no luck so we decided to try one last place and then go home for the day, which is where i have described.  We parked and got out quietly and I headed into the  woods on the other side of the road, I walked  about100 feet in and was startled by a dow jumping out of the brush and fleeing.  We decided to go in the direction that the dow had gone thinking that there may be a buck somewhere nearby, my brother in law went off in the direction he thought the dow had gone and I stayed back and looked for tracks to see if there was others.  This is when i noticed some very strange prints on the ground, they were like a humans foot print but larger there were about 8 to 12 prints by one creature as far as i could tell the prints were not all in one dorection.  It looked as if the creature, animal, or what ever may have shifted its weight or something when it turned because the dirt was pushed up more on the out side of the print in places.  I told my partner and he didn't seem to interested he just kept looking for the deer, then he finally came back up over the little rise and I showed him the tracks he didn't seem to know what to think.  I kept studying them and tried to come up with an answer for them, I thought maybe the wind but know the chances of the wind making one let alone 8 - 12 of the prints was very unlikely, or rain but there is no way, or a bear but for a bear to be on its hind legs and to take that many steps was very very unlikely.  The prints from what I remember were about 12 to 15 inches in size, and some of the strides were possibly 4 to 4 and a 1/2 feet.  We had been at this location for about 30 minutes when my brother in law said we should go he sounded kind of shaky whitch was very unusual for him i asked him why and he said we should go.  So this got me kind of spooked for the first during this half hour, so we got in the car and left.  We never saw a creature or heard any unusual sounds, other than the prints the only thing that seemed odd to me was that when we first got to this location is that it was very quiet.",
  "classification": "Class B",
  "county": "Deschutes",
  "state": "Oregon",
  "location_details": "About 2-3 miles from the base of Paulina Peek & newberry crater & about 1 mile in from hwy 31 and about 1 mile in from a dirt powerline road and on the south west section of the fire.  The burned area was very wide open and we were nere some small rock outcrops, there was a catline  road around the fire and this is what we parked on.",
  "summary": ""
}