{
  "id": "8777",
  "title": "Boy observes sasquatch on hillside near Orting",
  "date": "1998-09-15",
  "timestamp": 905817600,
  "observed": "Recently my 10 year old grandson, Brenden, told me of a sighting he had when he was about six years old. My husband Dana and I had been on one of the first episodes of \"Mysterious Encounters\". My son and ten year old grandson had come over to watch the tape with us. Brenden had heard us talking about Bigfoot before but having never seen a picture of one, he did not know what they looked like. I put the tape in and as it showed the first picture of a Bigfoot Brenden turned to me and said, \"Grandma, I've seen one of those\". Stunned, I paused the tape and asked him about it. He was living in Orting, WA. at the time beside a small creek, which ran parallel to the Puyallup River. It ran along the base of the hill that the old Soldiers cemetery is on. It is a wooden area with a lot of deciduous trees. Some fir, and brush. He said it happened when he was about six years old. He had crossed the creek and was starting to climb up the hill. He heard a noise and looked up to see it standing in the woods. He said at first it stunned him but he also felt scared so he ran down the hill, jumped across the creek then looked back at it. It was looking at him but turned, walked up the hill and disappeared into the woods. I interviewed Brenden on May 8, 2004. Here is his answers to my questions. Did you tell anyone?   B. No, it was too freaky. Where did you see it?  B. On hillside behind my house. He walked through a clearing from left to right, then looked at me, turned and went up hill and disappeared. Did it scare you?  B. It stunned me but I wasn't really scared. What did you think it was?  B. I just thought it was someone in a suit. What time of year?   B. It was still hot during the day but colder at night. Where were you?  B. Twenty feet up the hill till I saw it. Then I ran back down the hill and jumped across the creek and then looked back at it. It looked at me and then disappeared into the woods. What made you look up?  B. It made a noise. What kind of a noise?  B. Ahhheerrrraaahhhooo. What time of day?  B. Evening, starting to get dark but still light. How long were its arms? B. arms came to about its knees. Way longer than people's. Was it big and muscular or tall and skinny?  B. It was big and muscular. How big was it.  B. Oh about as big as this house. (We have eight foot tall ceilings) When you jumped across the creek, how is it you could see it through the trees?  B.  There was a clearing you could see from across the creek. The woods were not grown up as much. I went back to the spot about the second week of May. It is now very brushy but I think he may have had his encounter closer to fall when many of the leaves would have been off the trees. He could not remember what time of year. The hillside is very brushy and in spring at least very swampy. Fish are in the stream and it is a very shallow creek. This hillside runs from Orting all the way to Puyallup, and is brushy the entire way. There is a recording of bigfoot sounds from Shaw Road in 1972. I lived just off Shaw Road from 1985 until 1997. Although I did not hear any strange noises my neighbor immediately to the left of my house did. Her house sat with her back yard to the McMillin Reservoir and it is bordered by the woods that run the length of the valley. She  asked me several times if I heard the strange howling, noises from back there. She was very afraid of what ever made those noises. I know Autum had her first encounter in Orting, I thought she would like to hear that they are still there after all these years.",
  "classification": "Class A",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 47.0958,
  "longitude": -122.2356,
  "location": "-122.2356,47.0958",
  "location_details": "From the town of Orting take the Orting-Kapowsin Hwy. Take the first R after the bridge. Follow it to the end.",
  "temperature_high": 77.92,
  "temperature_mid": 65.46,
  "temperature_low": 53,
  "dew_point": 51.42,
  "humidity": 0.68,
  "cloud_cover": 0.19,
  "moon_phase": 0.84,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1010.82,
  "summary": "Partly cloudy starting in the evening.",
  "uv_index": 4,
  "visibility": 9.03,
  "wind_bearing": 357,
  "wind_speed": 3.32
}