{
  "id": "2789",
  "title": "Camper says a sasquatch entered a cabin of sleeping girls.",
  "date": "1977-07-15",
  "timestamp": 237772800,
  "observed": "In 1977 I went with my church Bethel Baptist on a retreat to Robbers Cave State Park. We had arrived on Friday evening and would be leaving on Sunday afternoon. Well, on Saturday I couldn't shake the feeling that we, the campers, were being watched. Later that afternoon a storm rolled in and it was going pretty strong by the time lights out came. The girls cabin was located at the far end of the camp ground and was in the shape of a horseshoe. I was sleeping on the top bunk bed on the right arm, if you were standing at the door, in the middle of the three bunk beds for that side. Everyone was really nervous because of the storm so it took a while for us girls to go to sleep. Well, I couldn't go to sleep because I'm really sacred of storms so I was just laying in my sleeping bag when I heard the sound of the screen door to the cabin open. I thought I was hearing things until I heard it bang shut. I told myself it was one of the girls or maybe a counselor going to the bathroom, but then I smelled something foul. At that point I became very still, hardly breathing, and I could hear heavy shuffling foot steps walking around the cabin on the others side. Then the shuffling started coming my way and the smell increased. I became like a board. Then next thing I know I can feel something standing above and behind me and I hear this deep breathing and sort of a soft growl coming from above my head, which I couldn't understand because I was on the top bunk bed. I wanted to scream but I was too scared. I continued to listen and what ever it was walked to the window at the foot of the bunk bed and then returned to the head of the bed, standing behind me. What happened next froze the blood in my veins. Something large, and furry, touched my face. It traced my face, and along the headgear I was wearing for my braces. The next thing I remember was waking up in the morning, on the floor beside the bunk bed, in my sleeping bag, with my pillow under my head. ! I have no idea how I got there and it really freaked me out. I thought I had had a really bad dream until the girl who had been sleeping in the bunk bed beside me, on the bottom, grabbed me the next morning and told me she had seen it. I asked her what she had seen and she said that it was a big black hairy creature standing behind me and she couldn't scream because she thought that if she did, it would kill me. She and I made a promise never to tell anyone about what happened, and I haven't until this day.",
  "classification": "Class B",
  "county": "Latimer",
  "state": "Oklahoma",
  "latitude": 35.00278,
  "longitude": -95.34111,
  "location": "-95.34111,35.00278",
  "location_details": "",
  "temperature_high": 95.61,
  "temperature_mid": 84.55,
  "temperature_low": 73.49,
  "dew_point": 71.17,
  "humidity": 0.67,
  "cloud_cover": 0.41,
  "moon_phase": 0.97,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.08,
  "summary": "Humid and partly cloudy throughout the day.",
  "uv_index": 8,
  "visibility": 8.51,
  "wind_bearing": 138,
  "wind_speed": 4.79
}