{
  "reportId": "47067",
  "title": "ATV riders near Berea have scary ride out of woods at night",
  "date": "2014-09-22",
  "timestamp": 1411344000,
  "observed": "This was around the end of September 2014, I recently made friends with the guy I purchased my four wheeler from.  He called me to see if I would be interested in riding on his friends property on four wheelers, I told him yes and showed up. We arrived at his friends farm with 3 four wheelers plus his friends quad which made 4 quads total, time was 21:00 eastern time. There were 5 of us that went riding 4 males one female which was my friends girlfriend. After riding for an hour on this guys farm we went to this place they call *******, its south of Berea off of US25.  Its easily a few thousand acres of undeveloped land.  We ride with no incident for an hour or so, around 2230 at night we decide to head back to the farm we left earlier in the night.  As we were heading out we stopped so everyone could catch up because some had utility quads and some had racing quads, as we waited was when the first incident took place, as we sat we heard a branch snap like it was being deliberately snapped to let us know we were not alone, it was about 50 yards to our left in thick brush, we sat there quiet and just waited to see what would happen next, I have hunted deer before and it did not sound like large game traveling thru brush, it was a single snap, no brush or leaves moving like when a animal walks, also you heard no noise at all, dead silent, insects stopped making noises, you could hear a needle drop. We decided at this point to move on, it was a strange incident but not alarming yet...  We rode up the trail about a quarter mile to half mile and stopped at a clearing in the woods to just talk, we were all present, we spoke abit about that branch and just other general things when out of no where a large, extremely large log was hurled from up the hill next to my friends four wheeler at the base of the hill, the log was a good sized log, I stood up and looked up the hill but as soon as I did this massive lime stone slab was hurled toward the same friends four wheeler and barely missed him, at this point you heard loud thumps and branches breaking like something was running down the hill with alot of weight, at this point everyone started their four wheelers and we sped out of there.  We haven't gone back since.  I am not a believer, I thought sightings were hoaxes before that night but now I cant explain what that was and I'm not ruling out the possibility that it could have been bigfoot.",
  "classification": "Class B",
  "county": "Madison",
  "state": "Kentucky",
  "latitude": 37.30984,
  "longitude": -84.20422,
  "location": "-84.20422,37.30984",
  "location_details": "",
  "temperature_high": 67.42,
  "temperature_mid": 55.67,
  "temperature_low": 43.92,
  "dew_point": 47.09,
  "humidity": 0.69,
  "cloud_cover": 0.03,
  "moon_phase": 0.95,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.06,
  "summary": "Clear throughout the day.",
  "uv_index": 6,
  "visibility": 10,
  "wind_bearing": 357,
  "wind_speed": 4.02
}