{
  "reportId": "15398",
  "title": "Possible tracks & smell noticed by hunter at Black Mountain outside Whitehall",
  "date": "1999-11-01",
  "timestamp": 941414400,
  "observed": "Not an actual sighting. However, I recently read an article in the Post Star Glens Falls NY newspaper about a BFRO gathering in Whitehall NY. To begin with, I had never heard of your organization nor knew that Whitehall was a supposed hot spot for Big Foot sightings. Let me tell you my story, all factual. My family and I have owned property in the Dresden NY area (off of RT 22, a few miles north of Whitehall) since the early sixties through last year when I sold my property (located on Blue Goose Rd, old RT 22) last year. Back in 1999 while deer hunting off of Pike Brook Rd. in the Black Mt. area, I viewed some very strange tracks in the mud on a logging road and suddenly an awful, foul smell was in the area. It was a damp, still early November day, thinking back it may have been Election Day. The time was around 8AM as I hiked up the logging road. The smell drifted away as quickly as I smelled it but it was distinct. I've never smelled anything like it since and I have been with hunters that took Adirondack bears and this odor was different. It actually raised the hairs on the back of my neck, it was definitely a strange odor. The tracks were sort of footlike but very wide. The toe area was mushed in the mud so it was difficult to determine if there were claws like a bear or any other type of distinguishing features. In retrospect, I should have reported this immediately but the only person I told was my wife and a few hunting buddies. No one completely dismissed my story but it was like, oh, thats something but I know what I smelled and sensed and it definitely gave me the creeps. I am interested in your organization and I'd be willing to go back to the area with someone involved with BFRO and take you to the site. Please contact me at T********@nycap.rr.com to  discuss. Thank You.",
  "classification": "Class B",
  "county": "Washington",
  "state": "New York",
  "latitude": 43.56211,
  "longitude": -73.45947,
  "location": "-73.45947,43.56211",
  "location_details": "Pike Brook Rd. Opposite trail to Black Mt. approx. 1/4 to 1/2 mile south of trail parking lot",
  "temperature_high": 62.96,
  "temperature_mid": 51.72,
  "temperature_low": 40.48,
  "dew_point": 38.79,
  "humidity": 0.71,
  "cloud_cover": 0.05,
  "moon_phase": 0.79,
  "precip_intensity": 0.0001,
  "precip_probability": 0.36,
  "precip_type": "rain",
  "pressure": 1020.68,
  "summary": "Clear throughout the day.",
  "uv_index": 2,
  "visibility": 9.41,
  "wind_bearing": 168,
  "wind_speed": 4.84
}