{
  "reportId": "45360",
  "title": "Campers sleeping inside their tent hear clacking and are touched near Bumping Lake",
  "date": "2014-06-08",
  "timestamp": 1402185600,
  "observed": "Let me begin by stating that my mother Renae Sampson is a member of the BFRO and has gone on multiple expeditions, is fairly knowledgable about Bigfoot activities and sightings, and has shared her stories with me. I am somewhat of a skeptic, but believe there is always a possibility of discovering new creatures on our planet, but until this past weekend I had never experienced anything first hand. Growing up in central and western Washington, my whole family has always enjoyed the wild outdoor spaces whether camping, day hiking, fishing or just exploring old mountain dirt roads. This past weekend June 7-8, 2014 was no different... We made camp at the upper Bumping Lake campground using 2 small tents and a picnic table tent. The weather was in the upper 70's to low 80's during the day, we had 3 young children ages 4-9, and 4 adults age 37-62. (Whether that's notable or not, I don't know- but I added it in case.) My brother and his family joined us only for the day leaving around 5pm. We rode bikes, played in the water, ate lunch, hiked around the campsite on animal trails, normal camping activity with kids. One notable strange thing happened happened around 6pm... My 4 year old son needed to use the restroom and we decided to walk through the small island of trees at the end of the campsite paved loop. We startled a deer in there and I remember thinking \"that's strange to see a deer in here with so much human activity around the campsites\" I wanted to try and take a pic with my iphone and tried to walk a bit closer. My son stayed right at my heels, also being curious if we could get closer. I don't know why, but I always call wild animals \"baby\" and spoke to this deer: \"it's ok baby, we won't hurt you\" etc. (And I honestly never would, no guns or any type of weapons for my family) So we move forward, the deer slowly walking away a few feet, nibbling some leaves, me moving forward, Deer looking back at me, deer nibbling leaves, the deer never being more than 20' away from us, until we emerge from that small island of trees, cross the paved road into an empty campsite near the restrooms. It was almost as if it wanted me to follow, it kept looking back at me, but never running off. My son looks up and says, \"I don't want to follow that deer anymore, Mama\" and I try to coax him along a bit more. He was adamant and did not want to enter that part of the forest. I follow the deer a bit more trying to get that \"one great nature photo\" and then I lost the deer over a small rise. I even crouched low to see if I could spot moving legs-nothing. What is interesting about this is that my son is very outgoing, adventurous and always wants to lead the way. Was some instinct holding him back? (Whether this is notable or not, I included it anyway) After dinner, my mom, son and I went for a drive up the dirt road (1800) all the way to the end and back. Got back to camp about 9pm, made a fire, sat around and told stories, watched bats flying, watched for shooting stars. The night was calm with not much of a breeze to notice, few clouds in the sky. The moon was in its waxing gibbous phase and visible in the southern sky straight up from our campsite. I put my son to bed in our tent, then stayed up with my mom at the campfire till midnight. I simply couldn't keep my eyes open any longer and quickly fell into a deep sleep. Here's where it gets interesting and something I will never forget... Maybe its the cool night air (approx 54F) or the glass of wine before bed, but I had to wake up and go potty. As I lay trying to convince myself to get out of my warm cozy sleeping bag and don my slippers to outside behind the tent, I hear off in the far distance toward the South part of the lake a \"Clack....clack, clack, clack\" and my brain races to identify the sound. By the time I realize I am hearing rocks clacking together I hear it again, in a definite pattern \"Clack....clack, clack, clack\". Now I am wide awake, on alert and must pee now! I have to say, I did not much want to get out of my tent at this point. Nevertheless, I did, and quickly went potty behind my tent and hopped back into bed. I remember thinking \"what the hell is that?\" I grabbed my headlamp and noted the time on my watch as a few minutes past 2am. I wanted to remember this and tell my mom in the morning. I would say I listened to this clacking occurring repeatedly every couple of minutes for approx. 10 minutes and somehow fell back to sleep. Here's where it gets freaky! I'm fast asleep and become aware that there is the sound of stampeding animals right behind my tent. Still in a haze of sleep, my head on my pillow up against the wall of our tent, I feel what seem to be fingers touch the back of my head in what I can only describe as a \"hard petting\". I feel the end of my tent beyond my feet on the inflated bed my son and I are sleeping on LIFTS UP! And then its placed gently back on the ground, like floating down! I reach out to touch my son and he is facing away from me with his arms and hands under the covers. He had not touched me....what did?! I hear something brush the side of the tent! And then, I hear my mom's voice in a loud shouting whisper: \"Jennifer!!\" I am awake and alert and scared at this point and try to call out to her but my voice won't come out. I am barely able to utter a weak mumble sound.  I hear the clacking rock sound closer now, in the near distance south of our tent in the \"Clack....clack, clack, clack\" pattern, with a responding \"Clack....clack, clack, clack\" from further away maybe south-west, maybe even from the other side of the lake. And then the closer sound again this time, rapidly: \"CLACK, CLACK, CLACK, CLACK, CLACK, CLACK\"  I have to tell you I was completely petrified with fear at this point, could not move or speak. Somehow, like a miracle, I fell back to sleep. Again, with that night chilly air I woke with the need to pee. I woke up thinking \"Something weird is going on here\". I could still hear the occasional clacking far off now, in the southern distance. No longer feeling petrified with fear, I don my slippers, quickly potty behind the tent again and dash back to bed. I notice the sky is still dark, full of stars and the moon positioned in the south western part of the sky right above the mountaintops. I did not check the time, but imagine it was around 4-5am. I don't remember sleeping well, filled with fright and thought \"next time we're sleeping in my Explorer\" and then it was 8am. I could hardly wait for my mom to wake so I could tell her what happened. I rose before Mom and my son and walked around our campsite looking for any sign of a visitor. No Bigfoot footprints. My tent was still firmly staked down. Couple of fresh deer tracks on the trail behind our tents. WHAT THE HECK??!! Mom woke up and I recount my story to her of the night's events. She states she was not awake at all during the night, and doesn't remember calling out my name. The funny thing about that is that I've gone by \"Jen\" for 20 years, and only my parents still call me \"Jennifer\". Weird. We pack up camp with the intent of going to the other side of the lake for a hike along the Cougar/Swamp trail for a spell before we headed home. We wanted to get to the Boulder Creek crossing and were curious if my 4 year old son could make it. He did, and we had fun taking pics along the way, had a snack break, met some folks on the trail on the way back, not too hot, not too breezy...all in all a nice day. When we were about 15 minutes away from our cars at the trailhead, we heard a sound. A sound my mom and I have never heard before. We were in a thick wooded portion of the trail: close to the water on one side, and fairly straight up elevation on the other- meaning the hillside rose steeply upwards. I do not think either of us would be able to easily climb up this land covered thickly with Kinnickinick, Bunchberry, ferns, and many many trees growing closely together. This is where the sound came from...directly above us! Hard to describe, but sounded like this: \"HUMPF\" like coming from deep within a large animal, kind of guttural, but not a growl. And it was loud. And close. And no other sounds like the animal moving or walking through this thick vegetation. We all stopped and looked at each other wide-eyed. We looked up into the woods a bit but could not see anything through the thick plant life. I was a bit on edge and thought, \"let's get out of here!\" We continued the hike back to our cars and I remember thinking to myself, \"that was weird\", and what a weird night I had just experienced and why isn't my mom talking about this more?? She's the Bigfoot fanatic in our family! Didn't she think that was strange? Maybe she was meant to forget? Or not notice? I understand Bigfoot may have powers beyond our knowledge or capabilities. You never know... So, that is my story to the best of my recollection.  It scared the hell out of me. I literally felt paralyzed. I am intrigued. I will continue to go camping, and maybe...just maybe have another encounter-if that's how you would classify this story.",
  "classification": "Class B",
  "county": "Yakima",
  "state": "Washington",
  "latitude": 46.85524,
  "longitude": -121.3034,
  "location": "-121.3034,46.85524",
  "location_details": "OK to post online: Location was at Bumping Lake, Upper Campground site #37. Very end of the campground loop.  And on Swamp/Cougar Lake trail.",
  "temperature_high": 73.23,
  "temperature_mid": 64.475,
  "temperature_low": 55.72,
  "dew_point": 49.79,
  "humidity": 0.63,
  "cloud_cover": 0.08,
  "moon_phase": 0.35,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.01,
  "summary": "Clear throughout the day.",
  "uv_index": 9,
  "visibility": 9.74,
  "wind_bearing": 301,
  "wind_speed": 8.38
}