{
  "id": "1344",
  "title": "while playing tag with several other children witness saw a white hairy creature.",
  "date": "1978-08-06",
  "timestamp": 271209600,
  "observed": "Subject: White Bigfoot I just read the Louisiana encounter on your site and thought it great that someone else had seen a white bigfoot. I have not told anyone outside of friends about my experience, although there were plenty of others around at the time. This encounter happened, Ohhh bout 30 years ago in Columbus, MS. I and several of the neighborhood kids were out playing in my front yard. I was the oldest, so the rest of the dozen or so kids were 4th grade and earlier in school. All of us were playing \"Tag\" and to make things level-out for the younger kids, we all were turning round and round to get dizzy so the youngers could have a fighting chance of  catching us. All of a sudden, my youngest brother ran through the group yelling \"Booger-Bear!!\" He looked TOTALLY scared to death. I thought he was joking, but then my next brother did the same while pointing toward the unoccupied side of out duplex apartment house. Soon, I looked around to find that I was the only one left in my front yard, the rest of the kids had run to where the parents where outside chatting next door. All of them were holding onto his/her parent(s). Well, I looked down the street and saw nothing unusual. Looked again, both ways, same result. As I was turning back toward them, my eye caught a movement beside my duplex. Something was standing at the corner, hugging it as though to peek around a corner. It appeared to be slightly hunched over and yet the top of it's head was at the top of the window. The top of that window was at about the 7ft plus level. Could have been higher. One day I might get a chance to measure it cause the house is still there today, although the neighborhood is not where I would care to be at anytime nowdays. Anyway, I stood there looking, trying to figure out what this white hairy thing was. Earlier in the year, maybe a couple of months (been a long time ago), there was a report of a white gorilla that had escaped from a circus. Thing is, kids know when a circus is around in those days, and I had never heard of one being anywhere near. It was just standing there, slightly moving kind of side to side. Since it was at dusk, and I couldn't really tell what this was that I was looking at, I slowly backed over to the grown-ups area. Eventually, the thing was hidden from my view by the house. I eventually worked up enough courage to make a wide arc toward where I saw it to see if it was still there. Nope, it was gone. I had a terrible time sleeping that night. Didn't want to be anywhere near a window even though we had no AC and it was warm weather. Next morning, I went to the area just to see if I could find anything. Nothing. I was never late for supper again. Never stayed out after dark. etc...The experience is real, though I have questioned my brothers about it and they remember nothing. Perhaps it was the grownups playing a joke?  They of course deny any knowledge. This is my only \"bigfoot\" story, though I have a couple of others that may spark some interest, one of which defies any rational explanation.",
  "classification": "Class A",
  "county": "Lowndes",
  "state": "Mississippi",
  "latitude": 33.50025,
  "longitude": -88.40335,
  "location": "-88.40335,33.50025",
  "location_details": "",
  "temperature_high": 86.84,
  "temperature_mid": 78.275,
  "temperature_low": 69.71,
  "dew_point": 68.09,
  "humidity": 0.73,
  "cloud_cover": 0.48,
  "moon_phase": 0.08,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.41,
  "summary": "Foggy in the morning.",
  "uv_index": 8,
  "visibility": 4.81,
  "wind_bearing": 349,
  "wind_speed": 3.64
}