{
  "reportId": "1461",
  "title": "Witnesses saw Creature next to a Broken Tree",
  "date": "1981-06-01",
  "timestamp": 360201600,
  "observed": "This was in the early 80s,late spring early summer. i was still in High school ( Graduated in 1983)  Myself my two brothers and my best friend and his two brothers were in a field with our dogs goofing off,on top of a hill over looking a swamp bottom.We had been talking about and wondering why the cattle that stayed in this field never went to certain part of the field.( the area we were looking at).(We jokingly called this the Devils corner because of this).On this particular day the cattle had wandered into this area and were grazing. After about 10-15 mins of us sitting at the top of the hill talking about this we noticed that a few of the cattle looked very anxious and were looking toward the fence row that bordered the swamp area. We all started getting excited that the cows were scared of something, when all of a sudden the herd startled and began running up the hill out of that corner and bottom. Since we were in their path we moved and watched them run back to ward the south end of the field. Being curious we gathered up some weapons (logs,sticks,rocks) and decided to go see what was there, not expecting to see anything. We crossed the bottom and started toward the fence row.We noticed that it was extremely quiet in that corner of the field . We began to look around when we noticed some reddish hair stuck to the barbs on the fence.Then thought hey there are no reddish colored cows,so why is this hair this color and on the top row of 4 row barb wire fence ( fence was 5 ft at the highest point) we then heard something moving in the woods (very thick and dense,lots of thorns)where the hair was at. At this time i noticed that a pine tree roughly 5inches in diameter had been twisted and knocked over about 8-10 feet up.We hadnt had any storms recently and no other trees were damaged. We decided we should leave.As we started to leave my the younger boys threw there stuff down and began running me ,but me and my friend didnt. I then had the feeling that we were being watched,i asked my friend if he felt that as well and he said yeah, i turned toward the fence to see a face about 7ft up standind next to the broken tree,i asked my friend if he saw it as well and said uh huh, we stared at it for about 2 mins before we ran away. What i saw was 2 eyes a gray/white color with reddess hair,the top of the head was hiddien by brush,the bridge of the nose was very apparent,straight,long and narrow the rest was hidden from view. After that we never said anything about it again.About a month later my friend decided he was going back in there to look around with his dog.(this is the same dog that was with us the first time and acted very afraid,and this dog has chased many animal in that field) I wnet to the fence row by the broken tree with him but told him i was not going in there with him and that id wait there for him.He said he'd be back later.After he crossed the fence i lost sight of him about 5ft in. No sooner had i lost sight of him i hear movement to the left of the spot he went in, shortly after this i heard him come running back to the fence row, he was yelling i saw it, i saw it..he jumped that barbed wire fence in stride with his dog hot on his heels. From that day on we never went to that area again. Later on that fall we had found a calf in the swamp that had been ripped open and the guts had been pulled out,but not eaten.We passed it off as wild dogs or coyotes/wolves. Later that winter we had a snow (unusual) and again found another calf that was the same way but in another area of the field. We also passed this off as wild dogs, coyotes/wolves. But since reading about the deer kills in other states,i began to think that these calves had been done the same way.We never talked to anybody about what we saw.Except the calves. That wooded area has since been cleared/thinned and but the swamp is still there.This swamp has access to Bayou Marie,Cedar lake ,and the Red River.My parents still live there so i visit the area every month.",
  "classification": "Class A",
  "county": "Rapides Parish",
  "state": "Louisiana",
  "latitude": 31.3058,
  "longitude": -92.4054,
  "location": "-92.4054,31.3058",
  "location_details": "This sighting occured in a community in Central Louisiana. Outside the city limits of Pineville near a swamp area. Between Hwy 107 and Hwy 167.",
  "temperature_high": 86.92,
  "temperature_mid": 79.055,
  "temperature_low": 71.19,
  "dew_point": 68.57,
  "humidity": 0.77,
  "cloud_cover": 0.53,
  "moon_phase": 0.97,
  "precip_intensity": 0.0003,
  "precip_probability": 0.08,
  "precip_type": "rain",
  "pressure": 1012.74,
  "summary": "Humid and mostly cloudy throughout the day.",
  "uv_index": 8,
  "visibility": 6.41,
  "wind_bearing": 165,
  "wind_speed": 2.69
}