{
  "reportId": "7241",
  "title": "ATV'ers find footprints near Pt.Pleasant",
  "date": "2001-01-20",
  "timestamp": 979948800,
  "observed": "We were riding our 4-wheelers in Mason Co WV, We were off of Greer Road on a friends property and stopped to get something to eat. This area we were at is not populated at all. I went over and sat on a log to eat and my husband asked me what kind of track was by my foot, When I looked down I was astounded! My husband wears a size 13 boot, And this was in cold weather so the thick boots make his foot look even bigger and this footprint made his look small! it was atleast 16 to 18 in long and 6 to 8 in at the widest point.There were about 3 or 4 more footprints leading down to the creek. I walked up and down the banks looking for more but I couldn't find anymore. I am 5'9\" and have fairly long legs and I could not put my foot beside one of the prints and reach the other one. This was one of the most amazing things I have ever seen! Regretably none of us had a camra, but there were aprox 15 of us who seen these. Everybodys first reaction was that it was a hoax, but in my opinion if someone was going to fake this they would have done it in a more populated area. Our friend Jack , whos property we were on called the Department of Natural Resourses to ask them about this, they sent one truck down to look at the print. This truck left and came back with about 5 more trucks. They told Jack not to come back there while they were there. After they were done one of them stopped and told Jack that it was only a black bear print, I am no zoologist but I have seen black bear prints, and this was not one. There were no claw marks, but there were toes. And if that was a bear, and it left tracks that big, I wouldn't want to meet it! This happned in winter of 2001, I have not told very many people because the ones I have look at me like I need to be locked up! I am very glad to find this site, and to share my amazing experince with people who understand!",
  "classification": "Class B",
  "county": "Mason",
  "state": "West Virginia",
  "latitude": 38.8448,
  "longitude": -82.0849,
  "location": "-82.0849,38.8448",
  "location_details": "Off of Rt 2 on Greer Rd.",
  "temperature_high": 25.76,
  "temperature_mid": 18.385,
  "temperature_low": 11.01,
  "dew_point": 21.2,
  "humidity": 0.87,
  "cloud_cover": 0.96,
  "moon_phase": 0.88,
  "precip_intensity": 0.0029,
  "precip_probability": 0.53,
  "precip_type": "snow",
  "pressure": 1017.78,
  "summary": "Light snow in the afternoon.",
  "uv_index": 1,
  "visibility": 5,
  "wind_bearing": 343,
  "wind_speed": 8.07
}