{
  "id": "6961",
  "title": "Teen has daytime sighting near Myers Flat",
  "date": "1963-08-01",
  "timestamp": -202608000,
  "observed": "This was a long time ago where I grew up in northern California.  I lived in a small town called Piercy, California about 17 miles from Garberville.  This encounter was located in a small mill town called Myers Flat.  Two friends and I were hunting up an old logging road roughly 2 miles up the mountain across the Eel River from the town.  I was far ahead of my friends and decided to scare them as they came up the trail so I climbed up some rock cliffs for a better advantage and settled down within some Huckleberry bushes to wait for my friends.  After things quieted down I noticed a heavy smell and started looking around.  The breeze was blowing straight from the brush behind me and I felt the hair on my neck starting to rise up. My two friend were nowhere in sight.  I noticed a small movement in the berry bushes right behind me.  I stood up ready to run when this thing stood up also.  It didn't hesitate but turned and walked off into the brush.  I heard trees snapping and the crunch of dry leaves echo away as I ran back to my friends who were still two hundred yards away.  After I calmed down we went back to the spot to look for some sign.  They believed I saw a bear but I know what I saw.  We found where something was squatted down and stripping berries.  I had disturbed its meal.  Small trees were just broken off about 4 feet from the ground as the thing made its retreat.",
  "classification": "Class A",
  "county": "Humboldt",
  "state": "California",
  "latitude": 40.26639,
  "longitude": -123.8692,
  "location": "-123.8692,40.26639",
  "location_details": "Take the Myers Flat loop road to the river.  There was an old logging bridge about half way around. The sighting was up that road about two miles.",
  "temperature_high": 81.62,
  "temperature_mid": 68.265,
  "temperature_low": 54.91,
  "dew_point": 50.34,
  "humidity": 0.57,
  "cloud_cover": 0.11,
  "moon_phase": 0.38,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.55,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 9,
  "visibility": 8.27,
  "wind_bearing": 266,
  "wind_speed": 1.14
}