{
  "reportId": "16661",
  "title": "Possible tracks found by snowshoers near Steamboat Springs",
  "date": "2004-01-15",
  "timestamp": 1074124800,
  "observed": "My girlfriend (now wife) and I were snowshoing in the mountains above fish creek falls outside of steamboat springs, CO in the winter.  We were off trail and decided to attempt to shortcut down the mountain to get back to the trail head.  We miscalculated and found ourselves in a very steep ravine just above fish creek and we were trying to find a way back up the steep incline as it was nearly humanly impossible to scale the side of the canyon.  Ahead in the snow we saw a set of tracks heading straight up the side of the ravine.  Initially we though it must be an elk or deer, but looking at the spacing of the tracks they appeared to be created by a bi-pedal creature with a gate much larger than I could span (I am a little over 6 foot tall)  The tracks appeared to have the basic shape of a human foot and toe impressions could be faintly seen in a couple of the tracks.  The tracks were postholed - 16 - 24 inches deep and most impressive was how this creature powered it's way through this deep snow up a slope that was over a 45 degree angle.  A deer or elk would have left long dragging skids through snow this deep, but there was no dragging, just deep, large, single steps that would look just like a humans gait, except maybe a foot more between each step.  We pondered it at length and I have a couple of digital photos, although honestly not much showed up with the whiteout action of the snow.  I spend a lot of time outdoors and I have seen countless elk, deer, and bear tracks.  This was none of thsoe for certain.  A friend of mine who is active in your organization told me I should post this despite the lack of credible proof, so here it is! I can provide the actual month and date when I dig up the digital photos...",
  "classification": "Class B",
  "county": "Routt",
  "state": "Colorado",
  "latitude": 40.4805,
  "longitude": -106.7682,
  "location": "-106.7682,40.4805",
  "location_details": "Take the fish creek falls main trail across the bridge (passing the falls) and continue up the trail about 1/2 mile until you are past the switchbacks and the trail straightens heading WSW.  Take a right off the trail go a few hundred feet and then turn ENE and follow back down the ravine towards fish creek.  Decend towards the creek until your about 150 feet above the water and then follow the creek back towards the bridge and falls (heading approx wnw) and you will pass over roughly the same area we did.  I estimate that we were about 1500 feet from the falls (heading towards them) when we saw the tracks.",
  "temperature_high": 31.75,
  "temperature_mid": 26.83,
  "temperature_low": 21.91,
  "dew_point": 12.87,
  "humidity": 0.69,
  "cloud_cover": 0.35,
  "moon_phase": 0.78,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.62,
  "summary": "Mostly cloudy starting in the afternoon.",
  "uv_index": 2,
  "visibility": 9.6,
  "wind_bearing": 125,
  "wind_speed": 2.03
}