{
  "id": "1100",
  "title": "Two fisherman run from a large screaming creature in the woods near Highway 7",
  "date": "1983-05-15",
  "timestamp": 421804800,
  "observed": "This wasn't experienced by me, it was experienced by my father. He related the story to me either later that night or the next day, I don't remember. He and his best friend, Gordon Johnson, often went fishing and (morell) mushroom hunting in the woods near Gordon's house which was just south of town. Gordon had 40 acres, but it was sparsely wooded, and had no fishing ponds. I can't remember whether they were headed for some fishing hole Gordon had heard of or if they were mushroom hunting, but I suspect the latter. The woods they were traveling through were very thick, almost impassible. If I remember correctly, my dad had a machete to hack through the brush. I remember he said that he was having an argument with Gordon, along the lines of \"Where the heck are you taking me!\" After traveling south from the gravel road they'd left my dad's pickup on, he said he found a trail, or at least a spot where the brush wasn't as thick. They started across this spot (I ! remember he said he couldn't tell if it was a trail, or just a cleared out spot) and said they heard a sound that stopped them in their tracks. There had been an eccentric individual that had lived near Gordon who had, a year or so before, let his exotic animal collection loose, which included a lion and lioness. It made all the papers. Despite the fact that all animals had been accounted for, the fact that this sound my father and Gordon heard was a definite roar of some large creature got their attention. In that part of Missouri, bears are unheard of. Forests are pretty much small trees and brush, not the hardwood areas bears like. Same with bobcats, and pretty much any other big game. We have deer and coyotes, and not too many of those. My dad said this was a cross between a lion and a bear, but that it ended in what he described as a high-pitched shriek, like a monkey. Gordon is a pretty superstitious guy, so he totally froze. My dad was more down to earth, he started looking around. They were then hit by a very strong smell, my dad said he almost vomited, he said he was glad he hadn't eaten lunch yet. They heard brush moving (but didn't see anything) and then another howl, just like the one before, but definitely closer. That was enough for them, they turned about face and hauled out at full speed, following the path my dad had cut as best they could. My dad had some nicks and cuts to back up this part of the tale of plunging through the brush (brambles on his clothes and such). They emerged almost 1/2 a mile from where they entered, that's how fast they were running. My father was a construction worker, and just not afraid of much, especially with a machete in his hand. He was also NOT a storyteller, at ALL. If something scared him, he was more likely to lie and say he WASN'T scared, he was quite the macho type. Also, every time he drove past that section of woods to Gordon's house, he always sped up. I could tell something back there got to him. He passed away a few years ago, or I'd call him and get more details for you.",
  "classification": "Class B",
  "county": "Cass",
  "state": "Missouri",
  "latitude": 38.7437,
  "longitude": -94.2633,
  "location": "-94.2633,38.7437",
  "location_details": "Cass County, Missouri. Approx. 1 mile east of 7 Highway, 3 miles south of Pleasant Hill. Unknown distance south of gravel road.",
  "temperature_high": 62.35,
  "temperature_mid": 53.42,
  "temperature_low": 44.49,
  "dew_point": 40.62,
  "humidity": 0.64,
  "cloud_cover": 0.58,
  "moon_phase": 0.1,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.81,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 9,
  "visibility": 9.31,
  "wind_bearing": 15,
  "wind_speed": 7.49
}