{
  "reportId": "8543",
  "title": "Turkey hunter has close encounter with bigfoot in Kiamichi Mountains",
  "date": "2004-04-30",
  "timestamp": 1083283200,
  "observed": "On April the 17th 2004 I was Turkey hunting in the Ouachita National Forest with my girl friend and my brother. I had crossed the creek that ran along side an old log road that headed up the mountain to the west, when I decided to hunt the creek bottom that afternoon. As I set up my Turkey blind and got settled in to do some hunting I blew one of my locater calls it was a screaming hawk. After sitting there for about 15 minutes I turned my head and noticed a burnt looking tree about 50 yards to my left. I raised my shotgun and looked at it with my scope when I realized what I was seeing was not a tree but a large creature like I have never seen before, it stood about eight feet tall, had charcoal dark color hair covering its entire body. [The hair] was about three inches long and coarse in appearance. It was watching me as well as I was watching it. Its eyes were reddish-brown in color, it had long arms and walked up right never taking its eyes off me, and I never took my eyes off of it. This thing was just looking at me as if it had been watching me for some time. This thing scared me pretty bad if you can give me a call I will give you more details. This thing is out there this is not a joke what I saw was Real! I have never been scared of anything in the woods but this thing was massive in size and I can say this thing scared me, and I have not been back in the woods before daylight since.",
  "classification": "Class A",
  "county": "Le Flore",
  "state": "Oklahoma",
  "latitude": 34.689,
  "longitude": -94.7325,
  "location": "-94.7325,34.689",
  "location_details": "",
  "temperature_high": 76.88,
  "temperature_mid": 65.495,
  "temperature_low": 54.11,
  "dew_point": 62.52,
  "humidity": 0.85,
  "cloud_cover": 0.64,
  "moon_phase": 0.35,
  "precip_intensity": 0.0524,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1013.75,
  "summary": "Rain in the morning and overnight.",
  "uv_index": 9,
  "visibility": 8.25,
  "wind_bearing": 140,
  "wind_speed": 3.3
}