{
  "reportId": "665",
  "title": "",
  "date": "",
  "observed": "First off I've lived and hunted and hiked in these woods most of my life.born and raised here by folks that trace our line back to \"THE MEEKS PARTY BLUE BUCKET WAGON TRAIN\".So I have studied plenty of animals that have lived here.what I HEARD ON THAT LATE FALL evening made the hair stand straight up. The month was September the weather was warm.My husbane had returned to Redmond to go bowling on his league.I stayed behind as some friends were to come up later that evening and join us The State was doing alot of road work and were blasting parts along the hiway to clear space for wider roads. I was putting more wood on the fire when I Looked at my watch our friends were late as usual.It's was 10:30 a friday.   You could heard the trucks and the blasting going on along the road. Then there was this real loud blast! It shook the ground under the stump I was sitting on. futher away from the road you could hear a rock slide started from the blast. Then the woods came to life.I could hear running of a very large animal going through everything in his way.UNDERBRUSH WAS SNAPPING AND SMALL TREES COULD BE HEARD CRASHING TO THE GROUND. As the rocks in the canyon stopped sliding the woods became quite again.Then just across the lake from where my tent was pitched the howing and screaming started.These sounds went on for at lest half hour.I being alone at this time became rather unnerved and decided that my tent would be a better place to wait for my friends from.I crawled inside and found my rifle load a shell into the barrel and sat there in the dark. The sounds across the lake had all but vanaished I COULD STILL HEAR something moving over there and it wasn't deer,elk,bear,cougers,cattle,people,linx,badgers, wild dogs or wolverines. At 11:30 pm my friends finally made up to the camp.They could tell that something had made a very bad impression on me and ask what had happen.I told them.We waited till my mate got back from town but no more noise was heard that night. As this is about more than just what I saw it would be nice for it to be keep unlisted. thank you",
  "classification": "Class B",
  "county": "Deschutes",
  "state": "Oregon",
  "location_details": "three sisters wildness area around the Cache Lake systems.us highway 58 is less than 5 miles from spot",
  "summary": ""
}