{
  "reportId": "7662",
  "title": "Girls see retreating biped near Molalla River",
  "date": "1984-08-15",
  "timestamp": 461376000,
  "observed": "I was 15 years old in 1984 and lived past the town of Molalla in Dickey Prairie and our house sat right on the river. It was early evening right before dusk. My girlfriend and I were down almost under the bridge where we swam in the summer. It was still warm right before school started. I guess we were just goofing off down there. It was the best thing to do out in the country, we had so much freedom. We wandered the hills, forest and old logging roads all the time. I really don't remember what made us look across the river at exactly the same time. Maybe it was a sound or just a feeling. And it was only a flash. But between the trees I saw a huge manlike being running. It was dark in color, dark brown to almost black. And covered in hair. It had to be about 71/2 feet tall. I had lived out there and being a tomboy. I had prowled all through the woods. I had never been scared out there alone and even miles from home on my horse. What I saw was not a bear or a friend playing a trick. The way it ran was so human like. The way the arm was bent at the elbow and the knee. It stood up just slightly stooped. And it ran fast. It gave us a quick look while it was running and disappeared. We looked at each other and we ran home. As soon as we reached the house we talked. We had both seen the same thing. We ran inside the house to tell my parents. But of course no one belived.",
  "classification": "Class A",
  "county": "Clackamas",
  "state": "Oregon",
  "latitude": 45.0837,
  "longitude": -122.4888,
  "location": "-122.4888,45.0837",
  "location_details": "Go out past Molalla to Dickey Pairie. You should see a little store. Dont turn off on the road that runs along side the river. Go about three miles and you will see the bridge we were near. Look straight across the river. thats where we saw it. If you go back the way you came little ways you will see a gravel road. Towards the river go down the road and the second house on the river side is where I lived.",
  "temperature_high": 85.89,
  "temperature_mid": 71.42,
  "temperature_low": 56.95,
  "dew_point": 51.12,
  "humidity": 0.57,
  "cloud_cover": 0.02,
  "moon_phase": 0.63,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.61,
  "summary": "Clear throughout the day.",
  "uv_index": 7,
  "visibility": 9.95,
  "wind_bearing": 298,
  "wind_speed": 1.46
}