{
  "id": "19926",
  "title": "Incidents and followup near Lake Hartwell Dam",
  "date": "2007-06-01",
  "timestamp": 1180656000,
  "observed": "I was fishing Friday from about 8 pm to a little after 9:30 pm on the Savannah river between Lake Hartwell and Lake Russel on the Georgia/SC line. I had walked up the trail by the river from the last parking area to try for some trout or maybe a walleye. It was after 9 pm and dark now. I was about ready to call it a night when I heard distinct footsteps coming towards me. I first thought it might be another fisherman, but the closest one to me was at the first parking area about a half mile away and he was fishing on one of the piers. I thought it was on the trail I had came in on but realized it was up on the side of the hill. I got closer and it stepped on a couple of limbs that cracked from its weight. I thought to myself it had to be another person but why would they be on a hillside in thick woods at night with no light? I broke the thumbsnap on my Sig 45acp just in case it was somebody up to no good. I only had my LED headlamp on and when I shined it at the sound it stopped. I would estimate it was about 25 to 30 yards from me at the time. I could see nothing, no eyes or anything. About a minute after I took the light off of it, it started walking again. I was getting a little concerned by now. I know it wasn’t a deer, as I have spent my whole life in the woods and know what deer sound like when walking. I eased out onto the trail and started walking back to the truck. The footsteps parralelled me back to the parking area but never came out of the woodline. I had Surefire G2 light in the truck and shined it in the woods to see if I could find the source of the sounds. I never did see anything. Nor did I smell anything. I don’t know if it could have been a BF. This area is pretty heavily used and in proximity to a major highway. All I know is the whole thing was very strange because usually a deer or other animals will spook when you put a light on them.",
  "classification": "Class B",
  "county": "Anderson",
  "state": "South Carolina",
  "latitude": 34.35765,
  "longitude": -82.82005,
  "location": "-82.82005,34.35765",
  "location_details": "From Anderson, hwy 29 to public access rd leading to fishing area about 3/4 mile east of Hartwell dam.",
  "temperature_high": 84.42,
  "temperature_mid": 75.32,
  "temperature_low": 66.22,
  "dew_point": 59.23,
  "humidity": 0.6,
  "cloud_cover": 0.22,
  "moon_phase": 0.52,
  "precip_intensity": 0.0005,
  "precip_probability": 0.72,
  "precip_type": "rain",
  "pressure": 1017.39,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 11,
  "visibility": 8.07,
  "wind_bearing": 155,
  "wind_speed": 3.86
}