{
  "reportId": "14719",
  "title": "Surveyor describes possible stick formations in woods near Jacksonville",
  "date": "2006-09-05",
  "timestamp": 1157414400,
  "observed": "I was patroling an area near the University of North Florida, when something caught my attention on the side of the road. I turned around and went back to the spot to get a better look. When I was in the woods I noticed several strange limb and tree formations. i saw arches T.P. formations and some \"X\" formations. I noticed that these were up close to the road\\. As I walked around and investigated the area I felt as if I was being watched. I heard some movement in the brush. I thought it may have been just an animal that I am used to. I tried to move to get a better look at what was in the brush. I never made a good visual. I found it strange that what ever it was did not flee. It was shadowing my movements and using the brush and lighting conditions to remain out of my sight. I did smell a smell that was like the smell of a dog that had dried off naturally after playing in standing water. The are of this incident was wooded and wetlands. It leads down into a swampy area and a creek that traverses the highway to a larger wooded area. Fell free to contact me for more information. I am willing to show this area to an investigator if you have one in the Jacksonville area.",
  "classification": "Class B",
  "county": "Duval",
  "state": "Florida",
  "latitude": 30.2637,
  "longitude": -81.49433,
  "location": "-81.49433,30.2637",
  "location_details": "If I am contacted I will take any one who wants to see the location to it.",
  "temperature_high": 87.52,
  "temperature_mid": 81.39,
  "temperature_low": 75.26,
  "dew_point": 71.28,
  "humidity": 0.73,
  "cloud_cover": 0.34,
  "moon_phase": 0.42,
  "precip_intensity": 0.0008,
  "precip_probability": 0.26,
  "precip_type": "rain",
  "pressure": 1016.04,
  "summary": "Partly cloudy starting in the afternoon and humid throughout the day.",
  "uv_index": 8,
  "visibility": 9.12,
  "wind_bearing": 175,
  "wind_speed": 6.93
}