{
  "reportId": "29336",
  "title": "Recollection of a late night road crossing while driving near Branchville",
  "date": "1977-07-09",
  "timestamp": 237254400,
  "observed": "NJ:2AM/;Summer morning:1977:Owassa Rd:Sussex Cty While traveling back from the Dover Station and returning to Camp Kiamesha a group of counselors encountered a large creature as it crossed the road in about 3 steps, it stood about 7 feet tall and as it crossed the road, it turned and our headlights caught its shape and eyes. It had crossed between us and another car, it was at least 3 foot higher than the car in front of us. From the low area to the left to the mountain area on the right. I was driving that van, I slammed on the brakes and asked everyone if they saw what I had seen, they did. I then got out with a flash light and another friend to investigate. The ground on the right where it had gone into was loose dirt and rocky area but no foot prints were found and the creature was gone. We waited there for some time, even stopped a car traveling in the same direction for help, but they only stayed long enough for us to say what we had seen and sped off. When we reached the camp we called the NJ State Police to report our find, but they wouldn't believe us. In March of 1978 I led a BF hunt on Mount Paradise near Crandon Lake and found footprints in the snow. Its been 34 years since this incident and it still seems like yesterday. Only the names of my friends have faded. I've camped in the area ever since hoping for another encounter. I've hiked the AT and Tilmans Ravine to Sunfish Pond, Blue Mountain Lakes and am still looking today as I have read of strange noises in the Walpack Valley. I know what I saw.",
  "classification": "Class A",
  "county": "Sussex",
  "state": "New Jersey",
  "latitude": 41.13498,
  "longitude": -74.80315,
  "location": "-74.80315,41.13498",
  "location_details": "Lake Owassa road, old Rt 527",
  "temperature_high": 84.12,
  "temperature_mid": 74.585,
  "temperature_low": 65.05,
  "dew_point": 66.13,
  "humidity": 0.73,
  "cloud_cover": 0.48,
  "moon_phase": 0.79,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.04,
  "summary": "Partly cloudy until evening.",
  "uv_index": 6,
  "visibility": 6.63,
  "wind_bearing": 340,
  "wind_speed": 3.61
}