{
  "reportId": "2220",
  "title": "Two campers report seeing tall creature at Rood Park campground and boat landing by the Chattahoochee River, just south of Florence Marina",
  "date": "2000-08-30",
  "timestamp": 967593600,
  "observed": "Initial report received as the associated media article linked below. Preliminary  investigation by the BFRO: I talked to the reporter and called the BP Quick Stop and spoke with one of the women who was there the night the guy came in to use their phone. I have yet to get in touch with the witness, J.N. that saw the creature. Here are a few extra notes: Tim Chitwood (reporter) heard the story from a Sheriff's deputy in Russell County. The incident happened on August 30. The call to 911 was made at 10:54 pm. J.N. never called a Game Warden as the story stipulates. He called 911 from the Quick Stop in Fort Mitchell, AL. No report was filed with any police agency due to the fact that the witness was not willing to go back to the camping area with an officer. On the 911 tape the witness did state that \"it\" walked upright. The women at the Quick stop would not give their names, but stated they saw the dog, and it looked okay, they didn't see any blood. Apparently, the dog had walked off from the camp site and started making strange noises. The women did concur on the fact that the witness was \"scared as hell\" when he came in. The witness told them that it was taller than himself, and he saw the silhouette and the eyes as it kept moving towards him. The camp ground where this occurred is named after an old plantation owner who owned the land. It is also known for it's Indian Mounds. The mounds are not burial sites, but foundations for the dwellings the Indians lived in. (circa 1000 AD-1500 AD). \"Sheky Bean\" is the name the locals have given to whatever is wandering around the area.",
  "classification": "Class A",
  "county": "Stewart",
  "state": "Georgia",
  "latitude": 32.0538,
  "longitude": -85.0409,
  "location": "-85.0409,32.0538",
  "location_details": "Rood Creek Park just south of Florence Marina.",
  "temperature_high": 90.27,
  "temperature_mid": 81.09,
  "temperature_low": 71.91,
  "dew_point": 65.12,
  "humidity": 0.62,
  "cloud_cover": 0.29,
  "moon_phase": 0.05,
  "precip_intensity": 0.0006,
  "precip_probability": 0.72,
  "precip_type": "rain",
  "pressure": 1013.14,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 8,
  "visibility": 7.86,
  "wind_bearing": 51,
  "wind_speed": 5.98
}