{
  "reportId": "7555",
  "title": "Two Young Fishermen Have Mid-day Encounter at Lake Shasta",
  "date": "1977-08-01",
  "timestamp": 239241600,
  "observed": "My family and I went to lake Shasta CA. To camp at antler camp ground.  While we were there, we went to this cove on the lake and had a picnic.  After the picnic, me and my cousin jimmy and my little sister Kim stayed in the cove to go fishing while everybody else went back out to the boat dock.  After awhile, my sister wanted to go out to the dock to be with my older sister, so I put her on my shoulders and started walking.  About 1/4 mile half way out I started hearing something walking in the woods. I stopped, it stopped. I started, it started. So I kept walking. I dropped my sister off and started heading back.  A little way in and I started hearing the footsteps again. Now they were closer and I could see something in the shadows. As I kept walking, it kept getting closer. I stopped again and all of a sudden, it came crashing through the brush straight for me. I just stood there, looking at it then it stopped about 5 feet from me and I could plainly see what was standing there, but I couldn’t believe what I was seeing. I remember noticing it had big reddish brown eyes that seemed to stare right through me.  It gave me the creeps. Then I noticed it had big muscular arms and huge hands. Then I looked down and saw big feet. Then I started scanning up and saw some big calves and thighs. It was definitely a male and was dark brownish black in color. I just stood there looking at him and then I said to my cousin jimmy, who was about 10 to 15 feet away from me, “look” and pointed at it. He took one look and screamed, and then he jumped into the lake.  I gave a yell and did the same. We swam out into the center of the cove and the creature stood there watching us. My cousin swam to the dock but I stayed. I was totally curious as to what it was but scared at the same time. Then it looked toward the back of the cove like it was startled and it ran up at least a 40 to 45% hill through brush and trees.  It covered at least a couple hundred feet in what seemed like 2 or 3 seconds and was gone.   I heard and saw some people coming down a trail from a cabin up on the hill. When they got close, I asked them if they ever heard of bigfoot.  They said, “yeah, they come around are cabin once in a while.”",
  "classification": "Class A",
  "county": "Shasta",
  "state": "California",
  "latitude": 40.8875,
  "longitude": -122.3775,
  "location": "-122.3775,40.8875",
  "location_details": "We went there in a boat I think it was on a north bank were the boat dock was.  I think I could find it if I went back there but it's hard to explain.  I think the cove was in a northern direction too.",
  "temperature_high": 93.45,
  "temperature_mid": 80.03,
  "temperature_low": 66.61,
  "dew_point": 52.2,
  "humidity": 0.44,
  "cloud_cover": 0.77,
  "moon_phase": 0.58,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.99,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 9.5,
  "wind_bearing": 306,
  "wind_speed": 0.72
}