{
  "reportId": "11439",
  "title": "Mother and sons hear whoops in woods behind house.",
  "date": "2005-04-25",
  "timestamp": 1114387200,
  "observed": "Recently my son went outside just after dark.  He ran back in telling me there was something out side making a strange noise.  I went outside thinking I was going to hear the nearby bulls, dogs, or even a coyote.   What I heard was the strangest sound I had ever heard.  We stood there for quite a while trying to figure out what it could be until my five year old started crying saying he was scared. Today I listened to several video [audio] clips of the Sasquatch Whoop Howl.  That is the EXACT sound I heard.  I got chills when I heard these recordings. I then looked up sightings in Texas to see if it were possible that there could be any in my area.  I was shocked to discover that there had been sightings very close to my house in Newton County on the Sabine River.  I even found where there had been a sighting in Buna, which is where I live, in the 1980's.  I live in a wooded area.  The woods behind me, over 500 acres, have been untouched for over a hundred years.  It has just recently been sold and timber starting to be cut in the area.  I am wondering if this is stirring it up?  Please let me know if you think it could be possible that what I heard is real.  I know that is the sound I heard.  I will be listening now every night and hope to get a recording.  Also, my children play in the woods quite often. Is there any danger for them playing in the woods?",
  "classification": "Class B",
  "county": "Jasper",
  "state": "Texas",
  "latitude": 30.43444,
  "longitude": -93.89,
  "location": "-93.89,30.43444",
  "location_details": "",
  "temperature_high": 69.32,
  "temperature_mid": 65.67,
  "temperature_low": 62.02,
  "dew_point": 55.01,
  "humidity": 0.84,
  "cloud_cover": 0.63,
  "moon_phase": 0.54,
  "precip_intensity": 0.0147,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1010.99,
  "summary": "Rain in the afternoon.",
  "uv_index": 8,
  "visibility": 8.81,
  "wind_bearing": 133,
  "wind_speed": 5.59
}