{
  "reportId": "7168",
  "title": "Hunter and family has repeated encounters over two decades",
  "date": "2003-11-16",
  "timestamp": 1068940800,
  "observed": "BFRO Investigators James Walker and Daryl G. Colyer have interviewed this witness extensively.  This report was filed on behalf of the witness, due to his inaccessibility to the internet. The most compelling testimony given by the witness involves an incident that occurred on another lease prior to the one he currently leases, but in the same general vicinity. Approximately 1992, the witness was hunting for deer in the late afternoon.  As he sat on a hunting stool, he continually scanned the surrounding terrain, and noticed some trees in a creek bed area with \"buck scrapes\" (marks made by male deer with antlers).  The witness focused on that particular area. After a while, the witness noticed a \"stump\" approximately 125 - 150 yards away that he had not earlier detected.  The witness raised his weapon and observed through his scope what appeared to be a large, gorilla-like animal standing very still, arms down by its side.  At this time, through the use of the rifle scope, the witness was able to observe the animal as though from a distance of only 25 - 30 feet.  The hunter now knew that he was not the only one doing the observing.  The animal was watching him every bit as much as he was watching the animal.  The witness described the animal as having rather thin hair on its body, but the hair almost had the appearance of being combed or groomed.  The color was described by the witness as being \"tawny-brown.\" After approximately 15 - 20 minutes had elapsed, the witness heard a loud snap of a branch off to his left.  He broke visual with the creature to identify the source of the sound to his left.  When he attempted to regain visual of the creature, he could not do so.  Apparently the animal fled or hid very quickly.  The witness believes that the animal suddenly hid in the tall grass surrounding it in order to escape his scrutiny.  The witness conjectured that the loud snap that he heard was created as a diversion by another creature to distract him from the first creature. At that, the witness quickly left the area - leaving behind the stool and everything else that accompanied him with the exception of his weapon. The witness never once considered shooting the creature and further stated that he felt no hostility whatsoever.  He had absolutely no inclination to pursue or seek out the mystery animal. The creature was described as being \"gorilla-like\" in appearance, but very distinctly bipedal.  Height was estimated to be between eight to nine feet tall.  Estimated weight was between 400 - 500 pounds.  The face was similar to that of a gorilla.  The nose was flat but \"turned upward\" and the witness stated that he could actually see into the nose of the animal.  There appeared to be thin facial hair surrounding the mouth, almost in a beard-like fashion.  Hair on the animal had somewhat of a \"combed or groomed\" look.  The head had somewhat of a round shape and there was no appearance of a neck.  The shoulders appeared very wide.  The witness requested that a sketch artist contact him. This incident is one of many that the witness has experienced through the years.  However, none of the other incidents involved a visual identification of the creature.",
  "classification": "Class A",
  "county": "Red River",
  "state": "Texas",
  "latitude": 33.845,
  "longitude": -95.19722,
  "location": "-95.19722,33.845",
  "location_details": "",
  "temperature_high": 73.42,
  "temperature_mid": 67.995,
  "temperature_low": 62.57,
  "dew_point": 57.81,
  "humidity": 0.84,
  "cloud_cover": 0.39,
  "moon_phase": 0.74,
  "precip_intensity": 0.0007,
  "precip_probability": 0.73,
  "precip_type": "rain",
  "pressure": 1015.71,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 3,
  "visibility": 6.78,
  "wind_bearing": 112,
  "wind_speed": 2.38
}