{
  "reportId": "3240",
  "title": "Father and son observe hand print and footprints near old logging road",
  "date": "2001-10-19",
  "timestamp": 1003449600,
  "observed": "While my son and I were camping in the Quachita National Forest on Oct 19 2001, in McCurtain County we discovered 4 large foot prints and one large hand print. We were off one of the logging roads that wind through out the forest. I came upon a area that had a very steep cut out along the bank off the road. This cut off had exposed the underlining strata, and I thought it would be a good time to show my son some geology of the area. The exposed strata was layered and I could show my son (18 years old) how the rock and soil was layered by water over thousands of years. We went up to the bank and was starting to show him the layers when suddenly my son said \"Dad look at this print\" it turned out that it was a very large hand print. After further investigation we found 4 large foot prints. The prints were in a single line and you could follow the prints for a space of roughly 15 -20 feet. We did not have a tape measure or ruler to measure accurately so every measurement is a guesstimation. The first print seen is a left foot, then comes right foot about two feet away, then comes left foot about 8 feet further up then about 3-4 foot away and slightly higher up the (what I will call for lack of a better term alluvial fan, because off this bank the soil and rock is washed down into a pattern like that off larger areas such as the sides of mountains, etc.) Following the left hand print comes another left foot print about 3 feet away, however this print only shows the toes and about 1/2 of the foot it appears to have been made while the foot was rotating off the ball and toes, and stopped at what with some caution I will call the arch. (I say that because there does not seem to be much if any arch at least like a normal human foot.) Following this print is another large print however this print seems to be out of place as that it is perpendicular to the others and headed further up the debris pile. After this the tracks stop. There are some others there that I think were at one time prints however they were deteriorated to the point where it would be impossible to ID. The material in this wash is a combination of small chat like material mixed with the native soil (clay based sandy loam). It is not a material that is condusive to holding any print of any kind for very long and they will be gone totally after the first rain. The track these prints and place was not a easy track for it was slightly up the debris pile and a fairly steep angle, my best guess why it would take this track was because the location of this place is in one of the few places in this area which has any open ground (not very large, but larger than the surrounding area) and as stated earlier it was right off one of the logging roads, so I guess he/it was walking along the bank to minimize his silhouette while treking along this open space next to the road. The next morning (Oct 20) we went back out there and we took some small sticks and placed hunters orange tape on the tops of the sticks then placed the sticks in the middle of the tracks so that we could get a visual on its track. We used one piece of tape to mark foot prints and used two pieces of tape to mark the hand print. This was so we could get a easier visual sight of what was going on. We then took the video camera and filmed the tracks and the track markers, so we have all this on video and you are welcome to view this, and in fact I can/will furnish a copy of the tape if interested in it. Just let us know if you wish to see it. ",
  "classification": "Class B",
  "county": "McCurtain",
  "state": "Oklahoma",
  "latitude": 34.45195,
  "longitude": -94.60042,
  "location": "-94.60042,34.45195",
  "location_details": "Coming south on Highway 259 you travel about 5 miles of the junction of 259 & 4 (which heads back to Smitville proper). On the east side of 259 you will see a low water crossing that crosses Mountain Fork river you follow that logging road 2 miles to the east. At the two mile mark the road Y's back south there is a pond on the south side to mark this spot. You take this logging road about 1/2 to 3/4 of a mile further and you will see the steep bank off the road on your right hand side (west). I will include more precise directions here below: Using the Smithville Quadrangle 7.5 minute topo map the UTM coordinates are as follows: Zone 15 347964E 3806266N This area sits between Hee Mountain which is to the south and Mountain Fork River which is north.",
  "temperature_high": 72.45,
  "temperature_mid": 64.015,
  "temperature_low": 55.58,
  "dew_point": 53.24,
  "humidity": 0.77,
  "cloud_cover": 0.29,
  "moon_phase": 0.11,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.96,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 9.93,
  "wind_bearing": 172,
  "wind_speed": 4.82
}