{
  "reportId": "2957",
  "title": "Youths riding in back of pick-up have close observation of large biped crossing road",
  "date": "1970-06-15",
  "timestamp": 14256000,
  "observed": "My brother Mark and I were riding in the back of my Dad's green '69 Ford pickup in the early summer of 1970 just outside of Georgetown, Arkansas.  My Dad was driving, my grandpa was in the passenger's seat, and my brother Larry was sitting between them.  Mark was 9 1/2 at the time and I had just turned 11.  As we made the right turn on the new highway from Georgtown to Draketown, I saw something 30 to 40 yards up the hill from the road.  At first, it was so tall that I thought it was the stump of a tree that had been struck by lighting, but as we passed it accelerating up the hill, it began to move.  In three steps, it was to the ditch at the side of the road, and then it took one long step across the ditch into the middle of the two lane highway.  It turned its whole body to look at us going up the hill.  Mark remembers a grayish splotch of fur on the chest, but otherwise, the fur was dark brown in color, longish but not dangling, and it had red eyes. We recently discussed this incident with my dad in Springdale, AR, and he remembered Elmer Drake in the '40's telling people around that area that he had seen what he thought was a \"gorilla\" that had escaped from a zoo or a circus.  Well, all I can say is that it wasn't a gorilla!",
  "classification": "Class A",
  "county": "Madison",
  "state": "Arkansas",
  "latitude": 35.9975,
  "longitude": -93.83426,
  "location": "-93.83426,35.9975",
  "location_details": "Turn right off Hwy 74 at Draketown, AR, and go about 3-4 miles to Georgetown.  You will be coming around a curve down a hill and across a creek to the old store.  The hill on the left side of the road is where we saw it.",
  "temperature_high": 90.76,
  "temperature_mid": 82.555,
  "temperature_low": 74.35,
  "dew_point": 70.64,
  "humidity": 0.71,
  "cloud_cover": 0.56,
  "moon_phase": 0.36,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1011.65,
  "summary": "Mostly cloudy until afternoon and humid throughout the day.",
  "uv_index": 8,
  "visibility": 9.71,
  "wind_bearing": 191,
  "wind_speed": 7.85
}