{
  "reportId": "231",
  "title": "",
  "date": "",
  "observed": "In 1981, I was on the South Branch of the Patapsco River, approx. 1 mile downstream from Rt.32.  This section of river flattens out into riffles then empties into a larger pool.  I have fished this part of the river since I moved to Maryland from Pennsylvania in 1976. I was fishing on the north bank of the river and noticed a stray large mixed breed dog showing alot of interest on the south bank.  This area has about 100 ft open area before it becomes wooded.  The dog suddenly started to bark and jumped at something that stood up in the brush near the river.  This animal, the best terms I can describe, stood approx. 7-8 ft. and had the shape of a slouching human, full dark brown matted hair covering the body.  The creature was making a ticking sound....hard to describe. The dog lunged at it and quickly was slammed to the ground by the creature.  By this time, I was wading across the shallow area of the river and caught a scent of this animal....reminded me of a heavy musk smell...kind of like that of a fox.  The dog ran away and the creature started to walk into the woods.  I tried to walk behind it, but I was in waders and lost sight of the creature.  I did see the dog a bit later and it had blood on it's mouth and backside. I drove to a phone in Sykesville and called the police.  I was told to return to the scene and wait.  It took me about 3 mins to get back....and a police cruiser (State Police) was already there.  I was immediately told to leave the area.  I returned an hour later and noticed several state vehicles and one federal vehicle as well as police...the area was taped off.  I could see people combing the area....I was told once again to leave. I tried for several days to get answers from state official but never got an answer. I called WJZ, WBAL and WMAR about the incidents and each seem very interested.  I contacted each station later and was told that they had \"no idea\" of an incident and did not want to talk to me. That's about it....I was very frustrated by this.  I have reported this incident to only a few sources over the years.  If you have any information...I would appreciate it... Lon Strickler",
  "classification": "Class A",
  "county": "Carroll",
  "state": "Maryland",
  "location_details": "described above",
  "summary": ""
}