{
  "reportId": "10904",
  "title": "Deer hunter watches large bipedal animal in Rifle River State Park.",
  "date": "2003-11-17",
  "timestamp": 1069027200,
  "observed": "I was deer hunting in the Rifle River State Park in Michigan. I was on the west border of the park about 300 yards from the southern border. I had walked into the area from the south and stopped to \"let the forest quiet\". I watched as three female deer crossed my path about 75 yards north of me. They were stopping and looking back to the west as they moved to the east. I thought that a buck would be sure to follow. What I saw was a figure that walked silently through the woods. It seemed to be a very large man in a fur coat. I thought,what a fool to be out in the woods in a fur coat and no hunter's orange during deer season! I had on an orange hunting coat and hat. As I stood up, the \"man\" turned to face me. It was then that I realized that this may not be a man. It turned and ran in the direction that it had come. I could not believe how quiet it ran through the woods. I have been hunting for over 50 years and have spent many days in the wilderness at a time but I have never seen such an animal. I have never seen any large animal move so quietly. I have hunted bear, moose, whitetail deer, wild boar, and moose. Never had any of these animals moved through the woods without making a sound. In fact, I had heard the three deer well before I saw them. When I got back to camp, I mentioned this incident to a guy that has hunted the area for decades. I only told him that I saw a guy in a fur coat. He seemed to be a little concerned about going back to the area. I have not hunted that area again. This animal was about 6'8\", had a grey/brown hair and seemed to have arms that were longer than a human's. It walked upright but not as a man would and not as a chimp or other primate that I know of would. There seemed to be white hair around the face and on the chest. The more that I think about it, I am convinced that it was trailing/hunting those deer. It was the rut and those does would be in heat. This could have masked my presence.",
  "classification": "Class A",
  "county": "Ogemaw",
  "state": "Michigan",
  "latitude": 44.36434,
  "longitude": -84.05358,
  "location": "-84.05358,44.36434",
  "location_details": "I was walking the west border of the Rifle River State Park west of the bridge over Rifle River. I had made it about 300 yards into the park.",
  "temperature_high": 52.91,
  "temperature_mid": 48.565,
  "temperature_low": 44.22,
  "dew_point": 40.79,
  "humidity": 0.93,
  "cloud_cover": 0.89,
  "moon_phase": 0.77,
  "precip_intensity": 0.0014,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1020.07,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 5.77,
  "wind_bearing": 159,
  "wind_speed": 5.2
}