{
  "id": "28305",
  "title": "Man recalls being spooked by loud vocalization near McKinney Bridge Road",
  "date": "1990-09-14",
  "timestamp": 653270400,
  "observed": "Late one summer night in 1990 two friends and myself were riding around the backroads between Pilot Point and Aubrey, Texas. B was driving J and myself around in his new Chevy truck. All 3 of us were 17 year old Seniors at Aubrey HS.  We decided to head down old McKinney Bridge road to where the old bridge was out across the creek. We had been down this road and hung out where it dead ends on several occasions. Mostly to scare girls and such. This night we stopped just to relieve ourselves and we were just plain bored. We all stepped out and went to the steel barricade blocked vehicles from driving off in to the creek. I went to the middle front of the truck, J off to the right which was north. Later after discussing the account, this was when B said he \"felt like something was watching him\". B did not feel the need to pass this on to J and myself for reasons still not known. B also locked the doors to the truck when he got back in. After finishing up our task we both noticed B back in the truck and made some jokes about his lack of courage. I did notice that it was a very dark night with no moon so anything outside the truck lights was just black. J and myself started loudly making \"jungle noises\" as the echoed down the creek bottom. It was at that point I suddenly had this overwhelming feeling that something was watching me and it was close. I didn't want to seem paniced after just getting through making fun of B, but I wanted back in the truck right then and there. I learned later that J had suddenly felt as if something was watching him at the same moment I had felt it. As I walked back around the truck I was looking off to the north where I felt the \"presence\" of whatever was going on. Not looking where i was going I ran right in to J who also was staring toward the north in to the pitch black woods where he felt it coming from. When I hit J he let out a loud yell and jumped in which I also reacted with my own yells and we exchanged multiple four letter words. After a few seconds we started laughing and trying to catch our breath. At this moments we both heard what I describe as a low growl like sound that ended in an \"oommppff\" like sound. We both stopped and I got out \" Did you hear..\" when it let out a loud screeching roar that turned to a low roar. To this J and myself panicked, made for the truck. The truck doors however were still locked by our friend B who was just sitting there looking at us with wide eyed fear on his face as we screamed like little girls trying to get the damn door open. The truck had manual locks so apparently leaning over and letting us in was too much to ask. I of course had no idea they were locked as I tried to rip the door handle off the truck all the while screaming God knows what. I jumped in the back of the truck and made my way to the driver side to get in while J tried in vain to work the passenger side. I pounded on the glass screaming for B to let me in and all I got was a panic crazed look like he had never seen me before in his entire life. J and I at this point jumped in the bed and were beating on the roof for B to go. B was in such a panic he could not keep the clutch pushed in on his truck because his leg was shaking so bad his foot would slip off. We heard the \"thunk, thunk, thunk\" each time his foot came off the pedal. He finally got the truck started and we exited the area at a very high rate of speed. We told this story to several people who if the didn't dismiss it right off, played it off as we heard a coyote or a raccoon and we just got scared. One of our football coaches insisted it was a cougar. He told us they make a sound like a woman screaming and that's what we heard. Between the three of us we never bought the cougar explanation. What we heard sounded like King Kong, not a screaming cat. The sound was so loud you could feel it in your chest. It seemed to be no more than 20 feet from us. Much like I've heard a male lion do at the zoo. And the feeling of being watched was what got to me the most. I've never had that sort of reaction to anything like that before. All the hair on my neck and arms stood up before I even heard a sound. Not to mention it happened to three of us at the same time and we did not realize that till we talked about it later. We never really had any closure or a chance a closure on that night until several years later I ran across the BFRO site and read report #2394 which was just north of us and the same year. Now we are convinced we crossed paths with a Bigfoot.",
  "classification": "Class B",
  "county": "Denton",
  "state": "Texas",
  "latitude": 33.33614,
  "longitude": -97.02299,
  "location": "-97.02299,33.33614",
  "location_details": "",
  "temperature_high": 90.78,
  "temperature_mid": 81.655,
  "temperature_low": 72.53,
  "dew_point": 70.1,
  "humidity": 0.72,
  "cloud_cover": 0.62,
  "moon_phase": 0.85,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.44,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 8.46,
  "wind_bearing": 120,
  "wind_speed": 1.62
}