{
  "reportId": "1271",
  "title": "Six foot tall or taller, black creature was observed leaping into the air and disappearing into the trees on a bike trail near the Des Moines River",
  "date": "2000-02-15",
  "timestamp": 950572800,
  "observed": "I heard the deer coming toward me over to my left. I was going down the trail and the deer was coming in the opposite direction about a hundred feet over to my left. He kept looking over his right shoulder at something. I wondered what he was looking at and I lifted my head a little and that is when I saw the thing. At first I thought it was a human being. I mean it had a head, shoulders, arms and legs, chest. It saw me at a distance of about three hundred feet and when it saw me it kind of hunkered down. I have seen deer do the same sort of thing when they are preparing to take flight. After hunkering down, it made a 90 degree turn and leaped and bounded through the air. Both feet were off the ground. It made another 90 degree left turn and disappeared among the trees. I could see the blackness disappearing behind and among the trees as it left. The total viewing time was no more than 3 seconds. It left in a big hurry. It was tall, about 6 feet or a little taller, black, slim and quick. I mean it was quicker than a deer. Imagine an Olympic class sprinter cooking off a hundred yard dash. Multiply that quickness by a factor of 2 or 3. It was incredibly quick, quicker than a deer.",
  "classification": "Class A",
  "county": "Polk",
  "state": "Iowa",
  "latitude": 41.62183,
  "longitude": -93.63804,
  "location": "-93.63804,41.62183",
  "location_details": "On the bike trail that goes between Birdland Marina on the south end and Big Creek on the north end. Between Euclid Avenue and Birdland Marina within the city limits of Des Moines. Very rugged land close to the Des Moines River, ravines, many tree branches down on the ground. Not like a smooth football field.",
  "temperature_high": 57,
  "temperature_mid": 37.475,
  "temperature_low": 17.95,
  "dew_point": 28.01,
  "humidity": 0.7,
  "cloud_cover": 0.43,
  "moon_phase": 0.36,
  "precip_intensity": 0.0004,
  "precip_probability": 1,
  "precip_type": "snow",
  "pressure": 1012.27,
  "summary": "Breezy and mostly cloudy starting in the evening.",
  "uv_index": 3,
  "visibility": 6.69,
  "wind_bearing": 234,
  "wind_speed": 5.27
}