{
  "reportId": "3248",
  "title": "Bainbridge (Chagrin Falls) Ohio resident reports multiple sightings",
  "date": "2001-10-26",
  "timestamp": 1004054400,
  "observed": "I HAVE SEEN THIS CREATURE THREE TIMES IN MY LIFE TIME.EACH TIME I HAVE ENCOUNTERED THIS ANIMAL BIGFOOT I GOTTEN A CHANCE TO GET CLOSER AND FINALLY A UNDERSTANDING OF ITS NATURE. ONE EVENING ABOUT 8:45 PM I WENT OUT BACK TO WALK MY DOGS. THEY WERE TIED UP AT THE TIME. SO I LET THE ONE DOG GO AND HE WENT RUNNING. JUST HAPPY TO GET LOOSE.MIND YOU, IT WAS DARK OUT BUT YOU COULD STILL MAKE OUT THINGS FROM THE LIGHTS FROM THE OUT BUILDING 50 YARDS AWAY.MY DOGS WERE TIED UP NEAR THE WOOD LINE AND THERE IS A STEEP VALLEY JUST BEHIND THE WOOD LINE, AND A THREE HUNDRED ACRE  FOREST SOUTH OF ME.THERE IS ALSO A PARK AREA WEST OF HERE. AS I WENT TO LET THE OTHER DOG GO I NOTICE A SHADOW JUST FOUR FEET AWAY FROM ME. IT STOOD ABOUT 8 FT TALL AND VERY WIDE. IT WAS WHITE AND GRAY. THATS WHAT IT LOOKED TO BE.I WAS THINKING THAT THIS MUST BE A TREE I DIDNT NOTICE FROM BEFORE, BUT I THOUGHT NOT OUT HERE IN THE OPEN FIELD.IT STOOD THERE MOTIONLIST. IT DIDNT MOVE OR MAKE A SOUND.WHAT EVER IT WAS HAD NO SMELL OR MAKE ANY SCREAMS OR HOWL. I JUST KNEW IT WAS SOMETHING STANDING THERE UPRIGHT LIKE A MAN. IT WAS COVERED IN WHITE AND GRAY FUR ALL OVER ITS BODY. I KNEW I WAS IN TROUBLE IF I HAD MADE ANY SUDDEN MOVE,SO I WATCH IT OUT OF THE CORNER OF MY EYE.I WAS CLOSE ENOUGH TO TOUCH IT WITH MY OWN HANDS. I COUNTINUE TO RELEASE MY OTHER DOG. I COULD FILL IT LOOKING AT ME, SO I PRETEND LIKE I DIDNT SEE IT. MY OTHER DOG I LET GO OF EARLIER CAME RUNNING FULL CIRCLE TO CHECK ON ME AND MY OTHER DOG FULL SPEED. WHEN I SEEN HIM ALMOST RUN RIGHT INTO THIS THING HE CAME TO A DEAD HALT AND COWED DOWN ON ALL FOURS. I KNEW SOMETHING WAS WRONG. THERE HE LAY LIKE HE WAS DEAD. THE CREATURE NEVER MOVED AN INCH. HIS EYES WERE ON ME AT ALL TIMES.I CONTINUED TO RELEASE THE OTHER DOG.I DIDNT KNOW WHAT TO EXPECT. THIS THING WAS REAL, AND I HAD NO WHERE TO RUN. THE SECOND DOG I UNTIED WENT BLAZING OUT OF THERE.I DARE NOT LOOK RIGHT AT THE ANIMAL. I KEPT HIM IN SIGHT OUT OF THE CORNER OF MY EYE, AND PRAYED THAT GOD PROTECT ME. I DID SOMETHING AS NOT CAUSE THIS THING TO ATTACT ME AND TURN MY BACK TO HIM OR HER.I KEPT WALKING AWAY NEVER TURNING BACK TO LET IT THINK I DIDNT KNOW IT WAS STANDING RIGHT IN FRONT OF ME. AS MY OTHER DOG CAME RUNNING PAST ME I KNEW IT WAS LETTING US GO AND I DIDNT FILL THREATEN ANYMORE.SOMETHING OF THAT SIZE HAS NO REASON TO FEAR ANY MAN.I STILL DONT UNDERSTAND WHY IT DIDNT ATTACK ME, AND WHY DIDNT THE DOGS BARK AND ALERT ME  THAT SOMEONE OR THING WAS THERE. FINALLY WHY DIDNT IT RUN AWAY WHEN IT SAW ME COMMING DIRECTLY AT IT.IT ALLOWED ME TO COME WITHIN A FEW FEET OF IT.I AM NO LONGER AFRAID OF IT, BUT I DONT THINK I WOULD WANT TO GET THAT CLOSE AGAIN. ONE OF MY FRIENDS WHO LIVES DOWN THE STREET FROM ME SAID HE SAW SIX OF THEM TOGETHER. HE THINKS THAT THEY ARE A FAMILY. HE TELLS ME THAT THEY WOULD COME TO HIS HOUSE AND SIT ON HIS PORCH. I DONT KNOW HOW TRUE THAT IS BUT I NOW BELIEVE.HE TELLS OF THE CAVES THEY LIVE IN NEAR MY HOUSE. I USED TO LIVE WERE HE ONCE LIVE AND ALWAYS THOUGHT THEASE THINGS WERE OUT OF MY IMAGINATION, BUT I TRULY DONT CARE WHAT PEOPLE THINK ABOUT ME. THERE IS SOMETHING OUT THERE AND WE MUST PROTECT IT BY UNDERSTANDING IT TOO LIVES AS WE DO. I AM NOW TRYING TO CHANGE THE AREA WHERE THEY ROAM INTO A WILDLIFE PRESERVE SO THEY CAN CONTINUE TO LIVE IN PEACE. EVEN THO I CARE NOT TO SEE ONE AGAIN I THINK THEY SHOULD BE PROTECTED FROM THE PLUBLIC.MOST OF THE FOLKS WHO LIVE NEAR THE WOOD LINE HAVE HAD A ENCOUNTER WITH OUR HAIRY FRIENDS. THERE HAS BEEN ONLY TWO CASES WERE PEOPLE HAVE BEEN IN A SIMULATED ATTACKED OR CHASED INTO THEIR HOME WITHOUT BEING HARMED OR KILLED BY ONE OF THE BIGFOOT CREATURES.THERE HAVE BEEN LOTS OF UNEXPLAINED SCREAMS, SIX INCH TREES SNAPPED IN TWO, ONE WITNESS HAS SEEN THEM ATTACK A  DEAR AND LEAVE NOTHING BUT THE RIBS .IF THEY COULD DO THAT TO A DEAR, THINK OF WHAT THEY COULD DO TO US.I HAVE LOST TWO DOGS THAT LOOKED TO HAVE BEEN STRANGLED OR UNEXPLAINED DEATHS.I DONT KNOW IF THEY WILL TALK OR NOT.I WILL.",
  "classification": "Class A",
  "county": "Geauga",
  "state": "Ohio",
  "latitude": 41.39803,
  "longitude": -81.33974,
  "location": "-81.33974,41.39803",
  "location_details": "Take Rt.422 east from Cleveland,Ohio to Chagrin Falls, Ohio. South Franklin to Woodland to Loraine St. There is a forest south of me where this unusual wildlife seems to come from. I live in a low income area that where people are considerate of each other and keep to themselves. Most of the people here are African American and are very decent folks. ",
  "temperature_high": 40.26,
  "temperature_mid": 38.035,
  "temperature_low": 35.81,
  "dew_point": 30.56,
  "humidity": 0.7,
  "cloud_cover": 0.99,
  "moon_phase": 0.33,
  "precip_intensity": 0.0082,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1012.61,
  "summary": "Breezy throughout the day and light rain starting in the afternoon, continuing until evening.",
  "uv_index": 2,
  "visibility": 8.67,
  "wind_bearing": 257,
  "wind_speed": 21.98
}