{
  "reportId": "1242",
  "title": "Day hiker sees large, hairy animal which seems to follow him",
  "date": "2000-07-14",
  "timestamp": 963532800,
  "observed": "I am an outdoor enthusiast who was visiting the Cody, Wyoming area this summer during the second week of July (July 14). While traveling the highway to Yellowstone National Park, about 30 or 40 miles west of Cody, I encountered heavy tourist traffic late in the day. I decided, rather than fight it, to pull off the highway for a while and go for a walk. I hiked up an unmarked path north of the highway through intermittent timber. I was traveling at a leisurely pace, exploring rocky outcrops and looking for Native American artifacts. About half a mile from the road (I could still hear traffic), I heard some rocks rolling down hill ahead of and above me. It was maybe 50 to 100 yards away. Mule dear and other game animals are plentiful in the area and I didn’t think much of it. I had bear spray with me as this is well known Grizzly country. Maybe another half an hour went past and I was taking a break, sitting on a rock ledge with a good view of the valley to the south. I heard underbrush breaking not far away on a steep, timber-covered slope that led down to a dry stream bed. I was able to distinguish the pattern of an animal walking through the trees. Again, I didn’t think much of it. I’m used to hearing game in the woods and don’t spook at stuff like that. I guessed that it was probably dear feeding along the slope (a little odd considering the time of day). Its behavior was highly inconsistent with bears, which don’t hang around when people show up. I started hiking again and almost immediately heard something move through the brush just below me in the same spot. This was a little strange I thought, like it was staying with me or something. I tried to see down the hill, but when I stopped I couldn’t hear it. It seemed to stop moving when I did and I couldn’t get a fix on its location. I began to get a somewhat uneasy feeling about things at this point. There is no good way to describe it other than something seemed to be intentionally staying with me. I started walking again and, shortly after (not having heard anything for a little while), I heard something run across the rocks not far up in front of me. It was up out of the drainage at this point. I was getting a little apprehensive by this time and decided to start back towards the road, which was maybe a mile away. I walked pretty quickly and for most of the way I heard nothing. But about a quarter mile or so from the highway and maybe 15 minutes since I turned back, I heard rocks and debris falling downslope again. It seemed awfully close and I instinctively whirled around thinking that I might see something, which I did. I will do my best to describe it, but, as I got only a short glimpse, I can’t be too sure of what it was. It was about 60 or 70 yards away on a rocky slope, immediately adjacent to the same heavily timbered slope I had been hiking along. As soon as I turned and looked at it, it jumped right away into the cover and completely out of sight. There is one thing I am absolutely certain of. Whatever it was, it was upright. I clearly could see two limbs off the ground that appeared more like arms than legs. They were definitely hanging down the side, and not down the front as one might expect of a four-legged animal standing on two legs. This doesn’t mean that it wasn’t a bear, but I’ve never heard of a bear acting like this thing was. That is if I’m right, and it was the same animal that I feel was following me all along. You hear about predatory bear behavior where they follow people though, so who knows. At any rate, the animal was brown with very long hair. I noticed that when it leapt into the woods, the hair swayed to one side from the sudden motion. It seemed longer than bear hair, and to notice this swaying effect at this distance I would guess that maybe the hair was a foot long or more. Also, for just that initial instant before its flight, I got a pretty good look at its face, which was long and somewhat flat. It was too far away to clearly make out individual features, but I have seen several bears at greater distances and it doesn’t strike me that that’s whatit was. I was not aware of this site at the time, nor of the occurrences detailed in it for this area. When I mentioned the incident to a friend, who had not heard of the site either, we did a net search on Bigfoot out of curiosity. I was a little astonished to see the main page indicating this region as potential Bigfoot country with recent sightings. I figured I might as well say something. I think all three of the other incidents had witnesses, and I didn’t. So I can’t point to another who can verify anything I saw or heard. It would have been nice just to see if someone else had seen something resembling what I think I saw. Trust me, it takes a little bit of time for it to register. You just don’t think right off, hey, there’s Bigfoot. I was probably almost at my vehicle before I even let that thought enter my mind. I can’t say for sure that what I saw is what I had been hearing in the woods throughout the hike. One tends to make thes!! e connections afterwards, but I really have no way of knowing. I will say, however, that I think it might have been. This is based more on a feeling than anything else. I realize that breaking branches and rock slides don’t exactly constitute scientific certainty. It really was like something was checking me out though.",
  "classification": "Class A",
  "county": "Park",
  "state": "Wyoming",
  "latitude": 44.48134,
  "longitude": -109.5113,
  "location": "-109.5113,44.48134",
  "location_details": "The incident happened about 30 to 40 miles west of Cody. I was hiking an unmarked trail that left near a car pull-off on the north side of the highway (trail went north).",
  "temperature_high": 95.63,
  "temperature_mid": 79.47,
  "temperature_low": 63.31,
  "dew_point": 40.95,
  "humidity": 0.27,
  "cloud_cover": 0.12,
  "moon_phase": 0.44,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.1,
  "summary": "Clear throughout the day.",
  "uv_index": 10,
  "visibility": 9.96,
  "wind_bearing": 220,
  "wind_speed": 1.38
}