{
  "reportId": "23856",
  "title": "Campers hear and see possible bigfoot pass by tents on Nuclear Lake",
  "date": "2007-07-15",
  "timestamp": 1184457600,
  "observed": "My sister and her two children, my wife and I and our two dogs went to Nuclear lake in Dutchess county for an overnight camping trip. We set up camp in a field next to the lake a few hundred feet off the applician trail. We had two tents and went in them to sleep around 11:00p.m. My sister was feeling uneasy so I sent my male dog to her tent to sleep with her and the kids. My older dog, my wife, and myself were in my tent. I turned the opening of my tent to face my sisters tent door so she felt less stressed. An hour went by and the kids my old dog and wife were sleeping. Suddenly I heard foot steps coming from the woods heading toward us. It was a very dark night but I saw no flashlight shine. Then my young dog in my sisters tent started to make this whine/growl and I could clearly hear a person walk behind my sisters tent, but still no flashlight shine! All the while my sister was awake and my young dog freaking out almost crying and he is a pitbull not afraid of any critter. I KNEW it was a bigfoot and told my sister not to worry because she hates the woods and couldnt sleep. The next morning she looked very tired and we only spoke about it a month later on the phone. She said she knew it was a biped and couldnt sleep all night. My wife, my two dogs and I are trail runners and twice a week do 6 mile runs on this section of the Appalacian trail. It is remote and rugged and I have Moose dropping on my fireplace mantle from that area and bear sightings are common. A few miles up the trail is a large beautiful swamp also. This is not my first time I had the feeling bigfoot was around. My wife and I are in the woods more then anyone I know. We hike and back pack all summer and log 25 miles a week in the woods trail running. I made a report a few years ago when we were hiking up Buck mountain when a bigfoot was smashing trees and making that loud click noise like I can do with my tounge but 10 times louder. I know a woman who had a daytime visual in st. lawrence county n.y. and I also know a man who had a visual in penn. when he was hunting deer. What is the real story on bigfoot. Are they so slick that no one can get a good picture or do they just scare people so much that the powers that be dont want the cat out of the bag. I wont go in the deep woods alone anymore and I was never afraid but now I am and hate that feeling. I'll give my name and number and I sure wish someone would call me. thanks.",
  "classification": "Class B",
  "county": "Dutchess",
  "state": "New York",
  "latitude": 41.59773,
  "longitude": -73.64642,
  "location": "-73.64642,41.59773",
  "location_details": "Nuclear lake right off the appalacian trail",
  "temperature_high": 84.46,
  "temperature_mid": 73.88,
  "temperature_low": 63.3,
  "dew_point": 64.64,
  "humidity": 0.76,
  "cloud_cover": 0.28,
  "moon_phase": 0.04,
  "precip_intensity": 0.009,
  "precip_probability": 0.49,
  "precip_type": "rain",
  "pressure": 1009.71,
  "summary": "Rain starting in the afternoon, continuing until evening.",
  "uv_index": 9,
  "visibility": 7.9,
  "wind_bearing": 199,
  "wind_speed": 5.96
}