{
  "reportId": "2384",
  "title": "",
  "date": "",
  "observed": "Three friends and myself were camping out the night before the opening morning of deer season Nov.7 to be exact. We had set up camp in an area known as Lonesome Woods which covers about three counties. It was really cold and we had a really big fire going and we were all sitting around it to stay warm, when all of a sudden this weird moaning sound filled the woods. It sounded kind of like a siren except it was very loud. It let off a series of three moans starting low building and then dropping, pitch as well as volume, in three bursts. This scared us because we all grew up in this area and have hunted and camped out here all of our lives and have never heard such a cry. Not wanting to act scared we tried to laugh it off but an uneasy feeling lingered throughout the camp for quite a while. That happened about 9:00. About 10:30 T., one of my friends who was camping with us, stepped out into the woods to relieve himself. He wasn't gone for about 10 minutes when he came running back to camp saying \"I'm gone and if you all have any sense you'd leave to\".  We asked him what was wrong and he told us he had seen something down by the creek located on the other side of the hill. It stood about 8 feet tall and appeared to be drinking from the stream as he came across the hill. Once on top of the hill it took notice of him stood up and watch him, or as T. said \"watched me run.\" T. hadn't much more than got the words out of his mouth when we heard a something running through the brush on top of a hill. My brother had a mining light (plus it was very bright from the moon that night, the sky was spotless)shined up on the hill to see a silhouette of a very large creature running on top of the hill. We couldn't make out a color but it was human shaped with long arms and ran kind of hunched over. It looked to be about 8 feet tall. The sound it produced while running was amazingly loud it sounded as though a truck was being driven over a road of branches and twigs. This was enough for us, scared out of our wits we packed up what little we had and left. we have heard a lot of stories about this area and now we believe them there is something in those woods without a doubt.",
  "classification": "Class A",
  "county": "Hopkins",
  "state": "Kentucky",
  "location_details": "Hopkins County, Kentucky an area called Lonesome Woods Highway 800 nearest town would be White Plains .",
  "summary": ""
}