{
  "reportId": "7562",
  "title": "Hunter briefly observes a stationary upright animal before it runs away",
  "date": "1973-11-15",
  "timestamp": 122169600,
  "observed": "My story is approximately 30 years old and I have never told it to other than friends and family. My wife and I were in, I believe, Union County, Oregon, where I was elk hunting. I hunted alone because too many hunters like to ride all day and I like to walk the high country. I carried a CB radio so I could stay in contact with the wife and kids. After driving to the high country I would have my wife drive back down and I would hunt the ridges and if necessary call and have her move my truck to another location as I hunted my way along the high ridges. On this day it was beautiful, clear cool, and sunny. I had a small breeze coming toward me as I walked along a high ridge. As I came down into a saddle where there were about 3\" diameter saplings on both sides of the ridge, the path in front was clear on top for a long ways and about 30 feet wide. Vision was great. As the ground became level at the bottom of the saddle there was a single pine tree about 9 feet tall in the middle standing by itself. From about thirty, maybe forty feet away, I noticed what appeared to be a tall stump or object standing on the other side of the tree. The saplings on each side of this ridge had leaves still on so you could only see throught them to about three feet up.  I still had my rifle slung on my back as stopped to view the dark object on the other side of the lone pine tree. I watched it and decided after a minute or so it was not a deer or elk and decided maybe a old tree stump with the top broken off about 5 feet tall. I then squatted down and was looking under the saplings to see if I could spot any part of an elk through the underside of the saplings. I first looked right and then turned to my left and suddenly I spotted movement from the right corner of my eye and I jerked around, peering back toward the pine tree. I saw the object was gone and as I swung to the right I saw two brown legs to the waist through the saplings running as fluid and fast as any thing I have ever seen. I heard nothing. I immediately ran to my left and down along the side of the saplings and in about a hundred yards the saplings ended and I had a expansive view of the side of the ridge. I was amazed to see nothing. It was as though whatever I saw disapppeared into shale rock slopes down the ridge..with no noise I could detect. I was breathing hard but stopping long enough to listen..still ..nothing. I hunted on out the ridge about another 3 miles and then dropped off the side as evening was approaching. I asked my wife who was on the only road in if she had seen any hunters in the area and she said no hunters or camps. The road dead ends at a fire lookout. I have concluded after thinking about this over the years that what ever I saw was intelligent (it froze until it knew I was looking away). If it had tried to move from behind the tree, I would have been able to see it very clearly.  It waited for probably one to two maybe even three minutes while I studied the area without moving. But as soon as I looked off to my extreme left, it ran across the 12' clearing. After swinging to my right still on my haunches, I had a clear view of the legs running to know it was on two legs with brown smooth looking fur. It ran quietly but fast and unbelievably quiet. I'm guessing 5 feet tall; there was no smell as the breeze was in my face while it was directly in front of me. I still don't know about there being a bigfoot but I cannot explain what I know I saw that day. I hunted New York , California and Montana years prior to this and am considered a knowledgeable hunter. I have played this over in my head many times since and I still wonder??. I will leave you with this it was no bear or animal I know of.  ???",
  "classification": "Class A",
  "county": "Grant",
  "state": "Oregon",
  "latitude": 44.825,
  "longitude": -118.415,
  "location": "-118.415,44.825",
  "location_details": "The location is questionable as I hunted over three counties in those days but It was on a newly paved road with the ridge to the South and the road went to a fire lookout..",
  "temperature_high": 47.56,
  "temperature_mid": 44.925,
  "temperature_low": 42.29,
  "dew_point": 37.7,
  "humidity": 0.73,
  "cloud_cover": 0.99,
  "moon_phase": 0.69,
  "precip_intensity": 0.005,
  "precip_probability": 0.57,
  "precip_type": "rain",
  "pressure": 1008.42,
  "summary": "Overcast throughout the day.",
  "uv_index": 1,
  "visibility": 9.98,
  "wind_bearing": 164,
  "wind_speed": 11.43
}