{
  "id": "5137",
  "title": "Scientist hears nocturnal vocalizations near Ontanagon.",
  "date": "2002-07-20",
  "timestamp": 1027123200,
  "observed": "Ontonagon Michigan in the Upper Peninsula July 20th 2002 First, I should tell you that I am a scientist. For this reason I would like to remain anonymous but thought it would be of value to report my experience. My wife and daughter and I were staying at a friends newly built cabin up in the Michigan UP.  The cabin is on the shore of lake Superior in a desolate area on a dirt road not too far away from the nearest town.  I was amazed by the quietness of the forest area and the very tall pine tree stands.  At 9:30 PM my wife was reading a story to my daughter in bed and I was laying on a mattress right next to the window.  All of a sudden I heard Whoooop  Whoooop, long pause, Whoooop, Whoooop, long pause, Whoooop, Whoooop.  The pitch was rising from low to high.  The first thing that went through my mind was “what the hell is that?”  The sound came from a thick area of pine trees to the west of the property.  The next thing I noted was  the incredible volume of the sound.  Even though it was probably 150 yards away, it was so loud that it echoed off of the trees.  To me it was a very “zoo sound,”  It sounded so much like a primate that it gave me chills.  The vocalization sounded almost exactly like the “whooping” on the Sierra sounds webpage. Up until that moment, bigfoot had not crossed my mind at all. Let me add that I have had about 25 years of experience hiking, camping and fishing in the Sierras and throughout the country and I had never heard a sound like that.  It clearly was not an owl, bear, loon, coyote or moose.  I have heard similar sounds on the internet as well. There are multiple creeks and swampy areas as well as lots of blueberries.  There are thick stands of pine trees. It had rained earlier in the day.  Some of our group were out picking blueberries during the day, I was out fishing that day on a nearby river and in lake Superior. I’m aware that there was credible sighting in 1998 by a bear hunter on the Firesteel river in Greenland county less than 5 mi away from the cabin that I was staying at.  Also, there is an account of an Ontonagon logger who claimed that 2 bigfoots rescued him from under a fallen log.  Those 2 incidents  got me thinking that there may be some reality to what I heard. The thought of the existence of another bipedal primate is a shock to most people, including me. I did not make an effort to investigate the area where the noises came from in the morning.  Partly because we were busy taking care of small children and I was not prepared to have an encounter.  Next time I go to the UP I’ll keep my camera ready.",
  "classification": "Class B",
  "county": "Ontonagon",
  "state": "Michigan",
  "latitude": 46.87111,
  "longitude": -89.31389,
  "location": "-89.31389,46.87111",
  "location_details": "Edited.",
  "temperature_high": 78.59,
  "temperature_mid": 74.255,
  "temperature_low": 69.92,
  "dew_point": 61.84,
  "humidity": 0.77,
  "cloud_cover": 0.1,
  "moon_phase": 0.38,
  "precip_type": "rain",
  "pressure": 1012.41,
  "summary": "Heavy rain overnight.",
  "uv_index": 7,
  "visibility": 9.2,
  "wind_bearing": 180,
  "wind_speed": 5.37
}