{
  "reportId": "31852",
  "title": "Daylight sighting behind a home in Cuyahoga National Park",
  "date": "2011-06-04",
  "timestamp": 1307145600,
  "observed": "I saw Bigfoot from the chest up just below my house, it was in a wooded ravine below my house.  This was on June 4th, 2011.  It arrived there with a great deal of crashing and breaking down of trees.  I was looking to see what was coming when it stood up and looked at me.  It had greyish brown long hair, particularly over the face, wide set eyes, ears on the sides of the head, and a huge chest and shoulders.  It looked at me for maybe 1 minute, then went back down into the ravine.  Later that day it was making lots of sounds, like low grunts, my friend heard this as well. After that, it stayed in the Cuyahoga Valley area all summer, and I would often hear it calling, smashing rocks together, knocking on trees, and one day it sneezed a lot. Another day in September my cousin was using my large tractor to mow under the trees behind my house, and as I walked to my car from behind my house, I heard a terrific crash to my right, and there it was again, it had knocked over a tree and then I saw it run back into the ravine. I did not see any tracks, because since I knew it was down in the ravine most of the time I left it alone. It only recently seems to have left the area. I heard something like it about 2 years ago but never saw it that time.",
  "classification": "Class A",
  "county": "Summit",
  "state": "Ohio",
  "latitude": 41.23739,
  "longitude": -81.60576,
  "location": "-81.60576,41.23739",
  "location_details": "Edited at the witness' request.",
  "temperature_high": 86.25,
  "temperature_mid": 75.875,
  "temperature_low": 65.5,
  "dew_point": 56.72,
  "humidity": 0.59,
  "cloud_cover": 0.26,
  "moon_phase": 0.09,
  "precip_intensity": 0.0022,
  "precip_probability": 0.19,
  "precip_type": "rain",
  "pressure": 1017.81,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 10,
  "visibility": 9.35,
  "wind_bearing": 203,
  "wind_speed": 4.6
}