{
  "reportId": "1925",
  "title": "Strong odor, crunching footsteps and large human-like tracks found in snow",
  "date": "1976-01-30",
  "timestamp": 191808000,
  "observed": "Tracks found after hearing crunching snow outside of cabin. Wife first smelled an odor coming from outside the cabin; husband was asleep in front of TV. She paid no attention to it and went to bed. She was awakened by a metallic bang on the back porch and then crunching footsteps going towards the driveway. She got up and noticed that the smell was stronger then it had been earlier. She likened it to something like a bear just come out of hibernation. She finally was able to wake husband at around 3:30AM. Telling him of the events, she loaded her 12-gauge shotgun and gave it to husband, who with flashlight went out on back porch. He noticed the smell right away, a lifted up wash tub protecting their frozen food and saw large man-like footprints on and near the open porch. He came running back in frightened. The next day they went into town to get film and plaster. They mixed the plaster too runny and it soaked through the snow on what they thought was the best track. Seeing their mistake they made a thicker batch of plaster, but not knowing better, poured it into the same track. They couldn't think of how to get the cast out of the snow so decided to wait till spring to thaw it out. They covered them with cardboard boxes. Their son heard about all of this (3 days later) and contacted Peter Byrne, who contacted Richard Noll and David Smith to investigate as soon as possible.",
  "classification": "Class A",
  "county": "Okanogan",
  "state": "Washington",
  "latitude": 48.36361,
  "longitude": -120.1211,
  "location": "-120.1211,48.36361",
  "location_details": "",
  "temperature_high": 39.45,
  "temperature_mid": 35.35,
  "temperature_low": 31.25,
  "dew_point": 33.06,
  "humidity": 0.89,
  "cloud_cover": 0.75,
  "moon_phase": 0.98,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1035.96,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 4.69,
  "wind_bearing": 34,
  "wind_speed": 0.96
}