{
  "reportId": "806",
  "title": "",
  "date": "",
  "observed": "I was 8 years old, and very much a nature buff (when I was 10, I was helping grad students at the University of Michigan identify rare birds.)  I was walking east along the RR tracks with my friend, who was 9.  We were picking up rocks and talking, and as we were getting closer to the RR bridge that crosses the Huron River (a fast stream at that point) we noticed an odor that smelled like old roadkill mixed with cabbage(?); in retrospect, rather hard to identify but very strong and very distinct. We were expecting to come across a deer or some other animal that had been killed by a train. While crossing the bridge (about 80'-100' long) my friend grabbed my arm and jerked it as if to show me something really quick. I looked over, and he was pointing down over the south side of the bridge. I took a few steps to look down, and about 20' below us was the biggest pair of hairy shoulders I had ever seen. The creature looked like an ape, but its shoulders were MASSIVE ! - as if it was wearing football pads under its skin. Because of this, its head looked almost small. It had dark brown fur which covered every part of the creature, though we never saw its face. It was crouching by the east bank of the river, looking down into the water.  It didn't appear to be moving much, and I don't remember splashing or ripples from where the creature was squatting. We didn't stay long-- I'd say we looked at it for 5-7 seconds before my friend started running east, and followed him. His home was about a mile down the tracks, and when we got there, he ran up into his room and locked the door. I had to call my father to pick me up (I lived on the east shore of Briggs Lake.) For some reason, this event ended our friendship. Although it frightened me a bit, I spent a lot of time in the school library trying to figure out what kind of creature that looks like a big-shouldered ape lives in the Midwest.This is when I first learned of the Bigfoot phenomenon.",
  "classification": "Class A",
  "county": "Livingston",
  "state": "Michigan",
  "location_details": "In Livingston County, MI, near Brighton, approx. 1 mile SE of Briggs Lake.  N42 30.12', W83 42.73' , where the C&O Railroad crosses over the Huron River.",
  "summary": ""
}