{
  "reportId": "27274",
  "title": "Possible vocalizations heard near Shades State Park",
  "date": "2009-07-01",
  "timestamp": 1246406400,
  "observed": "The first incident was in Febuary of 2009 after a snow. Me and my daughter who was 5 at the time went to Shades State Park to play. I was goofing around and making tree knocks every 15 minutes or so. I did not expect anything but any time I'm in the woods I try. We were making our way back to the truck and were within 500 yards when I made another set of knocks wich was followed almost immediatly by a very loud and powerfull growl. My daughter immediatly looked at me and said what is that dad. Halving my 5 year old with me made me just want to get her to the truck asap. The power and intensity was really something, it reminded me of passing a snow plow on the road, just the power of it. The following summer a couple of things happened I think are related. In june me and my buddy who like to whitewater kayak went to the Shades, Pine Hills area to kayak due to some heavy rains and flooding,wich in Indiana is the only good runs we get. That day while standing along suger creek at our buddys cottage which is across from the spot Indian creek enters suger creek we were debating how safe Indian creek would be to run when for some reason a deer jumped into the water and tried to swim across, it did not make it and got sucked under a log jam under the covered bridge. That was our sign and we descided tomorrow would be a better idea. We met around 10:30 the next day and Kayaked Indian creek which was still running fast but safer. As we was leaving Indian creek and entering suger creek at the spot we were at the day before except on the other side, I noticed to my left along the cliff face was a stack of rocks about a foot and a half tall stacked right on top of each other. What was odd was this area was still quite flooded and the area was completely under water the day before. There is know person in there right mind that would halve been in that spot over night or that morning. My last incident was in July 2009. I was catfishing about 1 am at lake Waveland about 1 to 2 miles from the Shades and Pine Hills area. I heard very cleary three short howls coming from the area around Shades. And the whole time this thing was howling every coyote in the area was going nuts. As soon as it stopped everything went silent, it was really cool I pretty much knew at that point for once and for all that sasquatch is a real and living creature, very cool. I got online when got home and found a identicle sound, the Columbiana County Ohio howls are exactly what I heard.",
  "classification": "Class B",
  "county": "Montgomery",
  "state": "Indiana",
  "latitude": 39.9347,
  "longitude": -87.08955,
  "location": "-87.08955,39.9347",
  "location_details": "Interstate 74 runs from Indianapolis head west to the Crawfordsville exit and head south. Take highway 47 to 234 and head west about 5 miles and you will see the Shades sign.",
  "temperature_high": 67.94,
  "temperature_mid": 64.84,
  "temperature_low": 61.74,
  "dew_point": 55.42,
  "humidity": 0.71,
  "cloud_cover": 0.94,
  "moon_phase": 0.32,
  "precip_intensity": 0.0001,
  "precip_probability": 0.08,
  "precip_type": "rain",
  "pressure": 1007.64,
  "summary": "Overcast throughout the day.",
  "uv_index": 6,
  "visibility": 9.83,
  "wind_bearing": 300,
  "wind_speed": 6.55
}