{
  "id": "41471",
  "title": "",
  "date": "",
  "observed": "The sun was setting,another 15-20 minutes until it would be dark.  My one dog began to raise a fuss along my property line. My other dog joined up and began to cower away and back to me.  I saw what I first took to be two really big and tall dudes.  One was looking straight ahead in the direction they were traveling (east), the second one was a little shorter but literally walking on the heels of the first one. The sun was highlighting the back of their heads. The first one was kind of mustard colored but the back of his head was highlighted to a golden glow. The 2nd one with head bent down looked to be a dark brown, but the setting sun highlighted the back of its head to a brilliant red/brown. As they were sideways to me, their profile was not quite distinguishable other than I could tell that a small amount of their facial features was flesh while the rest of their heads were 85-90% covered in hair. My one dog was now passing me and climbed up the deck to the patio doors clearly conveying she wanted in. My other dog was following the fence line barking, while moving parallel with them. They took no notice of my dog.  I stepped out away from my planting and this innocuous movement caused them to disappear straight down into the heavy grass/foliage.  I approached my property line while my dog kept moving down the line still barking at where they would have walked if they had continued.  By now, I knew I had finally seen my \"Buddies\" as I have lived here for 34 years and have had numerous indirect encounters. The one thing that has me a bit confused is, I saw the wild grass that stands about 8' tall was only up to their shoulder/armpit area. Making them to be approximately 9' tall...? The second thing that has me wondering is why the second one was so carefully stepping behind the first one, looking down...but so close to the first ones back that there was very little space between these two. (?) Granted, I was about 150' away from them, but it sure looked exactly like I have described. I called my dog back from following them as I live on 10 acres of heavy woods.  In the past I have had two big dogs \"disappear\" from off of my fenced in property.",
  "classification": "Class B",
  "county": "Summit",
  "state": "Ohio",
  "location_details": "Withheld at witness' request.",
  "summary": ""
}