{
  "reportId": "2819",
  "title": "",
  "date": "",
  "observed": "As my friends and I sat around our campfire, about 3 miles from the trail head at a flat, well trampled site, we heard a group of low based voices \"mummbling\" down the hill and braking large sticks. When the voices drew closer to our camp we heard them change to a more high pitched tone, possibly suprise and uncertainty. Since it was spring the river was swollen and my companions dismissed the noise as something like \"stream garggle echo.\" But when it suddenly stopped there was a great abscence of sound and the river couldn't reproduce the noise. I then witnessed large tall shadows move through the trees and down the bank to a flat granite river bank. It was then that what I can only describe as a \"protest dance\" began. The sasquatch began stomping with enough force to almost bounce me up and down on a log seat and the chants grew loud, spirited and quite hysterical. The seat I was on was a thick log supported on either side, about seven feet apart by other logs, that literally bounced when the\"protest dance\" began. The message of their chant was unmistakable in any language : \"GET THE --== OUT!\" So much that I declared, \"whatever that is doesn't want us here, let's just pack up and go!!!\" My friends, although visibly quite shaken, were still reluctant to concede our site. Then, abruptly the chants, actually shouts and screams stopped. With a few deep hooted orders from what I believed to be the male, the pack of voices trailed off. I didn't relax again until I heard screams much later, far up the valley and then from the mountaintop on the other side. Just passing through, I thought. Later, just after I had settled into my tent, my tentmate asked, \"Did you hear that\"? Even though I had my sleeping bag pulled back from my ears because I had heard a shuffling in exactly the place he described I replied, \"No\", hoping it would go away. I lay there on my back watching the fires orange glow and then, BLACK! A silhouette had eclipsed our fire and was squatted in front of the tent! I caught a scream in my Adam's apple for fear I might frighten the creature into... who knows what. It was so close! I could feel it's breath pushing against the nylon and a warm stentch filling the air. Five clear digits groped at the zipper in curiosity. I could sense the way a German Shepard senses the fear of an adolescent, that the sasquatch knew that I knew he was there, and that I was literally scared pissless! I had to go before he arrived but held it all night! The shadow gave way to the familiar warm glow of the fire just as it had arrived. In the morning I actually found some hairs (thin black hairs with silver tips) and a few deep pot holes on the trail that were pushed in by something heavy. Before the encounter I was a skeptic. Now I feel Dr. Krantz's idea of families is exactly what we encountered. (I saw a documentary after the incident) I also feel I \"sensed\" the intelligence, compassion and even mischevious sense of humour that these animals possess. Please don't take this as a joke, at least I believe every word of what I said. Yes I do kick myself for not collecting the hair/photographing the indentations or even swallowing my fear and moving an inch to peak outside!!!!! I would like to say that I think it was a family of bigfoot, possibly migrating. They were definitely communicating with one another, even if it was only grunts, they got the point across.",
  "classification": "Class A",
  "county": "Trinity",
  "state": "California",
  "location_details": "Bridge Camp or Stewart's Fork",
  "summary": ""
}