{
  "reportId": "25362",
  "title": "",
  "date": "",
  "observed": "I attended two BFRO Expeditions last year, the Oklahoma trip in September and the Missouri Ozarks trip in November. After those trips I wanted to try to locate some sasquatches in my area. There is a national forest close by where I live, and we've been hiking & camping there my whole life. But we never thought about sasquatches possibly being in there. Since those expeditions we of course began to think about that. Me & my Dad have been scouting out this one area for a while now, with Harold Benny (BFRO Investigator) and on our own a few times. It is heavily wooded and has lots of ridges & valleys, and plenty of water sources too. Tons of deer. Just seemed like an ideal spot. This was only our second time there at night. We went up the trail into some pines and built a fire and cooked some bacon and just talked. We stayed there for about 2 hours, and did two knocks. We weren't hearing anything, and the wind started to pick up....we were on a big hill. So we decided to pack up and head back down the trail, maybe try another spot or just go on home. We both had to work the next day. By now it was dark, with a cloudy sky and some stars, so we had our headlamps on. Mine was green and his was red. About halfway down we stopped in the pines and he did three whoops just to see what would happen. As soon as we came off the hill it became still, so we could hear much better. We didn't hear anything after the whoops except coyotes. I thought I heard a long whoop kind of start off the coyote chorus but I wasn't sure. So we kept heading down the trail. I was leading the way, and we were about 80 ft from the trailhead/parking lot. My truck's headlights were reflecting in my light. I was not expecting to see or hear anything, and just focused on watching where I was walking. Then Dad whispered, \"Rachel, come back here....there he is\". He had stopped and was looking into the trees to our left. I turned around and went back to him. I actually thought he was talking about a coyote because we'd seen a bunch in that same spot going in. I looked to where he was looking and saw EYES. Big round eyes. They were shining white-ish green. Then Dad whispers, \"Turn your light off\", and before I did we saw the head turn, he looked ahead then looked back at us. We both had our lights on him, and we could actually see the outline of his head when he turned. It was rounded like a persons, and I could see how the eyes were positioned on the front of the face. That's when it registered for me that it was in fact a sasquatch. This is all happening in a few seconds. As we flipped our lights off, he started to walk. I believe I took a step back and said \"Whoa\" because he was close.  He was about 30-40 feet from us. He took some big heavy deliberate steps, about 6 or 7, moving down the hill. Then he stopped. Dad said, \"Should I whoop at him...?\" I said NO!! I really didn't want to spook/annoy/provoke him! He didn't seem very afraid of us though, or especially bothered by our shining lights in his face. So we just stood there for a couple of minutes and I talked to him softly, and whistled. As soon as I started talking he moved, then was still again. My heart was just pounding. I could not believe it. It felt like he was waiting to see what we were going to do. So we left quietly. What surprised me was how close we were to the trail head parking lot, and also that he was right there and not making a sound! If my Dad hadn't looked around at that moment we never would have known he was there. They are so stealthy & smart. I do think he might have been on his way up to check us out. The wind was blowing his way, so I'm sure he smelled the bacon. I shined my light over the truck when we got home, and it had marks on it, that we are positive were not there earlier in the day. I took pictures. They look like finger swipes in the dust. I can't say for certain what made them, but they are weird. We are both very excited! This was our first definite bigfoot experience in our own state.",
  "classification": "Class A",
  "county": "Saline",
  "state": "Illinois",
  "location_details": "[Editor note: Directions were removed, but the location is in the .]",
  "summary": ""
}