{
  "id": "4077",
  "title": "Night sighting on the edge of Salem, within a few miles of Roanoke River",
  "date": "2002-04-04",
  "timestamp": 1017878400,
  "observed": "Hi, I am relaying this story for my brother since I have access to the net and he does not, but I will relate the story to you just as he told it to me with his permission. My name is [PB], I am 35 years old and live in Salem, VA in Roanoke County. My brother [RB] who actually had the sighting on April 4 of this year is 8 years younger. I have several rental properties in this area and my brother is my repair person/handy man.  One particular rental property is vacant and it happens to be directly in front of the house that I live in now.  On Thursday April 4, 2002, my brother was painting the interior of this house.  I work 2nd shift and usually get home around 11:30 each night.  At 11:30 I noticed that my brother was still working on the house so I stopped to see how things were going.  He was visibly shaken so I asked him if anything was wrong.  He then told me that at aprox. 10:45pm that night, he took a break and went out to the front yard to smoke a cigarette.  He heard a dog barking back in the woods, about a 100 yards away.  A short time later my dog became extremely agitated, barking and growling.  He was startled because he had never known my dog to behave in this manner.  He then heard something large \"crashing\" through the trees, and what he saw, he just couldn't beleive.  He said he saw a \"very large creature\" traveling at a high rate of speed and making a very loud \"gutteral grunting noise\" running much faster than a human could possibly run.  He said he got a very good look at it before it crossed the road and went out of sight. It's arms were swinging down by it's sides.  He said it was very broad and very tall but he could not tell me just how tall it was.  He said that it was very hairy, and described the hair as \"long and curly like a sheepdog\".  He said that it appeared to be a silver-gray color.  (All the reports of bigfoot sightings I have ever read however seem to say that they are brown or black in color).  My brother said that he would be glad to speak to anyone who might be interested in hearing his story first hand.  This is also not the first sighting in this area that I have heard about.  I also have a good friend who tells me that he saw a \"Bigfoot\" while out scouting for deer in Ironto VA. in Montgomery county.  Acording to my GPS, it is 9 miles from here as the crow flies. I can honestly say that I absolutely beleive my brother's story and my friend's as well.  Thank you very much for the great work and I look forward to hearing from you, Sincerely, [PB]",
  "classification": "Class A",
  "county": "Roanoke",
  "state": "Virginia",
  "latitude": 37.2423,
  "longitude": -80.13276,
  "location": "-80.13276,37.2423",
  "location_details": "[not for public display]",
  "temperature_high": 52.17,
  "temperature_mid": 41.29,
  "temperature_low": 30.41,
  "dew_point": 22.81,
  "humidity": 0.48,
  "cloud_cover": 0.17,
  "moon_phase": 0.75,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1024.64,
  "summary": "Partly cloudy starting in the evening.",
  "uv_index": 8,
  "visibility": 10,
  "wind_bearing": 352,
  "wind_speed": 5.02
}