{
  "id": "36011",
  "title": "Man recalls night time sighting at an airport outside Frederick",
  "date": "1987-03-19",
  "timestamp": 543110400,
  "observed": "It was 1987, I was 17. Me and my friend were going to the airport in Frederick, Oklahoma (Tillman county). My friend's dad owned a helicopter manufacturing plant that was located at the airport a few miles south of town.  We were going to get some paperwork for a trip we were taking during spring break. It was about 9 pm or later. It was dark. There is an access road that leads to the hanger which is at the south end of the airport. I believe the field on the passenger side of the van (my side) was a plowed field. Me and my friend were talking and I saw something out of my peripheral vision in my window.  There are various lights scattered out there on buildings and such but mostly very dark. At first I thought it was a reflection from the inside of the van when I glanced. Then I turned my head to look and there it was. I would say approximately 15 to 20 yards directly to my right striding our speed it seemed easily. I would guess it was 20 mph . It has been a long time so forgive my accuracy.  I would say maybe it was a bear or something else if it wasn't so clear to me what I was looking at. It looked just like the majority of the pictures and clips I've seen over the years. Almost identical to the really popular ones, like the one that gets all the press where it is striding across the open area in kind of rocky terrain. And almost just like that clip as I was looking trying to come to terms with what I'm looking at, while it is running it turns its head and is looking at me.  Dark black hair, it seems to me the face was dark like the hair. but being dark it is hard to say for sure. The whole face wasn't covered, I could make out some features because I remember a kind of indifferent expression on its face as we were staring at each other.  It had the same kind of gait as the video of one on the beach and seemed not to be laboring to run as fast as he was.  I could not even talk. My friend did not see it. We got to the hanger which was about 1/4 mile down the access road in the same direction it was going, that is when my friend knew I was serious. I would not get out of the van to go in to get the paperwork and told him that I'm going to leave him if I see the thing. We decided to come back the next day. The airport is very secluded. Mostly flat fields, a couple of creeks with treelines but overall flat and open. But the Red River is only 4 or 5 miles and I could see him there but I dont know why it would venture to where he was. I don't know if this will help but I just saw a show on bigfoot and thought what the heck. I have only told 5 or 6 people in 25 years. I think I would rather of seen a UFO though, the looks you get when you say \"I saw a bigfoot\".",
  "classification": "Class A",
  "county": "Tillman",
  "state": "Oklahoma",
  "latitude": 34.38638,
  "longitude": -98.99414,
  "location": "-98.99414,34.38638",
  "location_details": "It's been a long time, if you need specifics I can find out. I now live in Tulsa wich is NE OK and Frederick is in the opposite corner in SW Oklahoma. The nearest would be south of county line road about a mile as you come in to the airport main entrance.",
  "temperature_high": 68.56,
  "temperature_mid": 60.175,
  "temperature_low": 51.79,
  "dew_point": 43.69,
  "humidity": 0.64,
  "cloud_cover": 0.71,
  "moon_phase": 0.64,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1009.11,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 9.98,
  "wind_bearing": 150,
  "wind_speed": 9.81
}