{
  "reportId": "6062",
  "title": "Three teenagers witness a \"thing\" crouched on the road, stand up, take three quick steps, and jump over the reeds down a hill",
  "date": "1986-10-01",
  "timestamp": 528508800,
  "observed": "I was in High School in 1986 and we just came home from an away football game and were cruising around town late one night, about 12:30 or so. My friend was driving and my other buddy was in the back seat in the middle. I was riding in the passenger seat. After riding around for a while, we decided to go to the other side of town and took a shortcut on the very curvy Timlin Hill Road. The area has some nice homes and has a huge old Montessori at the top of the hill that was abandoned by the nuns a few years earlier. So you can imaging the ghost stories that emulate from this such place. It is still well kept and was a popular make out spot for the area teens, it overlooked Portsmouth and was at the top of a hill-like region... Anyway, just at the entrance to the Montessori are well lighted street lights that provide more that ample light. We were turning a sharp corner at the bottom of the hill and started to the top of the hill toward the Montessori when we turned the corner and saw a \"thing\" sitting in the middle of the road all crouched down. When it saw our car/headlights, it arose and took three large steps and leaped over and down the hill. My friends and I said nothing until we got to the other side of the hill (stop light). I finally had to say something and turned to my friend driving and he was almost crying, my friend in the back was in total disbelief of what we had just seen. We went back (going about 100 mph) but obviously that thing had vanished. Later that night, we went back with a few more people and saw where some branches were broken. I had never been a believer in Bigfoot, but the thing I saw was something I cannot to this day explain. I was about 17 then, now I am 34 and still recall vividly how that night was when I didn't expect to encounter this thing. It was slender, tall and had fur hanging off of it, its arms swung down past its knees almost. It took two to three steps and leaped over these reeds that were at least 4 foot tall. It was almost like it was warming itself under the lights and the warmth of the pavement.",
  "classification": "Class A",
  "county": "Scioto",
  "state": "Ohio",
  "latitude": 38.74899,
  "longitude": -82.97854,
  "location": "-82.97854,38.74899",
  "location_details": "Off of State Route 23",
  "temperature_high": 75.75,
  "temperature_mid": 71.025,
  "temperature_low": 66.3,
  "dew_point": 67.27,
  "humidity": 0.86,
  "cloud_cover": 0.76,
  "moon_phase": 0.92,
  "precip_intensity": 0.0096,
  "precip_probability": 0.56,
  "precip_type": "rain",
  "pressure": 1015.97,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 6.27,
  "wind_bearing": 204,
  "wind_speed": 4.34
}