{
  "reportId": "9818",
  "title": "Hiker has nighttime sighting at Minnehaha Falls",
  "date": "1998-05-23",
  "timestamp": 895881600,
  "observed": "I feel pretty stupid reporting this now after some time has passed, but I felt like someone should hear about this. Back in May 1998, I  had taken my first trip to the North Georgia Mountains, specifically the Tallullah Gorge area. After hiking to the bottom of the gorge I hiked  to another local area near a lake called Lake Rabun and I viewed some water falls called Minnehaha Falls. The sun was already setting and when I completed the fairly easy stroll to the falls I noted that I was the only person at the falls. I did not observe anything weird at that time, but I did catch a whiff of something smelly in the area. Not quite the smell of a dead animal, but the smell of something very musty and almost sweaty. I stayed until it was completely dark and I fished my flash light out of my backpack. As I finished my ham sandwhich, I began to get up off the ground to hike out. It was at this time I noticed a figure of what I thought was a person squatting to the right of the falls in some bushes. I thought it was another hiker I had either failed to see sitting there or someone who had arrived after me. I did not turn my light on yet and I did not want to turn it on so as to blind the other person. I began to walk in the direction of the other person to say hello and that is when it stood up and I could obviously tell the thing was about 9 to 10 feet tall. I still thought it was a very tall person until I got to within 20 feet of it and the smell became extremely bad. I could hear the thing breathing shallow and it kind of sounded like when a person has a chest cold with some gurgling or rattleing in the chest. I stopped and turned my light on and tried to shine it on the thing, but it began to turn away from me as it took very long strides as it walked on two legs. It was dark brown in color and had matted hair covering it's body. It stopped and turned towards me from about 60 feet away and took about 5-6 steps towards me in the bushes. I became scared and drew my service pistol from my fanny sack (I am a police officer) and stood my ground while yelling at it to stop. It stopped and then turned away. The creature walked away without turning back. I left the area and drove back to my apartment in Marietta Georgia. I did not tell anyone about this, as I thought they would think I was crazy or lying.",
  "classification": "Class A",
  "county": "Rabun",
  "state": "Georgia",
  "latitude": 34.74775,
  "longitude": -83.48067,
  "location": "-83.48067,34.74775",
  "location_details": "Minnehaha Falls is 1.6 miles from the Lake Seed Dam. To reach the falls Follow US441 north out of Tallulah Falls for 2 miles and turn on Old 441 at the Rabun Beach Recreation Area sign. Follow Old 441 for 2.5 miles and turn left on Lake Rabun Road. Proceed along the shore of Lake Rabun for 6 miles (2 miles past the Rabun Beach Recreation area) to the Lake Seed Dam. Cross the lake below the dam on a one-lane bridge. Go about 150 Yards and turn left on Bear Gap Rd. Follow Bear Gap Rd. for 1.5 miles to the Minnehaha Falls sign on the right. ",
  "temperature_high": 85.86,
  "temperature_mid": 77.71,
  "temperature_low": 69.56,
  "dew_point": 68.03,
  "humidity": 0.75,
  "cloud_cover": 0.2,
  "moon_phase": 0.92,
  "precip_intensity": 0.0001,
  "precip_probability": 0.24,
  "precip_type": "rain",
  "pressure": 1012.54,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 10,
  "visibility": 5.01,
  "wind_bearing": 257,
  "wind_speed": 4.12
}