{
  "reportId": "2599",
  "title": "Grays Harbor County Sheriff's Department Offense report/summary",
  "date": "1982-06-02",
  "timestamp": 391824000,
  "observed": "On numerous dates listed within the report those witnesses listed above and I had occassion to examine \"unusual\" scenes which, to date, have been undetermined as to the origin of the evidence found. It should be noted that all materials used to process said scenes were supplied by the individuals themselves and the results thereof are retained personally by said individuals. Copies can be made available on some of the evidence, with consent of the owners. The time involved was donated by the individuals as well - Therefore, this report is merely a documentation of facts observed by myself and includes some comments made by those listed. It is not submitted as an official case report \"per-se\". This, the Grays Harbor Sheriff Dept. has been asked, and graciously accepted to act as caretaker of this documentation. On 4-22-82 @ approx. 1609 hrs. I was contacted @ my residence by a private citizen (name witheld @ request) in reference to a number of large tracks found in a fairly secluded area of the eastern portion of Grays Harbor County. The location is known as \"Abbott Hill\" to the local residents and is rarely traveled or visited. It consists of a two year old \"clear cut\" of privately owned timberlands surrounded by second growth timber and a heavily vegetated forest floor. There is presently one road around the clearcut and one dividing the clearcut with short spurs off of each. I was escorted to one of these spurs and was shown two large, what appeared to be footprints with human features in an area along the base of a fire trail. The tracks were obviously made after the rains and before the sun had dried the mud as there were virtually no \"rain pocks\" in the major portion of the track. They were approximately 46\" apart and the toes of each track pointed the same direction. No other tracks were visible in the muddy area or along the grassy edge. A distinct trail could be found leading from the top of a small hill, down hill through 8 foot high Salmonberries, Devils club, Blackberries and other intertwined plants. The plants were either broken over entirely or the tops were broken. The trail measured 36\" across and was approximately 150' long. It ended on the roadway at the point where the aforementioned tracks were observed. I photographed both tracks and made a plaster cast of the left foot. The tracks measured 15 1/2\" long by 6 3/4\" wide @ the longest and widest points. (see attachments for further measurements). At the deepest point into the mud, the track measured 1 1/2\" deep. This plaster cast was retrieved as evidence by me. A hair was removed from between the second & third toes of the left track & sent to the \"Institute of Cryptozoology\", in Tucson, Arizona for analyzation. No results have been obtained @ the time of this writing. More tracks were observed, photographed, measured and processed @ the end of the \"spur\" approximately 1/4 of a mile from the first set of tracks. The longest step @ this location measured 9 feet between steps and only the ball of the foot was distinguishable @ the end of each 9' step. From there a trail of broken vegetation & matted grass went down the hillside into rugged clearcut & drainage. The perimeter road was searched for further sign to no avail. @ the same time I was informed of more tracks located seven miles west of our present location along the Satsop River @ a place called \"Worman's Bar\". Upon investigation I found two seperate sets of tracks together. Both starting from under the water, traveling westerly and ending in hard packed gravel which made tracking difficult @ best. These tracks were photographed & measured by me. The largest was 17\" long by 7 1/2\" wide @ the longest & widest points. The smallest was 15 1/2\" long by 6\" wide @ the longest and widest points. Both sets were made in hard packed river sand and appeared to have been the result of great weight being placed on each foot. The steps measured from 52\" down to 39\". No casts were made of these due to the lack of plaster of paris. Upon return to the scene with the proper casting materials I found only portions of the tracks due to those made by curiosity seekers. On 4-27-82 I was informed by Officer Jim Young of the Oakville Police Dept. of numerous tracks discovered along the Chehalis River in an area known as \"Elma Gate boat launch.\" According to Jim, these tracks were followed approximately 1/2 mile upstream. Veryl Hutchinson (Sgt.) and I went to the area where I photographed, measured, and processed the scene. Hutchinson retained the cast of the left foot. The measurement was 15\" long by 61/4\" wide @ the longest & widest of the left track. Further investigation revealed a trail of approximately one mile. Steps measuring from 59\" to 34\". On 5-23-82 I was contacted @ my residence by a pastor of a local church and requested to the Porter Creek area for investigation of large tracks sighted in a fairly secluded area of Capitol Forest. I contacted Mike Behm and we met the Pastor and were escorted to the scene. There were four tracks found in the area, numerous photos were taken of the tracks (slide film) and two casts were made of two tracks. Mike Behm retaining one, I the other. An Aspen tree was scratched in such a way indicating five fingers or like items were used to make marks. The lowest mark was located 72\" from the ground and the highest was located 98\" from the ground. This portion of the tree was removed and is held as evidence. Numerous branches were broken from 8 feet to approx. 11 feet in the trees. A wad of approx. 12 ferns, minus the roots were found @ the creek along with two new growth portions of Aspen branches. A subsequent search of the opposite banks of the creek revealed numerous tracks traveling downstream. The area the tracks were located is a sharp bank, covered with ground salal and devils club. the tracks were followed approx. 1.5 miles and were lost @ the edge of a clearcut. Of the sightings investigated, no two tracks were of the same measurements. The largest distance between the sightings was between the Elma Gate and Abbott Hill, approximately 9 miles. All the sightings indicated something of great weight (600+ pounds) with steps varying from 32\" between to 59\" between (barring the two of 9' between each). At the Porter Creek and Elma Gate scenes there was evidence of obvious foraging. @ all the scenes there was evidence of great height and weight and a lack of tracks to indicate the evidence was placed there as a hoax. Followup is continuing.",
  "classification": "Class A",
  "county": "Grays Harbor",
  "state": "Washington",
  "latitude": 46.9705,
  "longitude": -123.6288,
  "location": "-123.6288,46.9705",
  "location_details": "1. Abbott Hill 2. Worman's Bar 3. Elma Gate 4. Porter Creek",
  "temperature_high": 60.09,
  "temperature_mid": 53.555,
  "temperature_low": 47.02,
  "dew_point": 44.81,
  "humidity": 0.72,
  "cloud_cover": 0.84,
  "moon_phase": 0.38,
  "precip_intensity": 0.001,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1016.87,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 9.51,
  "wind_bearing": 230,
  "wind_speed": 2.71
}