{
  "reportId": "4970",
  "title": "Case report about a sighting by a boy and local rumors about a bigfoot in area.",
  "date": "1977-05-18",
  "timestamp": 232761600,
  "observed": "Case Report by Ron Schaffner Subject - Encounter with large \"Ape-like\" animal Date - May 18, 1977 Time - 8:30 PM Witnesses - Two 13 year-old boys whose parents request confidentiality Location - Preble County, south-east of Eaton, Ohio; U.S. 127 and Old Camden Pike near the Roberts covered bridge Investigators - Ron Schaffner  & Betty Parks Case Data: The following circumstances was related to Schaffner from the one boy, whom we shall call T.L.: \"We were walking our dog and she got excited about something. She got away from us and I ran after her. When I picked her up, we smelled this awful stink, like rotten eggs. When my friend and I turned around, we saw this creature that was about 9 ft. tall and weighed somewhere around 500 pounds. It had dirty brown hair and what looked like white eyes. It's arms were real long and hung almost to the ground. It chased us down by the bridge, across a soybean field towards my home. It seemed like it was right behind us, as it took very large steps. When we reached the railroad tracks and the highway, it vanished from our view.\" When the boys arrived home, they told Mrs. L. what had happened. She immediately notified the Preble County Sheriff's Department and two deputies responded. The boys accompanied the Officers to the scene. They refused to get out of the cruiser while the deputies searched the area. Mrs. L. told us that for the next week, her son would not let anyone open his bedroom window. Evaluation: Mrs. Parks interviewed the other witness, D.B. at a different location. He told her the same basic story as heard. When Betty and I later compared notes, we both agreed that the stories matched. I was impressed with T.L.'s testimony. The boy was really scared during our interview. The description of white eyes seemed odd, so I questioned him very carefully on this matter, but he stuck to his story. A local farmer and police officer contacted a researcher (Richard Hoffman) in Dayton, Ohio concerning two unusual foot- prints on his property. His farm is located about 1/2 mile northeast of the reported encounter. Hoffman notified us and we went to investigate. Two prints were discovered along a creek bed. One was in good shape, while the other was very weathered. We estimated them to be about a week old. It had five toes and measured 14 inches long, by 7 inches wide. The distance between the prints was roughly 6 1/2 feet. A deputy told us that some strange thing things have happened over the past several months. \"I haven't seen a deer in these parts lately. Just doesn't seem right, as they are usually plentiful in these parts. Also, we have reports of a wild goat or something roaming about\", he stated. We also learned of a cattle mutilation in the neighboring town of West Alexandria. Other members of our research team investigated that situation, but found no relationship to this incident. The vigilante factor was at an all-time high. Locals were on their C.B. radios talking about the Preble County \"Sasquatch\". Someone had left manufactured footprints underneath the covered bridge. In a later sweep of the area we found a cardboard sign on a fence that read: BIGFOOT DRINKS BEER HERE. Everyone was talking about Bigfoot; some in a joking manner, while others were seriously trying to track the creature down. With the combination of eyewitness testimony and some soft evidence, we can speculate that some sort of hominid creature was seen in Preble County. However, the terrain is not heavy forest to support a habitat for a large primate. Since the locals all knew about Bigfoot, its worth noting that this could have been a hoax pulled on the two boys. Our feeling is that something scared those boys and their dog and they believe it was something other than a prank. The case is still unexplained.",
  "classification": "Class A",
  "county": "Preble",
  "state": "Ohio",
  "latitude": 39.70042,
  "longitude": -84.62567,
  "location": "-84.62567,39.70042",
  "location_details": "Preble County, south-east of Eaton, Ohio; U.S. 127 and Old Camden Pike near the Roberts covered bridge",
  "temperature_high": 87.85,
  "temperature_mid": 76.36,
  "temperature_low": 64.87,
  "dew_point": 61.22,
  "humidity": 0.62,
  "cloud_cover": 0.37,
  "moon_phase": 0.02,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.19,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 9,
  "visibility": 5.73,
  "wind_bearing": 251,
  "wind_speed": 8.31
}