{
  "reportId": "12640",
  "title": "Possible vocalization in Great Smoky Mountain National Park",
  "date": "2005-12-02",
  "timestamp": 1133481600,
  "observed": "A friend and I were camping in the Big Creek Campground in the Great Smoky Mountains National Park right on the Tennessee and North Carolina border. It was dark. We just finished cleaning up after dinner and were walking to the restroom to get ready for bed.  We heard crashing and the excited snorting sound deer make when startled.  We had flashlights with us and shined them on some deer that were looking toward the forest.  There was a trail which went up the side of the mountain in the direction the deer were staring.  They turned their attention toward us for a second but then continued looking toward the trail. They ran a few feet and made some noise and stopped again to stare in the same direction.  We figured a bobcat, coyote or something scared them. Eventually the deer slowly calmed down and crept back to where they were originally browsing.  This all lasted about 5 minutes. We were walking back to the camp when out of the dark (in the direction the deer were looking) came a long call. It echoed through the woods.  We thought it sounded like a primate - some kind of monkey or ape. Eventually I stumbled on your website and read how you use gibbon calls to attract sasquatches.  I then got curious and started checking out different animal calls.  The call of a gibbon is exactly the sound we heard that night. I wish at the time we had thought it could be Bigfoot, but we didn't, so we never took off into the night to look or it or look for prints. The noise wasn't a recording. It wasn't any animal I have ever heard before and it sounded exactly like a gibbon.",
  "classification": "Class B",
  "county": "Haywood",
  "state": "North Carolina",
  "latitude": 35.89305,
  "longitude": -83.26097,
  "location": "-83.26097,35.89305",
  "location_details": "It was within Big Creek Campground which is part of the Great Smoky National Park.  Big Creek Campground is not far from exit 451 on I-40 in NC.",
  "temperature_high": 44.42,
  "temperature_mid": 36.12,
  "temperature_low": 27.82,
  "dew_point": 17.31,
  "humidity": 0.5,
  "cloud_cover": 0.18,
  "moon_phase": 0.04,
  "precip_intensity": 0.0006,
  "precip_probability": 0.29,
  "precip_type": "rain",
  "pressure": 1019.6,
  "summary": "Clear throughout the day.",
  "uv_index": 2,
  "visibility": 9.86,
  "wind_bearing": 293,
  "wind_speed": 4.63
}