{
  "reportId": "23160",
  "title": "Daylight encounter with two hunters south of Union (w/ cellphone photos)",
  "date": "2007-11-16",
  "timestamp": 1195171200,
  "observed": "This incident was originally reported to the BFRO by phone. The witness described a daylight encounter with his son while spotting for deer on private land near the Olympic Mountains. He said he and his son took some photos of the approaching figure with a cellphone. Five BFRO Investigators went to the witness's home to interview him and see the photos.  We spoke with the witness for over an hour, then recorded his full account.  Here is the transcript of the interview. The blurry cellphone photos are shown below the interview, in the Investigator Comments section. These images do not have enough clarity to show details of the figure, but they do show its approximate size, girth, posture and color. --------------------------------- BFRO Investigator: What were the events that led up to this incident? Witness: We came down the road and turned around like usual and we go very slow down the end of the road. As we come down this road, probably at about 150 yards, maybe a little more out in the woods I could see something moving. I didn't know what it was and we went past a few trees and I ask the boy “WHAT IN THE HELL IS THAT?” He couldn't see it, and I drove ahead about another five feet. Stopped the truck and you could see a form coming. I call it a sasquatch. It kept coming. I said “Look at that!” He said “What is that??” “Well I don't know what the hell it is and I don't even have my camera.” Then he said “You do too have a camera – you’ve got your cellphone.” So I took the phone out and handed it to him. By the time he got the phone working that was when picture 1 was taken. It was about that time that it was fifty yards from us.  Then the next picture it was probably thirty yards, for picture 2, and then it turned to its left. BFRO Investigator: Was it aware of you at that point? Witness: It didn't act like it cared if we were there or not, other than it did turn. It was getting brushier between us and it and it turned, then went into an opening.  It came into the opening and then at one point it stopped and turned its head, looking right at us. Investigator: Did it turn its head or whole body? Witness: Well, the whole shoulder part - the front portion. It lifted its left shoulder back and twisted and looked at us. Then it just went right back into the angle it was. Investigator: When it looked at you, what was the expression on its face? Could you see any of that? Witness: I don't know.  It just looked at us. You know – deer-in-the-headlights type of look. Investigator: Did it look surprised? Witness: It looked more like the same as we were, “What are you?  What the heck are you doing here?”   I was just looking at the size of it cause it was ... IT WAS HUGE. I kept asking him, “DID YOU GET A PICTURE???” You know, “Did you get a picture???” (Witness's son).. “I GOT A PICTURE THERE!” Then it just turned back and to the angle it was originally going. Then it picked up its stride. It moved a little faster probably half again as fast as it was going. Then he (the witness’s son) got out of the truck, the boy did. Then it paused, like it was going to turn again and look at us but it didn't. It just turned, I don't know if it went around something or what and he got one more picture. Then it came on the road and he couldn't get one more picture before he left. I don't know how long all that took. Investigator: So it cut across a logging road? Witness: The road runs through there. Investigator: And you lost it once it went across? Witness: It stepped right on the road and I don't think it made two steps.  The first step and then it was standing, stopped right there and it looked right at us. It was standing more upright. The next step it went into heavy brush - just a deer trail or a little path. The brush just closed in around it. I pulled forward and there is another little road that goes down along the way it went and we never did see it again. Investigator: You said it crossed the road, how many steps did it take to cross the road? Witness: One, two it was across because it just stepped in the road and stepped off it. It's a narrow road. It's just a regular Ford pickup so it's the width of the pickup, brush rubs both sides of the truck so eight or nine feet. Like when deer will jump, hit the road once when they are running. It had the same stride as a deer would running - you know jumping through the woods. Investigator: Was there a trail on either side of the road? Witness: I didn't notice a trail where it came from as much as I noticed a trail from where it went. You know where it came from was bracken fern and salal brush. It's up there above my waist. Back here where it came, turned originally in the opening - there was water even then, probably it's a low spot kinda where it came through probably a foot deep or two feet deep from the rains. Investigator: So would you estimate about 48 inches tall for the fern and the salal? Witness: About that tall.  Then it goes in stages but your base layer is at least that high. Investigator: So what we are seeing in these pictures is... ? Witness: Oh his butt was above the brush, it's chest height on me. [the witness is 6 feet tall] Investigator: From that picture it appears the figure is down on all fours. Witness: Don't think so, I don't think the hands were on the ground. Investigator: You don’t think it’s walking with its knuckles? Witness: Everything else moved but the arms didn't.   They were just kind of there. Investigator: So you didn't see any big arm movement, like when a gorilla walks quadrupedally? Witness: I didn't see the arms moving at all. Investigator: So it is walking hunched over but not down on all fours? Witness: I didn't notice it being down on all fours. Investigator: Just looking at the angle the torso is in, leaning quite far forward - it would be very difficult to walk in that manner without falling over. Witness: Well I couldn’t do it.. Laugh.. Investigator: Yeah, that is interesting. Witness: I said it's not like he's crawling over logs or windfalls or anything either. He appears to be more hunched over in certain pictures than when he was walking towards us, but he was still hunched over coming towards us. I noticed as he was coming towards us that he walked from side to side. Investigator: He waddled? Witness: Yeah he swayed or something, like every step he would really make a big step,...you know like a little kid being proud or something... but I know, well you just need better pictures, you need to be there.. Investigator: You needed your video camera. Witness: [Laughing] Yeah - I wouldn't have had these if the kid hadn't remembered the camera on the phone. Investigator: So did you try to look for any impressions or footprints? Witness: No actually, I can say no, I didn't.  The road is pretty hard.   It's all black crushed rock and that's hard as rock. There is nothing there where he came out of.  He didn’t leave as much of a trail as I thought he would coming through the bracken ferns and stuff. That's what I thought. It surprised me, because after he came through there I figured you'd see a trail, as even brush pickers and mushroom pickers coming through you can see they're leaving trails. You know breaking them away, and there wasn't one. It was hard to see where he came out on to the road vs where he went in. He went in on a regular old deer trail & where he came out, it was almost undisturbed. That surprised me as a matter of fact. Places I went in there I left more of a trail in the bracken ferns than he did. Investigator: What time of day was this? Witness: It had to be around 10:00, 10:30. Investigator: In the morning? Witness: Yeah Investigator: And it's on the 16th of November (2007). Witness: Yeah a week ago Friday Investigator: There weren't any other cars around? Witness: No, there was nobody else there. Not where we were at.  Matter of fact, I didn't see anybody out there.",
  "classification": "Class A",
  "county": "Mason",
  "state": "Washington",
  "latitude": 47.49865,
  "longitude": -123.2182,
  "location": "-123.2182,47.49865",
  "location_details": "A logging road in Mason county.",
  "temperature_high": 51.68,
  "temperature_mid": 48.025,
  "temperature_low": 44.37,
  "dew_point": 45.2,
  "humidity": 0.85,
  "cloud_cover": 0.9,
  "moon_phase": 0.22,
  "precip_intensity": 0.0084,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1011.01,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 9.39,
  "wind_bearing": 191,
  "wind_speed": 6.94
}