{
  "id": "9367",
  "title": "Two family members have night time encounters near Navidad",
  "date": "2004-09-22",
  "timestamp": 1095811200,
  "observed": "Well to begin, my uncle which lives across the street from my parents heard his dogs barking so he got a flashlight and went out in his pasture to check it out. He shined his flashlight to an old vehicle he has in the pasture and saw eyes. He just stood there trying to figure out what it was then he saw it turn and run. He said he beat the dogs back to the house it scared him bad. Well he called my parents telling them about it. They laughed at him and asked him if he had been drinking - he said no, it ran towards y'all. Well my dad went outside to see if he could see anything and he didn't find anything. We thought he was just joking till about a week later my mom went outside to throw something in the trash. She flipped on the porch light and had her back to the back pasture till she got a funny feeling something was wrong. She felt something staring at her. She turned around and all of a sudden my mom ran in the house shaking and crying, saying \"that SOB is out there!\" She panicked. I said, \"Mom what is it?\" She said, \"He wasn't lying, that thing is out there.\" My dad ran to the porch to see what it was but by that time it had already ran off. I asked my mom what it looked like after I finally calmed her down she said it was about 7 1/2 to 8 feet tall standing there kind of slumped over with his arms dangling, staring at her. She said the lights reflected off of it and its eyes were glowing red from the porch lights reflection. It looked like it had been bedding down in an old hog pen my parents have. It is in the woods not too far from the creek. Mom saw it twice. We have never told anybody about this cause we didn't want people to think we were crazy or stupid.",
  "classification": "Class A",
  "county": "Jackson",
  "state": "Texas",
  "latitude": 29.02611,
  "longitude": -96.71,
  "location": "-96.71,29.02611",
  "location_details": "",
  "temperature_high": 86.83,
  "temperature_mid": 79.25,
  "temperature_low": 71.67,
  "dew_point": 70.58,
  "humidity": 0.76,
  "cloud_cover": 0.34,
  "moon_phase": 0.29,
  "precip_intensity": 0.0032,
  "precip_probability": 0.34,
  "precip_type": "rain",
  "pressure": 1015.28,
  "summary": "Light rain starting in the afternoon, continuing until evening.",
  "uv_index": 7,
  "visibility": 9.65,
  "wind_bearing": 89,
  "wind_speed": 8.69
}