{
  "reportId": "1594",
  "title": "Footprints found with huge Toes on each print",
  "date": "1997-11-28",
  "timestamp": 880675200,
  "observed": "4 close friends and myself were camping at the base of Corral Pass. 2 of us have been believers for quite some time, the other 3 are staunch skeptics. On the 2nd day of the outing all 5 of us decided to go check out Corral Pass. We all packed into my 4-Runner and off we went. By the time we got near the top, it was quite cold and snow-covered. We got out and plotted our hike. I immediately began looking for tracks and within 15 min., we found some. They were bare (not bear) feet prints, about 16-18inches long X 8-10inches wide, and the tracks were about 45-60feet long, (which trailed off into an unsnowed on area). We've always been outdoorsmen, and seen various animal tracks before, and we even considered that maybe these were possibly tracks from huge boots, which melted outward some, then re-froze, but then we noticed something that convinced all 5 of us. On the top of each print were a huge set of TOES, (but absolutely no claws). As I pointed this out to my buddies they were speechless. We observed them individually, and in silence as we were all really convinced, staring at each other with flat-affects and big eyes. We continued on our trek, quitely, and didn't speak of it the rest of the trip. We've actually been squatch'n for about 10 years and this has been our first visual of evidence..., when you least expect it, I guess!!",
  "classification": "Class A",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 47.01278,
  "longitude": -121.4642,
  "location": "-121.4642,47.01278",
  "location_details": "Corral Pass, (just before Crystal Mt. Ski Resort), near the top of the pass.",
  "temperature_high": 46.67,
  "temperature_mid": 43.305,
  "temperature_low": 39.94,
  "dew_point": 40.65,
  "humidity": 0.91,
  "cloud_cover": 0.78,
  "moon_phase": 0.95,
  "precip_intensity": 0.0112,
  "precip_probability": 0.84,
  "precip_type": "rain",
  "pressure": 1012.37,
  "summary": "Light rain until afternoon.",
  "uv_index": 1,
  "visibility": 5.99,
  "wind_bearing": 179,
  "wind_speed": 7.47
}