{
  "reportId": "20173",
  "title": "Motorist describes nighttime sighting/encounter in headlights on US-2, west of St. Ignace",
  "date": "1979-06-01",
  "timestamp": 297043200,
  "observed": "I saw what I feel was Big Foot, in 1979.  I was traveling home from Minot AFB, North Dakota, in the early summer of 1979 with my family, on leave.  We were headed for upstate New York. It was approximately two in the morning, I was driving east on Hwy 2, in northern Michigan, I was driving through the Hiawatha National Forest.  I looked down the road and about 3/4 of a mile down, there was something in the road.  I couldn't tell what it was, all that I could see was the reflection of the eyes, a red reflection, I thought nothing of it, thought it was an animal and kept going, I was running at about 80MPH.  As I approached  what I thought was an animal, it didn't move, as I got closer I figured out that it wasn't going to move, I had to slam on the brakes.  Naturally, this created a great deal of blue smoke.  And I still could see the red eyes, they didn't move.  I still could not make out what was in the road.  After the car came to a stop, I looked up after the smoke cleared and there it was, this thing was approximately 11 feet tall, fairly slender, his hands reached down to his knees.  I sat there looking at this thing, and he stood there unruffled, looking back at me.  We stared at each other for approximately a minute and a half.  Then he turned to his left, his head turned, then his entire body turned to his left, and took two steps to the edge of the road and looked back at me.  He was covered in fur, from his head to his feet.  And it was as though his head turned almost all the way around to look back at me.  Then he stepped down into the field on the side of the road, it was about 50 feet to the forest, then when he went up to the edge of the forest, he stopped once again, and did that funny turning of his head to look back at me one more time and then he took one big kind of a side step into the forest, and he was gone. He was about 11 feet tall, covered in dark red short fur with red type highlights, it was clean fur, and somewhat neat and orderly.  His eyes were very unnerving.  He made no sounds. Oh, yeah, it did smell kind of odd that night, like rotten eggs.",
  "classification": "Class A",
  "county": "Mackinac",
  "state": "Michigan",
  "latitude": 45.91515,
  "longitude": -84.87524,
  "location": "-84.87524,45.91515",
  "location_details": "Hwy 2 just before Hwy 75 south",
  "temperature_high": 59.66,
  "temperature_mid": 53.04,
  "temperature_low": 46.42,
  "dew_point": 47.75,
  "humidity": 0.78,
  "cloud_cover": 0.72,
  "moon_phase": 0.21,
  "precip_intensity": 0.0137,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1017.26,
  "summary": "Heavy rain in the morning.",
  "uv_index": 6,
  "visibility": 7.62,
  "wind_bearing": 309,
  "wind_speed": 3.81
}