{
  "reportId": "19836",
  "title": "Campers describe incidents over 3-4 hours with unseen animal near their camp outside Prattsburgh",
  "date": "2003-11-09",
  "timestamp": 1068336000,
  "observed": "This account happened on the night of the lunar eclipse back in 2003.  I was camping with my friend Pete in NY up behind his cabin (about 1/4 mile up the hill).  It was about 11pm and we were both in our bags in the shelter we built. Pete was already asleep... I was trying to sleep but couldn't so I was poking the fire with a long stick.  I heard something coming down the hill (heard rustling leaves, etc) but figured it was deer coming down the game trail.  It is tough to tell where sounds come from at night and judge distance in the woods because it's so quiet.... but I figured it was pretty far out (about 150 or 200 yds) moving to our left.  I heard some sort of popping sound like the trunk of a tree being hit with something solid or two 2x4s being smacked together and a few growls (kinda like a lion but higher pitched, kinda like a stomach growling)... I still didn't really pay any attention.  I dismissed the popping as trees cracking and the growling to Petes stomach or a low volume snore.  Whatever this thing was, it circled our camp keeping the same distance away.  All I heard was the rustle of leaves or twig snaps.  I kept hearing the popping sound occasionnally but I still wasn't freaked out.  The sound eventually stopped basically where it I started hearing it.  I starting thinking that whatever it was, it was a predator (showing stalking behavior)... I figured it was a bear, fox, or some other predator/scavenger that thought it was a good idea to leave us alone.  But then I started getting a really creepy feeling that I was being watched.  I thought my mind was playing tricks and I was imagining it...  but it got worse and worse.  I couldn't hear anything definitive in the woods but was still getting creeped out. I could only see part of the woods because only part of our shelter is open... but I started looking around (from my bag inside the shelter, not walking around) and what I could see was lit up pretty well because of the full moon (after the lunar eclipse anyway).  I looked into a stand of trees and saw a really big dark spot... it looked like a broken off tree trunk darkened by shadow... in basically the same spot where the noises stopped.  I looked around the woods a little more and came back to the  same spot where I saw the tree looking thing... and IT WAS GONE!!  I woke Pete up so I could tell him what was going on... and so I would know I wasn't crazy if I heard something again.  I was telling him what was going on when we heard the popping/thudding sound again... He loaded his gun (Pete has a permit to carry a handgun in NY). We got out of our bags and restoked the fire and I heard his stomach growl... really loud!!  He said, \"Man you must be hungry.\"  I said I thought that was his stomach and we just looked at each other.  We went to investigate where I saw the disappearing shadow thing and we made a lot of noise to scare off whatever it was (breaking branches, kicking at the leaves, talking/yelling to each other).  We looked around the woods a bit... I heard something up on the ridge keeping pace with us but moving away.  It didn't run, just moved away from us at the rate we were moving toward it.  We stayed up for a little while longer and heard nothing so we went back to bed.  Pete was out like a light and I stayed awake just listening. About 30 minutes later, THE THING CAME BACK!! I woke Pete up as I heard it come down off the hill from the same direction it started from... it was making a truck load of noise banging trees (we think it actually pushed one over too). It growled a few times,  and it's foot steps were really heavy... based upon how Pete and I sounded moving through the woods earlier, this thing had to weigh much more than both of us (I'm 6'2\" and 250lbs).  It came in on our left and walked behind our camp about 30-50 yds... We couldn't see it because it was on the non-open side of our shelter and we didn't want to pop out and provoke an attack.  It kept walking in the same direction and eventually was out of earshot but we figured that was enough of a warning. We packed up and went back to the cabin. There are many screwed up things about this.  First, I've been hunting for years and I don't get spooked... Pete is ex-military and no slouch in the woods either.  But this spooked us bad enough to make us want to pack up the gear at two in the morning (leaving some of it on the hill) and come back to the cabin.  Second, two of us heard this thing so I know its not just my mind playing tricks on me... it was definitely there!!  Third, this thing was massive... It made a whole bunch of noise when it walked behind our camp (more than any animal I have ever heard) and it's footsteps almost shook the ground.  But here comes the most screwed up part of the story.  I have hunted for 15+ years and know what animals sound like coming through the woods... I have heard deer, bear, fox, etc... just about any animal in NJ, NY, PA, and ME... and, ofc ourse, other hunters.  I can tell you with 100% certainty...  THIS THING WAS WALKING ON TWO FEET!! I checked the area the next day and found a large foot print in soft earth... about 3 inches longer than mine and about 2 inches wider (I wear a size 12).  I tracked the animal (or whatever) for a few hundred yards but only found one other definate track and it was the same size roughly.  I also found a dead tree that was knocked to the ground probably the night before (fresh earth on the roots, leaves under/around it disturbed)... I presume it was the large crash we heard the night before.",
  "classification": "Class B",
  "county": "Steuben",
  "state": "New York",
  "latitude": 42.54346,
  "longitude": -77.36516,
  "location": "-77.36516,42.54346",
  "location_details": "",
  "temperature_high": 37.38,
  "temperature_mid": 29.69,
  "temperature_low": 22,
  "dew_point": 17.32,
  "humidity": 0.66,
  "cloud_cover": 0.13,
  "moon_phase": 0.52,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1038.51,
  "summary": "Clear throughout the day.",
  "uv_index": 2,
  "visibility": 9.94,
  "wind_bearing": 236,
  "wind_speed": 3.56
}