{
  "id": "29403",
  "title": "Witness recalls a possible daytime sighting while 4-wheeling as a youth west of Nashville",
  "date": "1988-10-08",
  "timestamp": 592272000,
  "observed": "I was born, raised, and currently live near Nashville, TN.  When I was about 13 years old, I had a 4-wheeler. My dad used to take me to a piece of property owned by one of his customers which is located in western Davidson County, about 10 miles directly west of downtown Nashville, on Hwy 70. It’s about 1 mile east of where Hwy 70 intersects Hwy 70 South. There I could ride my ATV and shoot guns. One afternoon, a couple hours before dark, in early October of 1988, I was riding my ATV on an old logging road, which ran along a creek, in the bottom of a holler (valley between two ridges). My 9 year-old stepbrother was on the back of the ATV, hanging on for dear life as I sped down the logging road at over 40 mph. He tucked his head between my shoulder blades as he sat behind me because he was apparently scared of my driving. The power company had bush-hogged or cut the brush in a 150 foot-wide path, centered on the power line, as per routine maintenance. The power line right-of-way had grown up really thick since the last cutting, which must’ve been 2 years prior to this. Just before the old logging road passed under the power line, there was a “dog-leg” in the road (the road went straight, made a quick 20 degree turn to the right, and immediately turned another 20 degrees back to the left, now running in the same direction as it was originally, just 3-4 feet to the right of the original vector). I had fun seeing how fast I could drive through the “dog-leg” and also scaring my younger stepbrother. On this particular day, I got up to speed, fishtailed through the “dog-leg,” and proceeded to drive past the thick overgrowth, approximately 8-10 feet high, which ran under the power line. At this point, I saw something that made the hair on the back of my neck stand up! From the brush on the left side of the road, something ran out in front of me. It was covered in 5-8 inch long dark brown hair, about 7.5-8.5 feet tall, and was running on two legs! It passed right in front of me with lightening speed. I’d say it only took about 2 steps to clear the 12-foot wide logging road. It then disappeared into the overgrowth on the right side of the logging road. I didn’t get a really clear look at the creature because it happened so fast. I didn’t stop either. Out of fear, I applied full throttle to the ATV in an attempt to vacate the area. My stepbrother didn’t see a thing because he was hiding in fear of my reckless driving. I yelled out to him to see if he’d seen the creature but he thought I was joking. The best description I can give of the way I felt after the incident would be to compare it to having a near miss in a fatal automobile crash! My heart just felt like it stopped before it began to beat out of my chest. Nearly an hour passed before I found the courage to return to the location of the sighting. I had to go back through the location because it was the only way back to my dad’s truck. The first time I drove back through, I was travelling at a high rate of speed due to fear. Curiosity eventually got the best of me and I returned, still on my ATV, just as it was getting dark. I found no tracks (it was extremely dry at the time), smelled nothing out of the ordinary, and saw only a path through the brush, which appeared to be seldom used. I didn’t say a word to my dad about what I’d seen when he asked why I’d been gone for so long. If I had, he would’ve thought I was out of my mind. I didn’t tell anyone for a long time. To this day, the event plays over in my mind like a movie.",
  "classification": "Class B",
  "county": "Davidson",
  "state": "Tennessee",
  "latitude": 36.0917,
  "longitude": -86.9803,
  "location": "-86.9803,36.0917",
  "location_details": "Take Charlotte Pike/HWY 70 westbound out of Nashville toward Memphis. Drive approximately 10 or 15 miles. The location of the sighting will be on your right, about a mile before HWY 70 intersects HWY 70 South.",
  "temperature_high": 67.75,
  "temperature_mid": 54.905,
  "temperature_low": 42.06,
  "dew_point": 36.74,
  "humidity": 0.64,
  "cloud_cover": 0.32,
  "moon_phase": 0.93,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1025.31,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 8.69,
  "wind_bearing": 210,
  "wind_speed": 0.25
}