{
  "reportId": "7552",
  "title": "Man has early morning encounter with unidentified creature",
  "date": "2003-12-12",
  "timestamp": 1071187200,
  "observed": "I was asleep on the couch and we have around 7 dogs. They started running around the house frantically barking and carrying on. We recently had a small fire that cleared out the back part of the woods back there and more and more people keep moving to this area. So I figured it was an animal or coyote or something they were chasing. I run a small security perimeter every night or so. There's always been a rumor of a panther up here, so I carry a weapon with me, not to mention snakes. I have never seen the panther but I have many times come up on something I assumed was the panther story but I never thought about a big foot theory till this morning. My wife woke up and made me go look. So I loaded my rifle and headed out on my security sweep. I first hit the road about 200-300m from the house, small dirt road. I don't use a flashlight, I can see fairly well at night. I have a brindle boxer who was freaking out sniffing the ground every 4-5 steps and just real jumpy, usually he just marks it and goes away. I saw no signs of the other dogs, when something jolted passed me out of the bushes almost knocking the boxer over, he ran the other direction. It scared the crap outta me and I got off 3 shots but missed it because my rifle jammed up with two shells in the chamber. I thought whatever it was I scared off, and used my pocket knife to release the two jammed shells. So I walked about 350m to my shop to grab some more ammo. I felt like the hairs on my neck were standing up. I loaded my rifle up and opened the door to my shop. Instantly I noticed this, pardon the expression, but this stout crap/wet grass odor really thick in the air. Not more than 5 minutes had passed and I felt like I was being watched again. I snuck around to my parent's house about 200m from my shop and climbed on the roof to get a better look. I was up high so could see lots more from there. We have a school bus on the property that we use for storage. It's about 350m NW of my location and I thought my eyes were playing tricks on me when I thought I saw a large thin shadow go past the bus. I figured it was my brindle boxer's shadow because there's a light on the shop. My house porch light creates a lighted area near there. But then it stop and looked right at me on my perch. I had it open sights but thought it was my dog with just a shadow. Then outta nowhere behind me the neighbor's dog started going crazy. I turned for two secs and the shadow was gone. My dog was behind me, not in front. I sat up there for another 10 minutes trying to find out what the neighbor's dogs were barking at. They were howling, growling, weirdest sounds too. They have a hound dog but it did not sound like that. It was really hard to describe the sound, almost like a howl but a growl at the same time. Very distinctive and then it all just stopped, a dead silence. I turned back to the bus area kinda just looking in the general area, trying to figure out what I saw, if it was just my imagination. Then I saw it again, plain as day. It was squatting down like it was hiding. It looked at me again and then ran around the side of the bus, it was as tall as the bus but skinny, but it was dark so not sure. I instantly jumped off the house and ran over there. The closer I got the more slower I went. Rifle held in a firing position as I crept around the bus. My heart pounded and when I got around the bus, nothing but the open area of where the fire had been. I am always suspicious of the land across the hwy, they have a fence around the property that is almost 9-10 ft high. They have many Exotic animals over there. A huge manmade water source. I think its a wildlife preserve or something, but nothing like this ever happened till it showed up. After this I am convinced it's not a panther. I have been running security every night or so. Bigfoot no idea, I am unsure what I saw, but it was intelligent. No matter what I think, I am absolutely sure, I was not the one hunting it. I don't think its intentions were harmful, it probably could have got to me at anytime. And I am not that easy to catch. It came back to the same place 3 times in one night even after I shot at it. I'm not sure but it's braver than me. Not the first time, just the first time I have seen it in the open. It seemed to me like it was testing defenses, probing to a point. It is either fast or there is more than one, because our homesteads are half a mile from each other. The neighbors and their dogs flipped out last night as well. I just know what I saw and it was not a coyote, wild pig or a panther.",
  "classification": "Class B",
  "county": "Hood",
  "state": "Texas",
  "latitude": 32.53333,
  "longitude": -98.05,
  "location": "-98.05,32.53333",
  "location_details": "",
  "temperature_high": 47.51,
  "temperature_mid": 40.315,
  "temperature_low": 33.12,
  "dew_point": 35.45,
  "humidity": 0.75,
  "cloud_cover": 0.84,
  "moon_phase": 0.62,
  "precip_intensity": 0.018,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1015.14,
  "summary": "Rain starting in the afternoon, continuing until evening.",
  "uv_index": 2,
  "visibility": 7.16,
  "wind_bearing": 100,
  "wind_speed": 4.53
}