{
  "reportId": "28714",
  "title": "Memory told of seeing a bigfoot on the side of a road along Middle Branch Creek",
  "date": "1969-08-09",
  "timestamp": -12528000,
  "observed": "Years ago I had a strange experience as a kid. I was ten years old and I remember it was the summer time. My bedtime was 8:30 so I knew this had to have happened later in the evening as I was already in my pajamas. It was dark outside. My ex-brother-in-law had an old pick-up truck that he was always having problems with. He called my mom and asked if she could come get him as he had broken down. We got into the car, me in my pajamas and we headed out one of the country roads that is east of Norris. As we got nearer the creek (Middle Fork of Copperas Creek) and woods there is a curve in the road. After coming out of the curve the headlights shined onto something that was crouched down behind the fence and near a fencepost. We couldn't tell what it was but it's head did stick up above the four foot fence. It appeared to be watching my brother-in-law whose truck was just ahead of us. When we got to the truck we told him about it. He grabbed a rifle he had with him and strapped a flashlight onto it with some duct tape. I went with him as as he took off to see what this unusual creature was. He moved his flashlight back and forth near the fence and that is when it stood up. It was really tall and was on two feet. It immediately took off running into the woods that were close- by. In two or three steps it was gone.",
  "classification": "Class A",
  "county": "Fulton",
  "state": "Illinois",
  "latitude": 40.62288,
  "longitude": -89.99328,
  "location": "-89.99328,40.62288",
  "location_details": "",
  "temperature_high": 76.74,
  "temperature_mid": 68.095,
  "temperature_low": 59.45,
  "dew_point": 63.67,
  "humidity": 0.78,
  "cloud_cover": 0.73,
  "moon_phase": 0.89,
  "precip_intensity": 0.057,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1008.56,
  "summary": "Heavy rain in the morning.",
  "uv_index": 6,
  "visibility": 8.62,
  "wind_bearing": 44,
  "wind_speed": 2.87
}