{
  "id": "3334",
  "title": "Man hits 7 foot tall, reddish-brown creature with his car, then is pursued by the creature",
  "date": "1987-07-15",
  "timestamp": 553305600,
  "observed": "I have never told this to anyone because I didn't want to hear the jokes, but it was mid July 1987.  I was heading toward the beach in my sports car, top down music blasting.  It was around 8:45 pm so it was still light, sort of dusk dark.  I had my headlights on cruising about 60 mph  when I rounded a corner and there in the road stood this large hairy thing.   I slammed on brakes and swerved around it, but I must have glanced it because it bounced over the passenger side of my car.   I slid the car around and stopped where my headlights were about halfway on the thing.   It got up and came at me.  I was about 25 feet away from the thing and the smell was horrible. It hung in the air like a wet blanket.   It was about 7 to 7.5 feet high, reddishbrown matted looking hair,  its face was hairless and he looked ticked.   I put the car in reverse, backed up and threw the car in drive and took off.  As I was spinning around I looked in the rearview mirror and it was right on my cars rear end.  I heard a loud bang. About that time my car caught traction and took off.  I left the creature running down the road after me.  I have never been so scared in all my life.  After I got to my destination I checked my car.  The passenger rear quarter panel  was dented in with hair on it.  And my rear spoiler was shattered where he had hit the rear of my car.    I told my friends, family, police and insurance that I had hit a stray cow.  But it took weeks to get that smell off of the outside of my car and the inside still had that smell.   It was a under smell, like sewage and something else.  I was 27 then, I'm 38 now.  I have not been down that road since.   I will drive 45 to 50 miles out of my way not to go that route.",
  "classification": "Class B",
  "county": "Onslow",
  "state": "North Carolina",
  "latitude": 34.7576,
  "longitude": -77.5873,
  "location": "-77.5873,34.7576",
  "location_details": "Just on the edge of Onslow county,  North Carolina,  about 25 miles from Hampstead,  about 15 miles off of US 421  on Hwy 51.  I think is the Hwy number.",
  "temperature_high": 78.47,
  "temperature_mid": 74.4,
  "temperature_low": 70.33,
  "dew_point": 70.24,
  "humidity": 0.85,
  "cloud_cover": 0.78,
  "moon_phase": 0.67,
  "precip_intensity": 0.0517,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1013.61,
  "summary": "Heavy rain in the afternoon.",
  "uv_index": 6,
  "visibility": 5.9,
  "wind_bearing": 72,
  "wind_speed": 4.08
}