{
  "id": "45150",
  "title": "",
  "date": "",
  "observed": "Doubt this rises to a level of super credible sighting, but thought I'd pass it along anyway. I work at a golf course in northern MN which abuts a large state park. The other early morning \"something\" was walking in the woods just off a paved cart path but went out of view behind a small building used as bathrooms. What made this odd was: Size: Very tall and lanky Gait: The gate was very long and easy in heavy brush Speed: Not running but covered ground quickly Location: I find it hard to believe that a human would walk through dense brush ten feet in and parallel to a paved trail. Plus, no houses are near. Color: Uniformly tan/red from head to toe. Disappearance: After walking behind the building, the creature did not exit the other side meaning it made a complete 90 degree left turn to walk away from me with the small building blocking my view or it just disappeared. Other sightings: There have been other sightings in recent years within a 30 mile radius. Also, I live one mile from this site and had an odd experience several years ago. I'd left the sprinkler on in the garden in the summer and went outside after dark to turn the faucet off alongside the house. As I walked towards the spigot, I heard a loud low growl from the corner of my house and about ten feet from my spigot. Too low and guttural for a dog or wolf and I've never heard bears growl before although I have confronted them and they just kind of snarl or snap their jaws. This was different. What was very odd is that after hearing the growl you'd think my reaction would be to turn and run or freeze as I was about ten feet from the source, but I said loudly in my head \"stop growling, I'm just gonna turn the water off.\" I then felt at ease and not scared at all. Nothing. Sorta numb. I then walked towards the growl, turned off the spigot, turned around with my back to the growl, and slowly walked back in the house. I then sat back in my living room and only later my mind cleared and I thought \"what the heck? My daughter used to complain about someone looking in her window on that side of the house too, but I chalked it up to \"boogiemen.\"",
  "classification": "Class B",
  "county": "Beltrami",
  "state": "Minnesota",
  "location_details": "Not provided at request of witness.",
  "summary": ""
}