{
  "reportId": "27486",
  "title": "Man recalls strange encounter while searching for his father near Jackson",
  "date": "1994-04-22",
  "timestamp": 766972800,
  "observed": "It was late April, 1994, my dad borrowed my fishing boat and went down Cypress Creek to his favorite fishing hole to try to catch a few fish. It had been a long winter and it was the first time since he had broken his hip during the ice storm that he felt like being out in nature. My dad was very comfortable in the woods and on the water for he spent all his free time there. He had lived in this area all his life. Later that evening around 9 pm my mother called she was worried that my dad hadn’t come home yet. It was not unusual for him to stay out late in the woods or on the water, on numerous occasions in the past, I have had to go find him to tell him supper’s ready to get him home, but on this night I to had a bad feeling about him not being home yet. I got one of my friends to go with me to look for him. It was windy and dark so we took our flashlights and headed out. Dad’s favorite fishing spot was about a mile off of the highway right before Cypress Creek dumped into the Forked Deer River. The only way there is by boat or to hike. We went down the east side of the creek, shinning our flashlights and yelling for my dad. As we approached the area where my dad like to fish we heard a clicking sound like an insect, but not like any insect I had ever heard. So we stopped and looked around when we spotted on the North bank of the Forked Deer River two sets of large red eyes. This, of course, freaked us out. We started flashing the lights around and we spotted the boat on the other side of the creek but it was too deep and wide to cross so we had no choice but to go back to the highway and cross on the road and run back down the other side of the creek back to the boat. As we got back to the road my mother had called one of our cousins to help look for my dad. We told him we found him to go back to the house and call Rescue to meet us at the bridge. So we proceeded to run back down the west side of the creek to the spot the boat was. We found my dad floating beside the boat with the boat rope wrapped around his hand. The red eyes were still on the North bank of the Forked Deer River, as if they were keeping watch on my Dad. We were able to get him in the boat and perform CPR but unfortunately he had already died. So, of course, we were in a heighten state of emotions but we were trying to get my dad back to the Rescue unit waiting at the bridge on the highway. As we started paddling we were hitting something under the water but that couldn’t be that for the creek was about 20 ft deep.  We didn’t know or understand how or who had taken my dad’s life and it was as if they were after us as well. I kept yelling, “Come on you SOB, you got him but you’re not going to get me. I’m not afraid of you”. Once we got several yards upstream we were able to paddle without resistance. We finally got back to the bridge where Rescue was waiting. We found out later by the Medical Examiner that my Dad had suffered a massive heart attack. Over the years I often wondered if the Creatures with large red eyes were keeping protective watch over my dad. I know with as much time, day and night, that my dad spent in those woods and on the water they knew him and they were trying to protect him in his time of need. The clicking sound was alerting me that my dad was near. Another thing, why didn’t the boat and my dad float off, the creek and the river has a current and there’s no telling how long it stayed in that spot without floating off, it was not tied off. After many years I finally went back during the daylight to the spot where my Dad died. I got a better reference to where the eyes were and I can tell you this, I couldn’t tell exactly how tall they were but after seeing the area in daylight the Creatures were very large. I know this is a very personal incident to be telling but I thought it had to be told. I feel that the creatures in no way did anything to harm my dad. I feel grateful for the creatures I encountered that night for without them I would not have found my Dad a fast as I did. I just wish the outcome would have been different.",
  "classification": "Class B",
  "county": "Crockett",
  "state": "Tennessee",
  "latitude": 35.8606,
  "longitude": -89.0912,
  "location": "-89.0912,35.8606",
  "location_details": "Cypress Creek, Hwy 152 where the creek dumps into Forked Deer River",
  "temperature_high": 71.19,
  "temperature_mid": 59.035,
  "temperature_low": 46.88,
  "dew_point": 44.86,
  "humidity": 0.54,
  "cloud_cover": 0.39,
  "moon_phase": 0.38,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.25,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 8,
  "visibility": 9.41,
  "wind_bearing": 33,
  "wind_speed": 9.96
}