{
  "reportId": "15782",
  "title": "Possible intimidation/interaction heard by couple on two occasions in route to Fort Bragg",
  "date": "2005-09-16",
  "timestamp": 1126828800,
  "observed": "Re: Our Bigfoot encounter in California My wife and I have had two incidents over the year, including vocalization and wood knocking. We are San Francisco City people, artist; not hunters. We are not used to the outdoors or accustom to the forest and nature and the shock of fresh clean air. The first encounter was on Tuesday evening, 8/16/05 at 5:17pm on highway 128 in the Redwood forest. We were on a vacation, driving west on 128 and heading towards Fort Bragg, CA. Once we entered the state park, we stopped and parked to smell the fresh air. I marked the time, because I was shooting with my digital camera. We walked into the forest, on a trail, and were having a great time, enjoying our time alone. There was little traffic or noise from the road. The forest was quiet and powerful. We have lived in the center of San Francisco for 15 years, and were stunned and amazed to experience the silence and peace of the Redwoods. As we got deeper into the woods, about 20 minutes, I started to get uneasy; feeling like someone was watching us. The digital photos my wife took of me show my concern, the longer we stayed. Then we heard it.  It was a growl-grunting. Just above the hearing of my ears. I would described it as “infra-sound”- a deep sound that was low in pitch, deep, almost inaudible. My body felt it more than my ears. It threw me in a panic. The fear in me rose fast. I looked at my wife and she was feeling the panic. We both looked around. We could not tell the direction. We could not see anything in the thick woods around us. It could have been a bear or a wolf. But my instincts said no. I did not know what it was. But, the \"vibe\" message was becoming clear- GO AWAY NOW! Predators do not warn-they ambush-right? My wife looked at me and said “Did you hear that?” I said “Yes”. She said, “Let’s get back to the car”. I said “Good idea!”  It was a weird feeling. We were stunned and mystified as we ran back to the car. We drove away nervous and excited about what happened. On our way to Fort Bragg, CA, we were talking about the experience. Was it a bigfoot? Did we have a Bigfoot encounter? We felt something special had just happened. We had to learn more about bigfoots. Over the year, I became obsessed with bigfoots. I read as mush as I could about the Sasquatch, Yeren, Almasty, and Yeti as my time permit. My wife became obsessed also. Together we decided to go back to those redwoods and try to make contact with the forest giants. We made it back to highway 128 on Monday 9/4/06. Something told me to pull over at a different spot. As soon as I got out, I had the DV video camera running. On the camera my wife tells me to make my “Whoop-Whoop” Bigfoot call, into the redwood forest. As soon as I did, the camera records wood knocking and tree breaking. Soon the smell of a dead animal/skunk filled the air. The sounds and smells go on for about three minutes,  then stops. I could tell he moved away after my calls to him, inviting him to be photographed. We left the redwood forest, excited about our contact. My wife wants to see a bigfoot. I do not want to see him.  I hear that many people die or have very bad luck after seeing a Bigfoot. Remember Dr. Morbius from the movie Forbidden Planet? Maybe Bigfoot is the ID, coagulated from the quantum soup of our collective unconscious mind. Maybe, Bigfoot is us.",
  "classification": "Class B",
  "county": "Mendocino",
  "state": "California",
  "latitude": 39.06583,
  "longitude": -123.4439,
  "location": "-123.4439,39.06583",
  "location_details": "",
  "temperature_high": 69.9,
  "temperature_mid": 60.205,
  "temperature_low": 50.51,
  "dew_point": 47.88,
  "humidity": 0.67,
  "cloud_cover": 0.32,
  "moon_phase": 0.45,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.56,
  "summary": "Partly cloudy starting in the evening.",
  "uv_index": 6,
  "visibility": 9.11,
  "wind_bearing": 302,
  "wind_speed": 3.25
}