{
  "id": "23399",
  "title": "Possible night-time visit at campsite near Esto",
  "date": "2005-03-13",
  "timestamp": 1110672000,
  "observed": "Me and my friend were planning on camping out in the woods near my uncles house, near an old well where a old house used to be. It was march and it was just starting to warm up around the area and well we setup camp and head back to my uncles house, it was about a three minute ride by four wheeler. We get some food and tell him we are turning in for the night so we head back to the site. It was about 6:30 when we get to the tent. We get a good fire going and talk for an hour or two. we get in the tent at about 8:30 or so. About an hour or so later my friend wakes me and he tells me to listen and it sounded like big thuds and tree limbs breaking. It almost sounded like it was circling the or site. It couldnt have been about 40 or 50 feet away. But the woods are so thick back there we couldnt figure out what it was. It sounded like it was getting closer. My friend was laying in front of the tent opening and sounded like it was 5 ft away. It got quite and we are trimbiling. and then we heard deep grunts almost like a gorilla it was very strange. Then it sounded like it was moving away from us going towards a bottom. There is a creek that runs through there and it sounded like whatever it was it was headed that way. We looked at each other and my friend had tears in his eyes. We never went back to sleep that night and we were to scared to leave. As soon as the sun was peeking thriught the trees we took off to my uncles and told him what happened and he could tell we were upset. We take him back down to the tent and look around but we found nothing. The ground was to hard to leave foot prints and it was covered in pinestraw and leaves. I have nor my friend has ever experinced any thing like that in our lives. We only told my uncle about what happened until now.",
  "classification": "Class B",
  "county": "Holmes",
  "state": "Florida",
  "latitude": 30.79,
  "longitude": -85.685,
  "location": "-85.685,30.79",
  "location_details": "I would rather not say. If what was my land then i would but it is my uncles place and i have to honor his request in not saying the specific location but our camp site was on ten mile creek, just off highway 2",
  "temperature_high": 76.99,
  "temperature_mid": 69.37,
  "temperature_low": 61.75,
  "dew_point": 56.01,
  "humidity": 0.73,
  "cloud_cover": 0.16,
  "moon_phase": 0.12,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1011.64,
  "summary": "Partly cloudy starting in the afternoon and breezy in the afternoon.",
  "uv_index": 7,
  "visibility": 9.14,
  "wind_bearing": 230,
  "wind_speed": 9
}