{
  "reportId": "21821",
  "title": "Daytime Sighting by Caver West of Lake Monroe",
  "date": "1979-11-01",
  "timestamp": 310262400,
  "observed": "After caving in a local pit off of Popcorn Road in Monroe County I decided to wait on the surface while my two fellow cavers did the next pit. I was sitting in the back of my jeep reading. I saw a silhouette moving south just within the tree line. Thinking this was the land owner I got of my jeep and walked up to the tree line. The jeep was parked in a small grassy clearing used for camping and the two pits were appox 50 feet east of the jeep with the fence and tree line 10 to 20 feet beyond the pits. The trees were bare of cover and it was a bit overcast. I waited at the fence line and I kept an eye on the silhouette moving towards me. I called out once, twice with no reply. The thickness and number of trees and the overcast made it hard to see details of the silhouette. The silhouette moved past me and the only noise I heard was the slight crunching of leaves on the ground. Still not able to make out more then a silhouette and thinking this was the land owner or local, I called out again and waved at the silhouette. It was now approx 50 to 60 from me. A bit confused and thinking that the silhouette did not hear me nor saw me, I moved down the fence line to a small opening cut in the tress for a power line. I stood at the fence waiting, and the silhouette moved into the opening. I called out again and froze. The silhouette also froze and turned its head towards me. We stared at each other for 10 seconds or so. No other interaction took place. I then was able to view the silhouette and make out some detail. The silhouette stood appox 6-7 foot tall, was covered in long dark brown fur/hair, and stood on two legs with a bit of a bend forward. After the brief stare the witness turned its head back and continued to walk back into the trees and I returned to my jeep. Officially I can not say for sure it was a ‘Bigfoot’, only that it was walking up right on two legs, had two arms, a chest, and torso and was covered in long dark brown fur/hair.",
  "classification": "Class A",
  "county": "Monroe",
  "state": "Indiana",
  "latitude": 39.01166,
  "longitude": -86.57665,
  "location": "-86.57665,39.01166",
  "location_details": "",
  "temperature_high": 53.99,
  "temperature_mid": 43.83,
  "temperature_low": 33.67,
  "dew_point": 45.41,
  "humidity": 0.78,
  "cloud_cover": 0.72,
  "moon_phase": 0.41,
  "precip_intensity": 0.0442,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1015.68,
  "summary": "Rain until afternoon.",
  "uv_index": 2,
  "visibility": 8.12,
  "wind_bearing": 237,
  "wind_speed": 7.72
}