{
  "reportId": "36230",
  "title": "Hunter gets investigated while in his blind outside Bagdad",
  "date": "2011-11-20",
  "timestamp": 1321747200,
  "observed": "November 20, 2011 Was deer hunting on the farm behind my house like ever year before. That season I used my hunting blind that I had setup a few days before. It had been raining that morning so I used the 4 wheeler to get back to the blind. I parked it beside the blind and took my stuff in. I poured a cup of coffee and opened a bag of donuts and loaded the gun. I could hear something step over the fence (normal sized person could not do that) this fence is double wide with extra electric wire. Then the foot steps continued to come closer to the blind. The foot steps sounded really heavy. The foot steps came to the side of the blind and stopped. I could hear heavy breathing and then it leaned over the blind . I could see a impression of a nose pushing down on the top of the center of the blind. The blind I have is 6 feet tall, this means he had to be at least 8 feet plus tall. The nose imprint began sniffing and leaning more on the top of the blind. This point I was getting really nervous, so I took the safety off on the gun and said (\"if you are a person you better leave, if your a bigfoot then you better not growl or howl our push any harder on the blind cause I'm gonna start blowing holes in something\". Then the sniffing stopped while I said my little speech, but then started again more aggressively. I told myself to stay calm ,and then the subject stood upward and walked around the blind and then over to the woods. I tried looking out the window but could not see anything.. Scared the holy-**it out of me ..",
  "classification": "Class B",
  "county": "Shelby",
  "state": "Kentucky",
  "latitude": 38.24361,
  "longitude": -85.03827,
  "location": "-85.03827,38.24361",
  "location_details": "Jacksonville,outside of Bagdad, KY in north Shelby county",
  "temperature_high": 58.91,
  "temperature_mid": 55.86,
  "temperature_low": 52.81,
  "dew_point": 54.38,
  "humidity": 0.88,
  "cloud_cover": 0.97,
  "moon_phase": 0.83,
  "precip_intensity": 0.0176,
  "precip_probability": 0.96,
  "precip_type": "rain",
  "pressure": 1020.65,
  "summary": "Rain in the afternoon and evening.",
  "uv_index": 1,
  "visibility": 6.58,
  "wind_bearing": 206,
  "wind_speed": 6.66
}