{
  "reportId": "2657",
  "title": "A tree stump moves closer to a group of young boys",
  "date": "1974-08-15",
  "timestamp": 145756800,
  "observed": "Unfortunately, my sighting is not recent at all. It happened in the late 70's in a town called Flagler Beach on the east coast of Florida. At that time the area was still very rural and undeveloped. Myself and a group of other kids, I think a total of 8,were down a deseted open flat, a small peninsula,primarily used for nesting birds. This is late morning under a clear sky in August I should add.  We were near one of the banks when I \"felt\" something. I look across the water to a hill (approx 200 yds away) covered with course brown grass with a tree stump at the top. Seeing nothing else I went on with whatever we were doing but it occured to me that the \"tree stump\" was very much out of place on that hill. I look again and \"it\" has moved downhill closer to us. Realizing it was much taller and moving I pointed it out to the others, turned to see if they looked, when suddenly everyone bolted. Since the older brothers ran I too took off. About a mile later I finally asked why they ran and they said it moved it's head. To this day I still regret leaving. What description I can give is this: \"it\" was tall, 7 ft maybe. It appeared to covered in long brownish/grey fur and it did indeed stand upright. I call it a bigfoot because I am certain of what it WASN'T. Definitely not a bear and the liklihood of it being a human in a costume is extremely remote. My arguement there is one, Fla in August can be brutal even to the locals, damn near suicide to put on a heavy costume out in the sun. Two, the location. With the exception of the hill all else around was marshland, not very easy to get to. I know because I tried to at another time. Also as I stated it was very remote so the liklihood of a hoax at that time and place just doesn't add up. I cannot give more details of the bigfoot but I can say for myself that I didn't perceive any danger from it. More of a curiosity. As I stated I ran because the older brothers' did, it was their fear that had me running and to my regret that they did. But I will never forget that day, even now I still can see it all very clearly.",
  "classification": "Class A",
  "county": "Flagler",
  "state": "Florida",
  "latitude": 29.47035,
  "longitude": -81.1273,
  "location": "-81.1273,29.47035",
  "location_details": "20 miles north of Daytona Beach on the east coast of Florida",
  "temperature_high": 91.37,
  "temperature_mid": 83.045,
  "temperature_low": 74.72,
  "dew_point": 72.09,
  "humidity": 0.75,
  "cloud_cover": 0.4,
  "moon_phase": 0.92,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.17,
  "summary": "Humid and mostly cloudy throughout the day.",
  "uv_index": 9,
  "visibility": 6.97,
  "wind_bearing": 113,
  "wind_speed": 3.65
}