{
  "id": "702",
  "title": "Group of people witness two Sasquatch run through a clearing",
  "date": "1997-11-10",
  "timestamp": 879120000,
  "observed": "My wife, grandmother and friends wife are the actual witness I'm just typing what they said to me. My buddy and I had left the wife's and grandmother at camp to set out on my evening elk hunt It was about 2:30pm we had been gone for four hours and then returned to camp to rest when the lady's ran to us and told me about what they had saw. Around 4:30pm they were looking down in the clearcut below the helicopter pad we were camped on. when my grandmother said she saw something that might be an elk. when my wife and her friend looked they both couldn't believe what they saw. It was a hairy thing running from the treeline into the clearcut on two legs. It was sunny and clear the creature ran through the clearcut very easily even though there were stumps logs brush and ect. when two dirt bike riders came up a trail that cut through a portion of the clearcut. the creature stopped and ran back to the treeline and the two riders stopped and started to point in the direction of the creature. then the creature ran out again picking a different direction through the clearcut now with a second creature a little smaller than the first. they went through the clearcut faster than any man on two legs could ever go.they then disappeared into the treeline on the other side.this is what i was told. This is not a hoax. the wife's friend is a trained marine like myself and was a nonbeliever until that day and there is no question in there minds they said that was a bigfoot. they had dark shaggy hair like a bears they were on two legs they swung there arms and stood upright and ran upright. i paced the distance to approx. 200yards from were they stood and looked for tracks non were found the ground was dry and hard to much low foot brush. you can contact us this is for real my wife said she would talk about it.",
  "classification": "Class A",
  "county": "Tillamook",
  "state": "Oregon",
  "latitude": 45.59669,
  "longitude": -123.3768,
  "location": "-123.3768,45.59669",
  "location_details": "This sighting was in the Tillamook State Forest in the Browns Camp area. It is about 50 miles west of Portland.",
  "temperature_high": 58.54,
  "temperature_mid": 51.09,
  "temperature_low": 43.64,
  "dew_point": 40.28,
  "humidity": 0.69,
  "cloud_cover": 0.24,
  "moon_phase": 0.36,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1006.1,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 2,
  "visibility": 9.74,
  "wind_bearing": 86,
  "wind_speed": 8.19
}