{
  "reportId": "55236",
  "title": "Former park ranger has possible night sighting near a remote Texas game ranch",
  "date": "2016-07-18",
  "timestamp": 1468800000,
  "observed": "I think I may have seen a Sasquatch near the Montgomery Game Ranch in Jack county last night, slightly before midnight.  A few friends and I were dirt road driving through several very wild and remote parts of our county. We stopped to look and listen. I put my generation one night vision monocular on the edge of a clearing. I noticed a large, black, and roundish shape. I thought it might be a cow but when I focused on it, it stood up slowly on two legs, appeared to be very tall, and took three or four really long, liquid, and smooth steps to get behind a nearby mesquite tree. It appeared to be a huge, man like figure. It appeared to me to be moving slowly to avoid detection, i.e. moving slowly and smoothly with no sudden movements. I tried to zoom in but all I could make out was a huge black shape behind the tree. I was not able to record it and I was the only one in the group who saw it. It's size and the fluidity of its movements are what stuck in my mind the most. It was more coordinated and smoother than even a wild cat. After growing up on a cattle ranch in this part of the country and spending many years as a park ranger, I have seen many wild animals. This was like nothing I have ever seen before. I can't say for sure I saw a Sasquatch but feel strongly that I might have.",
  "classification": "Class B",
  "county": "Jack",
  "state": "Texas",
  "latitude": 33.375,
  "longitude": -98.3,
  "location": "-98.3,33.375",
  "location_details": "Incident occurred near several huge wild game ranches, very remote area.",
  "temperature_high": 95.2,
  "temperature_mid": 85.535,
  "temperature_low": 75.87,
  "dew_point": 68.63,
  "humidity": 0.59,
  "cloud_cover": 0.05,
  "moon_phase": 0.45,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.88,
  "summary": "Clear throughout the day.",
  "uv_index": 11,
  "visibility": 9.84,
  "wind_bearing": 145,
  "wind_speed": 7.56
}