{
  "reportId": "2347",
  "title": "",
  "date": "",
  "observed": "On Aug. 15, 1998, I sent the following E-mail to: ameyer@weber.edu After looking through a couple of Bigfoot web sites, I thought he might be the best one to send it to. Now after looking through your web site, I guess I should have looked a little further. Oh well, FYI here's a copy of my story. Dear Mr Meyer I want to tell you about what happened a very long time ago, 1968. I was living up Ogden canyon, in a house in Wheeler canyon, the second one to be exact. It was fall and there were alot of leaves on the ground. Very late one evening I was sitting in the living room watching TV, my 2 year old son was in the back bedroom asleep. The chair I was sitting in was angled with it's back to the windows. I got up to go into the kitchen to get a drink, when I turned around in the kitchen to walk back into the livingroom I was shocked to see a pair of glowing red eyes staring at me from the window behind my chair through the window. The porch light was also shining through that same window to the left (from my point of view) of the creatures head. All I could see of it was mainly a very dark mass outlined in the window and the eyes which were reflecting the light and seemed to glow red. I stood in the kitchen doorway frozen, I kept trying to tell myself I was seeing things and it wasn't really there. After all, I did enjoy monster movies, even though the show I was watching that night was a love story, I kept trying to convince myself it was just my imagination. I finally turned and put my back against the wall inside the kitchen doorway and told myself that I'd clear my mind and when I turned around again it would not be there. I waited long enough to compose myself and then turned back into the doorway to go into the living room. It didn't work, my visitor was still there! I want you to know that at that time in my life I had never heard of a bigfoot. The only thing in my mind that could look like that was a werewolf and, ofcourse, everyone knows they are only movie myth. I turned around again and walked back to the bedroom where my son was sleeping. I was very shaken and the only thing I could think to do was call the police. I dialed the operator and asked for the police but when they came on the line to talk to me they said because I was up the canyon I needed to talk to the sheriff. I finally got to talk to the sheriff's dept. and I told them I had a prowler. I certainly couldn't say I had a beast of some kind looking in my window. It took them about 30 to 45 minutes to show up at the house. While I waited, I sat in the dark and just listened, expecting to hear the thing crashing through the door or window at any time. I heard several of the windows along the east side of the house rattle \"softly\" and also the back door, as if someone was just testing to be sure they were secure. After that there was nothing but silence and I started to get some courage back before the sheriff showed up. By the time they got there I was back to the living room and waiting for them. They asked for a discription, and I said I couldn't see the person because they were standing on the top step next to the porch light and all I could see was a dark outline of their head and sholders in the window. One of the deputies was about my husbands height, 6'3' and he stood on the top step and the window framed only his head. They commented that my prowler must be fairly tall. There were no tracks to be found when I looked the next day, too many leaves. The porch doorway and steps at that time were built to go right along the house toward the driveway. Several years later when I went back to look at the house, someone had changed the door and stairs to go away from the house and out toward the lawn. It made me wonder if someone else had the same visitor. My husband had laughed at me at the time I told him about what had happened. I took my son and moved out about a week after that. My husband later told me that about a month or so after that he had a strange encouter early one morning. He was up getting ready for work when he heard a racket out in the porch so he went out to chase our cats out and stop the noise. As he walked toward the front door he saw a dark hairy face looking in at him through the little diamond shaped window in the door. He stoped and thought \"Bear\", and he ran into the front bedroom to put on his pants and grab his gun. By the time he got back out, he was alone again. It wasn't until later when he was thinking about it that he realised that it couldn't have been a bear because it's face was up close to the window and a bears snout would not fit close to the window like that. About a year after that, my husband moved to Eugene OR with a friend to work and he sent me a book on bigfoot with a note that said, \"I think you might like to read this, remember your visitor\".. Remember, I'll never forget, I still get the shakes when I think about it and it's been alot of years. One other note I'd like to mention; When we first moved to Wheeler canyon, we did so with another couple and they had 3 horses which they kept in a corral down by the creek. More than once, when I was there alone in the evenings I would hear the horses screeming. I'm not talking just their normal horse neigh or such, I'm talking screeming. I told Bob about it and he said \"Oh don't worry about it, either the mare is picking on one of the boys or they can sense a wild cat up in the clifs\". After my visitor, I think what the horses could sense or smell was not a wild cat. I've told this story to alot of friends and family, but never reported it to anyone involved in the study or tracking of bigfoot before. I hope that you find this of some interest, I picked your address to send it to because of your location and the fact that this took place close to where you are. I now live with my second husband in WA but most of our familys are still in the Ogden area. I don't know how long they keep police report records, especially such minor type reports but maybe they keep them forever. I have no wish for any harm to come to any bigfoot. Thinking back, I know that the one I had the privlege to see ment me no harm. However, at the time, it sure scared the heck out of me.",
  "classification": "Class A",
  "county": "Weber",
  "state": "Utah",
  "location_details": "Wheeler Canyon",
  "summary": ""
}