{
  "id": "27779",
  "title": "",
  "date": "",
  "observed": "in the summer of 2008 i was on a fishing trip to the neosho river. my parents have own'd a cabin there for about 25 years and i enjoy going with them to set limb lines for catfish and rod and reel fishing the shallow rapids. being in my 30's surrounded by my older parents and their friends (some of which have purchased their own cabins on the same grounds over the years when one comes up for sale) i am often asked to pitch in on the chores a little more than is normal because of everyones older age. grass mowing, weed eating, carrying supplies and water up flights of stares, cabin repair, etc., that i often will grab a couple poles, fill a bucket with bait and supplies, and dissapear up river on foot for an entire day to get away from my honey-do list.  on this day i was walking along the stoney river's edge, when i saw the track. i commonly find the usual tracks for animals in our area and am familiar with raccoon, opossum, beaver, badger, armadillo, turkey, deer, occassionally a cow and very rarely other people.  and this track was none of the above. it look'd very very similar to the plaster tracks you see portray'd on television shows about this occurance. i wear a size 12 and the length of the track dwarf'd my own. and was very wide. i had seen my first bear track at that river for the first time a couple months earlier that summer. a small track of a sub adult bear i guess, we do not have bears in this area. but 1 is seen every couple years. i live within 30 minutes of arkansas, oklahom, and missouri. this area is known locally as the 4-state area. and their are bears in arkansas and rarely one will wander this far north. we didnt even have armadillos til a decade ago. and now they're everywhere. wild pigs are now starting to move out of arkansas and into our area. but i have not seen one yet. but i know 1 person that has. anyway, the bear track i had the older people look at a couple months pryor and they concurred that, thats what they were. but because of the distance i was up river from the cabins when i saw the bigfoot track, the distance was too far for the older people to make so i didnt mention it. they are kind of redneck anyway, they probably would have drank a case of beer, grabbed a deer rifle and wanted to go driving around lookin for it as a joke. anyway my story continues, i fish'd all day and headed back down river mid afternoon. that evening after dinner, relaxing from the day of sun, and visiting with family and friends (keeping my thoughts about the track to myself) at approximately 9 pm i gear'd up and went down to the wingwall of the dam right by the cabins and settled in for some night fishing. thats when the flathead really become active. at approximately midnight, as i was sitting there in the dark, i heard a sound starting to cross the shallow summertime river. SPLASH!,..SPLASH!...SPLASH!...SPLASH! i heard this sound approximately 50 times and it was coming across approximately 100 feet from me. the first splash made me curious. fish sometimes slap their tails on top of the water or make a splash while feeding in the shallow rivers edge. i was excited and happy to hear that sound. i love the sounds of the woods at night. by the 4th or 5th splash i realized it was not a fish because they wouldnt splash that many times in a row. by the 10th or so splash i realized something was entering the river andi was curious. deer??  they have to get to the other side just like i do. you gota cross the river somewhere shallow and rapids free. by the 20th splash every hair on my body stood straight up, and my body was crawling out of my skin trying to get away. i was tingleing in the feeling of flight!!  you know the fight or flight reaction. i'm 6foot 5 inches tall and comfortable with nature and in my youth was a bouncer and bartender and a security guard for years and am very comfortable with fighting. i have felt great fear a few times such as in automobile accidents and work hazzards and i am familiar with that emotion and controlling it. i have NEVER felt this sensation before or since. it was pure FLIGHT!.  i had helped for a couple months pryor to this incident help my parents friend, richard, fix up the cabin next door to my parents cabin. and as this weekend was the first time he was officially going to use his new cabin, i decided to sleep that night in his extra bedroom instead of sleeping on the couch inside my parents cabin. when i heard those splashes i stood straight up, left my poles and gear and drink and cigarettes and everything and walked as briskly as i could straight to richards cabin, up the steps, in the door, straight to my room, in the bed and under the covers. and i forced myself to go to sleep immediately to just GET AWAY. at 5a.m. i met my mother at her truck because we both worked at a local cafe,her waitressing, i a dishwasher, and it was a 25 mile trip to pittsburg kansas where we live and work. we left for home before sunup so we could shower before work with plans to return to the cabins in the afternoon after work. we left everyone asleep as we drove for town. on the trip, my mother told me of something that happened to her while she was sitting on the cabins deck late the night before. she told me she was sitting there, stareing down at the glow of the bonfire that i had built earlier in the day, enjoying herself, when all of a sudden a stink filled the air outside. she said jason, it smelled like death! it didnt smell like no god damn'd skunk, or rotten fish guts, it smelled like death!!  she said it stunk so bad it gagged me and i had to go inside to get away from it!!  she then asked me if that night i had come over from richards cabin to her's lookin for a snack or sumthin?? i said no, why? she said she heard something on the stairs coming up to the cabin, and then shortly later she heard something moving around outside down below, and then she felt the cabin rocking like someone was bashing themselves against thy pylons! she said it rock'd so hard it knock'd the vcr off of the television and the vcr tape rack that hold all of their vcr movies fell over and tapes scattered everywhere. her story freaked me out and i told her about the track i found the day before and we decided that it was a bigfoot and agreed to just keep the story to ourselves.",
  "classification": "Class B",
  "county": "Neosho",
  "state": "Kansas",
  "location_details": "The cabins next to the neosho river which we use for fishing approximately 7-9 months of the year.  Specific directions omitted upon the submitters' request.",
  "summary": ""
}