{
  "id": "7860",
  "title": "Hunter has daytime sighting near Dos Rios",
  "date": "1974-09-01",
  "timestamp": 147225600,
  "observed": "I was deer hunting in Mendocino County in Northern California near Dos Rios close by to Covelo where there have been continual sightings. I was walking down canyon and noticed a human walking about 1300 yards below me, so I checked it out.  The human did not have any clothes on, and was not carrying a rifle, and was coming my way up canyon.  I watched the bigfoot as he came nearer, to try and figure out what it was.  As the bigfoot became almost even with me across canyon, it disappeared into the manzanita, about 80 yards away.  I then heard a jeep on the above dirt road. By the time I looked back to where the bigfoot was, he already had come back out of the brush and was walking uphill. He was about 7' tall and had a slender body like a basketball player with big strong shoulders, and a real skinny waist. The legs were really muscular, and strong.  The arms were long, as were the fingernails, and fingers. He had no clothes on whatsoever, and the bigfoot’s body was covered with about 2\" of hair with a few bald spots showing skin.  Its hair was black, and cut off about even with the upper neck. Its forehead was gunpowder gray with the temple area being purple red down the side of the face partway then dark tan.  The face was flat with a flat nose.  It walked hunched over with his arms at a dead hang as he walked. After I made this sighting I went back the following weekend to look around some more for what I had seen. I walked up the same trail bigfoot walked up, and found a steer skull laying in the trail.  I picked the skull up and looked at it, and it was completely clean underneath without a cobweb or a speck of dirt. I sat it down exactly how I found.  I went back two weeks later and the skull was gone.  Maybe it was a migration route, and others were following.",
  "classification": "Class A",
  "county": "Mendocino",
  "state": "California",
  "latitude": 39.68833,
  "longitude": -123.4817,
  "location": "-123.4817,39.68833",
  "location_details": "Baxter Ranch",
  "temperature_high": 87.78,
  "temperature_mid": 73.335,
  "temperature_low": 58.89,
  "dew_point": 53.63,
  "humidity": 0.57,
  "cloud_cover": 0.26,
  "moon_phase": 0.49,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1010.15,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 7,
  "visibility": 9.07,
  "wind_bearing": 226,
  "wind_speed": 0.83
}