{
  "reportId": "4236",
  "title": "Man recalls a possible encounter as a teen at Fort Gordon",
  "date": "1965-06-15",
  "timestamp": -143510400,
  "observed": "The year was 1965 while my father a military NCO Basic Training Instructor, was stationed at Ft. Gordon Georgia.  We were living on the base at the NCO old housing area.  There had recently been built a new housing area but we lived in the old Army barracks converted to housing where four families were accommodated to live in a barracks of four apartments.  There were more barracks converted to housing in the same area and woods to the left of the housing that led to some old infantry fields no longer in use of dense pine trees.  Near these woods, there were two barracks of Military Police units. One day, the girl from the apartment below informed me that her little brother would tell her that a big man would look through their window at night.  The little boy would observe the man looking into the room.  To the both of us, this seemed amazing since the window bottom ledge of the barracks where we lived was about 7 or 8 ft. from the ground.  It would be impossible for any normal size human being to look into the window from that height.  I paid no attention to it and soon forgot the story. During the summer vacations, I would enjoy venturing into the woods next to the housing area with my friends.  We would go downwind and get as close to deer as possible just to take a photo or observe the animals without disturbing them.  I remember one morning my friends were not around so I decided to go and venture the woods by myself.  As I walked down the slope into the woods and began walking on level ground just about 200 hundred yards at the edge of the woods, I noticed that a bulldozer had just scraped the land next to the Officers Housing area.  The Army was going to make a new housing for the Officers in that part of the woods.  I also noticed on the red clay of the ground some big footsteps that came from the Officers Housing into the edge of the woods where I was walking into. The last footsteps that lead into the woods from the red clay were so enormous that I began to observe them.  I noticed they were of a person walking barefoot, at least 18 inches in length and about 5 inches wide.  The person or whatever it was that had made the prints had a total of 5 toes.  I had never heard of Bigfoot and just thought it was some big person walking around barefoot enjoying the mud (red Clay). I then went into one of the many trails that led into the woods and after a few minutes, something seemed not to be right.  I did not hear birds nor did I see any squirrels.  Everything seemed to be silenced.  I could only hear the wind blowing and the trees moving in the wind but no sign of life in the area.  This began to give me what you call the goose bumps as if someone or something was watching all my moves.  I then sat on a big rock nearby and observed everthing around me and at the same time kept my ears opened.  Just a few moments went by when I started to hear some heavy bi-pedal footsteps in the grass and leaves near me at about 50 ft. of distance from where I sat.  The grass was very high and there was lots of brush that did not allow me to see more than 20 ft. into the brush area.  I guess you can say that my human nature or animal instinct just took over me, telling me to get out from there as fast as possible.  I did not waste any time, but controlled my self not to go into panic. I steadily began to walk out of the woods and as I did, I could hear the heavy bi-pedal footsteps stalking me from the left, deeper in the woods from where I was at.  If I stopped walking, it would stop walking.  If I ran a little, it would run a little.  I also became aware that whatever it was, would stop walking just a few seconds after I did.  In other words, it would stop and begin to walk as I did.  As I got closer to the edge of the woods at the red clay area, whatever was in the woods began to run very fast coming towards me.  I then thought it was time to run like hell.  I picked up a running speed that surprised me.  When I finally got back to the housing area, I was exhausted trying to get my breath back again and sat on the porch in front of my home.  A friend that lived across the street had observed me and asked what had scared me.  He said he saw me running out of the woods as if my butt was on fire.  This got me a little upset and when I finally got all my breath back, I explained the ordeal to him.  He just stood there and laughed at me.  Since he did not believe me, I made him a challenge to go into the woods with me where I had heard the footsteps.  He accepted the challenge and we both returned to the area.  While walking down the path near the Officers Housing area, I showed him the footprints in the red clay.  He observed them leading into the woods and said to me that the prints must be those of the Bigfoot monster.  I had never heard of it and told him monsters don't exist, it must be some big hillbilly or hobo person living in the area that does not want us to disturb him.  We both went into the same trail I had went into before and sat on the same rock.  Shortly after, the same weird sensation got over us.  There was a total silence and only the wind and trees moving in the breeze could be heard.  Suddenly, the heavy bi-pedal footsteps once again began to stalk us in the brush as it did when I was by myself.  I told my friend to walk a little ways and then to stop.  As we stopped walking, whatever was stalking us would also stop.  When I looked at my friend, he seemed to have changed in skin color to almost a tomato red.  I knew he was more afraid than I was at the moment.  I then told my friend to stop once again and listen to our stalker getting closer.  As we stopped, heavy footsteps began to run towards us.  We could hear the brush breaking and moving.  When I turned around to tell my friend that it was time to start running, he had already begun his run and had about a 40 ft. lead on me.  I did not waste time to look back and ran as close as I could to my friend.  When we got back to the housing and sat on my porch trying to get our breaths back, he said he had seen something big that moved in the brush.  He was not certain what it was. To date, I know it was the Bigfoot creature because of the footprints I had observed earlier in the red clay.  I did not smell anything peculiar because we were down wind from it.  We did not hear anything except maybe a heavy breathing if I could remember correctly and the brush and grass moving about as it came towards us.  I will never forget the experience and because of it, I am especially interested in Bigfoot.",
  "classification": "Class B",
  "county": "Richmond",
  "state": "Georgia",
  "latitude": 33.4119,
  "longitude": -82.13665,
  "location": "-82.13665,33.4119",
  "location_details": "The wooded area adjacent to the new NCO military Housing and next to the Officers housing just down a slope area. This was inside the Ft. Gordon Military Base in 1965.",
  "temperature_high": 76,
  "temperature_mid": 69,
  "temperature_low": 62,
  "dew_point": 67.48,
  "humidity": 0.89,
  "cloud_cover": 0.99,
  "moon_phase": 0.55,
  "precip_intensity": 0.0218,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1011.74,
  "summary": "Overcast throughout the day.",
  "uv_index": 7,
  "visibility": 7.94,
  "wind_bearing": 117,
  "wind_speed": 3.5
}