{
  "reportId": "3335",
  "title": "Deer hunter witnesses a large, gorilla like animal",
  "date": "1982-10-01",
  "timestamp": 402278400,
  "observed": "I wanted to let you know about a sighting of Bigfoot I had in North Carolina. It happened about 1982, I was about 17 at the time of the sighting. It was in the fall, around October. First of all I should start by letting you Know I am what you would call a city boy. Scared and out of place in the woods. A friend of mine invited me to go Deer hunting with his father and him on a large parcel of private property they owned in North Carolina. I'm willing to try  anything, so I went. This Property was set back away from the closest road about a 1/2 mile on foot, before you even got to the cabins they owned. These cabins were on stilts, like a beach house about 10 foot high, with stairs. For what reason I have no idea although we were next to a small inland waterway. At about 5am in the morning we proceeded to go hunting, my friends taking me to my deer stand and moving on to thiers. This deer stand was about 10 feet high in a tree. I did see many deer and a black bear that day, but I didn't have the heart to shoot them. I guess at about 9 am My sighting began with a bad smell. It smelled worse than a dog that had been playing in a sewer.  Then I heard it before I saw it, snapping twigs as it walked, at first I thought it was my friend and his dad, come to rescue me from this ordeal. I only saw it from the waist up, from a distance of about 50 yards. And if It knew I was there, It didn't care. It stood in one spot for a good 5 minutes eating leaves, so I got a good look at it. Having seen a bear earlier that day there is ABSOLUTELY NO WAY this could be a case of mistaken identity. This creature had hands like a human, that plucked the leaves it was eating and it looked very fussy about the ones it wanted. They looked dark black in color and relatively hairless except the back of the hand was hairy. It looked to be about 8 foot tall, and just unbelievably massive in the chest and shoulder areas. Its fur was very dark black in color. I only caught a glimpses of its face, as its back was to me, and it looked hairy except around the eyes. The neck was short and stubby with a kind of furry ridge that ran up the back of the neck, to the top of what looked like a slightly pointed head, that sloped down to the  forehead, like a gorilla I saw in the DC zoo. When I lost sight of it I could still hear it crunch sticks and leaves ,as it walked on its way for about 5 more minutes. Needless to say I was so scared I almost Peed myself waiting quietly for my friends to come save me. When they arrived, I told them the story, and of coarse they thought it was a bear. I haven't told this story to many people, because of the ridicule i received from the \"manly\" men of the woods that day.",
  "classification": "Class A",
  "county": "Pasquotank",
  "state": "North Carolina",
  "latitude": 36.3715,
  "longitude": -76.29115,
  "location": "-76.29115,36.3715",
  "location_details": "Pasquatank County NC and the property was on/near the Pasquatank River, near Elizabeth City and the Great Dismal Swamp.",
  "temperature_high": 72.29,
  "temperature_mid": 66.105,
  "temperature_low": 59.92,
  "dew_point": 57.61,
  "humidity": 0.77,
  "cloud_cover": 0.71,
  "moon_phase": 0.45,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.2,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 5.19,
  "wind_bearing": 354,
  "wind_speed": 5.65
}