{
  "reportId": "2886",
  "title": "A Wildlife Biologist observes a large upright walking animal near Pinecrest",
  "date": "1993-06-15",
  "timestamp": 740102400,
  "observed": "The following is an account of the events of the day while conducting surveys for amphibians downstream of Bloomer Lake. The account may be somewhat fragmented in presentation, as I want to provide a narrative that portrays the events of the day. Additionally, I prefer to provide a narrative and let people draw there own conclusions. First, I recall finding the remains of a fawn in the meadow I wa surveying. Nothing unusual about that, in-and-of-itself...ties-in later. As I continued to conduct my survey, perhaps thirty minutes or so afterwards, I noticed movement off to my right. What I saw was what appeared to be an animal covered with black, semi-long hair (two to three inches, to guess), walking upright (fully) with a gape somewhat like the current hominids; and approximately five to six feet in height and weighing one hundred seventy-five to two hundred twenty-five pounds.  I saw something move for two or three steps.  It did not appear to go anywhere (but just moved) but of sight.  It did not look at me or react to my viewing, it just simply appeared and then was gone. To some extent I was not really paying attention to my surroundings, as I was focused on my work; but was enjoying the surroundings in that field sort of way.  I recall thinking that that looked like an upright creature walking through the woods.  I tried to repeat my last movements, to see if what I saw was a play on light and shadows.  I was not able to re-create any likeness of what I had seen - the light and shadow of the forest did not seem to be the source of my observation. I did not hear anything.  Either before, during, or after, in regards to the sounds that one might hear if someone were walking in the woods stepping on branches or simply rustling the ground.  I did not take an active interest or pursuit, as I was uncertain of what I think I really saw;  I am skeptical by constitution; not only for mythologies, but in general. Although I did play the event in my mind while I finished my survey.  And occasionally looked in the general vicinity of the area of where I saw the animal-creature-mythological being.  I finished my survey and left the area. While I was returning upstream, approximately one hundred meters from the meadow, I came across an exhausted buck - two or three year old lying on the ground near the creek.  I was able to approach and touch the deer.  I clearly recall brushing flies off his head and sitting next to him for a couple of minutes and thinking this is pretty cool! I was courious about the deer and did think about what I had seen in the meadow. I then proceeded upstream again.  Approximately one hundred fifty meters from the buck I came across a mass of tissue, which looked to me like an aborted fetus.  Upon further investigation, I discovered that it was the entrails of an animal.  Very fresh.  I then looked behind me a saw a freshly killed doe.  Her eyes were still clear and there were no flies or maggots on or in the carcass.  As I examined the doe I could find no sign of struggle. I was unable to locate any apparent method of kill by another animal; thinking of a cougar, which usually will bite at the base of the skull or that general area.  I found no such evidence. The carcass was left fully in the open.  What I did notice was that the right leg had been cleanly ripped off from the main body to include a couple of ribs. There was no blood anywhere.  I looked around as my in-the-woods instincts were quite active. There was that six sense of a presence.  I spent awhile running all of the pieces through my head and thought that this was pretty cool and funky.  I then continued to hike out to Bloomer Lake, taking the experience with me. ",
  "classification": "Class A",
  "county": "Tuolumne",
  "state": "California",
  "latitude": 38.26661,
  "longitude": -119.8633,
  "location": "-119.8633,38.26661",
  "location_details": "Upstream from Bloomer Lake.",
  "temperature_high": 82.19,
  "temperature_mid": 70.64,
  "temperature_low": 59.09,
  "dew_point": 46.33,
  "humidity": 0.45,
  "cloud_cover": 0.04,
  "moon_phase": 0.86,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1011.97,
  "summary": "Clear throughout the day.",
  "uv_index": 14,
  "visibility": 9.71,
  "wind_bearing": 266,
  "wind_speed": 4.06
}