{
  "id": "26962",
  "title": "Childhood face to face encounter at dusk in the river bottoms of Bootheel",
  "date": "1961-10-15",
  "timestamp": -259200000,
  "observed": "In the fall of the year 1961-1962 I was out behind our house in the field. It was just before dark I was throwing dirt clods up in the air in front of bats flying around and they would chase it till it would almost hit the ground. My dog was with me and it was right at dark. Now he had went over to a barn that was no longer used and had tall weeds growing all around it. I had noticed that he was going back and forth along the weeds and then started to inch his way in then. I heard him starting to bark very fearfully. Then it turned into the noise he makes when he is very scared. I stopped what I was doing and started walking toward over to were he was. He came running out toward me very fast and then I saw why. Right behind him was the biggest thing I have ever saw. I stopped in my tracks. Then he saw me and did the same. We were looking right at each other, eye to eye, no more then ten feet from each other. My dog stopped right behind me and began his barking again at this very tall thing that had hair from toe to head. It was A very dark brown I could see his very huge hands and long fingers. I turned very fast and ran to the house and told my folks they did not belive a word of it. Since then I've only told very few friends and my family. We lived in the boothill of Mo. Their was nothing around us but farmland water ways and deep woods. Not any houses were located to the south or the west of us and only one to the north for many miles.",
  "classification": "Class A",
  "county": "Pemiscot",
  "state": "Missouri",
  "latitude": 36.06055,
  "longitude": -89.98725,
  "location": "-89.98725,36.06055",
  "location_details": "Two miles west of sunrise corner just acress the railroad tracks",
  "temperature_high": 67.85,
  "temperature_mid": 53.895,
  "temperature_low": 39.94,
  "dew_point": 31.74,
  "humidity": 0.51,
  "cloud_cover": 0.01,
  "moon_phase": 0.2,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1027.94,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 10,
  "wind_bearing": 341,
  "wind_speed": 1.85
}