{
  "reportId": "4156",
  "title": "Loud, high-pitched, close-range screams directed at bowhunters",
  "date": "1980-09-15",
  "timestamp": 337824000,
  "observed": "My dad and I used to bowhunt deer on a lease that was in Rusk County in East Texas.One end of the property was bordered by the Angelina River.This was good deer habitat as there was abundant food and lots of thick cover.The rest of the hunting lease was covered with a thick forest of pine trees. Late one September afternoon we were scouting the river bottom area for good locations for tree stands. There was an eerie stillness in the bottomland that day, and I had an unsettling feeling that I was being watched. A lot of people have said that they \"felt as if they were being watched,\" but that's probably the best way to describe this vague feeling of anxiety. It was at dusk when we heard it: a blood curdling scream that echoed across the river bottom. It was long in duration and high-pitched and very loud. It did this three times.The sound came from the edge of the woods which bordered the bottomland area about 150 yards away, and it was directed at us--whatever was making the sound was doing so for our \"benefit.\" It was clear that whatever was making the noise wanted us to leave the area. By this time darkness was beginning to fall and the woods were very dark. We could not see what was making the sound. I looked at my dad and I could tell that he was a little bit startled by what we were hearing. This spooked me even more, as my dad is an experienced outdoorsman that doesn't scare easily.  At this point, we decided to call it a day and headed back to camp. At the time this happened, I was 17 years old.  I have hunted in East Texas all of my life and I have never heard anything make a sound like this. We hunted there the rest of the season and did not have any other strange encounters. I never asked the land owner if he had ever heard such a thing. Like many others who post here, I didn't want to be thought of as \"loco\" either, so I never brought up the subject.",
  "classification": "Class C",
  "county": "Rusk",
  "state": "Texas",
  "latitude": 31.87791,
  "longitude": -94.89986,
  "location": "-94.89986,31.87791",
  "location_details": "6 miles East of Recklaw off Highway 84 in the Angelina River bottom",
  "temperature_high": 99.92,
  "temperature_mid": 86.86,
  "temperature_low": 73.8,
  "dew_point": 66.04,
  "humidity": 0.57,
  "cloud_cover": 0.15,
  "moon_phase": 0.19,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1012.94,
  "summary": "Partly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 7,
  "visibility": 6.4,
  "wind_bearing": 261,
  "wind_speed": 2.41
}