{
  "reportId": "22910",
  "title": "Witness has unusual experience in area of the Great Dismal Swamp",
  "date": "2008-01-12",
  "timestamp": 1200096000,
  "observed": "My wife and I were walking down the Great Dismal Trail which is the old Route 17 before they made a 4 lane version between Chesapeake VA and the North Carolina border. We had walked approximately 1 mile down the road and were sitting at one of the benches they put along the way. It was quiet and cool out, around 50 degrees. We started hearing what sounded like someone walking parallel to the canal on the other side. We heard the typical crunching sounds of leaves and twigs snapping. These sounded like the footsteps of a man (as in 2 legged). They started to our right as we faced the canal and in the span of about 5 minutes ended up being in front of us. Once the were near our center, we started hearing steps coming from the left side. We continued to listen as they seemed to be intercepting each other. A couple minutes later we heard what sounded like chattering or popping sounds from the center point and then the same sounds coming from our left. My wife and I were somewhat spooked at this point as we've never heard those sorts of sounds before. I was carrying a small, thick pine branch which I hit against a mile marker post a couple times to try to produce some sort of a response. About 10-15 seconds later we heard a similar sound come from the area of the footsteps but it seemed like it was deeper in the woods. The steps continued and it sounded like it was about to pop out on the other side of the canal. The canal is approximately 40-50 feet across and very deep at that point and the brush on the other side was essentially a wall as it's so dense. We never did see anything but I decided it was time to leave. My wife was hesitant as she wanted to see what it was. We headed back to the gate of the trail and there was a park ranger sitting in his vehicle waiting to close the gates (the trail closes at sunset which is 5:00pm at this time of the year). There's frequent blackbear sightings in this area so I asked the guy how bears typically sound in the wild. I told him about the chattering and asked if they could do that but he didn't think they produced that sort of sound. We talked a bit longer and started towards the car. About 20 feet from the car my wife and I heard a loud but short scream coming from the direction of the swamp. The best we can describe it is a cross between a woop and a woman's scream. My wife thought it was my cars alarm sounding but I said it doesn't make that sound when unlocking the door. I have absolutely no idea what we heard but it was completely unlike anything she or I had heard before.",
  "classification": "Class B",
  "county": "Chesapeake City",
  "state": "Virginia",
  "latitude": 36.6765,
  "longitude": -76.364,
  "location": "-76.364,36.6765",
  "location_details": "I don't care if it's posted online, I just don't want to be named or included in any of this. Location is off of Route 17 Business towards the end. The entrance to the Dismal Swamp Trail is located on Rt 17 Business.",
  "temperature_high": 53.2,
  "temperature_mid": 46.865,
  "temperature_low": 40.53,
  "dew_point": 39.32,
  "humidity": 0.67,
  "cloud_cover": 0.63,
  "moon_phase": 0.14,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.34,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 1,
  "visibility": 9.48,
  "wind_bearing": 22,
  "wind_speed": 8.48
}