{
  "reportId": "15374",
  "title": "Possible vocalizations outside of Elberfeld, Indiana",
  "date": "2006-07-02",
  "timestamp": 1151798400,
  "observed": "Some neighbors and I went four wheeling on our dirt bikes and quads. It was about 6:30 PM when we left. About 9:30 PM we stopped to repair a chain on one of the bikes. We were all gathered around his bike when we all heard a moan that sounded like a cross between a tornado warning siren and wolf howl. We all froze while we listened to this thing moan about 5 or 6 times. The lead rider in our group grabbed his rifle out of his case. He hikes out into these woods all the time and I've never seen him grab a weapon to defend himself against anything in these woods. After the moans subsided we waited frozen there for about 30 seconds when we heard about 6 knocks like someone hitting their knuckles against a tree. We were all frozen stiff in fear. Nobody made any movements. After we heard the knocks we started hearing something run through the woods. It sounded like it was running really fast. As soon as we heard this we abandoned the bike and jumped on our vehicles while Mark rode on the back of my quad on the way back. We went back to that spot the next day around noon and the bike was not on the trail where we left it. It was about 5 ft off the trail into the brush, as if it had been tossed there. We never found any footprints or anything of that sort but I am positive after hearing the same noises on the sound clips on this site that what we encountered was a sasquatch.",
  "classification": "Class B",
  "county": "Warrick",
  "state": "Indiana",
  "latitude": 38.1579,
  "longitude": -87.41805,
  "location": "-87.41805,38.1579",
  "location_details": "Take I-64 to wheatonville rd and cross on to North road, you see a bunch of trucks parked on the side of the road, the incident happened about 5 miles into the woods.",
  "temperature_high": 94.17,
  "temperature_mid": 82.74,
  "temperature_low": 71.31,
  "dew_point": 66.22,
  "humidity": 0.61,
  "cloud_cover": 0.03,
  "moon_phase": 0.22,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.33,
  "summary": "Clear throughout the day.",
  "uv_index": 11,
  "visibility": 9.48,
  "wind_bearing": 226,
  "wind_speed": 6.51
}