{
  "reportId": "8450",
  "title": "Property owners hear loud vocalizations in early morning and have a possible sighting near Clearcreek Metro Park",
  "date": "2004-04-03",
  "timestamp": 1080950400,
  "observed": "About a couple years ago my dad and I heard this sound which sounded like a women screaming like she was getting raped or something. After that day we started to hear it more often about three times a summer. Well, three days ago, I had a bunch of my friends come over and we were going to try and get a picture of whatever was making the sounds. When three of my friends went ahead of the group a ways like they were going to try and scare us the rest of the group turned around and went back to the house and decided to wait and listen for it before we went looking for it because it was pretty cold and it was supposed to start raining. Well, the three kids who went ahead to try to scare us didn't know that we had turned back and so they waited crouched in the woods waiting for us. As they were waiting they heard something behind them in an old cabin that has fallen in and starting to decay. When they shined the flashlight behind them at the object, they saw the silhouette of an enormous object. My one friend, who is about 6 ft. 5 in. tall, said the objet was just as tall as he was, at least. They didn't get a very good look at it, though, because as soon as they saw it they turned and ran about a quarter mile back to the house as fast as they could. I knew they saw something because I could see in there eyes how scared they were.",
  "classification": "Class B",
  "county": "Fairfield",
  "state": "Ohio",
  "latitude": 39.5246,
  "longitude": -82.6353,
  "location": "-82.6353,39.5246",
  "location_details": "The sighting occured down the road from Clearcreek Metro Park, just off of State Route 33.",
  "temperature_high": 58.58,
  "temperature_mid": 47.03,
  "temperature_low": 35.48,
  "dew_point": 34.91,
  "humidity": 0.67,
  "cloud_cover": 0.63,
  "moon_phase": 0.43,
  "precip_intensity": 0.0003,
  "precip_probability": 0.34,
  "precip_type": "rain",
  "pressure": 1009.18,
  "summary": "Mostly cloudy throughout the day and breezy starting in the evening.",
  "uv_index": 6,
  "visibility": 8.97,
  "wind_bearing": 289,
  "wind_speed": 10.61
}