{
  "reportId": "1830",
  "title": "Two separate sighting reports of a creature",
  "date": "1975-08-25",
  "timestamp": 178156800,
  "observed": "I myself have never seen a bigfoot. But, I have two reports that were told to me. These both occurred in Blount county, Alabama. The first sighting was in 1975 about 2 miles from the Chamblee Mill bridge. A friend of mine had just dropped me off after football practice. He was driving home on the road that crosses the bridge, this area is located in a triangle between Blountsville, Hanceville & Holly Pond. He saw a large black or brown hairy figure stepping out of the woods as he was coming around a curve. He was startled and almost wrecked his car. His story later appeared in the Cullman Times, a paper in Cullman, Alabama. He later told me that he never was more affraid in his life. He looked it right in the eye and it stepped back in the woods. The location he saw it at is about a mile from my childhood home. The second sighting occurred on Skyball mountain some 2-3 miles from this sighting. My brother was driving alone on the road that crosses Skyball mountain. The area has very few homes on the mountain. There are streches of the road that are 2-3 miles before a house is located. The time was late evening around 11 pm or later in August 1991 or 1992. He had just topped a small rise on the road and began to smell a strong odor (he had his window down). He looked to the right of the road and saw a large dark figure walking through the tall weeds that were beside the road. He first thought it was a horse but it stepped out on the road. He described it as 8 feet tall, large, hairy, no neck, coal black eyes and covered in dark  brown or black hair. He said it looked dead at him and he stopped his car. He thought about putting car in reverse but instead just sat there looking at it. He said it must of stood there a minute or longer. It smelled awful, it had long arms and large dark hair covered hands. It just walked off in to the woods on the other side of the road and he drove home.",
  "classification": "Class C",
  "county": "Blount",
  "state": "Alabama",
  "latitude": 34.1288,
  "longitude": -86.68,
  "location": "-86.68,34.1288",
  "location_details": "These both occurred in Blount county, Alabama. The first sighting was in 1975 about 2 miles from the Chamblee Mill bridge.",
  "temperature_high": 90.42,
  "temperature_mid": 81.475,
  "temperature_low": 72.53,
  "dew_point": 72.36,
  "humidity": 0.75,
  "cloud_cover": 0.23,
  "moon_phase": 0.62,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.77,
  "summary": "Humid throughout the day and partly cloudy until evening.",
  "uv_index": 7,
  "visibility": 9.09,
  "wind_bearing": 88,
  "wind_speed": 5.15
}