{
  "reportId": "7003",
  "title": "Truck driver has brief roadside sighting",
  "date": "1978-06-21",
  "timestamp": 267235200,
  "observed": "I was headed south in a delivery truck when my eye caught movement on the right side of the road maybe 200 yards ahead. The creature had been standing motionless at the side of the road. It was facing the road then it spun around counter clockwise and in less than 3 steps was gone back into the timber with its arms swinging as it stepped. I saw him for 2.5 seconds. It was solid black or dark brown. It was very large with huge shoulders. I think he was standing there looking to see if it was safe to cross, then turned around and retreated because of the approaching vehicles. I thought what the heck was that? Did I see what I just saw? It moved like a large man but it is a solid color. I saw one color. It didn’t have any clothes on. You just start trying to rationalize in your head what you just witnessed. Did I just see a sasquatch? It was hard to believe I seen one. Still is. Sometime before this - maybe 6 months - on the TV news was a story of a tour bus driver up in British Columbia, Canada that had to hit the skids to keep from hitting a Bigfoot that crossed the road in front of him. He quickly opened the door and chased it into the woods. Just inside the woods he ran into it or came face to face with it and it like screamed at him or something. He had to quickly turn tale and run. This was fresh in my mind when I came upon the spot where the creature retreated back into the woods. I slowed my truck down to a slow roll but there was no way I was going to stop and get out to look for tracks or to see if I could see it up close and personal. I wasn’t going to leave the security of my truck. I looked into the timber best I could as I passed but I didn’t see him. There was a sedan roughly 100 hundred yards in front of me, half way between me and the creature. No other cars on the stretch. The tail lights never came on when the creature moved and they didn’t come on when the car approached the spot in the road where the creature stood. It didn't appear to slow at all. I thought how can it be that the car didn’t see it? They were twice as close to it as I was and the thing was huge. The only thing I can guess is the driver of the car looked down to mess with something on his dashboard and took his eyes off the road for the 2 to 2.5 seconds it took the creature to turn and retreat. I hope they did see it and that they submit a report, too. My next delivery was to an elderly man on Moody Rd. just off of Kirkpatrick Rd. at Humptulips. I was still pretty excited about what I had just seen no more than a half hour before and when I told him what I saw he looked at my like I was on drugs. That was my last stop so when I got back to the warehouse I told my boss Darrell Winters and a coworker Larry Trader what I had just seen. They had a good time laughing at me. That’s ok, I know what I saw. If I didn’t see it with my own eyes I would be a skeptic too I guess.",
  "classification": "Class A",
  "county": "Grays Harbor",
  "state": "Washington",
  "latitude": 47.4259,
  "longitude": -123.8763,
  "location": "-123.8763,47.4259",
  "location_details": "between Lake Quinault and Neilton on Hwy 101.",
  "temperature_high": 63.75,
  "temperature_mid": 58.695,
  "temperature_low": 53.64,
  "dew_point": 52.26,
  "humidity": 0.8,
  "cloud_cover": 0.74,
  "moon_phase": 0.54,
  "precip_intensity": 0.0005,
  "precip_probability": 0.54,
  "precip_type": "rain",
  "pressure": 1017.77,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 8.49,
  "wind_bearing": 241,
  "wind_speed": 7.38
}