{
  "reportId": "20011",
  "title": "Hunters experience powerfull knocks on camper and hear vocalizations outside Jicarilla Indian Reservation",
  "date": "1982-01-11",
  "timestamp": 379555200,
  "observed": "My encounter with ???????? The area and time: My encounter occurred during the November rifle deer hunt of 1982.  I was 14 years old, hunting deer with my father, grandfather, neighbor, and his son (same age as me).  The area we were hunting is called Mud Springs in unit 5A.  It is approximately 20 miles NW of Lindrith NM.  The area we hunted is bordered on 3 sides by the Jicarilla Indian reservation. The terrain of the area is a long cliff bluff on the West that leads down to several hills, knolls, and small canyons that dump out into big open flat lands to the East and North.  There are several deep arroyos in the flat areas (10 to 20 ft deep) that are not visible from the dirt roads that access the area. The Eastern border of our hunting area is a group of gradual slopping mountains.  The best way for me to describe the area is like a huge box canyon (2 miles wide, 5 miles long) with the cliff bluff as the Eastern border, and the gradual mountains as the Western border.  The flats dump out and slope downward to the North. There is pretty much only one way in; a dirt road that comes in from the highway (595) from the Northeast.  There are several natural gas pumps (look like oil wells) that run 24/7, and a quiet “thump, thump” can be heard pretty much any where you are on the flats from the pumps. The vegetation consists of Sage brush (4 to 5 feet tall) on the flats, juniper trees on the hills and knolls, to Ponderosas on the top of the cliff and mountain tops.  We have seen deer, elk, bear, coyotes, squirrels, rabbits, and a few mountain lions in the area.  My father and Grandfather hunted the area since the late 60’s. The story: (forgive the over-explaining, trying to get all important details down) It was late afternoon, my Grandfather and I returned to the camper by truck from hunting a nearby knoll that over-looked a water hole.  The camper (in-bed cab over camper) was parked in an opening on the Southern end of the box canyon with the cliffs to the West of it. The camper/truck was in a spot where the nearest trees were 60 to 80 feet away on the North, West, and South sides of camp, The East side of camp faced the flats and the road.  We were back a bit early (we usually stayed out till dark) because we had not seen a thing all day or the day before.  We did not expect my father, neighbor, or his son back until after dark.  It was cold (November), so my grandfather and I stayed inside the camper. About a half hour after arriving, my grandfather started dinner so it would be ready when everyone else got back.  Important note:  My neighbor and his son had their own camper they were staying in parked perpendicular to ours.  The back doors faced the center of camp where the fire pit was.  My grandfather’s truck was parked hood to hood with my dad’s which had the camper on it.  The tailgate of my grandfather’s truck was facing the flats to the NE. and the camper’s back door was facing SW.  The hood of my neighbor’s truck was facing SE. (I wish I could submit a diagram of the scenario). Right around dusk there was a loud bang on the side of the camper, I thought it was my dad, so I opened the back door of the camper and stepped down (I was young, and excited, hoping someone had seen or shot a deer).  There was no one around.  I was not scared, but thought my dad or neighbor’s son was messing around with us.  I walked around all of the trucks, thinking he or they were hiding, not the case.  We never took truck or camper keys out in the field hunting and kept them locked-up while we were gone.  We hid the keys under a rock so whoever got back to camp first was able to get into the campers or truck.  My neighbor’s camper was still locked-up.  I did not get the keys and check if they were inside, just assumed they were not.  I went back inside our camper; my grandfather (busy cooking hamburger helper) asked where they were.  I told him I didn’t know.  He squeezed past me (I was in between the door and him) and opened the door and started yelling at my dad.  Something like “come on you f***ers, dinner is almost done!”.  I don’t remember the exact dialogue but it was in a raised voice, and my father was known for messing around with my grandfather especially when my dad and neighbor where together (big jokers that brought the best out of each other).  My grandfather was easily irritated by their antics.  No one answered my grandfather’s ranting, he did not step out of the camper, but slammed the door shut, cussing under his breath.  We sat there knowing they would be opening the door any minute; my grandfather was scooping out dinner and putting it on paper plates. We sat there waiting for them for over an hour, it was well past dark when I heard them coming up the road to camp.  They were walking brisk, talking, not worried about making noise as hunting hours were long over; my father was smoking a cigarette.  My neighbor and his son got their keys and went inside their camper to put away their riffles and change clothes.  My dad walked up to me and asked if we had seen anything (I was next to the truck door, were he was laying his riffle down on the seat).  I told him no and then asked him where he went.  He pointed towards the mountains to the East and said we were hunting up there.  I said “no, where did you go after you came back here”, he looked at me puzzled and said “we just got here”.  I blew it off, and went back inside following him.  My grandfather was irritated still and was chewing him out for messing with us (I don’t remember the exact dialogue). Since I had already eaten(and there is not much room is a camper), I climbed up on the cab-over bed and laid on my stomach, watching and listening to my grandfather and father bicker about the banging incident.  The argument stopped when my neighbor and son came in.  The son got up on the cab-over bed with me and ate his cold dinner (we were propped up on our elbows facing the adults who were sitting at the small table eating dinner.  The banging incident did not get mentioned again (I don’t think my neighbor or his son knew anything or heard anything about it). After they were done eating, discussion among the three adults was centered on whether we should stay another day, or leave in the morning and get back home (it was a terrible hunt, we had not seen any deer).  My neighbor’s son and I wanted to make a camp fire, but were told not too because it was too cold outside, it was late, and we might leave in the morning and did not want to leave a smoldering fire. All of a sudden, the “banging” (2 distinct hard bangs) on the side of the camper happened again.  All five of us were in the camper, and the bangs were definitely on the side of the camper.  It was like someone knocking , except it was more violent (like cops banging on a door before they break it in, it could not have been something falling on the roof, or someone throwing something at the side of the camper).  Startled, my dad who was closest to the door grabbed his .357 mag that was in a drawer adjacent to the door and flung it open.  He waited for about 3 seconds, and then stepped out.  There was no one there.  If it was a gentle knock, he wouldn’t have grabbed the gun right away; he would have opened the door to see who was out there.  Whoever banged on the camper would have had to clear 60 feet of open ground very quickly to get to the nearest tree line.  I don’t remember if it was a full moon, but it was bright enough to see a silhouette if there was one. By then, my neighbor was up and out the door behind my father.  He went into his camper and got his pistol.  My grandfather went out also, but did not have a weapon.  I suppose my father thought someone was stalking our camp on foot (if a vehicle pulled up, we would have heard it and seen head lights long before it got to camp).  He started talking loudly (like he was speaking to an audience, not yelling), warning whoever was out there that we were hunters with guns.  He got no reply.  My father is a rational man, and is not quick to jump to the defensive; he did this time, so I knew something was wrong.  The neighbor’s son and I stayed in the camper.  After the adults walked around camp for about 5 minutes, my grandfather started a camp fire.  They stood out there for about 10 minutes talking quietly about what had happened.  They came to the conclusion that it must have been a drunken hunter or something, so they were going to stay out there for awhile to “ward-off” whoever was messing around. My neighbor’s son and I went out, and all five of us sat around the fire only whispering.  Nothing happened for about an hour, so everyone eased up and we started talking normal.  I guess it was probably 8 or 9 o’clock at night when my father told us all to shut up.  We all did and looked at him.  He asked if we “heard that” about the time my neighbor said “heard what?”  We all heard a screaming, moaning noise.  There was about 10 seconds of silence, and we heard it again.  It went on for about 15 minutes before my father, armed with his pistol, walked out of camp into the direction of the mountains to the east.  Camp was situated towards the end of the “box canyon” so it was difficult to judge how far away, or which direction the screams were coming from.  I followed my dad for about 100 yards down the road into the flat land.  We stopped and stood in silence until we heard it again.  As best we could tell it was coming from the tree line approximately 300 yards to the east across an arroyo at the foothills of the mountains.  The screams came almost on a regular interval 15 to 30 seconds apart.  It almost sounded like it was coming from multiple locations but it was difficult to tell because of echoing.  We did not hear rustling or footsteps.  But it was bright enough to see.  If anything was moving in the open we would have been able to make it out, we saw nothing. My dad decided to head in the direction we thought the screams were coming from.  I stayed and watched him.  He went across the arroyo and emerged about 50 yards from the edge of the tree line.  By then, the screams ceased.  I think whatever it was heard my dad coming (he was walking through sage brush with no flash light).  My father started heading south paralleling the tree line until I lost sight of him.  I was starting to get more spooked than I was when I heard the screams, I guess because when the screams were happening I could tell that they were fairly far away, now I did not know where or how far away “it” or “they” were.  I walked quickly back to camp.  My dad returned about 45 minutes later and reported that he did not see anything. We all stood around the fire for about an hour talking about the screams and everyone came to the same conclusion that it was not elk, coyotes, or any other animal we all were very familiar with in the woods of New Mexico.  The rest of the night was un-eventful.  We all spent the next day hunting the area were we thought the screams came from, but no one saw anything out of the ordinary.  My grandfather hunted the roads out of his truck (he could not hike around the mountains like the rest of us because of his age).  There were no other hunters or camps in the area. We packed up and went home that afternoon. About a month or so later, my dad and I were watching “In search of” with Leonard Nemoy.  They played some recordings of what were believed to be big foot.  It sent chills down my spine, I looked at my father, and it’s like he just saw a ghost, they were the same screams we heard on the hunt, the same recordings I heard on the BFRO website which has prompted me to write this. We returned to that area again the next year and did hear the screams again, but they were much further away.  Since then we only hunted the area 2 more years because the State of New Mexico shut the entire area down to hunters because of poaching, and the death of a rancher who tried stopping a poacher.  The last time we were there, the forest service had gone in and thinned out a lot of the wooded areas (late 80’s, early 90’s), and the natural gas pumps were not running.  The area is now open for hunting, but by lottery draw only.  We now hunt in the Gila. I cannot tell anyone that it was big foot because we did not see anything.  But what we heard was not any animal that we are familiar with.  I believe it is completely possible that big foot exists, and I think as our forests get smaller due to development, highways, homes, etc, we will eventually find one dead or alive.  I think big foot is a timid, shy creature that is very good at concealing itself, and there is probably very small numbers of them.  It took the producers of the show Planet Earth on Discovery channel 3 years to film 20 minutes worth of the only video images in existence of snow leopards in the wild.  It stands to reason that it would be harder to video a creature who’s numbers are probably much smaller than the leopards.  Also, I think that the big foot is much more intelligent than the leopard. Again, I apologize for the length of this report; I wanted as many details as possible to come out.  I am not looking for anything out of this, except that I would like a professional’s opinion of what we encountered, and would like to know of any other reported instances in the same area/time–frame.  Also, I would be glad to show someone the area this happened at.  My grandfather passed many years ago, but my father will tell you the same story I just told, my neighbor and his son probably would also, but we lost contact quite awhile ago.",
  "classification": "Class B",
  "county": "Rio Arriba",
  "state": "New Mexico",
  "latitude": 36.4178,
  "longitude": -107.1612,
  "location": "-107.1612,36.4178",
  "location_details": "Game unit 5A, would have to draw map to give directions (see report above)",
  "temperature_high": 33.95,
  "temperature_mid": 28.235,
  "temperature_low": 22.52,
  "dew_point": 17.43,
  "humidity": 0.78,
  "cloud_cover": 0.74,
  "moon_phase": 0.57,
  "precip_intensity": 0.001,
  "precip_probability": 0.5,
  "precip_type": "snow",
  "pressure": 1017.22,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 9.26,
  "wind_bearing": 41,
  "wind_speed": 1.37
}