{
  "id": "28545",
  "title": "Man tells of the strange occurrences and his sighting as a teenager near Buckhart",
  "date": "1976-09-18",
  "timestamp": 211852800,
  "observed": "[ Note: The first names of the witnesses has been changed. ] Preface: This information is based on witnessed facts, and is as close to the events as I can recall.  I am blessed with a near photographic memory.  First is some background that seems to perhaps relate to the main focus, and as I think it is relevant, I will start thus. 1976 – 1st Encounter – Vocals Heard The year as close as I can recall was 1976, the year before graduation from Rochester High.  It was the fall, shortly after return to classes, but before the autumn chill had set in.   On a date that goes forgotten, myself, Tom, and John, (both grew up in houses outside of Rochester in the unincorporated “Buckhart”, Illinois), decided we were going to fish some ponds that were formed by overflow from the Sangamon river in the Buckhart area.  I cannot say exactly were they were now, other than from memory, I recalled that if you were to drive to Buckhart and then turn immediately left onto a blacktop, it would come to a river bridge over the river, and a large sandbar there, then continue on north to eventually meet the Mechanicsburg blacktop.   The ponds were found by taking a very narrow unpaved dirt track to the left before the bridge, and then off again through fields until it came to a dead end along the river and ponds fringed with large stands of tall trees. It was perhaps a mile distant from the bridge.   We knew the farmer, who farmed most of the bottoms in the area from our associations at church, and who had given us permission to fish and access the area. On the day of interest, we needed fresh bait, and decided to follow some other less used field perimeter tracks to a place where we could get near the river in the shade to look for earthworms.   We started out walking through the very dense weeds and underbrush, until finally we opened into that area where the overhead tree canopy makes less light available to the denser weeds, and lots of open flood plain is available to dig for fresh worms.  From this place, you can traverse the river bank fairly well, and the trees and weeds you have passed through make a green wall that hides you from view of the parked vehicle and fields beyond. We went about digging in various places finding good bait.  At some point, perhaps a half hour into our self occupied digging, Tom decided to go exploring farther down by himself, leaving John and myself more or less digging together.  Another half hour or so, and I had a pretty good bucket of worms when I felt a strange sensation that I was being watched.  I remember having the feeling, and dismissing it, and not saying a word about it when John and I came across a large pile of earth on the river bank.  It was out of the ordinary, and actually, looked exactly the size and shape of earth if you were to lay down and cover over a body with soil.  We both saw it and both decided no way were we going to dig into it!   We joked about how silly to even think about it, and bent to the digging.   I got the feeling again of being watched and remember carefully looking around out of the corner of my eyes, to see any movement in the weeds or trees.  It was approximately 4:30 in the afternoon when we started, so the daylight was beginning to cast longer shadows as the sun got lower.   I didn’t see anything but the feeling kept nagging at me, and I more or less lost interest in the worm hunt.   At some point shortly there after, an interesting thing occurred.   It has never happened to me the same way since. John and I were hunkered down on one knee, turning over small spades of earth, when he stopped, and I stopped, and without any communication between us he looked me straight in the eye, and we both turned and looked into the trees and weeds at the exact same time.  We never heard a thing.   At that instant, we both realized that we had both sensed something, and our minds were reaching that primitive level when you should decide quickly fight or flight.   He said to me, “We need to get out of here now”.  I agreed, and before I could say anything about finding Tom, the need for his search was over as he almost ran into us as he came looking pale and said, “I don’t know what that was, but we are out of here right now!”  We didn’t run, but we made haste following our path back out through the weeds and trees, to the waiting pickup truck!   When we got to the truck we all kind of laughed and joked the tension away and all talked quietly about the heebee jeebee way we had felt.   Then we heard something I had never heard before that hastened our departure.    We all heard it.  The sound as close as I could come to describing would be a woman screaming in undulating pain and terror, but it really didn’t have a human quality to the sound.   We did not stay to investigate, as it was either very very loud, or the proximity was very very close.   We loaded up and spun tires on dirt and cornstalks as we got out of that place. We talked about arming ourselves with rifles etc and returning, but soon school and the fall and winter set in , and we passed on that and never went back to that place again.    This set up the next segment of the history of the area. 1977 – 2nd Encounter – Vocals Heard You may recall that I had gotten a rust orange Jeep CJ 5 between my junior and senior year at Rochester, and along with Sarah and Mary, who had her dads old CJ2A, we did a lot of exploring the various wooded trails all around the area.  (The tales of creepy river bottoms made for some memorable make out sessions with Mary, LOL) I had never forgotten about the river drama of the year before, but decided that we were all just acting childish, and that the scream was probably a Lynx cat, who do cry like women, even though I don’t really know what the possibilities of such species was along the river if any!  That goes unproven to this day. One fall evening, myself and Steve were out four wheeling about, and went down the blacktop to the Buckhart river bridge.  For no apparent reason, we met and passed a Sangamon Sheriff’s car going the other way.  He went down about a quarter mile and I saw his brake lights and he did a u-turn, so I knew he was going to do a stop on me.  We had no reason to fear anything, but for kicks we decided to cross the bridge and continue as he sped to catch up.  It was just getting true dark outside. Just down about a quarter mile I knew of a dirt cut, now a very muddy rutted path through the fields along an oil well tank right of way, and turned into it just as the patrol car crossed the bridge in time to see me heading down the path.  He never turned on his overhead lights, so we decided to continue.  It was four wheel drive needed, muddy wet and rutted.   He would not have made it fifty feet. Passing the oil storage tanks, the path got overgrown, and continued until it came to a fairly steep hill.  You don’t really see these bluffs above the river from the blacktop but it is probably at least a hundred feet higher than the fields below, and took the Jeeps transmission into low range to climb it with the mud.   At the top of the hill, the path continued on into a dark stand of timber but as we had not explored that before, I backed the Jeep around and parked it so we could see back to the blacktop, about a mile away.  I had turned the lights off before climbing the hill, so I don’t think the patrol car even knew how far in we were.  We could see him sitting there on the road, parked, and probably waiting for us to come back out.   We shut off the engine and sat there watching him in the dark while a very light misty rain started.  We made small talk about how long he would wait when after a few minutes, he must have gotten a call for real police work and we watched him drive off.   Thinking perhaps he was trying a ruse to get us to come back out, we decided to wait at least a half hour, and barring another squad showing up, we would just hangout and shoot the bull until then.  That’s when Steve heard it. I was talking about chicks, and remember Steve very seriously saying to me, “Dan, turn off the radio a sec.”  I shrugged my shoulders and did so, asking him what?   He looked in the rear view mirror, and said to me, “Did you hear that?”  I hadn’t heard anything but the radio.  He kept looking in the side rear view mirror, and it was totally dark behind us, so I told him that he wasn’t going to see anything back there.  Keep in mind my Jeep was a soft top.   Steve looked at me, and said, “I know I heard something back there, and I don’t like it.”  About that time, in the quiet and the misty rain, with small cooling clinking sounds from the engine as it sat, I heard it too.  It was on the edge of my hearing.  That kind of sound where you turn your head a little, not sure of what but definitely hearing and trying to fathom the sound for identification.  “Now you hear it don’t you” I remember him saying as He held onto the door handle like he wanted to make sure somehow it couldn’t be opened.   It sounded very low frequency, almost a wet guttural rolling sound.  Perhaps like a deeper wet rolling purr.  Although not like any house cat I have heard, but that is as close as I could get to describing it.  We could feel the vibration of the sound as it got distinctly louder as it seemed to get slowly closer.  I remember saying that I had enough of this, and Steve agreed and I fired up the Jeep and turned on the lights and hauled ass down the hill.  We didn’t see a thing but mud, corn, and weeds until we got to the blacktop.   We got to the river bridge and I pulled over.  Steve and I discussed what the hell, and decided that we would come back in the daylight and reconnoiter the area. 1977 – 3rd Encounter – Sighting Several weeks later on a clear sunny Saturday, we followed that path in the Jeep back to the top of the hill.  There was a very old path through the trees, perhaps from some early hardwood logging, or maybe a shortcut for farm purposes at one time, but it was easy to tell that my Jeep was the first vehicle to travel up there in a long time.     The path meandered around and more or less dead ended in two places, forming as it were a large Y in configuration. We got out and walked and searched and could find no signs of anything out of the ordinary.  Eventually we discussed the incident of the sounds with Tom, and Mike, who really wanted to tag along, and so a return nighttime trip was planned. This is where it gets to the thick of it.   On that night, I was driving my Jeep, with Steve up front, and Mike and Tom in the back of the CJ5.  We went back down that muddy rutted path to the top of the hill, and then drove way back to the dead end of the path that forked to the left.  We had to cross a smaller fallen log, in low range to get back to that point, but it had a wide open area about a hundred feet in diameter that made a good place to turn the Jeep around so it was pointing in the right direction. We got up into place and shut off the engine and sat quietly taking in the sounds of the night, and letting ourselves adjust.  An hour or so and Mike more or less thought we were yanking his chain and began to make jokes etc, as we passed the time.  It was a typical fall night, with light misty rain and humidity.   Steve got everyone very quiet and we listened close.  That’s when we decided that someone or thing was circling our position very quietly.  A twig would crunch.  Then slowly another, some distance away.  This went on in total darkness for an hour.  Finally, the circling of our position seemed to return to its starting point behind the Jeep at an undetermined distance.  Tom had a large six volt lantern flashlight in the rear seat. If you remember Jeep soft tops, you will note that the back window area is huge, and is basically a top to bottom, and side to side clear acrylic sheet.  Mine was a little scratched up from scraping winter frost, but you could still see out of it fairly well.  While Steve and I sat and pondered if our ears had played tricks and we were hearing what we wanted to hear, Tom got very quietly terrified in the back seat.   I ignored his first request to start the Jeep and leave because it was not normal for him to be so quiet, but then I remembered how he was pale and reacted the year before at the river bottom when we were looking for bait.  He got our attention.  Steve asked him, “What is going on?” and Tom said very somberly, “There is something behind us, watching, and we need to leave now.”  I looked at Steve, and Mike kind of snickered while Tom had the light more or less shining through the window lighting up the area behind us.  I was whispering to Steve, about if he had heard the same sounds as before, when Mike, said, “Oh no” and got absolutely scared.  Real scared, I am making a joke of it scared.  Tom began to whimper some and pulled on my shoulder and made it clear he wanted to leave RIGHT NOW!   I and Steve were still not sure if they were pulling our leg, when I asked Tom why, and he said “LOOK” and just pointed the light over his shoulder without looking.  I and Steve saw it.  I know that Mike and Tom had already seen it. My memory is this.   As I looked over Tom’s shoulder into the trees directly behind the Jeep, a large, tall, (figure of a man standing is about as high as the Jeep top when a normal suspended Jeep, and this was a foot or more taller) seemingly dark matted brown colored species of something bipedal ducked slowly behind a tree.  I had a very fleeting glimpse of red reflected eyes, meaning man or predator.  The fact it ducked slowly behind the tree is what suggested other than animal intelligence, and is what spurred me to start the ignition and high tail it out of there! Tom would claim it followed us in the trees at a distance as we left, but I can not confirm that.  We never went back there again.   It is important to note, that whatever it was, person or not a person, it could have done us harm easily, and chose not too.  Perhaps it was curious as well.",
  "classification": "Class A",
  "county": "Sangamon",
  "state": "Illinois",
  "latitude": 39.7721,
  "longitude": -89.4691,
  "location": "-89.4691,39.7721",
  "location_details": "North of Buckhart on Young Road.",
  "temperature_high": 83.01,
  "temperature_mid": 70.885,
  "temperature_low": 58.76,
  "dew_point": 51.81,
  "humidity": 0.64,
  "cloud_cover": 0.12,
  "moon_phase": 0.81,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.3,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 5,
  "visibility": 6.45,
  "wind_bearing": 134,
  "wind_speed": 1.48
}