{
  "reportId": "359",
  "title": "Daylight sighting by motorcyclist near Atwater",
  "date": "2000-08-01",
  "timestamp": 965088000,
  "observed": "This incident occured in the town of Atwater,OH. One day in the late afternoon my sister and I climbed on my motorcycle and headed back to what was once strip mines.I frequently rode there and knew every bit of it.We had just rounded a corner and were headed north when we noticed South of us 2 \"people\".I immediately assumed it was my one friends with his dad..They are big guys.Well,I turned the bike around and headed toward them.At this point, they were quite a distance away.As we got closer,a strange transformation took place in my mind.What had been my friend took on a different appearance altogether.I remember feeling strange because my previous thoughts were being replaced as we got closer.At some point, we realized it was not my friend, and within seconds after that,saw them enough to get the details.They were indeed large,covered with hair,and looked human.They were not bears for 2 reasons.Their faces,and the way they left, on 2 legs.When years later I saw the Patterson film,the first thing that struck me was the way that animal looked at the camera.When these 2 beings looked at us,they also turned their upper body with their head to see us.As soon as I realized that we were looking at 2 huge, 2 legged things looking at us,I immediately got scared.Right after they looked at us,they were gone into the woods.We coasted up to the spot,and my sister reached up and turned off the bike.I protested! In the distance we heard distinctly branched breaking as if something snapped them as it ran.I also remember thinking that the snapping sound was deeper,as if whatever was breaking was larger than the typical twig.We re-started the bike and ran for home.It wasnt until later that we even thought about Bigfoot.But i must stress,we saw them in the day,and we saw them close enough to know what we saw.",
  "classification": "Class A",
  "county": "Portage",
  "state": "Ohio",
  "latitude": 40.98596,
  "longitude": -81.11642,
  "location": "-81.11642,40.98596",
  "location_details": "from the corner of 183 and 224 in atwater,you follow 224 east till you come to Porter Rd.Its only about a few miles.Turn right and go down 3 houses on the left.The big blue house is still mom and dads.from there,the mines are behind the house.Since then,they have dozed most of the area so it doesnt resemble much of what it looked like.",
  "temperature_high": 80.59,
  "temperature_mid": 73.49,
  "temperature_low": 66.39,
  "dew_point": 66.65,
  "humidity": 0.8,
  "cloud_cover": 0.46,
  "moon_phase": 0.06,
  "precip_intensity": 0.0112,
  "precip_probability": 0.31,
  "precip_type": "rain",
  "pressure": 1015.01,
  "summary": "Rain in the evening.",
  "uv_index": 7,
  "visibility": 6.5,
  "wind_bearing": 211,
  "wind_speed": 7.95
}