{
  "reportId": "36467",
  "title": "Man driving home through Joint Base Lewis-McChord sees an animal walk across the road south of Spanaway",
  "date": "2012-09-12",
  "timestamp": 1347408000,
  "observed": "OK, last night I went home from Walmart in Spanaway Washington, and I turned left onto 8th Ave E, which goes from Spanaway highway 7 which is Pacific Avenue also. This street turns into a two lane country road that makes one of the borders of Joint base Lewis-McChord. It is a long dark two lane country road that bisects a huge prairie with lots of old growth woodlands bordering it. I drove home the back way again tonight hoping to pinpoint the exact location for you, but there are no mile markers nearby where I seen what I saw. The best I can do, is it is Approximately 4-5 miles out from town, the road is largely flat and straight, but there are a few rises as you drive. The place I was at was about 3-400 ft from the second place where there is a rise in the road. I know this because I could see the creature with a hill in the background and some trees, and when we drove up through there tonight there was no place else that fit those two things. First off, it was very dark, and oddly devoid of cars, as there is usually someone flashing their lights at me as my car has a headlight out and I have been driving with my brights on until payday to get it fixed. I think if I had not had my brights on, I would never have seen this creature. At any rate, suddenly I seen the Patterson Film in real life, about 400 ft down the road ahead of me. The creature I saw fit the same color scheme of Harry and the Hendersons, but in behavior it was nearly identical to the Patterson film. It strided across the road in 3-4 strides, and in as many was way off to the right again when it stopped mid-stride and looked back at me exactly like the patterson film, but this thing looked huge, even from the distance I saw it. When you see something that does not fit into the ordinary part of what you perceive as your reality, your brain tries to pidgeon-hole the data into one file after another, click click click click and suddenly you come up with \"Does not compute\" At first I thought was a smudge on my windshield, but it was moving right along. Just like the patterson film. So I went to work, and several people live near me and I decided to tell somebody. One guy had a girlfriend who seen him within a mile of my house within a month ago, and then a week ago his father came home at midnight telling him he had seen one in the same area in the headlight of his Harley where a small creek runs under the road and the creature appeared to be crossing the road where the small bridge was. It's weird how this effects you. I could really see how someone could keep this to themselves for their entire lives. However, when I shared this story, I got \"Oh yeah, this happened and that happened,\" To \"My Cousin, My Brother, My Dad, and even a couple of personal stories from people who grew up here. I was always willing to give it an open mind, but the lack of physical evidence sort of left me wondering, if I had to be honest. Now I know we share our woods with one big sumbitch, and you better be paying attention when you are cookin up that bacon at 8 pm in the woods around here cuz I don't think he got that big eatin dandelion greens. :) My impression, one HUGE Chewbacca/Harry and the Hendersons kinda guy, at least 2.5-3 ft thick thru the chest from back to front and if I had to estimate would be tall even for a Sasquatch at 9-12 ft like I said it was a quite a ways up the road, but I had time to see it, evaluate, and question it and look again, and then again after that as it looked to the right at me coming down the road, so it was a pretty firm sighting even if I am still questioning myself the next day. Like I said your brain tries to rationalize anything that \"Does not Compute\" but I was not under the influence of anything. Still puzzling and marvelling over it all. My urge to get in a last minute camping trip just evaporated like a puff of smoke lol! that's my experience and I sure never expected to be posting this :) ",
  "classification": "Class A",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 47.05072,
  "longitude": -122.4212,
  "location": "-122.4212,47.05072",
  "location_details": "listed above",
  "temperature_high": 70.27,
  "temperature_mid": 57.775,
  "temperature_low": 45.28,
  "dew_point": 42.44,
  "humidity": 0.6,
  "cloud_cover": 0.01,
  "moon_phase": 0.88,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1026,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.93,
  "wind_bearing": 11,
  "wind_speed": 6.42
}