{
  "id": "12087",
  "title": "Trapper experiences nighttime vocalizations",
  "date": "1997-01-04",
  "timestamp": 852336000,
  "observed": "I was setting some coon traps on the edge of a powerline next to a wooded area after dark.  I had some sardines or some kind of fish with me for bait.  I was using fence staples to stake the traps to the roots of trees.  I had finished hammering in the staples on the last trap and was baiting the trap with the fish when I heard something walking towards me out in the woods.  I don't remember if I could tell if it was walking on two legs or not but I thought it was strange that any wild animal would approach me when I had just finished hammering staples.  I backed out into the powerline and stood by a power pole to see if whatever it was would come out of the woods but it would'nt.  It stayed back about 10 yards from the edge of the woods walking back and forth.  I had a small flashlight with me and I decided to try and shine whatever it was.  I pointed the light in the direction of the footsteps and turned it on.  I could'nt see anything because of the undergrowth but whatever it was started whooping and ran off.  I was also followed out of the woods after dark one night later that year by what must have been the same thing because when i shined my light in its direction it whooped and ran off just like before. I did'nt see anything that time either due to the undergrowth. I've lived in this area all my life and i've never heard anything make a noise like that.  I'm not saying this was a bigfoot.  I don't have any idea what it was. We have deer and coyotes in this area but i did'nt think either of these made whooping soonds.  Maybe some of you know or have an idea of what this could have been.  I would appreciate it if anybody could shed some light on this.",
  "classification": "Class B",
  "county": "Livingston Parish",
  "state": "Louisiana",
  "latitude": 30.509,
  "longitude": -90.6763,
  "location": "-90.6763,30.509",
  "location_details": "With held for confidentiality",
  "temperature_high": 76.94,
  "temperature_mid": 71.215,
  "temperature_low": 65.49,
  "dew_point": 66.4,
  "humidity": 0.84,
  "cloud_cover": 0.87,
  "moon_phase": 0.84,
  "precip_intensity": 0.0003,
  "precip_probability": 0.17,
  "precip_type": "rain",
  "pressure": 1011.42,
  "summary": "Mostly cloudy throughout the day and breezy until afternoon.",
  "uv_index": 2,
  "visibility": 8.87,
  "wind_bearing": 197,
  "wind_speed": 12.4
}