{
  "reportId": "46769",
  "title": "Mushroom picking couple scared out of a forest near Wilkeson",
  "date": "2014-10-08",
  "timestamp": 1412726400,
  "observed": "On October 8, 2014 me and my wife we're out picking  mushrooms, above Wilkeson Washington, 20 miles or so from the base of Mt. Rainer. We parked at a forest service gate and walked in about 1 and a half miles to our spot, Where we have been many times before, its all old growth timber and really thick with old stumps and moss and what not, anyway, when we walked in my wife thought she heard an ax or something pounding on a tree. She said did you hear that? I was excited and finding mushrooms so I blew it off, and said come and pick this patch. An hour or so had passed, when I heard snapping and crunching about 100 yards away or so. And then we both heard thump thump thumping of what we concluded was a big rock pounding against a tree, now mind you, we are in the middle of pretty much nowhere, not a sole around. My wife and I stood in awe, and she said that sounds like wood knocks. My heart sunk as I watch a lot of bigfoot documentaries. I am an avid hunter and no all the sounds a forest or animal makes. Three minutes or so had passed from the tree pounding and crunching when all of a sudden SNAP, a tree or big branch we estimated around 5 or 6 inch in diameter snapped 20 feet behind us. We both jumped.as it was so loud and close.at that moment we ran. I said lets go, heck with the the mushrooms, as we were running past a lot. It was the scariest most unsurreal thing that's ever happened to me. 42 years in the woods and I never. I do not like to tell this story to my friends and stuff.as they laugh. But I know what we seen and experienced. Of all the times the one trip I did not carry my gun. Not that I would of shot.but I would of maybe got a picture or a visual or just felt more secure. Take this to heart, I will never hunt or look at the woods the same as long as I live. They are real whatever they are .THEY ARE REAL! Feel free to call me on this.",
  "classification": "Class B",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 47.1352,
  "longitude": -122.0669,
  "location": "-122.0669,47.1352",
  "location_details": "",
  "temperature_high": 65.19,
  "temperature_mid": 59.105,
  "temperature_low": 53.02,
  "dew_point": 56.03,
  "humidity": 0.89,
  "cloud_cover": 0.25,
  "moon_phase": 0.51,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.16,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 3,
  "visibility": 6.05,
  "wind_bearing": 333,
  "wind_speed": 3.04
}