{
  "id": "946",
  "title": "Unusual sounds heard, sighting of fast upright animal",
  "date": "1995-07-01",
  "timestamp": 804556800,
  "observed": "The first incident dates back to around the summer of 1995. It has been a while, so I can't be completely sure of the exact dates. One of my older sisters, and her three young duaghters were out looking for a place to pick wild blackberries with my younger sister. There were blackberries in abundance there, which was kind of odd, considering it was so close to the road, and there were many people out picking berries that time of year. They picked berries for just a few minutes when they began to feel uneasy, like there was someone watching them. The girls started to get scared, and one of them said it was a scary place, which was unusual, since it was a nice summer day, and the spot seemed pleasant enough, down by the river. After a few moments, their uneasiness turned to outright fear, and they decided to waste no time leaving. My younger sister related the events of the day to me when she got home that evening, and being curious about such things, we decided to make another trip out there the following day, so I could experience the oppressive atmosphere first hand. We lived in Hoquiam at the time, and got a late start, so it was full dark when we arrived the next evening. But my sister, her husband and myself were somewhat prepared, having brought flashlights, and a point and shoot 35mm camera. It was a walk of about 300 yards from the side of the road to the river, and the going was made a bit difficult because of the downhill slope, and the fact that it rained a couple of days earlier, and the track was all mud, quite deep in parts. We walked / slipped down to the edge of the river bank, and stopped to observe the area. It was very dark, and seemed quite isolated, but other than that, it felt normal, no sense of impending doom, no unseen presence felt. We idled around there for about ten minutes, and were about to go home, when all of a sudden there was a tremendous BANG, it sounded very much like a shotgun at first, and we thought somebody was shooting at us. We ducked, and begin to make our way back to the car, when we heard a very loud splashing just off the shore on our side of the river. It sounded to me like a cow or large deer had fallen in, and was struggling to swim. Being young and foolish, I thought this would make a very cool picture, so I made my way to the bank, and was about to peer over the edge to get my shot, when the thrashing ceased, and there was the very distinct sound of a large rock being thrown into the water. This was quickly followed by another, and soon another. I turned to my sister, and she said, \" Oh my God, there's someone throwing rocks!\", and by this time her \"brave\" husband was already well on his way back up to the car at a dead run, and we were right on his heals in a mad panic, slipping and sliding up the dark hill. After a few moments, sanity returned to my sister, and she grabbed my arm and said \"wait, listen.\", and we stopped a few yards up the track and listened. Now you may be wondering why the sound of some rocks being thrown in the water freaked us out so much. This area was quite desolate, and the river is very cold and deep, with eddies that could easily pull you under and drown you. The river bank is quite steep, and it's an almost sheer 25 foot or so drop to the water, with no easy footing when the tide is in and the river is up. So anybody that would be crazy enough to stand out in the middle of nowhere, in the dead of night by a dark dangerous river, and casually throw VERY large rocks into the water, was not the kind of person we wanted to meet at that time. It just felt very wrong, and our instincts told us to leave NOW! Anyway, we stood there listening for a moment, when my sister grabbed my arm again, and yelled something to the effect, \" Oh my God it's coming!!\", and she ran off up the hill in a blind panic, and although I didn't see or hear anything, I decided to follow her. We made it up to the car, having slipped and fallen in the mud several times, and beat on the door for her husband to unlock it and let us in. We sat in the car for a few minutes, gathering our wits, and decided to get out and have another listen, since nothing seemed to have followed us up. We stayed close to the car this time, and heard no more splashing at the river, but after a few moments we heard a single, large branch snap in the woods off to our right. It was silent for a few more moments, and we heard a soft rustling in the brush from the same area. I told my Brother in law to throw a rock in that direction, to see if we get any response, and he tossed a fairly sizable stone into the general area, and we heard a bit more commotion. I yelled \" Hello there\" to make sure we weren't tossing rocks at a person, and got no answer. I then whistled, and heard the strangest sound I have ever heard, before or since. Whatever was in the brush attempted to mimic my whistle. It didn't blow air through it's lips, but tried to vocalize it. I don't know how to describe it, it was somewhat high pitched, but had very deep undertones, and you could tell this thing had some incredible lung capacity, it wasn't even straining, yet had a volume several times louder than my own. This disturbed us quite a bit, and we decided to leave. We returned the next night, and brought four other people with us, and within a few minute of darkness, it would get very quiet, and then the rock throwing would start. Sometimes on our side of the river, and sometimes on the other side. We returned to the area several times, with several different people, and always heard something. I won't detail all the instances here, but will note some of the stranger occurrences. After about our third visit there, we noticed a different phenomenon, just after dark, we would hear the sound of large rocks being clicked together, usually starting on the far side of the river, and then answered with similar clicking from off in the woods on our side. Several times we tried to duplicate the sound, but it always sounded bigger and louder, no matter how large of rocks we could bang together. Several times we heard snapping and rustling in the brush off to both sides. We went there in the daylight to look for anything unusual, but could find nothing out of the ordinary. One interesting note: we never seen nor heard anything unusual in the daylight. Even on bright moonlit nights, we often would hear nothing. My theory is this thing was nocturnal, and if there was even a remote possibility of seeing it, it would keep quiet. The only time anybody saw anything strange there, was when my younger sister and I were left alone at the site for a few hours, waiting for our ride to return. We were standing at the river bank, basically just enjoying the sunset, when my sister said, \" Holy S***t, it's bigfoot!\", and pointed to the far bank. I looked where she was pointing, but was too late, it had already disappeared into the brush. My sister told me she was scanning a gravel bank we had just noticed earlier that day, when a large black object she had assumed was a stump, or piece of a log which had washed onto the gravel, suddenly stood up, and took three quick steps toward the woods, and was gone. The sun was almost down, and the gravel bank was in deep shadows, so she could make out very little detail, but she said it was defiantly not a cow or bear. She said it walked on two legs, and she got the impression it was walking hunched over, and that it had no neck, and massive shoulders, that the body seemed almost impossibly bulky. She said it moved very fast, like it knew we were there, and it was trying to sneak away. Apparently, it was bent over on the gravel bar for some time, she noticed it when she first looked that way, and it was several minutes before it got up and moved. She seemed quite shaken by the event, and it was a long wait while it got dark, us there alone with no way out, and no car to hide in. I don't think we returned there after that, My sister moved back to Florida where her husband was stationed, and I got a job there driving truck. I moved back to Washington a couple years ago, and last summer decided to return to the area, to see if there was any activity. The first time I went back, I brought along another sister, her husband and their 14 year old son. We arrived at the site after dark again, I had trouble finding after such a long time. This was in the middle of July, and the moon was quite bright, and we hardly even need our flashlights. We walked down to the river bank, and I noticed how the place hadn't really changed at all over the years. We stood there for about half an hour, listening to the frogs and other night critters, and heard nor felt anything unusual, so we decided to leave. I had pretty much figured that whatever was down there back then had moved on, but I wasn't quite ready to give up. We returned the following weekend, and this time it was cloudy and pitch black. We walked down to the river once again, and stood there talking for about ten minutes, when my nephew said, \"Shh, listen.\", and we did, and heard nothing, and I was about to say that I don't hear anything, when that's when I realized that was what he was talking about. It had suddenly got very quiet, all the frogs quit croaking, and the atmosphere felt dead calm. It began to feel very eerie, and then things happened so quickly, I have trouble recalling the exact events to this day. Two things happened almost simultaneously, we heard the yap of a single coyote, very close by, which was strange, they almost always travel in packs, then we heard something very large, scrambling up the bank, no more than 20 feet away. We all began to run, because whatever it was, was coming right towards us, and fast! I got a sudden case of the braves, and said \" Don't run!\", then heard very definite, heavy footsteps in the brush, no more than ten feet away, and still coming after us, and said, \"Okay, maybe jog!\", and we proceeded to hightail it up to the car. We sat in the Blazer for a few minutes with the windows down, listening, and heard nothing further, but none of us wanted to walk back down to river that night. The experience had me so fired up, that I bought one of the new Sony handycams, with the nightshot infrared systems the next weekend, and was determined to get some evidence. We went out there that Saturday armed with my new video camera, and stalked around until looking for tracks or anything until it started to get dark. We found nothing as the ground there is not conducive to track retention, being mostly gravel, weeds or deep brush. It seemed to avoid the muddy track completely. We were at the river bank just after dark, when we heard a single loud splash, and then heavy steps and brush crashing as something made it's way up the bank towards us. I should note, that earlier that day we climbed down the bank to the place it always seems to come from, and it was so rough and steep, it took us several minutes to make our way back up the bank, and that was keeping to the trail, this always came through the heavy brush. My sister and nephew ran off towards the truck, and I walked quickly backwards, filming as I went, hoping to get video of it as it emerged from the brush. It stayed just within the brush, and thus out of sight from me, and it stopped chasing me after I retreated about halfway up the hill. I was feeling brave behind the lens, and started to advance back toward it, and heard to more heavy steps in my direction, and got the distinct impression that I should leave now. We got back in the truck and left, and haven't returned since. My sister feels it's too dangerous to go back, and I won't go there alone. Whatever it is, it's very territorial, I get the feeling that it was charging us to get us out of the immediate area, and then when we got back to the vehicle, it was okay. The experiences I've had this time are much different than the first time. There was no rock splashing or rock clicking this time, just a sudden, and I feel very aggressive charge to get us out of there. I haven't been there since the first part of August of 1998, and would very much like to return to the site with somebody that has more experience in these things than I do. If there are any serious researchers in the area that are interested in this site, let me know and perhaps I can take you there. I would love to find out what this really is.",
  "classification": "Class A",
  "county": "Grays Harbor",
  "state": "Washington",
  "latitude": 46.9782,
  "longitude": -123.3893,
  "location": "-123.3893,46.9782",
  "location_details": "",
  "temperature_high": 81.62,
  "temperature_mid": 69.94,
  "temperature_low": 58.26,
  "dew_point": 56.27,
  "humidity": 0.67,
  "cloud_cover": 0.56,
  "moon_phase": 0.12,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.32,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 8.75,
  "wind_bearing": 224,
  "wind_speed": 5.61
}