{
  "reportId": "44191",
  "title": "",
  "date": "",
  "observed": "I had reported earlier (Michigan Report #808) about sightings I had when I was in high school.  In October of 2003, I as home on leave from Korea (I'm an officer in the Army, currently a Lieutenant Colonel, but at the time of this report I am submitting, a Captain).  My dad and I were planning on doing a lot of bow hunting while I was home and got two areas set up - a bow stand for me and my dad sat in the ground blind he used for rifle season.  The location is near Manistee, Michigan, East of North Custer Rd and North of East Custer Rd.  Over the course of four mornings, we entered the woods approximately one hour before daylight to set in and let things calm down.  The first morning, 11 October 2003, we moved in and split up to our positions.  I was on my stand, settled in, and immediately heard three distinct knocks, from the North of where we were.  Farther North, I heard an answer.  There is a cabin to the West, and I figured it was those guys, as they are usually up on weekends for hunting.  However, the next three mornings, I heard this sound again after we entered the woods, however, the returns changed location, two coming from directly East, and one generally Northeast.  I took this as some sort of signal, but felt it may be the large woodpeckers that are common in the area (except you didn't have the normal rapid drilling/pounding you normally equate to woodpeckers).  However, after seeing \"Finding Bigfoot\" I now equate these to wood knocks that were signalling our presence.  The sounds ceased after the final morning of knocks.  I returned for solo hunts and again with my dad with no repeat of sounds. In October of 2004, I moved my stand East of where I was hunting into the edge of pines and used this to over watch a trail system.  I had gotten into the stand without incident, was set about an hour after first light (0830) when I heard a garbled sound close to the gibberish heard on Bigfoot sounds and running (North in the pines), when a doe bounded through the pines, stopped 10 yards in front of me breathing heavily, and kept staring North of her.  The gibberish and movement kept coming, then it sounded like a quick sound like \"Huh\" then silence.  What I then heard was the sound of similar to something sniffing deeply, and then slow movement towards the Northeast and East of me.  As this began, the doe moved quickly past me to the Southwest, eyes really big.  The sniffing ended, but the movement seemed to remain, slow, deliberate movement, but you could hear twigs snap periodically. For two nights after that incident, while in my stand, I felt I was being watched, and circled, hearing slow movement, especially just before dark, to my Northeast and East, then to the South of me, where whatever it was, seemed to be curious, as I was in a stand and not really seen, had shelled corn off the trail for bait, and it knew I was there, knew something was around, but couldn't see me.  It was too loud for a deer, but big enough to be heard.  I had my stand against a big pine, with a larger pine really masking me. I have pictures of me in the stand after I put it up and can provide those for a reference.",
  "classification": "Class B",
  "county": "Mason",
  "state": "Michigan",
  "location_details": "The location is on the edge of Manistee/Mason counties.",
  "summary": ""
}