{
  "id": "528",
  "title": "Three children have daytime sighting near Eureka",
  "date": "1957-06-01",
  "timestamp": -397180800,
  "observed": "I was about 10 or 11 years old.  My brother 15 month's older and a friend my age.  I am now 53 years old.  We lived in the country outside of Eureka California.  We went fishing at the end of our rural Rd, Ole Hanson Rd.  As kids would do we wandered off in the woods and found an old logging road that we decided to walk up.  About 15 minutes up the road we heard a noise in the woods on the other side of the road, we huddled together and waited to see who was there. We saw a creature on the other side, in the trees.  We began to run back down the road and the creature kept pace with us although we knew due to the size it could easely go faster. it stayed in the brush and trees and when it would get ahead of us, it would stop and watch us but never came across the road just followed and watched from across the road. When we reached the center of clearing on Hanson's property we stopped and looked back.  It was no longer there.  About two years ago I asked my brother if he remembered the incident, thinking it was something I had just imagened, and he said, just as wided eyed as that day, yes it was real. I watched your program on bigfoot tonight and that day became so real again because the film you showed was our boogieman. As I think back on it now I feel it was very curious of us although we were very scared at the time",
  "classification": "Class A",
  "county": "Humboldt",
  "state": "California",
  "latitude": 40.80222,
  "longitude": -124.1625,
  "location": "-124.1625,40.80222",
  "location_details": "The end of Ole Hanson rd.  Through the Hanson Property",
  "temperature_high": 67.71,
  "temperature_mid": 58.19,
  "temperature_low": 48.67,
  "dew_point": 51.3,
  "humidity": 0.78,
  "cloud_cover": 0.14,
  "moon_phase": 0.12,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.08,
  "summary": "Mostly cloudy in the morning.",
  "uv_index": 10,
  "visibility": 7.61,
  "wind_bearing": 293,
  "wind_speed": 0.96
}