{
  "reportId": "723",
  "title": "creature sitting on a wood pile seen watching witness.",
  "date": "1969-06-15",
  "timestamp": -17280000,
  "observed": "Over an 11 year period I found footprints. Fences repeatedly had barbed wire top lines pushed down to the field fenceing below and wrapped with moss and lodged with sticks. If you took them out they would be back the next morning. One pony regularly had a hand hold twisted in her mane and tied there. My horses would stand by the hour and stareing into the woods off the back corner of the property.At that time there was over four square miles of woods and pastures back in there with no roads. Found footprints in the field. I had roofs removed from dog houses. My neighbor had stock attacked. I had one remembered sighting. My dogs in the kennel started to bark about 2 in the morning and I had to go out to shut them up. as I went out the back door I glanced over to where my mother had a small building for her Chihuahuas. I remember seeing a being sitting on the pile of wood my dad had gathered and thinking.What are you doing here. I went over to the big kennel building and the dogs were so upset I had to go in and shut them up. As I went back over to the place (i was staying that night(we had two places and when my folks went away for the weekend to our other home I would stay on the couch in their place to watch the color tv.) I remember glancing to my right as I passed the wood pile and thinking oh your still here. then I did a stupid thing i went inside and shut and locked the back door something we never did. I went back to bed only to wake up three hours later shaking like a leaf. I can remember calling a friend to tell her what I had seen as I knew this was one person who would not think I was nuts. It had been a large silver colored creature sitting there calmly watching me. I drew a picture of what I saw I do not know if I still have it or not.. That has been my only remembered actual sighting though many times I have felt them around me and heard them.",
  "classification": "Class A",
  "county": "Hernando",
  "state": "Florida",
  "latitude": 28.50665,
  "longitude": -82.50591,
  "location": "-82.50591,28.50665",
  "location_details": "Florida. Hernando county, USA  between Brooksville and what is now Spring Hill",
  "temperature_high": 87.96,
  "temperature_mid": 81.5,
  "temperature_low": 75.04,
  "dew_point": 73.67,
  "humidity": 0.83,
  "cloud_cover": 0.58,
  "moon_phase": 0.03,
  "precip_intensity": 0.0263,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1008.15,
  "summary": "Humid and partly cloudy throughout the day.",
  "uv_index": 9,
  "visibility": 8.24,
  "wind_bearing": 80,
  "wind_speed": 3.21
}