{
  "reportId": "27682",
  "title": "",
  "date": "",
  "observed": "This sighting was on the night of Monday, 05.03.2010.  My 12 year old daughter and I picked up my son (age 18) at Dulles International Airport (Virginia) at 9:45 pm and proceeded south on Route 28.  My daughter was riding in the front seat; my son rode in the back seat. I became disoriented and missed our turn. After driving down roads that had unfamiliar names, were unmarked by lines, and even having to drive around part of a pine tree that had been broken and looked to be thrown in the middle of the road--we backtracked. In the area of the sighting, the speed limit drops from 45 MPH to 35 MPH.  I dropped my speed to heed the limit.  We came to a corner where there is a church. Crouched and bent over near the ditch/beside the road and directly in front of the church, was a large auburn brown figure.  It appeared to have its back toward the road, so I saw no face.  The fur texture, shape, and lay were similar to a grizzly (brown) bear.  I saw it but said nothing.  My daughter immediately said, \"Did you see that?! What was it?\"  I joking said, \"I don't know, maybe it was Bigfoot.\"  My son said he was looking forward and only saw a reddish brown color difference in his peripheral vision.  The time was approximately 11:00 pm. I asked if I should turn around and go back to see.  The kids said to keep driving because they were already rattled by being lost late at night.  They didn't want to waste any more time getting home.  We arrived home between midnight and 12:30 am.  I immediately got online to look at MapQuest to figure out our route; not because of the sighting, rather to see how I had gotten so lost. I assumed we saw a brown bear foraging for food. I mentally noted that the broken tree was in the vicinity of the bear sighting. Today (Tuesday, 05.04.2010)I began research on grizzly (brown) bears in Virginia.  I found a Virginia Department of Game and Inland Fisheries PDF link stating that grizzly (brown) bears do not live in Virginia.  Virginia is home to only black bears.  (See Narrator, p.3 at http://www.dgif.virginia.gov/video/living-with-black-bears/living-with-black-bears-transcript.pdf.) Now, I think what I had joked about may have been a Bigfoot sighting.",
  "classification": "Class B",
  "county": "Prince William",
  "state": "Virginia",
  "location_details": "Directions omitted upon the request of the church",
  "summary": ""
}