{
  "id": "6527",
  "title": "Campers find a large track",
  "date": "2003-06-21",
  "timestamp": 1056153600,
  "observed": "A college friend and I where camping just out of Index. We got up on a late damp Saturday morning about 10:30. We decided to take our cameras and [get] some pictures of the wilderness. I [have] lived in Washington my whole life and spent a lot time in the woods with my father. He moved here from Tennessee and was excited to see the wilderness of Washington. We spent a lot of time around the North Fork of the Skykomish that day. About 3:00ish we went back to camp and chose to go down a part of the road we camped on that had been blocked off by small trees that had fallen across (it looked like it had not been used for a long time), in [the] hope [of] finding some cool river shots. We headed south down the road thru the damp brush about a 1/4-mile. As we were walking in the area I noticed some small tree that where broke off at about 8 to 9 foot height and 4 to 6 in dia., at the break. It made me curious but I didn't say anything to my buddy. Then about a hundred and fifty yards or so, (give or take) we walked across a soft area in the road. At first I saw [only one] footprint but looked again, it was big and other than the ones we left it was the only one. It looked like the right footprint but no others, we found the soil was too firm. I asked my friend to put his foot next to it to compare. He wears a size 10 1/2 to 11 this was much bigger. I repeat, much bigger. So I took pictures of it with my camera.",
  "classification": "Class B",
  "county": "Snohomish",
  "state": "Washington",
  "latitude": 47.8901,
  "longitude": -121.3676,
  "location": "-121.3676,47.8901",
  "location_details": "",
  "temperature_high": 58.09,
  "temperature_mid": 53.315,
  "temperature_low": 48.54,
  "dew_point": 44.42,
  "humidity": 0.74,
  "cloud_cover": 0.67,
  "moon_phase": 0.75,
  "precip_intensity": 0.0105,
  "precip_probability": 0.72,
  "precip_type": "rain",
  "pressure": 1013.09,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 8.8,
  "wind_bearing": 225,
  "wind_speed": 4.91
}