{
  "reportId": "4738",
  "title": "Fishermen encounter upright, slender animal near Lone Butte",
  "date": "2002-08-03",
  "timestamp": 1028332800,
  "observed": "My son (31)  and myself were returning from a fishing expedition  in the Gifford Pinchot Ntl Forest, SW Washington.  All of a sudden, less than 100 yards away, we noticed an entirely black upright creature. Even though we're driving a noisy Cummins Diesel , when we came around the corner, going about 15 mph,  we managed to startle it. It immediately walked fast - didn't run - from the right to the left, up a hill and was gone. Now this whole event didn't take more than 3-4 seconds. We immediately went to the area, and investigated. We found one print that was about 12-13 inches long on the side of the road. This print was made in the somewhat soft silt/gravel that is so common on forest service roads. It only was about 1/4-1/3 deep at best.  Today we're going to try and make a copy of the print. A couple of things about the animal. 1.  It was totally black, like a black bear. It had no facial features that we could detect at all. It didn't appear to have a nose, eyes, mouth or anything, that we could see from the 100 yards we were away. 2.  The animal was in bright sunlight as it crossed the road - there was no mistaking it for a bear - and bears don't have 6 ft strides. 3. The animal appeared to be about 8-8.5 feet tall and slender build. It wasn't the massive muscular specimen I have thought they may be if they exist at all. I would estimate the weight in excess of 400 lbs. 4.  The animal's arms moved in a pedulum manner, like an ape - not like a human.  It moved very fast - BUT NOT a RUN!",
  "classification": "Class A",
  "county": "Skamania",
  "state": "Washington",
  "latitude": 45.8083,
  "longitude": -121.9063,
  "location": "-121.9063,45.8083",
  "location_details": "",
  "temperature_high": 74.61,
  "temperature_mid": 64.89,
  "temperature_low": 55.17,
  "dew_point": 48.02,
  "humidity": 0.63,
  "cloud_cover": 0.28,
  "moon_phase": 0.82,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.75,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 7,
  "visibility": 9.7,
  "wind_bearing": 304,
  "wind_speed": 5.43
}