{
  "reportId": "2170",
  "title": "Youths see unknown hairy primate staring at them from distance",
  "date": "2001-04-02",
  "timestamp": 986169600,
  "observed": "Me and 5 friends were walking in the woods at night on April 2nd this year and we saw something pretty big and real thick and furry crouching behind a bush that was in between two trees. He had his hands on the tree and poked up to look at us. We had a video camera with us at the time but it does not show the creature. The reason we had the camera with us was because the all the dogs in our town were going crazy the last few days and we had heard odd noises coming from down in these woods which were right along side the Des Moines River. We got extremely scared at the sight of this thing and took off running right after we flipped the camera light on to try to get it on tape. The next morning we went down to the same spot to try to find some evidence. We found nothing real important there except some broken twigs and what not. However a little ways away we found a large femur bone either from a cow or a human -- it was much to big to be a deer and wasn't a horse. This led us to dig around and we found 22 more bones. We also notices a bunch of fur around that area like rabbit or something. About a week later we went back during the day cause we were scared of night and found a deer dead with its rear bit completely off, shredded. We still have these bones and movie. We reported it to the police they said to give them the movie and bones. I was wondering if this would be the right thing to do. I would be glad to show any skeptics out there the tape and bones and if you come soon enough the deer but I imagine it will rot soon.",
  "classification": "Class A",
  "county": "Humboldt",
  "state": "Iowa",
  "latitude": 42.72063,
  "longitude": -94.22206,
  "location": "-94.22206,42.72063",
  "location_details": "Sumner ave bridge if your going soutwest then take a left before the hill and go over into the woody area and walk about a 1/4 of a mile down ther take right and down about 50 yards.",
  "temperature_high": 50.21,
  "temperature_mid": 42.365,
  "temperature_low": 34.52,
  "dew_point": 34.02,
  "humidity": 0.76,
  "cloud_cover": 0.32,
  "moon_phase": 0.3,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.17,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 5,
  "visibility": 9.37,
  "wind_bearing": 63,
  "wind_speed": 5.86
}