{
  "reportId": "29549",
  "title": "Memory told of a possible daylight sighting while driving deer on a farm east of Iron River",
  "date": "1960-10-31",
  "timestamp": -289353600,
  "observed": "The sighting that occurred in the late 1960s was in an area which is off Hwy US 2 between Iron River and Crystal Falls.  This is where my brothers and I grew up. At the very end of the road, about 1 1/4  to 1 1/2 miles in, is an old farm.  My brothers and I, as kids, were driving deer in mid November during hunting season.  My brother was posted along the western fence line of a 40 that is 1/4 mile farther than the end of the road and then 1/4 mile or slightly more west. (I have looked for this 40 acres on google earth recently and it shows up very well.  You can still see the fence line.) My step-uncle raised beef so all his 40s were well fenced with 4 or 5 strands of barbed wire and roads along all the fence lines.  As we were maybe half way through our drive, two deer came running towards us and jumped the northern fence line. When we finished the drive and I talked to my brother he was excited and scared, he said he saw an abominable snowman.  We didn't know about bigfoots back then.  I didn't want to believe him but he wasn't the type of kid to make up a story like that. I saw tracks in the snow but I just thought it was from the deer. Now that we are adults, he is 53 now, his story is the same.  He said when he was posted he saw movement out of the corner of his eye and looked along the fence line.  The bigfoot stepped over the barbed wire fence, coming from the west, and then stepped over the fenceline on the north, the direction the deer went.  He said It was huge, about 8 feet at least, and hairy, brown/black and could just step over the barbed wire fence with no problem.  The area was wooded with mature aspen and evergreens with some underbrush.  There are lakes in the area and springs and a railroad grade.  The weather was clear and it was around mid day. There was some snow cover on the ground but not very deep. The wildlife in those days was mostly deer and bear.  Now there are wild turkeys, wolves, coyotes, bobcats, deer and bear.",
  "classification": "Class B",
  "county": "Iron",
  "state": "Michigan",
  "latitude": 46.10294,
  "longitude": -88.45181,
  "location": "-88.45181,46.10294",
  "location_details": "",
  "temperature_high": 49.13,
  "temperature_mid": 44.71,
  "temperature_low": 40.29,
  "dew_point": 46.54,
  "humidity": 0.97,
  "cloud_cover": 1,
  "moon_phase": 0.41,
  "precip_type": "rain",
  "pressure": 995.41,
  "summary": "Foggy in the morning.",
  "uv_index": 1,
  "visibility": 2.77,
  "wind_bearing": 92,
  "wind_speed": 8.66
}