{
  "reportId": "1674",
  "title": "18\" tracks found in the snow by two witnesses who felt like they were being \" hunted \" by something big.",
  "date": "2000-02-06",
  "timestamp": 949795200,
  "observed": "Driving up road, we hit snow. In a clearing we noticed lots of tracks of wildlife then some large foot prints on left side of road. We investigated the prints. It was definitely bare foot prints coming down the side of the road then turning up into the woods. The feet were 18\" long. A large heel and tows were visible. We turned the truck around, parked near the prints, and started a fire. My friend, Rob knocked two logs together three times then repeated this twice. Within 10 minutes at around 11:45 we heard a bark from a distance. 5 - 10 minutes later I heard the sound of a person whistling for a dog but there were no cars around that we could see nor were there any on the way up to our location. Immediately after the whistle, I heard more whistling in the same direction but from multiple sources. The whistling began to sound like small birds or birds chirping. Rob and I contemplated what kind of a bird would be in the mountains chirping at midnight in the middle of winter. We figured there are none. At about 12:15 I heard some fast paced foot steps beyond our field of vision. We viewed the area with our flashlights and I didn't see anything. Rob told me on the drive out of there that he saw something cross the road while we heard the footsteps. The footsteps sounded bipedal. Then Rob heard a branch brake behind him behind a pile of logs. I asked if he'd like to leave because I was feeling like we were being approached by something big and I couldn't see it. Rob later commented that it was as if we were being hunted. We headed out at about 12:30 feeling that we were leaving just in time before whatever it was got too close.",
  "classification": "Class A",
  "county": "Snohomish",
  "state": "Washington",
  "latitude": 47.7853,
  "longitude": -121.6647,
  "location": "-121.6647,47.7853",
  "location_details": "Turn off Hwy 2 on FR 62. 3 miles up main dirt road. Area has recently been clearcut. We were just above the snow level. There was a foot of snow on the road.",
  "temperature_high": 51.58,
  "temperature_mid": 47.275,
  "temperature_low": 42.97,
  "dew_point": 42.75,
  "humidity": 0.87,
  "cloud_cover": 0.7,
  "moon_phase": 0.04,
  "precip_intensity": 0.005,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1024.81,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 7.85,
  "wind_bearing": 109,
  "wind_speed": 3.37
}