{
  "id": "8896",
  "title": "At dusk, swimmers hear vocalizations and whistles near Lake Oroville",
  "date": "2004-06-21",
  "timestamp": 1087776000,
  "observed": "It was dusk my friend, his girlfriend and I were relaxing and swimming at a launch ramp off of Vinton Gulch Road near Oroville CA. When we got there we heard faint sounds like there were two, what we thought at the time, mountain lions calling each other off in the distant. My friend fished while I explored and his girlfriend swam. When all the other anglers that we fishing too me and my friend started making very loud sounds just to hear the echos off the surrounding canyons of Lake Oroville. Then I remembered hearing on one of the sound recordings off of this website and how there was sort of a whistle at the end of the recording from bigfoot so I started trying to imitate the whistle. Well after about five minutes I heard something \"running\" through the treeline of thick bushes above the lake line. It was coming towards us. I asked if anyone heard that and the said no. Right after I said that we heard the same sound earlier but within I'd say 200 ft from us at the bush line. We jumped in the car and turned around so we could make an escape in case anything attacked. My friend shined his light along the treeline and seen some eyes low at the tree line. So I stared whistling like I did before and it would make its sound softly. Well after three times I started mocking it and to our surprise and what made us leave was it whistled back to us. We took off. I tried finding sounds of mountain lions off of the internet that sounded the same but to no avail. Then I listened to monkey and bigfoot sounds and the only thing that came close was a Black Howler monkey. It had almost the same cooing sound. I don't know if it was a mountain lion that could whistle but I believe bigfoot is around and I will continue hunting on around Oroville CA for signs or answers.",
  "classification": "Class B",
  "county": "Butte",
  "state": "California",
  "latitude": 39.53722,
  "longitude": -121.4822,
  "location": "-121.4822,39.53722",
  "location_details": "North down Hwy. 70 of Oroville. Turn right down Cherokee Rd. Turn left down Vinton Gulch Rd. to launch ramp on Lake Oroville",
  "temperature_high": 88.38,
  "temperature_mid": 74.165,
  "temperature_low": 59.95,
  "dew_point": 52.8,
  "humidity": 0.5,
  "cloud_cover": 0.02,
  "moon_phase": 0.12,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1010.37,
  "summary": "Clear throughout the day.",
  "uv_index": 11,
  "visibility": 8.79,
  "wind_bearing": 176,
  "wind_speed": 5.39
}