{
  "reportId": "1783",
  "title": "Night hunters hear strange screams in the woods",
  "date": "1985-08-15",
  "timestamp": 492912000,
  "observed": "From the top of this hill the river was almost visible about a mile away through the darkness. We got out of the truck and stood and looked down toward the river. I was raised in the outdoors hunting, fishing, trapping and watching wildlife. I like to imitate owls at night just to hear them respond to me. As my friend and I stood on the side of this hill I began to hoot to see if any owls would respond from the river bottom. Instead of being rewarded with owls responding to my calls I heard a scream or moan about three quarters of a mile away like I had never heard before. I asked my friend what in the hell was that? He replied that it was probably what some of the old farmhands referred to over the years as the hairy man, which some of them had told of seeing from time to time for many years. I hooted once again and the same scream replied only closer this time. We stood there a little longer and could hear something big coming up the hill through the woods very quickly. By the time we got into the truck we were treated to another hair curling scream still in the woods but getting close to the hayfield. We cranked the truck and drove as fast as we could thru the bumpy field. When we arrived at the gate my friend asked me to get out and close the gate so that nobody could trespass onto the property. The gate was a quarter to a half a mile away from where we were run out of the field. As I opened the truck door to get out I was treated to yet another scream from the hay field. The gate did not get closed that night. What this was I do not know. I know that there was no livestock kept in this part of the farm. I do know that if this thing were discovered and somehow befriended that it would be a great asset to the U.S. Olympic team, for neither Jesse Owens or Carl Lewis can run cross country like this thing. This incident happened to me in 1985.",
  "classification": "Class B",
  "county": "Autauga",
  "state": "Alabama",
  "latitude": 32.4456,
  "longitude": -86.5653,
  "location": "-86.5653,32.4456",
  "location_details": "The events that I can describe took place along the Alabama River in Autauga Co. Aabama between the city of Prattville and the town of Autuagaville within a five or six mile radius of a creek named Rocky Branch",
  "temperature_high": 88.62,
  "temperature_mid": 80.595,
  "temperature_low": 72.57,
  "dew_point": 71.47,
  "humidity": 0.81,
  "cloud_cover": 0.67,
  "moon_phase": 0.97,
  "precip_intensity": 0.0042,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1017.12,
  "summary": "Humid and mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 7.12,
  "wind_bearing": 128,
  "wind_speed": 4.82
}