{
  "id": "9001",
  "title": "Possible howls heard near Thomaston",
  "date": "2004-07-15",
  "timestamp": 1089849600,
  "observed": "A relative recently built a house in a slighty remote southern area of Upson County. The property of about 50 acres has a small lake which has been there for about 30 years.  A few miles south is lots of wooded areas, and the county is bordered by the Flint River. Around June 15, 2004, about 10:00 A.M  one mostly cloudy, but hot and humid morning, I arrived at her house to plant some flowers in her flower bed.  I had been there about 45 minutes and had taken a break to drink some water when I heard a sound that I had never heard before, but knew for sure that whatever it was, had power behind it. It really got my attention since I was alone at the time.  I listenned for about 2 more minutes and I heard the sound again much clearer and could tell that it seemed to be coming down towards the lake.  The lake can't be seen from the house.  This creature called Bigfoot automatically came to my mind because I knew it had to be powerful to produce that sound.  I left immediately because I was frightened and came home to look on the internet for bigfoot sounds.  I found on the Oregon Bigfoot site the sound.  the first 2 screams on the \"Puyallup Screamer\" file is exactly what I heard.  I told my cousin's roommate that I had heard something and she said immediately that I should talk to my cousin because she had heard it too.",
  "classification": "Class B",
  "county": "Upson",
  "state": "Georgia",
  "latitude": 32.80865,
  "longitude": -84.25755,
  "location": "-84.25755,32.80865",
  "location_details": "",
  "temperature_high": 88.8,
  "temperature_mid": 76.955,
  "temperature_low": 65.11,
  "dew_point": 68.41,
  "humidity": 0.69,
  "cloud_cover": 0.22,
  "moon_phase": 0.94,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1011.04,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 9,
  "visibility": 9.3,
  "wind_bearing": 315,
  "wind_speed": 5.53
}