{
  "id": "8069",
  "title": "Witness hears late night screams near Yreka",
  "date": "1994-07-15",
  "timestamp": 774230400,
  "observed": "I was sitting outside on the back deck of my ex girlfriend's mobile home at, approximatly, 12:00 A.M. enjoying a smoke before going to bed for the evening.  About five minutes after I went outside, I noticed a faint, but still very pungent, odor on the breeze. Kind of a cross between skunk, rotting carcass, & very dirty wet dog.  I've lived in the area all of my life, and hunted around the local hills and gulches, and have not encountered a smell quite like this before or since.  The smell came in on the breeze from the west of the trailer, up the hill from the property. I am a believer in the Sasquatch, having read, watched, and listened to as much information as I could get my hands on from the time I could read. About a week after the incident, I was working on a bicycle on the back porch, at about, 10:00 or 10:30 P.M., when I heard a low gutteral growl/hoot type noise, coming from behind me.  I would say from the volume of the noise, the critter that produced it was, maybe no more than 100 to 200 feet away.  That would have put the area it was in about halfway between our trailer, and the neighbor up the road.  Due to spending a considerable amount of time in the woods hunting, and just hiking around, I have encountered or heard just about all of the wildlife in this area, this sounded like nothing I have heard before.  The strange part of the encounter, was the fact that our German Shepherd Rottweiler cross heard nothing, nor did any of the other neighbor's dogs.  I went inside to retrieve my handgun and a flashlight to check around the vicinity, but found nothing out of the ordinary.  However due to the time year the ground was way too dry to accept any tracks. ",
  "classification": "Class B",
  "county": "Siskiyou",
  "state": "California",
  "latitude": 41.72944,
  "longitude": -122.6361,
  "location": "-122.6361,41.72944",
  "location_details": "The property is about 3/4 of a mile to 1 mile west of town proper. just on the city limit line.",
  "temperature_high": 91.29,
  "temperature_mid": 73.88,
  "temperature_low": 56.47,
  "dew_point": 46.26,
  "humidity": 0.41,
  "cloud_cover": 0.13,
  "moon_phase": 0.24,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.57,
  "summary": "Partly cloudy overnight.",
  "uv_index": 10,
  "visibility": 9.45,
  "wind_bearing": 344,
  "wind_speed": 6.4
}