{
  "reportId": "22358",
  "title": "Hiker Discovers Possible Bigfoot Scat in Rock Springs State Park",
  "date": "2007-03-15",
  "timestamp": 1173916800,
  "observed": "To this day I cannot honestly say this was a sighting or not. I will leave that conclusion to those with more knowledge of Sasquatch behavior to decide. At the time my knowledge of Sasquatch, Bigfoot or the skunk-ape was limited only to what I had seen on t.v. or read in the papers rarely. In fact, I was under the belief that the Patterson tape had been debunked and bigfoot was probably a myth. It was a clear March day and I being off from work decided to take a day hike in Rock Springs State Park. The park is not heavily used I think mainly because its reputation for a healthy black bear population keeps city dwelling day hikers well clear of it. I have hiked many time in bear country and the idea of a bear encounter wasn't a worry. I decided on a loop trail approximately 2 miles in length basically as a warm up then planned on hiking different parts of the area. The woods very basically slash pine and palmetto with clear scrub meadow and shallow swamp areas a little deeper in. A well defined trail led through the palmetto. About 1/2 a mile in I noticed the woods had become very quiet and I began to feel as if I was not alone but being watched. In the middle of the trail I came upon a very large of very fresh scat. It was directly centered in the middle of the trail and the stools were incredibly large and long approximately 3 having lengths of between 9 and 11 inches. This was not bear scat as I have seen piles of that before and never saw continuous lengths of stool such as this. Again feeling that I was not alone I developed the strangest feeling that this was there for me to find and that it was meant as a warning not to go further. The fear I felt became almost irrational but I had no doubt I should turn around and leave this area. I have spent many hours in the woods but had never felt this type of flight or fight feeling. I now know that primates have used scat to mark territory and warn others away. Could this have been a warning left by a primate to me? I honestly don't know.",
  "classification": "Class B",
  "county": "Lake",
  "state": "Florida",
  "latitude": 28.80455,
  "longitude": -81.45354,
  "location": "-81.45354,28.80455",
  "location_details": "SR 46 west. The park is south of SR 46 just past the Wekiwa River and north of the main Wekiwa River State Park. Trail is on the west side of the main park road approximately 1/4 mile past the main gate.",
  "temperature_high": 80.24,
  "temperature_mid": 73.54,
  "temperature_low": 66.84,
  "dew_point": 60.73,
  "humidity": 0.72,
  "cloud_cover": 0.37,
  "moon_phase": 0.87,
  "precip_intensity": 0.0041,
  "precip_probability": 0.67,
  "precip_type": "rain",
  "pressure": 1016.9,
  "summary": "Light rain overnight.",
  "uv_index": 7,
  "visibility": 8.95,
  "wind_bearing": 150,
  "wind_speed": 6.8
}