{
  "reportId": "6020",
  "title": "",
  "date": "",
  "observed": "I think I might have seen something while I was in South Carolina last May, but I'm really not sure. Anyways, I live in Florida and last May I went on a herping trip to South Carolina looking for snakes to collect and photograph.While I was in Francis Marion National Forest walking a trail with my eyes set to the ground on the side of the trail looking for snakes I saw something leap across the trail about 50 yards ahead of me from left to right in one leap.It was on two legs about the size of a person or bigger and was uniform brown in color.This is basically all I saw. I was only about 15-20 minutes into the trail when this occurred.The trail was very narrow but straight and densely wooded on either side.I was by myself and I never saw anybody else on the trail or in the park during my time there. I know this is disjointed but let me try to describe this further. After I saw this thing leap across the trail ahead of me, I stopped in place and listened, somewhat startled.I did not hear anything going through the woods. My first thought was it was a hunter,then I thought it might be a weird person following me or something,so I started to get a little worried and thought of turning back towards my car.I tried to play back in my mind what I saw,because it was somewhat of a blur when it happened.That's when I ruled out it was a person because it was all brown in color and had to be fur and not clothing.It knew it wasn't a deer because it was on two legs when it leaped across the trail.It was definetley a human shape though.After some thought I decided to proceed forward up the trail where I saw this thing cross.I had a 40 inch metal snake hook with me that I thought I could use if I needed to.When I got to the place I thought it crossed I looked through the thick trees to see if I could see anything but I did not. I resumed my snake hunting on the trail but I was looking over my shoulder the rest of the way.I returned back the trail a couple of hours later and did not see anything.I have to say it wasn't till I returned to my hotel room in Mt.Pleasant that I seriously thought what I saw  might be something out of the ordinary.",
  "classification": "Class B",
  "county": "Berkeley",
  "state": "South Carolina",
  "location_details": "SouthEast part of Francis Marion National Forest.East of US 17.",
  "summary": ""
}