{
  "id": "32024",
  "title": "",
  "date": "",
  "observed": "It was Aug or Sept of 2011.  Warm night, around 3:30am.  We were raising broiler chickens (meat birds) in chicken tractors (mobile chicken coops).  Our bedroom window was open and I heard the sound of a squawking bird.  I jumped out of bed, grabbed the rifle (.22) and a Mykyta flashlight and ran outside--thinking coyote.  I shuffled down the slope behind our garage--toward the sound and toward the general area where the coops were--and paused at what I saw.  100 feet (I measured it the next day) ahead of me, and up the slope on the other side of this dip, was something--and I do not know what.  I shined the light on something that had huge orange eyes and was staring right at me--and standing over one of our chicken tractors.  I am guessing it was at least 6 to 6.5 feet tall, as I had my wife stand where it was the next day and she is about 5' 3\" and it was way higher than that (maybe 7?).  I just stood there and stared at it.  I could not make out the rest of its body size or shape.  We just stared at each other.  Seconds passed and I thought about firing at it, but my one neighbor to the south's house was right in line with him/it, and him/it being uphill of me, I'd be firing up, into the air, and toward homes--so I did not.  Also, my mind was swimming around trying to figure out what exactly I was looking at.  We continued to stare at each other.  I could see his eyes quite clearly, like detail of them.  Or so it seemed.  For whatever reason I decided to at least put the rifle in position to fire if need be.  It had been resting over my forearm, while I aimed the flashlight at it.  I took maybe 1 to 2 seconds, looking down at my hands as I positioned the rifle and flashlight together and lifted them--and he was gone.  I looked around all freaked out, didn't see him, so ran up the hill, just running forward, flashing the rifle and flashlight in all directions--all the time running south.  I quickly tuned into the sound of something crashing through the brush on my right.  It sounded like something sprinting through the thick bramble and saplings and I could hear it breathing, exerting itself--and moving very, very fast, to the SW.  I stopped and just listened to it until I couldn't hear it anymore.  It was running very fast--covering ground quickly.  Coming back to the chicken tractor, there was a pile of feathers sitting just outside the coop.  The bird (only one in there at the time) was fine, but missing many feathers from her rear end.  Usually, when a coyote gets them, or anything else, there will be digging of some kind.  There was none.  I went back inside and went to bed. This is the second odd encounter within maybe a 1-2 month window.  It was again around 3:30-4:00am.  I was sleeping and heard something screaming outside.  At the time we had multiple chicken tractors set up in three different locations to the south of our house, plus a chicken coop in the barn.  I assumed it was coyotes getting at the chickens and jumped out of bed, grabbed rifle and flashlight and this time ran out the front door--as it sounded like it might have been from the tractors best accessed that way.  I sprinted out, over to the birds, and they were all sleeping.  I then heard the screaming again and it was clearly coming from the west, over near the pig pens and barn.  The sound continued as I ran past the pig pen (no action--all asleep) and past the barn (coop secured and closed).  The screaming led off directly west.  It sounded like it was just beyond the barn and moving west.  Like, I ought to have seen it, but was running and unable to locate it with the flashlight.  I paused at the corner near the pig pen and barn and shined the light up the two-track directly west and saw two large, orange eyes aimed right at me.  I measured the distance the next day and it was almost 300 feet exactly (~290).  The eyes stayed put, staring right at me.  I felt no desire to shoot and based on my previous encounter felt like this might be a sasquatch and why shoot it?  We stared at each other for maybe a minute?  Then it calmly turned (to its left--my right) and disappeared.  I had zero desire to go after it.  I went back inside and went to bed.  The sounds I had heard were like...screeching/howling/wailings.  Loud!  Ape-like.  Like Animal Planet.  Like jungle ape sounds. Third report within about a 1-2 month period.  My family of four was out one evening doing animal chores (feeding, milking, watering).  It was around 8-9pm.  We'd gotten a late start on the chores.  It was already dark.  I was down near our pigs, my son was at the backdoor with the dogs, and my wife and daughter were in the barn milking and feeding goats.  I was filling a waterer when all of a sudden a loud, freakish howl/scream/wail began right over in the woods to the west of our barn.  I yelled out \"what is that?\"  My son yelled back \"I don't know!\"  It sounded like the wail from my previous sighting.  I dropped the hose and ran for the backdoor where the flashlight was, telling my son to put our freaking out dogs in the house.  I reached in, grabbed the flashlight and ran off into the woods.  All this time it was still wailing, and as I ran past the barn and up into the woods it had stopped.  I called my son to let the dogs out and they came out to me and tore into the woods.  They were gone about 3-4 mins and came back all excited but otherwise fine.  We all heard it, saw nothing, and wondered what it was.",
  "classification": "Class B",
  "county": "Grand Traverse",
  "state": "Michigan",
  "location_details": "",
  "summary": ""
}