{
  "reportId": "8435",
  "title": "Incidents around a cabin near Grantsburg",
  "date": "1985-10-01",
  "timestamp": 496972800,
  "observed": "During the autumn bowhunting season, in the fall of 1985, my friend, K, his cousin, T, and myself, A, went to K's parent's cabin (along with his parents).  We were all 15 to 16 at the time. The cabin is located north of Grantsburg, WI, on the edge of a very large wilderness area.  On Saturday evening, the moon was full so the three of us went out for a walk, down the long driveway through the forest and then for a mile or so down the paved road.  Early into the walk, we heard something moving in the bushes beside the road.  K thought it might be a bear and so we began to talk louder to scare it off. We all smelled something foul on the air, like rotten meat, sulfur, and musk all rolled into one.  I jokingly said that maybe it was Bigfoot, having read about it before.  The other guys laughed and we passed it off as a skunk, though it didn't quite smell as bad as a skunk. Several times during our walk (about a mile), we heard brush snap, and once water splashed as we passed a small pond (as if something was thrown into the pond).  At the time we were too engrossed in our conversation to fully pay attention to these seemingly isolated incidents, but putting them together now it appears as if we were being followed.  After about a mile, we all got a sort of creepy feeling, and decided to head back.  Just as we were getting back to the driveway of the cabin, the trees to the right of us started thrashing violently, as if a large man had grabbed them and was shaking them vigorously.  At that point we bolted for the cabin, running down the long dark driveway.  Once we were back at the cabin, we all attributed it to a bear. It was then about 10:00 at night and we all headed up to the upstairs room where the three of us were staying.  K's parents were settling down for the night and going to bed downstairs.  We stayed up late that night playing games quietly in our room.  The room had three beds and two windows.  We all went to bed at around 1:00 am.  Sometime in the night something woke us all up and we sat up in bed. The silhouette of a head and large broad shoulders blocked one of the windows.  The moon was full outside and back lit it.  The head was conical in shape, and slightly furry looking.  In silhouette, it looked like a guy with a really big head wearing a furry hood.  The most striking things were its eyes, they were lightly glowing orange-red.  They were positioned on the front of the face, like a primate's and not like a bear. The face was very close to the window, like it was trying to peer in.  I don't remember any other details of the face, as I was very frightened.  I, being the closest to the window, jumped out of bed away from it.  The other guys started telling me in hushed and urgent voices (though K says he remembers yelling) to shut the window shade.  At that point the head went down and was lost from sight.  I shut the shades and we all sunk into the beds, badly shaken.  I don't remember falling asleep, but we all woke late the next morning.  We didn't really look for tracks.  The dog was kind of spooked all that day and wouldn't go on a walk with us (very abnormal for this dog). We did not discuss the incident with K's parents; afraid they would think we were nuts. By the way, the windows were about 12' off of the ground, but there was a Weber grill under the windows and a horizontal 2x4 about 8 ' up. I assume that whatever it was used the 2x4, the window sill, or possibly the roof line to pull itself up to the window.",
  "classification": "Class B",
  "county": "Burnett",
  "state": "Wisconsin",
  "latitude": 45.776,
  "longitude": -92.683,
  "location": "-92.683,45.776",
  "location_details": "About 4 miles north of Grantsburg, WI.",
  "temperature_high": 46.3,
  "temperature_mid": 38.805,
  "temperature_low": 31.31,
  "dew_point": 32.48,
  "humidity": 0.78,
  "cloud_cover": 0.64,
  "moon_phase": 0.58,
  "precip_intensity": 0.0018,
  "precip_probability": 0.3,
  "precip_type": "rain",
  "pressure": 1016,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 2,
  "visibility": 9,
  "wind_bearing": 270,
  "wind_speed": 10.67
}