{
  "id": "7427",
  "title": "Four youths have harrowing experience in Alabama backwoods.",
  "date": "2003-11-26",
  "timestamp": 1069804800,
  "observed": "On approx. January 5, 2000, three friends and I decided to camp on one of my friend's land.  We had two fourwheelers and a dog with us.  It was a rainy day and the ground of surrounding area was significantly wet.  We decided to camp anyway.  It stopped raining about dusk when my friend and I started to pitch the tent, while the other two went back to there house for some more supplies.  Mind you we were only camping about a mile from the road and one and a half miles from the landowner's home.  About ten minutes after their departure me and my friend started hearing strange grunts, foul smell, and heavy footsteps. It went on for about ten minutes, with sounds getting closer and at random, as though the \"animal\" was trying to scare us or get us to make a move. It stopped when my friends arrived back and we dismissed as deer, spooked by our presence. We told of the incident to our friends and the landowner's son explained that his dad had been experiencing \"strange\" occurences lately.  We went on with our camping and rode four-wheelers for about two hours. When we arrived back at camp, we decided to stay for the rest of the night. About ten minutes after arriving back, the same strange grunts and heavy steps began again. This time they were more aggitated and frequent. The sounds came within at least twenty yards of our camp. The area is heavily wooded so I could not see the animal at this time. The animal was across the creek at the beginning of the sounds and eventually jumped down into the creek, about a seven foot drop, and stayed there making grunts and heavy steps there for about five to ten minutes.  Being very frightened and defensive, I picked up about a ten pound rock and threw it in the vicinity of the animal below in the creek. I could not see the animal due to the foliage. It must have hit the animal because it gave a loud shriek and ran up the creek away from us, then jumping back up on the bank, a seven foot jump, and running back behind our campsite. It then proceeded to make very loud grunts and ran around the back of the campsite about twenty yards away in the woods out or our fire's sight. It then stopped and we could hear it breathing heavily. Talking amongst ourselves and shouting at the animal, it then made the most blood-curdling scream I have ever heard. I would describe it as high-pitched and seemed to echo everywhere around us. I have heard bobcats and screech owls and can tell you this was not one.  We then proceeded to leave hasitly on our ATVs and went and got the father of my friend. He came back with us and stayed awhile with no occurences. He left and we somehow got ourselves to stay for the night. Nothing happened the rest of the night and we went to sleep. I awoke at 3am to the same grunts and heavy footsteps. This time they were very close. They lasted by my watch til 345am. Not awaking my friends in fear of the animal becoming aggressive, I laid there and listened to this animal. Afterwards, I laid there until sunrise and told my friends of the sounds and occurences of the night. They asked me due to my, as they described, pale face and rattled demeanor. We then went and looked for any evidence of the animal. We found locks of hair in the trees, approx. seven foot high, and numerous large footprints, similar to a humans, but with no arch and a very large great toe. We then proceeded to follow the footprints to where, amonst downed trees and foliage, we found where a large animal had been laying. We found hair there also. We continued to trail the animal's leavings when came across the same sounds of footsteps. They were too scared to go over the hill and see the animal making the noise so they told me to. Reluctantly I did, and saw a large upright creature, approx. seven to eight feet tall, walking with its back to me. It was covered in hair, black to dark brown, and had an awful smell. It turned and alarmed by my presence ran away from me. I then turned and ran away from it towards my friends who I shouted to to run. They got up and ran and we ran back to our campsite and stayed there where I told them what I saw.  For a few months after that we heard the same grunts and shrieks down the creek where we camped that night. We frequently rode ATVs down there and an occurence was frequent. Occurences also happened at other places, two to three miles away from the area of occurence. A sighting was also reported at a park about a mile up the road from my house, three miles from the creek. We also found footprints in nearby rock quarry. My brother and I also saw a \"brown\" animal, who we thought to be a man at first, but, trailed him to find that could not have been a man, on hunting land a mile from our house. No occurences have happened in the past three years. But, I also don't ride or camp as much, either.",
  "classification": "Class A",
  "county": "Lee",
  "state": "Alabama",
  "latitude": 32.6218,
  "longitude": -85.4258,
  "location": "-85.4258,32.6218",
  "location_details": "Near a creek that runs through the county called Phelps Creek.",
  "temperature_high": 63.58,
  "temperature_mid": 57.54,
  "temperature_low": 51.5,
  "dew_point": 36.46,
  "humidity": 0.62,
  "cloud_cover": 0.06,
  "moon_phase": 0.11,
  "precip_intensity": 0.0028,
  "precip_probability": 0.81,
  "precip_type": "rain",
  "pressure": 1019.87,
  "summary": "Mostly cloudy overnight.",
  "uv_index": 3,
  "visibility": 9.61,
  "wind_bearing": 123,
  "wind_speed": 1.92
}