{
  "id": "49182",
  "title": "Memory told of a possible childhood encounter at Georgefield Barracks",
  "date": "2017-01-24",
  "timestamp": 1485216000,
  "observed": "In 1953 I was a 10 year old girl living in George Field (Barracks), IL. George Field was a WWII air base for pilot training & the barracks housed airmen and brass. After the war the Barracks were converted to civilian apartments & my family lived in one. George Field was in an extremely remote area between Vincennes, Indiana & Lawrenceville, Illinois. The Wabash River was east close to Vincennes and the Embrass River was west - the rivers approximately 20-30 miles apart. The Barracks were surrounded by miles of corn and wheat fields. Often during the night I heard high pitched screams like a woman being attacked or killed. My parents told me the screams were panthers – I never saw any panthers. My sisters and I walked the corn and wheat fields as often as we could. Old timers told us to be careful of the “Grassman” which I later learned was their name for Big Foot. I thought Grassman was like the Wizard of Oz Scarecrow. One night my parents went out and left me with my older sister (who has since passed away). She was always teasing, aggravating and pulling pranks on anyone foolish to fall for her drama! That night she came close and said to me “Judy, there is something outside the window. Seriously, there is a monster outside came to the window – listen, you can hear it.” To shut her up I moved to the window and listened. (Our windows were usually open because we had no air-conditioning) I could hear something large moving around and saw a large head in the shadows. It walked around all the windows trying to look in and went from the back of the house to the front. Meanwhile, our middle sister came home – I knew she’d be coming in the front door where the monster was. I gathered all my nerve, opened the front door, turned on the porch light and screamed to my sister there was danger out there. I found myself looking eyeball to eyeball with the “Monster”. I am now 71 years old and know it was Bigfoot, which I didn’t know at the time. It had honey blonde hair and beautiful amber colored eyes. We startled each other, but it had an “Oh Shit” look on it’s face. My sister who had just returned home came running toward it and it turned to leave. My sister and I looked at each other for a second and “Bigfoot” was gone – disappeared instantly. Neither I nor my two sisters ever talked about it – we all forgot it – never told our parents or anyone. My memory of this incident never came back. 61 years later I started watching your T.V. show “Finding Bigfoot” – I’ve always had an interest in these creatures. It was like someone threw a switch and I remembered. I asked mys sister if she remembered anything and it came back to her. She remembered me screaming and also her chasing this “Bigfoot” thing. She said she chased it because I was hysterical and scared to death. I asked her if she ever told our parents or anyone and she said “no, she had also forgotten about it.” How can this be after 61 years? I think we were both so terrified our minds simply suppressed what we’d seen and your T.V. show was the trigger that restarted my memory.",
  "classification": "Class B",
  "county": "Lawrence",
  "state": "Illinois",
  "latitude": 38.76417,
  "longitude": -87.60555,
  "location": "-87.60555,38.76417",
  "location_details": "George Field Barracks (a WWII airfield) then halfway between Lawrenceville and Vincennes, Indiana",
  "temperature_high": 43,
  "temperature_mid": 40.01,
  "temperature_low": 37.02,
  "dew_point": 35.52,
  "humidity": 0.81,
  "cloud_cover": 0.28,
  "moon_phase": 0.89,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1011.36,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 2,
  "visibility": 9.81,
  "wind_bearing": 127,
  "wind_speed": 0.23
}