{
  "reportId": "10778",
  "title": "Vocals and thrown objects experienced by two friends exploring",
  "date": "1994-08-15",
  "timestamp": 776908800,
  "observed": "My friend and I had been searching for a place called Dickerson quarry in Dickerson Md, and had just located it on a map. We had to park on some railroad tracks by the aquaduct and walk through some very dense sticker bushes and overgrowth to find the place. To describe the quarry, it is located in the middle of the woods. It is about 75 yards long and about 30 yards wide with very tall cliffs, about 50 to 80 feet tall in some places. However there are a few places where you can walk down to the waters edge. As we were approaching the quarry, we heard this very loud screeching sound coming from about 25 yards away in the overgrowth. It was very loud and it actually startled us when it first started. The only way to describe the sound would be to say it sounded like a pig getting slaughtered. We stopped walking and waited but it stopped, whatever it was. We continued walking and found the quarry, hearing the strange sound several more times, always coming from a different place. We made a survey and located a place to go down to the waters edge to sit and rest. As we made our way around the quarry we heard the screaming again. Actually coming from the area where we wanted to go! We were not too alarmed though, being curious and stupid. We made it to the waters edge and sat down and started to look around and check the place out. I had picked up a stick off the ground and got out my pocket knife and started to carve on the wood. Suddenly there was a very large splash in the water. It sounded like a person had just jumped in but when I looked up could see ripples in the water where something had gone in. Figuring it was a rock falling from the cliffs we began talking again. About 5 minutes elapsed and we heard another splash. This one bigger and it was very far away from the edge. I asked my freind \"Did you throw something in?\". He said no, he was looking at me. We looked around to see if anyone was there that we didnt see but there was no one anywhere. We sat for about 5 more minutes talking and then heard another big splash. Neither of us saw what made it but the disturbance in the water was so big we guessed it had to be something big! We started to think that someone was in the woods and didnt want us trespassing and was trying to scare us off. However as we started to really think, we became aware there was no way anyone could throw any rock that big, that far. So we made the choice to go ahead and leave. As we were climbing up and out of the quarry another splash came from very near where we had been sitting and also sounded very big. We reached the top and started to make our way to the car. We only walked about 20 feet when something came crashing through the tree branches and hit the ground near us very hard. It sounded like a 20 pound rock hitting the ground. At that point we both stopped walking and turned and really looked hard into the woods. Neither of us saw anything. As we stood there listening, I swear Ive never heard the woods more quite in my life.  We started to walk again and the objects being thrown at us started to get alot more accurate. I remember saying to my freind \"What the hell is going on?\" His response was to tell me GO!!! We took off running and reached our only real obsticle, a creek about 10 feet wide where we had to cross on a log. I went first and he was close behind. As we where halfway across the log something landed in the creek about 5 feet from me that had to be the size of a paint bucket. I didnt see if it was a rock or what but it was big. At that point I jumped for it and hit the ground running with my freind right on my tail, neither of us looking back. I have never really felt scared like that, but that day I had the thought that we might meet something that was beyond nature and not live to tell about it. Our journey into the woods took about 30 minutes due to the high growth of pricker bushes, Our journey out took about 3 minutes! We reached the car and the only after the adrenaline wore off did we realize we both were bleeding nicely from running top speed through summer overgrowth. At the time, I didnt know about the connection between the rocks being thrown at us and the screaming to bigfoot, but it sounds like a classic case. Ive only been back a few times since then and only in the winter where I can see for 100 yards!!",
  "classification": "Class B",
  "county": "Montgomery",
  "state": "Maryland",
  "latitude": 39.21564,
  "longitude": -77.4608,
  "location": "-77.4608,39.21564",
  "location_details": "Land is owned by the Monocacy Hunting Club.",
  "temperature_high": 77.48,
  "temperature_mid": 70.735,
  "temperature_low": 63.99,
  "dew_point": 58.26,
  "humidity": 0.68,
  "cloud_cover": 0.72,
  "moon_phase": 0.3,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.79,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 8.94,
  "wind_bearing": 324,
  "wind_speed": 4.28
}