{
  "reportId": "2770",
  "title": "",
  "date": "",
  "observed": "This is an old report so I don't know if it will be of any use but my wife and I remember it as if it were yesterday.  We had just moved to California from Colorado and didn't know anywhere to hike so we drove to a Ranger Station in Shasta Lake. We bought a map and although it was the 4th of July weekend we asked the rangers if there was anyplace we could go that would be isolated or not too crowded. We got a fire permit because we were planning to 4 wheel somewhere remote and then hike to a camp area. We were told to drive on a logging road next to squaw creek and were shown some turns to take to end up past the last campground on Squaw creek. We drove until we spotted a stream leading up to a meadow about 200 yards from the road. We crossed a deep creek with our camping gear and helped our dog cross because the water was swift enough to make swimming across difficult. We set up our tent and decided to follow the creek to see if fishing might be good. We were surprised by an abandoned beaver dam and the pond was full of fish. I wanted to hike a bit further and my wife wanted to finish some reading so she went back to camp with the dog. I continued hiking until I heard something following me. When I stopped it stopped. I suspected I was being followed by a couger so I made lots of noise by stepping on branches and acting like I wasn't afraid of anything. I still stopped from time to time to look toward the area of the noise and had my knife ready along with a big stick that I purposely hit against rocks and trees to make myself appear aggressive. Finally I got back to camp and my wife asked me what was going on. I didn't want to scare her so I said it was getting dark and had to get some firewood. She said the dog had been growling and looking in the direction from which I had come. I still didn't say anything mainly because I wasn't afraid because I had packed a gun with plenty of ammo. I had been hunting and in the woods all my life. I figured a fire would keep the lion away along with our talking and laughing, plus we had a big husky dog that was a good protector. When I got back to camp with some wood my wife informed me that the dog must have taked a poop around the camp site because it stunk. It did smell but I was unable to find anything to get rid of. We lit a fire and cooked then settled back to let the fire burn out. When the fire got low we were terrified by the sound of breaking branches and a sound unlike anything I have ever heard in my life. I screamed to my wife to throw more wood on the fire and rushed to the tent to get my gun. I was bowled over first by my wife then the dog. I got the gun and yelled to my wife to get the flashlights. We threw more wood on the fire and heard something retreat. At this point I got my composure back and we shined our very bright lights into the woods hoping to pick out a pair of eyes. When I didn't see any I was alamed because I thought all animals eyes glowed in the dark as they reflected light. I was thinking that there must be a man out there trying to scare us. So I yelled for whoever was out there to identify himself because I has a gun and was prepared to shoot if I heard another noise. Now I had to tell my wife what had happened on my hike and what I still assume is correct about animals eyes. We talked about going back to the bronco and leaving but decided it was too risky to walk 200 yards through the woods and then have to cross the steam in the dark where we could easily step in a hole and lose the gun or be at a big disadvantage. We decided to burn a big fire all night and stay awake. As frightened as we were I talked my wife into getting some sleep on my lap and I would stay awake. She fell asleep and then so did I. We were startled awake by the dog growling and something rushing toward us through the trees. We threw more wood on the fire and screamed into the woods that we were ready to shoot. Again a retreat as the fire got bigger. Now we were definitly awake for the rest of the night. The next morning we packed up and left. When we got down to the stream I remembered my axe shovel and saw were still at the camp so I went back for them. I was greeted by a horrible smell, but that was it so I grabbed my things and ran down the hill. When I got close to the stream I slowed down and started walking. My wife informed me that right after I left the dog was growling and looking in the direction that I had taken. Since this incident we now camp in designated campsites that have other campers. We always used to 4 wheel or hike to places to camp that were completly isolated. We never considered bigfoot until I told my story to a new friend and he mentioned that the situation was similar to bigfoot related incidents.",
  "classification": "Class B",
  "county": "Shasta",
  "state": "California",
  "location_details": "Road by Squaw Creek about 2 to 4 miles past the last camp ground. Isolated enough that we only saw two guys on dirt bikes and two forest rangers in the area long before the incident happened. The rangers checked our campfire permit and briefed us on their interpretation of a safe fire. They commented that they had never seen anyone camped this far out. It did take a 2 to 3 hours to get to the spot where we eventually camped.",
  "summary": ""
}