{
  "reportId": "1904",
  "title": "Mountain climbers hear loud scream on Mount St. Helens",
  "date": "2001-03-04",
  "timestamp": 983664000,
  "observed": "On Sunday, March 4, 2001, six friends and I attempted a climb of Mt. St. Helens via the Swift Creek route from the Marble Mountain Sno-Park.  At approximately 7:30 a.m. at 4,000 ft. elevation, we heard a scream from the ridge just to the east of the one we were climbing, about 100 yards away. The wind was blowing hard from the east, which helped to carry the sound. We all stopped, looked, and called to each other \"did you hear that?\" \"what WAS that?\" It did not sound human, so none of us thought it was a call for help.  The ridge was not part of the climbing route and access to it required a steep downclimb then up steeply. And since visibility was excellent, so there was no plausable reason for anyone to be over there. It was not an elk or coyote, and did not sound like a dog. The ridge was snow covered with just a few small trees and rocks poking through. I looked closely for signs for movement, but saw none. I told my friends half-jokingly, maybe it was Bigfoot!  They laughed, but I wondered. I listened to the Bigfoot Scream 1978 Snohomish recording and yes, indeed, it sounded exactly like that!  The difference is that we heard only one scream, not a series of consecutive screams. Based on that recording, I believe that what my friends and I heard on Mt. St. Helens was Bigfoot.",
  "classification": "Class B",
  "county": "Skamania",
  "state": "Washington",
  "latitude": 46.10861,
  "longitude": -122.1283,
  "location": "-122.1283,46.10861",
  "location_details": "The Swift Creek climbing route on Mt. St. Helens from Marble Mountain Sno-Park at approximately 4,000 ft. elevation.",
  "temperature_high": 57.93,
  "temperature_mid": 49.125,
  "temperature_low": 40.32,
  "dew_point": 34.41,
  "humidity": 0.76,
  "cloud_cover": 0.58,
  "moon_phase": 0.32,
  "precip_intensity": 0.0023,
  "precip_probability": 0.69,
  "precip_type": "rain",
  "pressure": 1009.3,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 9.53,
  "wind_bearing": 58,
  "wind_speed": 4.68
}