{
  "reportId": "1523",
  "title": "",
  "date": "",
  "observed": "I am on the mailing list for the Bigfoot reports and recently I read about there being a sighting in Ticonderoga. I have always been interested in Bigfoot and thought I would take a trip up there and see if I could find anything. I live in Pennsylvania and this was the closest report to where I live. I parked at the entrance to a hiking trail and walked in on the trail for about 1 mile before leaving the trail and climbing up a hill for about 100 yards till I came to a flat area where I would camp. I had a back pack and a tree stand plus a tape recorder. I planned to spend the night in the tree stand up a tree and try to record any weird noises. After finding this flat spot I left my gear there and went for a walk to look around. It was 4:00 p.m. and I had only gone a short distance when I found some tracks that resembled a human foot. There was no definition because the ground was covered with leaves. Just the elongated impressions going up the hill past my camp. I did find one print in some bare soil that showed a human type foot with 4 difinite toe prints but the middle toe did not show up. Assuming there should have been 5 toes. The two toes on each end of the foot were pushed out to the sides pointing away from where the middle toe should have been. The print was about 12 inches long and 7 inches wide at the ball of the foot behind the toes, and 3 1/2 inches at the heel. The toes did not taper towards the little toe as much as a human foot does, this gave it a triangular shape. I heard what sounded like somebody hitting a tree hard with a wooden baseball bat, just once, but a good distance away. Returning to camp I made supper and climbed a tree just as it was getting dark. As I pulled up my back pack with the tape- recorder inside things started to happen! There was another loud sound of wood striking wood just up the hill from where I was. It was repeated about 5 times with about a 5 second pause between strikes. Then a tree fell over but it did not make a cracking sound. It was as if it were pushed over. Not broken off. I had frozen and not recorded a sound because the recorder was still in the back pack. By the time I got it out the sounds had stopped. Then I heard footsteps up the hill from me. Everything happened just out of sight maybe 60 to 80 yards away. Needless to say I was a little shaken. About 3 hours later the hooting started. It did not sound like an owl! It sounded like a person! Just a single hoot, a pause of 3 or 4 seconds, then another single hoot. This went on for about two hours with other hoots coming from other locations on the surrounding hills. All to far away for me to record. There was an occasional wood striking wood sound in different locations the whole time. No series of hits. Just one time hits. Maybe 6 or 7 different spots around the area. All got quiet after that, real quiet! Not a sound for the next 3 hours. I was freezing so I got down out of the tree with my stuff and walked out 3 a.m. by flashlight. I was so cold that I took my chances nothing would happen, and nothing did. I did not go back after daylight. I did not want to go alone in the first place, and hearing the banging on the trees so close to me really unnerved me big time! It sounded like they were really swinging hard! I doubt if a person could ever swing hard enough to make that sharp of a sound!",
  "classification": "Class B",
  "county": "Essex",
  "state": "New York",
  "location_details": "Along route 74, approximately 9 miles west of the town of Ticonderoga. Near Eagle Lake.",
  "summary": ""
}