{
  "reportId": "7356",
  "title": "Two servicemen from Hunter Army Airfield describe tent stalking incident on uninhabited Little Tybee Island",
  "date": "1976-01-02",
  "timestamp": 189388800,
  "observed": "I think it was 2nd or 3rd Jan. 1976. I was active duty and stationed at Hunter Army Airfield. one of my Army Buddies and our wives went out to Little Tybee Island on a Camping hunting trip. We had a nicely sheltered tent inland about two hundred yards off the beach behind the dunes. The first night out was cold. It got into the high teens. The local forcast predicted record lows the next day and night. Our wives were cold and wanted to go in. We transported them back to Tybee, and we went back out for an afternoon hunt. By 1600 hrs it was too cold to stay out. Our lab was coming out of the water with ice coating her. We returned to camp and had a warm fire going, ate an early supper, and retired early. It was too cold to sit up. At aproximately 2200 hrs I awaken to our lab growling softly. Jim was awake too. He asked me, \"Robbie, is your gun loaded?\" I assured him it was. We then heard a two legged creature walking toward our tent from the rear. I say a two legged creature because Men walk differently from deer. At that time there were no deer, or hogs on Little Tybee, Although now there are. The creature stopped aproximately 30 to 40 feet from our tent.(Our tent was in a small valley, and wouldnt be visible to someone coming from the backside of the Island unil they were upon it.)There was a minute or two of complete silence. Even my Lab was extremely quiet, she acted scared for the first time I had ever seen. There was then a whooshing sound of something large whirling through the air, it struck out tent with a tremendous whump. The dog went nuts. We both unassed the tent with our six volt headlights on and our shotguns at port arms. I caught a glimpse of something very dark colored and man sized running towards the backside of the Island. I noticed an odor tha I can only describe as a cross between grey fox and civit cat, in the air. We ran after it out to the edge of the open marsh. It clearly coul run faster without lights than we could with lights. I never got close enough for a positive visual.There is nothing on the backside of Little Tybee, except miles on open salt marsh, tidal rivers and creeks,and dozens of smaller hammocks and small islands. No man could or would hav exposed himself to that marsh in those temperatures. The marsh itself was frozen hard, but the creeks wern't. Under those conditions a man would perish in minutes if he got wet in salt water. We checked the only other boat landing on the island, the creek intrance on the northeastern end of the island. There was no boat or evidence of one being there. We walked the entire beach looking for prints, or other boats, and we were the only boat on the beach. We discussed the incident awhile and concluded that we just may have had a sasquatch encounter. At the time I felt that this was unlikely as all the encounters I had ever heard of was in the Pacific Northwest. Over the years since I have come to realize that the Bigfoot egnima is world wide, in all wild places.",
  "classification": "Class B",
  "county": "Chatham",
  "state": "Georgia",
  "latitude": 31.98125,
  "longitude": -80.89485,
  "location": "-80.89485,31.98125",
  "location_details": "Little Tybee Island lies across Tybee's Back River, and slightly southwest. It is an uninhabited & Wild Barrier Island, It has never been a habitat for man. People visit it, and usually only in summer.",
  "temperature_high": 62.77,
  "temperature_mid": 53.74,
  "temperature_low": 44.71,
  "dew_point": 45.32,
  "humidity": 0.8,
  "cloud_cover": 0.45,
  "moon_phase": 0.04,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1022.55,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 7.13,
  "wind_bearing": 73,
  "wind_speed": 4.73
}