{
  "reportId": "7038",
  "title": "Large footprints found in snow above Packwood",
  "date": "2002-11-02",
  "timestamp": 1036195200,
  "observed": "Hello I'd like to start out by saying I'm not a believer.  I now consider myself a skeptic.  I started out on 01 Nov 02 on my very first elk hunt.  All my friends told me to go and hunt in Packwood.  So being in the Army I did a good map recon. Talked to the locals and head out for my hunt.  I drove about about 30 minutes north of Packwood on the 02 Nov 03 The day was kinda warm. So I packed light. I had my rifle, pistol and a small day pack with camera. I hiked about 5 hours till I got to the top of the ridge line. Stop for lunch and decided to take some pictures cause it was so beautiful up there.  There where small patches of snow behind rocks and trees where the sun couldn't reach.  As I walked around a big rock I' saw these tracks that took my breath away. Well I'm not one to scare quickly and there is not much that scares me except sharks but after see these tracks in the snow. It made me feal very uneasy. After calming down I pulled out my camera and took these 2 photos the last 2 pictures in the camera. My foot is a 11 regular but the track was about 2\" wider and maybe 3\" longer. After taking the last picture something threw a rock. It didnt push it or it didnt fall on its own it was about 150 meters away but when the rock hit it started alot of other rocks to fall. So I took out my bino's and glassed in the direction the rock came.  I could see what looked like a indention in the rocks. So after I calmed down again I decided to come down off that mountain kinda quickly.  Again I'm not a believe but something spooked me I guess it's the fear of the unknown.  Sincerely SSG Brian R. Wood U.S. ARMY ",
  "classification": "Class B",
  "county": "Lewis",
  "state": "Washington",
  "latitude": 46.7225,
  "longitude": -121.6606,
  "location": "-121.6606,46.7225",
  "location_details": "North of packwood on Tatoosh ridge.",
  "temperature_high": 50.92,
  "temperature_mid": 36.985,
  "temperature_low": 23.05,
  "dew_point": 22.63,
  "humidity": 0.64,
  "cloud_cover": 0.02,
  "moon_phase": 0.92,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1022.54,
  "summary": "Clear throughout the day.",
  "uv_index": 2,
  "visibility": 9.05,
  "wind_bearing": 107,
  "wind_speed": 1.93
}