{
  "id": "8547",
  "title": "Hog hunter watches bigfoot kill hog in Sabine River bottoms.",
  "date": "2004-04-11",
  "timestamp": 1081641600,
  "observed": "I was hog hunting from a tree stand next to the Sabine River. I had gone to my stand around 5:30 AM, put out sliced apples and table scraps to hold the hogs for a few minutes for a shot. I got in my tree stand and waited for the woods to settle down and the sun to rise. At sunup, I heard hogs rooting around, working the river's edge towards me. I could first see them to my left at about 45 degrees, about 50 yards out. No clear shot, waiting for them to get to my bait area, I noticed movement to my right about 80 yards out. Putting my rifle scope on it, I could see only the side of something's face. It was dark, hair covered and slowly moving its head around looking in the direction of the hogs. At this time it quickly moved to another tree. I could see most of its body, it was huge, standing on two legs, slowly looking around the tree at the hogs. At this time I was quite afraid but tried to keep my scope on it study its features. The hogs were still feeding towards my bait area and the animal was working towards the hogs. It moved quickly and disappeared. It quickly reappeared moving to another tree, still looking at the hogs. I could again study its features. At this time I was quite afraid but tried to keep my scope on it. Its movement from tree to tree was a quick leap, landing at the base of next tree on two feet. Standing behind tree and slowly looking around at the hogs. This continued for several minutes until they were about 30 yards apart and almost directly in front of me at about 40 yards. The animal dropped to all fours, bunched up its rear legs and leaped. It took two leaps to reach the hogs and it screamed during the second leap causing the hogs to panic for a split second. The second leap ended with it slapping one hog in its side, knocking it through the air into side of a tree. As the squealing hog bounced off the tree, it pounced on it, beating it with its fist like a person pounding on a desk. I could hear bones crunching with each hit. All this happened very fast. About 4 seconds from first leap to dead hog. The quickness of attack was very unnerving. The three live hogs were in full flight. The animal picked up the dead hog, tucked it under its arm and started walking off and let out a noise like (Grrrrrrrrrrr, whoop, whoop, whooooooop, whoop). It was immediately answered from about 200 to 300 yards out by a shorter (whoop, whoop, whoop ). After a couple more steps in the direction of the answer, it stopped, dropped the hog and turned to look past me. It turned back to my tree and raised its head to look at me. I have never been more afraid in my life. I tried to keep the scope on its head in case it came after me. It looked at me, cocked its head to one side. Its face had a curious expression as if studying me. It opened its mouth showing its teeth, letting out a soft (rrrrrrrrrr) sound. It then turned back to pick up the hog and walked off in no hurry as if I didn't exist. I was looking thru a 3 X 9 scope. Originally set on 3 power for the hunt but turned it up to 9 power after first trying to see object approaching from my right. After that time I was afraid to make the movement necessary to take scope off 9 power. I sat in tree stand for another 30 minutes or so, trying to calm myself. After concluding that if it wanted me, it would have already slapped me out of my tree stand. I got down and went to find my hunting partner, who was about a quarter to half mile away. He had heard the attack scream and both whooping calls.",
  "classification": "Class A",
  "county": "Panola",
  "state": "Texas",
  "latitude": 32.05806,
  "longitude": -94.2,
  "location": "-94.2,32.05806",
  "location_details": "In the Sabine River bottoms.",
  "temperature_high": 54.98,
  "temperature_mid": 52.475,
  "temperature_low": 49.97,
  "dew_point": 51.97,
  "humidity": 0.93,
  "cloud_cover": 0.98,
  "moon_phase": 0.73,
  "precip_intensity": 0.0123,
  "precip_probability": 0.9,
  "precip_type": "rain",
  "pressure": 1011.75,
  "summary": "Light rain starting in the afternoon, continuing until evening.",
  "uv_index": 6,
  "visibility": 5.86,
  "wind_bearing": 11,
  "wind_speed": 8.19
}