{
  "reportId": "7225",
  "title": "Picnicker has daytime sighting outside Buffalo Creek",
  "date": "2005-02-04",
  "timestamp": 1107475200,
  "observed": "It was in 1978... My former husband and I had taken our children for a picnic at Wellington Lake, just south of Buffalo Creek, Colorado.  What I saw was not the same as what I've seen in photos, however, what I saw was a bipedal creature with white fur.  This may sound strange, but, I was talking with my former husband when the creature stepped out from behind a boulder.  I told my now exhusband, to look.  He turned around but the creature ducked back behind the boulder.  My exhusband turned back to me and said, \"I didn't see anything.\" At that very moment the creature showed itself to me again.  I told my ex to turn around.  He did, and the creature ducked behind the boulder again.  This happened four or five times, and then the creature was gone.  The creature was partially bipedal and then would stoop like an ape and touch the ground. It had a human-like feeling about it because it was obviously playing some sort of a game with me.  I have never told anybody except for people I trust not to make fun of me.  I was a resident in the area for many years and I knew what wildlife was there...nothing came close to this creature.  I've seen mountain lion, bobcats, linx, badgers, deer, elk, bear, and many more creatures in that area, but nothing like this.",
  "classification": "Class A",
  "county": "Jefferson",
  "state": "Colorado",
  "latitude": 39.31667,
  "longitude": -105.3542,
  "location": "-105.3542,39.31667",
  "location_details": "Drive from Hwy 285 down 67. Drive through the small town of Pine.  Right when you get into Buffalo Creek, there is a road that leads to Wellington Lake.  Drive to the picnic area by the lake and that's the general area where we were.",
  "temperature_high": 48.7,
  "temperature_mid": 37.29,
  "temperature_low": 25.88,
  "dew_point": 18.01,
  "humidity": 0.56,
  "cloud_cover": 0.06,
  "moon_phase": 0.85,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.58,
  "summary": "Clear throughout the day.",
  "uv_index": 4,
  "visibility": 9.77,
  "wind_bearing": 204,
  "wind_speed": 2.51
}