{
  "reportId": "15939",
  "title": "Elk hunters finds large human-like track near Trout Lake",
  "date": "2006-09-12",
  "timestamp": 1158019200,
  "observed": "September 12, 2006 Elk hunting on Salt Creek trail around Mt. Adams. 3 miles up where Cascade and Salt Creek meet there is a boulder Garden where the 2 rivers meet.  About 200 yards up on Salt Creek side 40 ft from the river on the North end their is a print that is unidentifiable to any animal print I've ever seen.  I am an avid hunter and spend all year foraging, fishing, and hunting in the NW so I'm very familar with animal prints but this one had me puzzled.  It had the characteristics of a human foot but was twice the width and the toes seemed like they where possibly 3 times the width.  I know everybodies thinking BEAR right know but this was not a bear print.  I've hunted and tracked bears for many years and this was not it.  It was a foot of what looked like a Gorilla or something. If any body has time they should journey on up there pick some Chantrelles and Matzutakes on the way up.",
  "classification": "Class B",
  "county": "Lewis",
  "state": "Washington",
  "latitude": 46.14853,
  "longitude": -121.5775,
  "location": "-121.5775,46.14853",
  "location_details": "My post left directions to exact spot.  If anyone goes up there to investigate and finds more sign.  Use a topographic map and find the ridge line between both rivers this is where all the elk and big game head when pressured.  You'll need to hike through the dry pine first but as soon as you get above that you'll find one of the most secluded square miles of Adams with small grass fields, downed old growth, and water.  With the extreme dry climate this year this is where all the animals were at or in the lower swampy lands.  and basically a place where an animal could live with almost no interference with man.  Note also you'll need to leave early in the morning for good wind conditions after 10 the wind changes every 5 minutes.  If these creatures are so elusive they have to have a nose on them that could smell dirty socks miles away.",
  "temperature_high": 81.13,
  "temperature_mid": 67.02,
  "temperature_low": 52.91,
  "dew_point": 49.42,
  "humidity": 0.58,
  "cloud_cover": 0.06,
  "moon_phase": 0.69,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.17,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.69,
  "wind_bearing": 307,
  "wind_speed": 5.81
}