{
  "reportId": "1510",
  "title": "Brothers have early evening sighting near Lee Vining",
  "date": "1977-07-01",
  "timestamp": 236563200,
  "observed": "This happened about 24 years ago, but it is still fresh in my mind (I guess you never really forget these type of experiences). It was late July of 1977. My family was up in the eastern Sierras, near Mono Lake, approx 13-15 miles above Conway Summit in an area known as Virginia Lakes. My dad told my brother and I to go to the lake and gather firewood. It was late in the day and the sun was down but it wasn't dark yet, only dusk. I was 14 yrs old and my brother was 1 month shy of 16. He had his learners permit so we were allowed to take the truck. We got to the lake and started loading up some wood. I had just returned to the truck and dropped the wood when I heard, what I thought, was someone walking through the brush. The foot falls were very heavy, almost like someone was jumping, but the steps seemed pretty rapidly placed. Where we were gathering wood was near a large hedge of bushes, approx 6 to 7 feet high and very dense with only 1 path through the bush to skirt the lake without wading in the water. I turned to the bushes, where the sound was coming from, and saw the bushes shaking and bending, as if something large was moving through the bushes, making a lot of noise. I watched for a few seconds when my brother came running to the truck, white as a ghost and eyes bulging wide. I said,\"Jeff, what was that?\" He was scared and out of breath. \"I don't know, but let's get out of here.\" he said. We jumped back into the truck and drove all out. On the way back to the camp, he told me that he was only 10 or 15 feet away from it. He heard the stomping and crashing of the brush, and turned to see a large, dark-brown head above the bushes moving rapidly away from him. He didn't see the face. He was so scared, he crashed the truck into a tree on the way back to camp. My dad was pretty pissed, to say the least, and didn't believe our story, even when we were crying because of how frightened we were. He finally calmed down and said that we probably saw a bear. But, bears do not walk through heavy brush on 2 legs. And my brother swore that it was not a bear. I think my dad started to believe that we saw something since we both would not go out to the camp fire that night, and both of us refused to go to the lake alone for the rest of the trip. Since that time, I have told several people with very few people actually believing me. Most told me that big foot are only in the north-west in Oregan/Washington. But, after finding this website, I feel a bit vindicated.",
  "classification": "Class A",
  "county": "Mono",
  "state": "California",
  "latitude": 38.04806,
  "longitude": -119.2642,
  "location": "-119.2642,38.04806",
  "location_details": "Traveling north on Hwy 395, as you crest Conway Summit, there is a left turn to Virginia lakes. The lakes are at an elevation of approx 9500 ft. The sighting was at Lower Virginia Lake near the road. I haven't been back to this area since the mid 80's so I don't know how much has changed.",
  "temperature_high": 88.53,
  "temperature_mid": 75.38,
  "temperature_low": 62.23,
  "dew_point": 53.07,
  "humidity": 0.46,
  "cloud_cover": 0.57,
  "moon_phase": 0.53,
  "precip_intensity": 0.0002,
  "precip_probability": 0.22,
  "precip_type": "rain",
  "pressure": 1011.49,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 11,
  "visibility": 9.84,
  "wind_bearing": 314,
  "wind_speed": 4.55
}