{
  "reportId": "11807",
  "title": "Twilight vocalizations heard near Lake Mary.",
  "date": "2005-05-30",
  "timestamp": 1117411200,
  "observed": "Directions to Location 3 Miles east of Lake Mary Rd. on R124. Lake Mary Rd runs southeast out of Flagstaff.  This is popular area for camping and hunting. Guess we were about 30 miles from Flagstaff. Nearest Town Mormon Lake Nearest Road FR124 east off of Lake Mary Rd. Narrative Observed   My wife and I were camped along FR 124 Sun. afternoon through Tues. morning. Monday night, Memorial Day PM, at 7:30 I went for a walk heading east on FR 124 to maybe see some elk before dark. I went at least 1/4 mile and heard a coyote sound off. I stopped to listen and a whole chorus of coyotes joined in for about 4 seconds and stopped as quickly as they started. I would guess they were 1/4 to 1/2 mile southeast of me. A second or so after that I heard an \"AH,OO\" just as distant or even further away in the same direction. I thought someone was calling back to the coyotes but what an odd sound for a person to make, then there was another just the same as the first. I turned back to camp and wondered about these two calls as I walked  I didn’t stop to listen again as it was getting dark and I wanted to get back to camp. At 8:15 I was back and I sat outside our trailer to listen again. Just I sat down I heart the \"AH,OO\" again from the same direction  followed by a high pitch \"WOW\" sound then another and then one more \"AH,OO\". So there were four \"AH,OO\" and two \"WOW\" sounds all together, that I heard anyway. The \"AH,OO\" was a mid pitch for a male person, The AH was about 1 1/2 seconds with OO short and slightly lower pitch. The WOW was very high pitch and lasted about 3 seconds. Both of these calls just started and ended without fading in or out and without waver. I listen until 9 PM without any more calls then went in to sleep. The calls were not real loud, if I was walking on the gravel road rather than stopped I might have missed them, but they were bit enough to carry over the sound of the breeze in the trees which was coming from the west. I was hesitant to report this since it was just sounds, but , rather odd sounds for a person or any animal I know of. Also I thought the time, date, location, and type of sounds may be worth reporting for past or future incidents. Thank you for the opportunity to record this.",
  "classification": "Class B",
  "county": "Coconino",
  "state": "Arizona",
  "latitude": 35.1394,
  "longitude": -111.6259,
  "location": "-111.6259,35.1394",
  "location_details": "3 Miles east of Lake Mary Rd. on R124. Lake Mary Rd runs southeast out of Flagstaff.  This is popular area for camping and hunting. Guess we were about 30 miles from Flagstaff. . ",
  "temperature_high": 75.6,
  "temperature_mid": 56.53,
  "temperature_low": 37.46,
  "dew_point": 32.24,
  "humidity": 0.35,
  "cloud_cover": 0.01,
  "moon_phase": 0.76,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1008.14,
  "summary": "Breezy in the morning.",
  "uv_index": 14,
  "visibility": 10,
  "wind_bearing": 228,
  "wind_speed": 14.08
}