{
  "id": "11325",
  "title": "Teen has sighting through bedroom window.",
  "date": "2005-04-18",
  "timestamp": 1113782400,
  "observed": "This is what happened as told to me by my sister-in-law who lives with my wife and family. On this night she had my baby daughter in the room with her on the bed and she was getting up to close the blinds to the window that she said,\" she could see the stars up in the sky that she had noticed earlier that night\", as she got up off the bed, she turned to make sure her niece wasn't going to fall from being close to the edge, when she turned back towards the window she noticed something looking in from the outside, it scared her so much that she grabbed her niece and ran out of the room to tell her mother who was in one of the other rooms of the house. Her mother then called my place of work to have me come back to house to take a look around, as I first arrived, I noticed that there was some kind of bad odor in the area but as i keep looking around along with my coworker, who gave me ride back to my house, and my mother-in-law, on the east side of the house where there is no lights, we all heard something stepping on twigs or branches laying on the ground for the snapping and breaking noise that it makes, as I attempted to walk towards the noise, whatever was there seemed to move farther back into the woods out of reach of my flashlight, after looking around we went to ask my sister-in-law if she could say who or what she had seen in the window, all she could say was that it was \"big, black, hairy\" and something about its eyes, she is really talkative all of the time but after that happened she looked liked she was in shock her face was pale and her eyes seemed to liked she was lost.",
  "classification": "Class A",
  "county": "Polk",
  "state": "Texas",
  "latitude": 30.71139,
  "longitude": -94.70139,
  "location": "-94.70139,30.71139",
  "location_details": "",
  "temperature_high": 74.19,
  "temperature_mid": 67.59,
  "temperature_low": 60.99,
  "dew_point": 57.51,
  "humidity": 0.71,
  "cloud_cover": 0.35,
  "moon_phase": 0.31,
  "precip_intensity": 0.0006,
  "precip_probability": 0.22,
  "precip_type": "rain",
  "pressure": 1020.89,
  "summary": "Partly cloudy until evening.",
  "uv_index": 8,
  "visibility": 9.93,
  "wind_bearing": 148,
  "wind_speed": 9.24
}