{
  "id": "2268",
  "title": "Three campers near Bumping Lake hear vocalizations from Nelson Ridge",
  "date": "2000-07-25",
  "timestamp": 964483200,
  "observed": "My nephew, his girlfriend and I were camping at the Bumping Lake camp grounds adjacent to the boat launch. It was about 10:30pm and we had just finished cleaning up after dinner. All of us goofed off for awhile running through the dark woods with flashlights, just exploring. After getting our fill of that, we built a fire in our fire-pit and were just relaxing and talking. Suddenly, we heard a horrific scream coming from behind us on what I think was Nelson Ridge. It was a long, high-pitched bellow that instantly caught our attention. The scream was a classic sasquatch scream, trying to catch the attention of another. About 15 seconds later, we heard another roar come back from down-range from what I think was Miners Ridge. We were all petrified and instantly knew what it was. Things settled down and we ended up going to bed. My nephew and I were up, decidedly exited about what we heard. We were laying in our tent, just talking. Suddenly, we heard another scream. Both of us grabbed our hand-guns at that point. We weren't sure what was going to happen. Eventually we fell asleep and nothing else happened. We are planning a trip back to Bumping Lake, specifically to look for what we heard.",
  "classification": "Class B",
  "county": "Yakima",
  "state": "Washington",
  "latitude": 46.82167,
  "longitude": -121.2764,
  "location": "-121.2764,46.82167",
  "location_details": "From Western Washington, take state hwy. 410 over the pass, past Ghost Lake and past Crystal Mountain. Exit at the Cedar Springs Campground Exit. Follow the Bumping River back until you reach Bumping Lake. The latitude is 46.873 deg-N and 121.300 deg-W. Elevation is 3426 ft.",
  "temperature_high": 74.47,
  "temperature_mid": 64.625,
  "temperature_low": 54.78,
  "dew_point": 53.93,
  "humidity": 0.67,
  "cloud_cover": 0.39,
  "moon_phase": 0.8,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.8,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 9.66,
  "wind_bearing": 262,
  "wind_speed": 6.06
}