{
  "reportId": "7864",
  "title": "",
  "date": "",
  "observed": "It was around 6:30 to 7:30 at night on January 24th, 2004 when I took my dog outside. I heard an unusual howling sound. I stood their for a moment trying to think of what it could be. I also noticed the neighbors dogs across the street were barking loudly ,But that wasn't unusual to me, as they seem to always bark at everything.. What did make it unusual was that I not only heard the neighbors dogs from across the street but also the dogs up the gulch barking. After about 45 seconds or so of continuos sound, I summoned my wife and asked her to come and listen. She came to the porch and listened. I told her in all my life of living around here I've never heard anything like that before. She just stood there with a somewhat terrified look about her and said she's never heard anything like that either. We went inside and I prepared myself for bed. My wife called me back to the porch and asked me to listen to the howling. So again I listened and this time we both agreed that it was very loud and sounded as though there were two of these things making this howling sound. One seemed to be at the foot of the hill acrossed the gulch and the other was quite aways up the hill from it. I told her that I have no clue what it could be. So I came in and went to bed. My wife stayed up and did some research about sounds on the internet. She later awakened me to let me listen to many wild animal sounds from the internet. When I first heard a moose call, it sounded as though that was the culprit. Then I got to thinking and remembered that the howlings we heard earlier were much longer than moose sounds. She then told me that she had found the sounds we were looking for on a website in which a guy had recorded unusual sounds in Ohio ( Ohio Howling Recording ). But as many people who experience these things probably do, I really beagn to think that my wife wasn't crazy but actually may have hit it on the head with those sounds she had found.  After hearing it again and again, there was no doubt that that's what we had heard and I told my wife that we should report something or ask the neighbors if they heard anything . I'll try and go look for some kind of tracks or indications of a strange animal in the morning.  Snow is falling, so who knows what I'll find. I do know that from now on I'm going to listen when the neighbors dogs bark. Hopefully this isn't a one night ordeal.",
  "classification": "Class B",
  "county": "Shoshone",
  "state": "Idaho",
  "location_details": "",
  "summary": ""
}