{
  "reportId": "1519",
  "title": "Boys observe hairy man-like creature several times",
  "date": "1982-06-30",
  "timestamp": 394243200,
  "observed": "It all started in the summer of 1982. Mt .St. Helens had erupted earlier about a year or so before. Myself and my cousin my brother and a family friend decided we would go hiking. Me and my friend were both 15 at the time and my cousin was 14 and my brother was 13. We went into the woods carrying nothing but BB Guns. We could not see nothing at the time. But I had been hiking in those woods about 5 years by myself or with my brother and I never had a care in the world.This included a run in with a grizzly. I felt as if we were being watched. For some reason the hair on the back of my neck even stood up. We could not see anything at the time so we continued on. Well a thunder storm started in and we started back towards my cabin. I gues we went out about 2 miles before we had to start back. I still feel as if something or someone was watching us. I just knew it. But whatever it was did not make a sound nore would it let us see it. Well we kept on and finally we heard something in the woods ahead of us. Well we stopped and to be honest were scarred so we stayed put for awhile and just listened.Well the noise stopped and we continued back towards the cabin this time a little faster than normal. Well when we finally broke out of the woods about 400 yards from the cabin I looked towards the end of the woodline and I saw a fiqure standing up and looking at us. My friend also saw it as well as my cousin, and my brother. It was black in colour and looked to be at least 6 foot tall. It was about 200 yards away from us so we did not know if it was a bear. well we went back to the cabin and told our parents what had happened and they had no explanation for it. My mother grew up there and she had no idea. Well about two days later we got brave again and on a bright sunny day our same group headed out in the same area. Well we got about 300 yards in the woods and we came upon a footprint. It was in the mud and well formed like a human print. Well I were a size 12 shoe and have since I was about 12 years old and I put my foot into the print and it was a good 4-6 inches longer than mine and a lot wider.Well I know what a bear print looks like as well as prints from the various animals in the area and the bear print was as close as I could come up with. But it had more human like toes not the long claws that you would see with a bear. Well we decided to get the heck out of the area. We then walked back out of the woods and back towards the cabin. Instead of walking the area of the woodline we took a path across the field. All of a suden my friend stopped and tried to speak, he almost turned pale white and he could not talk. He pointed into an area in the woods. I finally saw what he saw. Sitting on a old tree stump about 5 yards into the woods was what I believe to be a bigfoot. We were only 50 yards away from him and I could see clearly it sat there looking at us, and well it looked in another direction while we were starring at it and it was like he did not have a neck he moved his whole upper torso and then looked back at us. Well when he did this we took off running. I am now a police officer and have been for many years, and I still have never been as scarred as I was that very minute. When we got to the cabin we told my friends parents as well as my mom what we saw and what had happened. Well my friends dad got his pistol, and I got my dads 7mm. Deer rifle and we went back out, it was me my friends dad, and my friend. Well we went back into the wooded area and looked around for about an hour or so and found nothing. We then proceeded back out of the woods the same way we did when we saw this thing on the stump. Well I looked up towards my cabin and saw my mom she was waving her hands and yelling so I waved back. Well you have to know my mom she does not I repeat does not run for anything. Well she took off in a sprint towards us and when she got about about 100 yards from us she yelled that the creature was behind us.Well I turned and looked with my dads rifle reasy and I saw the back of the creature just for a second go into the woods. We then went back to the cabin and repported this to the local game and fish dept. They responded later that evening and we took the game warden to the area we were at. We could not find the print we had seen earlier, and I think he thought we were nuts. Well about he time we were coming back out we found a bush that had been layed float as if something had been sleepin there and it smelled. This was the only time I smelled anything. It smelled like real bad body odor mixed with urine and feces. Well we did not find anymore evidence. I have been back in the area many times. I do go out with a rifle but would not shoot this creature. I feel that if this creature was harmful towards me it could have killed me many times in the woods. We did have some people come from another state about a week later and ask if we were the ones who did the report and we told them no. I don't want a bunch of gun-toting idiots out there trying to hunt this thing. The way I fiqure is it has been there a lot longer than me and I need to respect its home",
  "classification": "Class A",
  "county": "Lewis And Clark",
  "state": "Montana",
  "latitude": 47.04333,
  "longitude": -112.7031,
  "location": "-112.7031,47.04333",
  "location_details": "",
  "temperature_high": 79.76,
  "temperature_mid": 69.69,
  "temperature_low": 59.62,
  "dew_point": 54.98,
  "humidity": 0.68,
  "cloud_cover": 0.55,
  "moon_phase": 0.33,
  "precip_intensity": 0.0022,
  "precip_probability": 0.32,
  "precip_type": "rain",
  "pressure": 1008.26,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 9,
  "visibility": 9.76,
  "wind_bearing": 106,
  "wind_speed": 0.47
}