{
  "reportId": "19804",
  "title": "Hunter reports unusual roars In South San Juan Mountains",
  "date": "2005-09-20",
  "timestamp": 1127174400,
  "observed": "The following is a report of unusual noises.  First, I would like to qualify myself as a competent woodsman...certainly no 19th century mountain man, but one who knows his way around the outdoors.  I was camping in the Rio Grande National Forest in Conejos County Colorado in September of 2005.  For those famaliar with this geographical area, I was in a district of the forest known locally and on topo maps as 'Jacob's Hill.'  I have hunted and camped in this area for many many years.  It was in late September and I was sitting in front of my campfire around 9 pm when I heard the most bone chilling and indescribable wailing roar that I have ever heard.  It was a very throaty sound and could best be described as an animal in agony.  While I have never heard a mountain lion roar in person I have heard this and other \"cat\" noises on T.V. and this did not sound at all like those noises.  The closest thing I could relate it to would be the noise of a hereford bull bellowing....but it was not that either.  The sound continued uninterrupted for about 5-10 seconds and then ceased.  Immediately coyotes from several different locales in the vicinity began howling and yelping as tho very disturbed.  I did not hear the noise again during that particular outing. Now, fast forward 2 months into November in camp in the same location for the elk hunting season. Bear in mind that until this moment in November I had not mentioned this incident to anyone.  I awoke at 4 AM one cold morning and noticed that someone else was awake and had built our camp fire again.  Because I was going to get up in another hour or so anyway, I got up and stepped outside.  It was my brother prowling around and I asked why he was up so early.  He replied that he had gotten up to go to the bathroom and the weirdest thing had happened.  I interrupted him immediately and told that before he told me what had happened I wanted to tell him about my experience.  I related to him the very story I told above.  When I was finished my brother just looked at me in amazement and said that is exactly what he had just experienced verbatim; right down to the coyotes reacting.  He, like me, could not relate the sound to anything we had ever seen or heard.",
  "classification": "Class B",
  "county": "Conejos",
  "state": "Colorado",
  "latitude": 37.3199,
  "longitude": -106.3325,
  "location": "-106.3325,37.3199",
  "location_details": "[GPS coordinates were supplied, and are shown in the internal database, but have been removed by the Editor from the public version of the report.]",
  "temperature_high": 74.33,
  "temperature_mid": 61.455,
  "temperature_low": 48.58,
  "dew_point": 26.75,
  "humidity": 0.32,
  "cloud_cover": 0.05,
  "moon_phase": 0.6,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1023.82,
  "summary": "Clear throughout the day.",
  "uv_index": 9,
  "visibility": 10,
  "wind_bearing": 241,
  "wind_speed": 4.98
}