{
  "id": "47165",
  "title": "Two campers take photos of what they see in the trees in the El Dorado National Forest",
  "date": "2014-07-15",
  "timestamp": 1405382400,
  "observed": "I live in the \"Bay Area\" of California. My visual sighting is at the bottom of this report. I have photos of that I want to send. I enjoy hiking and camping on a regular basis year round. I have been considering submitting a report for my encounter over the last few months and finally I am doing it. My encounter happened about 4 months ago in July. My girlfriend and I were \"dispersed camping\" (which is where campers can legally set up a tent in the national forest for free for up to 14 days) in El Dorado National Forest off of Hwy 50, about 6 miles east of Bridal Veil Falls. We have a secluded spot we always return to on the bank of a 10-15 foot wide, 4-5 feet deep (at the deepest) river. Some time in the night, probably 1-4 AM, my girlfriend woke me up saying she heard someone jumping into the river about 50 feet away, and it sounded like the person's legs were sloshing against the water the way it would sound if you were walking fast through thigh-deep water. Sure enough, a few seconds after she whispered this to me, I heard the noise too. She was accurate in her description of the sound. I guess my protective instincts kicked in because without hesitation I unzipped the tent with my large mag-light in hand, (the type police officers use) and stood outside my tent, spotlighting the river bank and the forest around us. I saw nothing, so I called out that there were people and please go the other way, still heard nothing. After that we didn't hear any more unusual sounds. What struck me as odd was, why would anyone be walking in FREEZING cold (likely glacier run-off) water in the dark morning hours, not anywhere near any trails, and not anywhere near any roads...? (We had to hike to this spot and it's a mile from our car, down a very steep heavily forested hillside full of underbrush, which is why this spot was so hard to find and it was an accidental find, and why it stays secluded.) It had me pondering for the last few months and even brought me to considering maybe it was a bigfoot because it sounded like two legs, not the way a bear would sound trudging through the water. Plus, there was nothing in the river I could see so whoever or whatever would've had to be farther than we thought and therefor very large to make sound seem so close... The next morning we went for a long hike as it was our last day camping. We had just gotten back to the car when I looked back at the treeline we had just came out of a, sort of, for a last glance, I will miss you, type of look, and I saw what I first thought was a black bear in the very top (the literal tip) of a 60-70 foot pine tree, it was staying still but I could see it was wiggling a little, almost like it was positioning itself comfortably, and it looked like it was hugging the tree like a bear. But then I saw the second \"bear\" in the SAME spot as this one in a tree right next to it. At this point I'm about 500 feet from these things and the trees they were in. I was able to take many photos of these \"bears\" and I have them on my phone and will send them to anyone who wants to see. On closer inspection, these were not bears. I showed a few friends and family and they all see what I see, it appears there is a UNIFORM Jet Black sillouette of a large, lean human man. When you see these pictures you will get an off/odd feeling. I know they weren't bears and I know they weren't humans. I'm not sure what they were, but I know what they were not. After viewing them for about a minute my girlfriend began to get a bit worried they might come down, so we left. And we didn't talk about it much as she isn't interested in the subject. However I cannot forget this, or write it off.",
  "classification": "Class B",
  "county": "El Dorado",
  "state": "California",
  "latitude": 38.77386,
  "longitude": -120.4036,
  "location": "-120.4036,38.77386",
  "location_details": "It's easier to describe on the phone or in person.",
  "temperature_high": 87.67,
  "temperature_mid": 75.32,
  "temperature_low": 62.97,
  "dew_point": 48.82,
  "humidity": 0.39,
  "cloud_cover": 0.05,
  "moon_phase": 0.62,
  "precip_intensity": 0.0016,
  "precip_probability": 0.15,
  "precip_type": "rain",
  "pressure": 1015.22,
  "summary": "Clear throughout the day.",
  "uv_index": 11,
  "visibility": 9.97,
  "wind_bearing": 177,
  "wind_speed": 3.86
}