{
  "reportId": "1211",
  "title": "",
  "date": "",
  "observed": "I dont recall which summer this sighting happened. It could have been the summer of 2000 or of 1999. I still have a hard time believing it myself and the few people I've told have made so much fun of it that it makes it even harder for me to believe. I will start with a little background. We live in the southern part of Michigan but my husbands family has a cabin in the northern part near a town called Mio. After three years of visiting Mio and nearby towns I still dont have my bearings when there,so I cant supply any north,south, east or west directions but if you need any my husband knows the area well because hes been going there since he was a small child. I do know a few names of roads though. This is hard for me to explain but when I saw \"bigfoot\" I totally dismissed the idea from my head until a few weeks ago. I would even go so far as to say that I forgot about it. Until recently when I was trying to think of interesting things to search for on the web. For some reason I thought of \"bigfoot\" and happened upon this site. While reading some of the sighting reports I kept seeing this image in my mind and I would think to myself \"now where have I seen this?\" Although I have seen shows on TV about bigfoot I still could not recall seeing my image. Then it came back to me.  We were up north for the weekend with friends and we were planning on doing some riding. There are many offroad trails where it is legal to ride ATV's with an ORV sticker. \"Not allowed in southern MI\" Well anyway, my girlfriend and I went to town to get some things to cook for breakfast and since we were in town we thought we would go to a popular ORV spot on the opposite side of town called \"Bull Gap\". There is a huge hill that is really sandy that everyone rides their ATV's and Trucks up just to see if they can do it, I guess. And there are many trails also connected to bullgap. It is stateland. Well we just wanted to see what was going on so we drove there and didnt really stay just drove back there and looked and then headed back towards town on M? 72. We were driving along on the paved 72 just talking about what I dont remember. When we came around a curve I saw a bigfoot step into the treeline. I immediately interrupted my friend and asked \"Did you see that?\" she said \"What did you see a deer?\" I said \"no it was big and black\" She said it was probably a bear. I kinda snorted and my mind thought that sure as hell was not a bear. I slowed down where I seen the bigfoot enter the woods and told her to look into the trees because thats where I saw it and we both looked and saw nothing. There was no trail and not even a space in the foliage where it must of entered. It was extremely thick, which made me wonder how it fit through there without making a path or something. I did not state that I thought it was a bigfoot because even saying it in my head sounded really stupid to me. I guess I would have been embarrassed. Instead I totally dismissed it from my brain until recently.  You have to understand that although I had always believed there could be a bigfoot I never imagined I would see one and in my native Michigan no less! I had thought they inhabitted only mountainous areas. After reading your sightings reports though I have went back and reflected on what I saw. Never did I doubt that it was a bigfoot I thought that I had been imagining it or something. Truthfully, I had not even thought about it at all from minutes after it happened until recently. That seems strange even to me but I rationalize it by thinking that I saw something that my mind simply couldnt comprehend so it just dismissed it. I will now tell you in as much detail as possible what I saw and how I interpreted it. It was definitely a bigfoot and if not,then it was a dream. I only saw it for a split second as it took one last big step and was gone into the trees. I am not good at judging distances but I guess it would have been about 25 to 30 yards away. I judge its height by the trees that it stepped into and I would guess that anywhere from 10 to 12 feet. It was truly the biggest manshaped thing I've ever seen ( It would have blown away the biggest of WWF wrestlers!) I must tell you that I dont have the greatest eyesight so although It was covered in hair,I didnt see the detail of hairs. It looked just about exactly like the Patterson film bigfoot. I did not get a view of the face. I just saw the outline of the body. It was broad daylight,around 9:00 AM. The head was smoothly rounded(Which makes me think the hair was so long that it laid down flat,not short and distorting the shape of the head.) The shoulders were so broad that it couldnt possibly have been a human it had long legs. It was completely black from head to foot(a very solid black). Even from a distance and with my poor eyesight it still seemed massively huge. Ive never seen anything as big (I cant seem to emphasize this enough). I have totally ruled out a bear(I knew that instantly) my husband tried to convince me of this,saying that bears sometimes stand on hind legs to get a better view,but if that were true then it couldnt have stepped like that into the trees. The shoulders stayed level as it stepped into treeline and besides bears dont have that long of legs. Aside from head,shoulders,and legs I also saw the rounded shape of its buttocks. I have also ruled out a human,even in a suit because of the size of it and the distinctness of its outline. It appeared to me to have a very firm body. I think this bigfoot could possibly hear my truck coming and was trying to get across road before I came around the corner,which it did. If my eyes would not have been positioned exactly where it entered woods I would have missed the split second view as my friend did. The side of the road it was coming from is where there are plenty of riding trails and I thought maybe since people were starting to show up and ride that it went to the other side of the road to get away from all the riders. I have since asked my husband if there were any riding trails on the side of road it went into and he said maybe a few but not sure. It could be protected state land where you are not allowed to ride and he also said that he thinks it is swampy on that side. I plan on investigating further on the next trip up north. I will ask the locals if they have ever seen anything and I would like to go back and check out area it travelled into to get a closer look and judge its size better. I did not stop and get out or anything. I have no desire to have a close encounter with something as big as the bigfoot I saw.",
  "classification": "Class A",
  "county": "Oscoda",
  "state": "Michigan",
  "location_details": "I 75 north to M33 turn right on 33 go through Rose City and then in Mio I think 72 is first light turn right and maybe a couple of miles my sighting was just after a curve if going in opposite direction of these directions. I would know exact location if I go back. I have a stillshot of it in my brain. I think that is Oscoda county but cant say positive without a map.",
  "summary": ""
}