{
  "reportId": "257",
  "title": "Mother describes possible observations by children near Tipp City, along Miami River",
  "date": "2000-09-01",
  "timestamp": 967766400,
  "observed": "Since this spring my family  noticed several unusual things in our area. First was a very strange set of 3-hoofed or 3-toed prints that we found and my 10 yr.old daughter followed with her feet down a path and into the woods coming away from a large lake people fish at alot. It is located in a nature reserve area right next to my home here in Huber Heights, Ohio. Friday, Labor Day weekend, I took my children to a secluded place on the Miami River in Tipp City, Ohio. We were just going to play in a very shallow area and mess in the river.I was with my 10 yr. old daughter and my son who is 6, and their friend (male) who is 10 also. I knew something was weird when we first went down the path to the river because it was so dead quiet. You could hear your voice echo and nothing else. No Crikets or birds or bugs. Was very eary! None the less we found a path that led right to the river. We stood there and besides this tree with a bunch a sticks laying under it. The kids picked up large sticks and began hitting the tree with them. We then turned to leave the area and try to get closer to the rocks we wanted to get to. As I left, my 10 yr.old saw across the river a set of bushes and a tree shake like something hit it. It spooked her and she ran up ahead of me. The kids then found a pond further down the path and were throwing rocks in it, when I decided to walk back towards the car. I still was not feeling comfortable at all about the silence.I then heard out of this silence, a very loud chirping-whistle coming from somewhere so I stopped and turned to face the river. I heard the whistle first to my left,then immediatly to my right. Then it seemed to travel away to the right and get fainter.For some reason, Im not sure why, but I whistled at it. It then whistled back and when it did, it changed its tone and went down an octive. ( I have studied music my whole life and I couldn't hit its tone or pitch.)But it answered me back really scaring me. I called for the kids to come over by me and I then told them I thought it was time to go. I stopped and asked if they heard that chirping which seemed to be moving off down stream to my right still. I said to them \"listen I'll whistle and then it will answere me back.\" I whistled again and instead of the sound I thought it would make, It began to chirp on our side of the river it seemed. The sound kept getting louder and louder. Moving closer to us when all of a sudden, we heard this enourmous tree being literally pushed to the ground to our right.Right infront of us! I screamed \" RUN!\" We all turned and ran, but my 6 yr. old didn't run. My oldest daughter said she looked over her shoulder to see where he was when we were running. She noticed he wasn't with us and he was standing frozen with his fists clutched to his sides.His eyes were really big and he looked so scared.She then yelled at him and he turned and ran.I only noticed him not being with us  we all were in the van with the doors shut, car started, and he was then on the outside screaming to get in. In those seconds he didn't run, this is what he said he saw: He told me that when the tree fell, something caught his eye so he turned to look.(to the right)He said it walked out of the woods and turned on the path looking straight at him. It took 3 steps stopped, and tilted its head to the side. It then took 4 more steps, paused and began moving even closer to him. It was then that he heard us yelling. He swears that he NEVER heard me scream run and he never heard us screaming and running to the car.He said that it was about as tall as his sister who is ten. It had a very large head that was round but it was sorta pointed on top. It was completly covered with brown fur or hair even the face had hair on it.Its eyes he couldn't see until it was closer and then he said they were round and black. His nose was black and sqwished to its face. Almost flat like.Its mouth was very wide, big, and looked like it was frowning. ( Or sad as he put it) It had very long arms that hung passed his knees  and swung out very far in front and back as it walked.It was hunched over when it walked too. Big shoulders and  a \"VERY\" big chest. He said when it got really close to him he then smelled it and it smelled like rotted garbage form the garage(haha)He even said he noticed clumps of mud hanging from its arms on the fur or hair. It never growled or made a sound. It just kept walking towards him and looking at him. He has been in serious distress at times since then. Fear, saddness, and anger are the bigger ones. He felt as though it was sad because of the face. Anger, because for a day and half we wouldn't listen to his story. He kept trying to tell us all somehing but we wouldn't listen. Fear, because it was incredibly scary to be standing alone and seeing this walk to you. I have had contacted our pediatrician and he is checking up on him and has been great in believing our story. We contacted someone who had a simular experience with his family in Oregon, and he has talked with my son and has helped us in dealing with all the anxiety in this whole situation and has be-friended him as well. We have made this a positive thing for him saying \"How many people actually see a bigfoot! What a cool kid you are!\" Plus allowing him to express how he has been feeling about this whole thing. He is excited about it, then very reserved about it too.  He also picked up a strange stick which I'm sending off to be evaluated. It looks as though something has used it for something. It was sanded down smooth by something and has tan and black animal hair fibers in certain parts of the wood. Something exists and we heard but our hero, Brian saw it!",
  "classification": "Class B",
  "county": "Miami",
  "state": "Ohio",
  "latitude": 39.9784,
  "longitude": -84.1735,
  "location": "-84.1735,39.9784",
  "location_details": "You go to the center of the town of Tipp City. Turn left onto 3rd St. coming from I-75. Go down past a large Park, swimming pool, and highschool football stadium. go another mile or so down the road and to your right is a little nature reserve sign and gravel drive way. Turn right and go back the drive way to the gravel parking area.",
  "temperature_high": 84.95,
  "temperature_mid": 77.31,
  "temperature_low": 69.67,
  "dew_point": 70.7,
  "humidity": 0.82,
  "cloud_cover": 0.34,
  "moon_phase": 0.12,
  "precip_intensity": 0.0001,
  "precip_probability": 0.15,
  "precip_type": "rain",
  "pressure": 1015.81,
  "summary": "Humid and partly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 8.24,
  "wind_bearing": 92,
  "wind_speed": 2.66
}