{
  "reportId": "6951",
  "title": "Bear hunter has sighting while approaching bait site",
  "date": "2003-04-20",
  "timestamp": 1050796800,
  "observed": "Apr 20, 2003- A friend and I were carrying in supplies on foot to a bear bait site about 2 miles west of hwy 89. This area is restricted to foot or horseback only and is on the Idaho/Wyoming border. I had carried in the bait barrel and some bait items a week earlier, having noted some bear tracks in the snow along the creek the first week of April. We walked along the foottrail early morning and about a mile in came upon the fresh carcass of a muskrat right on the trail, which was about 30 feet up from the creek and along the bend of the mountain. We were both startled by the dead muskrat because it was just there with no evidence of a predator in sight. I suggested that it may have been dropped by an eagle, but honestly there had been no sightings of eagles on our walk. Another mile in and we began placing our bait in the barrel, having noted that the bait already there had not been disturbed by anything. We were preparing to leave the site when we heard the cracking of branches and looking in the direction of the noise,we watched a large piece of a tree tumbling down the mountainside towards us. About 400yds up on a ledge stood something bipedal, the color of a moose, leaning against the remains of a tree. I asked my friend \"What is that?\" He replied \"must be a moose\". And I answered \"but it only has 2 feet!\" He did not reply, but started walking back to the trail. I looked back at the animal which was 7-8ft tall as best as I could estimate, very broad at the shoulders with legs that appeared long and thin compared to the rest of its body. It was hard to make out the shape of its head, as I couldn't see a neck and its head appeared to be bent, looking down the mountain towards us. It then quickly moved behind the broken tree and into the treeline . I wished I'd had my binoculars that day, but in our haste to get on the trail that morning, I accidently left them in the truck. My feeling while returning along the trail to the truck was almost of myself being stalked, a strange \"role reversal\". My friend moved quickly down the trail, no words spoken about what was on that hillside. When I recounted the experience a couple months later to friends, I had forgotten the part about the dead muskrat, which my friend quickly interjected to them as a very disturbing incident to him. Yet he laughed when I told them we may have seen a Bigfoot, which he readily dismissed. This bear bait site, coincidently, is along a drainage that connects to a larger creek near where a year ago, I had heard some strange and disturbing sounds on a moutain pass while hunting deer. I related the incident about the sounds to BFRO this past winter.",
  "classification": "Class B",
  "county": "Lincoln",
  "state": "Wyoming",
  "latitude": 42.4914,
  "longitude": -110.9967,
  "location": "-110.9967,42.4914",
  "location_details": "",
  "temperature_high": 59.06,
  "temperature_mid": 46.825,
  "temperature_low": 34.59,
  "dew_point": 27.26,
  "humidity": 0.55,
  "cloud_cover": 0.3,
  "moon_phase": 0.65,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.59,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 9,
  "visibility": 9.78,
  "wind_bearing": 157,
  "wind_speed": 3.08
}