{
  "id": "19350",
  "title": "",
  "date": "",
  "observed": "While reading sightings on your website, I noticed that there was one for Custer, SD.  I and my boyfriend had experienced some strange things happen while were working at a Native American Youth camp outside Custer.  I have worked at this camp before and have heard strange things. The occurrences took place in August of 2003.  The camp is somewhat isolated by forest, hills, and a small lake.  The first occurrence happened when some of us decided to go canoing out on the lake late at night (maybe around 11 pm).  It was dark, no moon light that I can remember.  My boyfriend and I had come back to shore and were standing  and talking along the shoreline.  I was facing toward some of the cabins that are situated on a hill (those cabins are lit by one light post), when I noticed what looked like a person standing up the hill beside a pine tree.  I couldn't guess the exact height as it was on an incline, but would say it was rather tall as it stood at least 4-5 feet about bushes that were a little shorter than my waist when I stood by them.  My boyfriend had his back to the thing, and I didn't say anything to him right away, because I wasn't sure of what I was seeing.  I kept looking at it and noticed that it had fur.  Maybe 30 seconds went by when I finally said something to my boyfriend.  I told him I thought something was watching us. He said it was probably one of our friends who is very tall, but I replied I don't think he's as tall as the thing that's watching us.  He still had not turned around at this point, because shortly after he said that I saw our friend walking back to his cabin at the top of the hill under the one light post.  I said, \"no it's not 'cause he's walking right there.\"  That's when he turned around to look at where I was looking.  The thing stood there for moment then stepped behind the tree.  My boyfriend did not see it, so I was pointing and directing him to where it was standing.  It just sort of disappeared, and seemingly never re-emerged.  We both got creeped out and I asked him to walk me back to my cabin. When the kids showed up, things were okay for the first couple of days.  Then one night after our first staff meeting (held at 11 pm, supposedly after the kids had gone to sleep), the male counselors returned to their cabins to find all the boys huddled into one cabin.  They were frightened and they told their counselors that they had heard something outside the cabins and that it was throwing branches and/or rocks at the cabins.  Some of the boys said they saw something at the back of the cabins and they were sure it was a bigfoot, only they had another name for it - Tallman.  The branch and rock throwing continued off and on during the camp around the boys' cabins. On another night, our camp director whose cabin was close to the bathrooms got up around 4 am to go to the bathroom and noticed a foul smell.  She told us that morning after we woke up and were getting ready.  She said \"I think there was a bigfoot here this morning.\"  One of us asked why she thought that, and she told us that she smelled one, and was familiar with the scent, having had bigfoot experiences of her own when she first started the camp program in Oregon. Towards the end of the camp, after another late staff meeting, my boyfriend returned to his cabin.  He went to open the door but it was locked.  He knocked on the door and was looking through the window of the door and noticed movement across the cabin through another window that was opposite the door.  He said he saw something huge move in front of that window and then realized that something was staring back at him through the same window.  Before he could make out what it was it stood up and moved away from the window. He kept knocking on the door and one of the boys opened the door.  He found the boys had moved their bunk beds away from the windows and were sleeping in the middle of the room.  He didn't say anything to them about what he had just seen because he didn't want to scare them anymore than they already were.  The boys immediately surrounded him with their beds, even sleeping on the floor near him. They also insisted on keeping the doors locked and keeping the fire going. On the last night, I heard something familiar from a previous camp experience.  It still gives me chills thinking about it.  A few of us were sitting out on the porch of the mess hall talking amongst ourselves when we heard a pack of coyotes howling to the east of us down by the lake.  The coyotes were all yapping and as they moved about the sound followed with them, and it's my guess that they were running because the sound was moving fast. Then all of sudden, from behind the mess hall we heard this cry that sounded like a group of children moaning/crying in unison and it echoed around us. At that moment the coyotes stopped their yapping/howling. Then just as quickly as it started, the moaning stopped \"mid-echo\".   It was unnatural how it just stopped.  We all just looked at each other and were in awe of what we had just heard.  I had heard that same exact thing when I had last worked at that camp, but it had happened three year earlier. These were some of the things that happened while we were there.  My boyfriend and I didn't really think about all things that had happened until we were on our way back to Arizona and had stopped to eat.  It was then that we fully realized we had a bigfoot experience, after all what else could it have been??",
  "classification": "Class B",
  "county": "Custer",
  "state": "South Dakota",
  "location_details": "(removed at witness request)",
  "summary": ""
}