{
  "reportId": "18958",
  "title": "Screaming and eyeshine witnessed by hunter in the Big Hole Mountains",
  "date": "2008-04-12",
  "timestamp": 1207958400,
  "observed": "Incounter happened on 7th of November 2006. I voted in the Idaho election at 8:00 a.m. Then I went straight home and loaded my two horses to go elk hunting for 3 days in the Big Hole Mountains east of where I live, approimately 25-30 miles away. I had camp all set up by noon, wo I decided to go for a horse ride and maybe hunt a little before dark. The creek drainage I planned to hunt was Big Burns Creek. I rode up this drainage as far as Bear Trap, the third canyon coming into this drainage from the west. I tied the horses up at the mouth of this canyon and decided to hunt for a few hours before it got dark on the ridge on the north side of Bear Trap and south of Temple Peak. I arrived back at the horses just as it was getting dark. I took my backpack off and tied it in the saddle of the horse I had ridden in on, so I wouldn't have to pack it going out. I slung my rifle over my shoulder and got on my second horse. I had ridden approximately 1/2 mile when the encounter took place. Riding south, with Big Burns Creek running parallel along my left side and making its normal loud babbling sounds cascading down over the many rocks, just as I was entering the confluence of where Little Burns Creek came down from the east at my left and entered into Big Burns Creek. I heard this very loud, voluminous, high pitched, slightly raspy scream. This scream completely over powered the noise coming from the creek. It screamed again again. Each scream lasted 3-4 seconds. The screams didn't noticebaly change in pitch or tone from beginning to end. It was just an intense scream like a large animal that had just been startled. My horse that had been following behind me, came trotting up to my right side about 3 yards away just beneath a tree. Both horses just stood there like a couple of statues, frozen in place. The air thermals were going down the two canyons, so these animals and my horses couldn't smell one another. My scent was drifting down and to the right because of the air coming from Little Burns Canyon, and their scent was being carried down and to the left because of the air coming down Big Burns Canyon. The animal doing the screaming was slightly to my left at approximately 40 yards standing right in the middle of Big Burns Creek. All that I was thinking was maybe I had just ridden into a Mountain Lion. A few years before a friend at work told me of a Whitetail Doe that screamed at him one afternoon on the river bottoms. I just couldn't put an animal with the scream. I think it was right after the second scream that I heard the sounds of the second animal. It was 40 to 50 yards east of the one doing the screaming. I heard a loud whistle followed by some 4-5 fast verbalizing grunts {agh ooh egh egh} The whistle it seemed to me was like a man would make if he laid his lower lip over his teeth and whistled to try and get somebody's attention clear across a canyon. This loud whistle and grunts also overpowered the sounds coming from both creeks. It seemed to me the second was communicating with the one doing the screaming. And I just couldn't put any animal with those sounds. I've hunted elk with the bow for many years and I think I've heard just about every sound an elk can possibly make. The whistle and grunts were not coming from an elk. Elk don't scream like the scream I was hearing. Big cats don't whistle and grunt like the sound I heard from the second one. By then I was wide awake and fully alert. I didn't have a light on my person. I had two lights in the left side pocket of my pack tied on the other horse. After much effort I was able to get the horse I was riding to break away from the trance he was in and move to my right up next to the other horse. I reached over and removed an energizer headlamp, and the Mini Mag flashlight which held two AA batteries. I fumbled around and got the headlamp put on and got both lights turned on. Looking down in the middle of the creek where the screaming was coming from there were the eyes of a predator {eyes coming out of the front of the head}. They seemed large because they were reflecting so much light back at me. They were reflecting exactly the same color that I was broadcasting out from my lights. The energizer headlamp was on the white diode mode and the mini mag flashlight had a slight yellow color to it. The eyes were reflecting mostly bright white with a slight tinge of gold. Having the lights turned on it didn't stop it from screaming. It continued to scream another 3-4 times while the lights were on it, for a total of 6-7 Loud screams. All the same volume, length, and intensity, etc. Although I was very concerned, I really wasn't teribbly afraid. My heart wasn't pounding with adrenilin and I didn't feel I was in a life threating situation, because the one doing the screaming stayed put and wasn't getting any closer and being aggressive. I felt more like I was the one scaring this animal. I must have blinked my eyes at just the right time, because all of a sudden the eyes disappeared and I didn't see which direction it went. I sat there looking and listening for about 2 more minutes. Hearing and seeing nothing more I thought whatever it was had probably left the area. I kicked my horse to go on down the trail. He didn't want to move. I gently talked to him telling him its OK, and kept kicking and encouraging him. I think he could still see something out there in the dark that I couldn't see. He finally started down the trail. I still had my lights on and kept looking at the edge of the creek nearest me, which was about 10-15 yards away. I expected something to jump out of the creek toward me any second. When I had traveled down the trail about the 40 yards or so I looked up on the other side of the creek. There standing side-by-side at approximately 25-30 yards were two sets of eyes. My guess is that the one doing the whistle and grunts came down the 40-50 yards to help the frightenned screaming one. When it arrived the screaming stopped and it got out on the bank with its buddy. The eyes seemed to be about level with my eyes as I sat on the horse. But my two lights didn't have enough candle power to see the outline of bodies with the eyes. I also couldn't see how high or low the bank was which they were standing on or any of the brush and trees which I knew was on the other side of the creek. One of the sets of eyes was higher up than the other. I sat there on the horse staring at the two sets of eyes for about 1 full minute. Then the one on my right slowly turned to it's left and verified to me that it was the eyes of a predator. Its left eye slowly narrowed to its right eye and disappeared almost at the same time as the right eye. Then the one on my left turned and followed behind the first. I sat on the horse for a couple more minutes looking for any glint of eyes as they moved away from me but I never saw them again. It's now the 4th of May 2007. When it first happed I had no idea what had happened to me. When I returned home and called by son to tell him about it. He flat out told me I had an encounter with a couple of sasquatches. He has been reading on the BFRO site for quite a few years. I being a slow learner was quite skeptical. I talked to every Mountain Lion hunter I could think of, to pick their brains as to what sounds they would make. Including Fish and Game personnel. This just left me as frustrated as before I talked to them. So before I thought I was going completely crazy, I gave Jeff Meldrum of Pocatello a call. I felt like what I'd heard and seen was not a great surprise to him for he had heard similar stories many times. After the first of this year 2007, my son told me of two sightings in Idaho on the web site. One in Northern Idaho and the second in the same time frame as mine within a few days and only 20-25 miles south of my encounter and east of Idaho Falls. My son then let me read Jeff Meldrum's book that he received for Christmas entitled \"Sasquatch: Legend Meets Science\" and I learned more about what evidence they have for the existence of these animals, including one thing that might have made my horses act the stupified way they did. When I talked to Dr. Meldrum I told him I was going to return first thing in the spring to the site to check for carrion to confirm Mountain Lions or not. My son and I took a horses to ride back up there on the 29th of April, nearly 5 months later than the incident and before the high water runoff could wash away any evidence. I took 3 pictures, one from where my horses and I first heard the screaming, etc. and two pictures from where I watched them across the creek. I had my six foot son stand in two different clearing places they could have been standing on the far bank. The one on the north side of a tree with thick brush and one on the south side of the tree. My sons head was level with mine while I was on the trail sitting atop my horse when standing on the north side of the tree. And the south side where I found a breakaway portion of the overhanging bank and the only possible footprint just next to it on the south side of the breakaway, where I thought the animal climbed up on the bank out of the creek. My sons head was about a foot lower than mine while I sat on the horse. If the south of the tree was where they were standing side-by-side, that would make them in the 7-8 foot height range. The heel portion of the right foot was quite visible but when I first noticed it I was facing the creek on top of the overhanging bank. I looked to the side of the breakaway and noticed the back heel portion of the print about 4 1/2 to 5 inches in front of my right boot. I wear a 10 1/2 to 11 glove size and this heal print was about the size of my fist. The depth of the heel print was about 1 inch deep with the rest of the print coming straight back up along the side my boot. When I realized what I had just done my heart jumped right up in my throat. As I lifted by foot out of the track it looked as if my boot heel was just about where the toe prints might have been if I hadn't stepped on it. I measured by boot length when I got home and it was 11 1/2 inches Long. Which would have make the track 16-17 inches long. I've heard the expression of putting one's foot in his mouth but I really felt awful when I realized I'd just screwed up the only possible track that we found by putting my foot in it. And that, as they say, is about the size of it. At first I thought I was loosing my mind cause I couldn't place those sounds with any animal I'd ever heard. But now, after learning all I could about these animals for the last 5 months,  I'm better than 95% sure I've been one of the lucky humans to have had an enoucter with these elusive creatures. And I wouldn't have traded this experience for the Biggest Bull Elk in Idaho.",
  "classification": "Class B",
  "county": "Madison",
  "state": "Idaho",
  "latitude": 43.61015,
  "longitude": -111.4418,
  "location": "-111.4418,43.61015",
  "location_details": "To get to the location of the encounter, you would drive east of Ririe turning North to cross the river West of Heise Hot Springs. Go east of the hot springs to the intersection in the road where you go left to Kelly Canyon or right to the River Road 206, follow the road east up the north side of the South Fork of the Snake River To the Trail Head at Big Burns Creek. Go up the trail up Big Burns Creek until you come to the first Large canyon with a creek flowing down it from the East. That will be Little Burns Creek. ??about 4-4 1/2 miles from the trailhead.?? I don't care if you post the area because there is already alot of people that go into this area in the summer time, horses riding, hiking, Motorcycle riders, etc. Not too many during the hunting season. I'll leave it up to BFRO to decide what is best on the posting.",
  "temperature_high": 52.32,
  "temperature_mid": 37.805,
  "temperature_low": 23.29,
  "dew_point": 19.26,
  "humidity": 0.58,
  "cloud_cover": 0.04,
  "moon_phase": 0.25,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1030.62,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 9.99,
  "wind_bearing": 3,
  "wind_speed": 1.65
}