{
  "id": "28720",
  "title": "Traveler observes a tall biped in a cornfield north of Bethany Beach",
  "date": "2010-08-16",
  "timestamp": 1281916800,
  "observed": "Our family was driving home from vacation last August when I saw something unusual in a cornfield. We were roughly 40-45 minutes north of Bethany Beach, Delaware traveling on Route 1 passing through farm country at the time.  We had rented a minivan and my husband was seated upfront driving with his Father next to him in the passenger's seat. They were busy talking.  My daughter and mother-in-law were seated in the row of seats behind them.  My mother-in-law was reading a book to my daughter at the time.  I was seated in the very last row of seats in the minivan and sat on the passenger's side of the car. As we were driving along and everyone else was busy either talking or reading, I was looking out the window at the passing countryside.  We were going through farm country at the time and as we drove past one corn field, something caught my eye.  The thing that initially got my attention was the fact that the corn stalks were now dried and yellow and it appeared that something dark brown was standing there in the middle of the corn stalks.  The roadway was slightly elevated above this particular field so I was essentially looking down onto the tops of cornstalks rather than them being level with the van. Having an interest in the subject of Bigfoot, I immediately went into observation mode and noted the following:  What I saw was medium to dark brown in color, it was taller than the cornstalks, it appeared to be about 3 feet wide and I may have been looking at a head and shoulders and it definitely wasn't a piece of farm equipment, a scarecrow or a human.  In fact, I noted that there were no humans around on the farm at the time.  I was able to observe this for roughly 5-10 seconds as our minivan drove past this large field.  The brown \"thing\" was roughly 300 feet in off the road in the cornfield by itself. I quickly tried to note the general location of where we were at the time.  I do not live in Delaware and was not familiar with the precise location.  However, not long after that, I spotted a sign for the Milton, Delaware exit off of Route 1.",
  "classification": "Class B",
  "county": "Sussex",
  "state": "Delaware",
  "latitude": 38.88665,
  "longitude": -75.3793,
  "location": "-75.3793,38.88665",
  "location_details": "",
  "temperature_high": 88.12,
  "temperature_mid": 81.905,
  "temperature_low": 75.69,
  "dew_point": 72.21,
  "humidity": 0.77,
  "cloud_cover": 0.38,
  "moon_phase": 0.24,
  "precip_intensity": 0.001,
  "precip_probability": 0.49,
  "precip_type": "rain",
  "pressure": 1014.53,
  "summary": "Humid throughout the day and mostly cloudy in the morning.",
  "uv_index": 8,
  "visibility": 9.95,
  "wind_bearing": 196,
  "wind_speed": 9.33
}