{
  "reportId": "15627",
  "title": "Four witnesses hear vocalizations in Davy Crockett National Forest",
  "date": "2006-08-27",
  "timestamp": 1156636800,
  "observed": "On August 27, 2006, my wife Teresa and I were in the Davey Crockett National Forest about 4 or 5 miles south of Hwy 21.  We were looking into some new areas to hunt this upcoming deer season. We had left the truck at 7:30 a.m., we were both pleased with the weather conditions, because the sun was obscured by thick clouds and everything was wet from a recent rain shower.  However, it was very humid.  The vegetation was extremely thick, so visibility was not good at all. We left the main road and went down a small road that lead off to the left, which seemed the only passable way to go into the woods and thick cover.  All the way in we heard nothing, the woods were extremely still and quiet with no wind at all. The only thing we could hear was small insects. We made almost no sound ourselves, walking mostly on wet pine straw or wet leaf litter.  We walked in about 3/4 to 1 mile when the trail abruptly ended in a small clearing at which point we headed back. We were about 200 yards back up the trail when we heard a sound.  It was short but very clear.  The only thing close to it I've every heard was on some Bigfoot vocalizations I'd heard on the Internet.  I've spent my whole life in the woods throughout numerous states and never heard this before.  It was like a loud, but not excited, first a yelp ending in a peaceful descending howl.  This was done only twice, but one right after the other.  It was off slightly to our left, and at a guess, about 200 yards away. We are both interested in the Bigfoot theory (which we believe) and had heard of tree knocking.  So I picked up the nearest good size limb and began to strike a small tree.  I struck it about six to eight times.  Immediately, to our right at about the same distance we heard another very clear vocalization.  This time it was one clear moan, like the second half of what I already described.  It was two different animals.  It seemed as though the one was calling the other, and when I tree knocked the second one was saying \"that's not me, I'm over here'.  The whole event only lasted half a minute or so.  After this the woods were as quite as they had been.",
  "classification": "Class B",
  "county": "Houston",
  "state": "Texas",
  "latitude": 31.50773,
  "longitude": -95.20691,
  "location": "-95.20691,31.50773",
  "location_details": "I didn't get the road information, but will be willing to go there again.",
  "temperature_high": 93.79,
  "temperature_mid": 85.04,
  "temperature_low": 76.29,
  "dew_point": 73.98,
  "humidity": 0.74,
  "cloud_cover": 0.31,
  "moon_phase": 0.12,
  "precip_intensity": 0.0027,
  "precip_probability": 0.28,
  "precip_type": "rain",
  "pressure": 1012.82,
  "summary": "Humid throughout the day and partly cloudy until afternoon.",
  "uv_index": 8,
  "visibility": 9.01,
  "wind_bearing": 177,
  "wind_speed": 5.49
}