{
  "id": "11828",
  "title": "Woman experiences rock throwing, vocalization during walk",
  "date": "2004-06-05",
  "timestamp": 1086393600,
  "observed": "It was a warm June afternoon when my dog Sadie and I went for a walk back in the woods on our property. After we walked threw the woods on our property i decided to take the gravel road the mile or so back home instead of traveling threw the woods again. I got a half mile away from the house when i kept hearing something like a rock or a branch hitting against a tree. At first i thought it was just animals or my husband goofing off in the woods to scare me. When i reached where i thought the noise was coming from i stopped and was looking up into the woods, but i couldnt see anything, so i proceed to yell, ha ha very funny because like i said i thought it was my husband. Well the banging got louder then stopped completly. I got the feeling something was watching me so i told Sadie lets go girl and started to walk a little faster. Just then a fairly sized rock came whizzing out of the woods and just missed me. I stopped looked in the woods because i couldnt believe what just happend, but i still couldnt see anything. So, i really started to pick up the pace just then another rock came flying out of the woods and just missed me. By the time all this happend i was at the bend in the road and i looked up in the hollar where the last rock had come from when something i can not explain let out the awfulest low growl then scream i have ever heard. It scared me and Sadie so bad we took off running and i dont think i felt the ground under my feet i was running so fast. I told my husband about it when i got home and realized it was not him he had been there the whole time. A few days later he convinced me to take him back where it all happend and along side the road was a foot print that was fairly large but shaped different. I have not adventured back there since then and really dont care to.",
  "classification": "Class B",
  "county": "Tyler",
  "state": "West Virginia",
  "latitude": 39.61958,
  "longitude": -81.14833,
  "location": "-81.14833,39.61958",
  "location_details": "",
  "temperature_high": 63.26,
  "temperature_mid": 59.785,
  "temperature_low": 56.31,
  "dew_point": 56.98,
  "humidity": 0.89,
  "cloud_cover": 0.93,
  "moon_phase": 0.59,
  "precip_intensity": 0.0079,
  "precip_probability": 0.83,
  "precip_type": "rain",
  "pressure": 1018.42,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 6.37,
  "wind_bearing": 75,
  "wind_speed": 3.05
}