{
  "reportId": "2349",
  "title": "",
  "date": "",
  "observed": "The sighting happened during the bow hunting season in Utah. I liked to hunt the area because of the relative isolation and the numerous deer. I had been hiking around the area of what is know as: Six-Bit Springs. I did start out in a general direction but wove around so much that I did not really know where I was (it would be hard for me to point it out on a map). The first strange thing I noticed was the absence of large game, it is usally a game highway in that part of the woods. As I was wandering, getting totally lost, I noticed a reeking smell and decided to scout out the source (I was curious if a hunter had lost or shot deer or elk during the hunt and wanted to see what it was). I would catch whiffs of the smell here and there and it led me to a sort of clearing. The area looked like a dried out pond. The grass was greener in this area and compared to the woods the only area that had bright sunlight. I scanned the general area and nothing really caught my eye except for what I thought was a large tree stump almost in the middle of the pond (about 25-35 yards from where I was standing in the trees). As I was walking back up the slope the smell hit me again and it was coming from the pond area. I looked again and stared at what I thought was a tree stump, it was black, like it had been burned by lighting or fire. The shape was odd, it was roughly pear shaped and contoured,no jagged edges like broken piece of wood, it looked like a large person wrapped in a dark shawl sitting with their back to you. In this sitting position it might have been about 4 feet tall. As I stared at it I decided it was only a burned tree stump that had weathered smooth edges, but as I watched it listed to one side. It was then I thought it might be a black cow or a moose laying with it's back to me. As I watched, it would shift back and forth like someone getting comfortable in their seat. I also noticed the grasses in front of this thing moving as though they were being disturbed. It seemed to be very intent on what it was doing. I became scared at this point and hurried back up the slope and after many wrong turns here and there I made my way back to camp about 4:00-4:30PM. The only other strange thing that happened was the large dog we always took camping and hunting was very jumpy and nervious, and would run off into the wooded areas by our camp for no apparent reason and would stare and fixate on the woods for very long peroids of time. The reason I mention this is that this same dog has been on these trips numerous times and he has never acted this way. Needless to say we left at the crack of dawn the next morning and I have not been back to the site since then. I don't know if this story is worth keeping because I could not guarantee that it was not a cow or moose although being familiar with cows and seeing moose often, I strongly doubt that it was either of these.",
  "classification": "Class B",
  "county": "Weber",
  "state": "Utah",
  "location_details": "I was in the woods in the monte cristo forest. The sight was about 2-3 miles? off of the main road at six bit springs. To get to six bit springs you need to take Curtis creek road and follow the signs. The road to the spring is a four wheel drive trail.",
  "summary": ""
}