{
  "reportId": "23531",
  "title": "Woman tells of her husband's close encounter as a young man with \"The Hermit\"  near Huntsville",
  "date": "1961-11-11",
  "timestamp": -256867200,
  "observed": "The information shown recently on a History Channel show about a curious Bigfoot motivated me to send this. This is not my sighting and I don’t want my name or any of these names used publicly, but felt that this information might add to the database. About 1960, my husband \"Teddy\" (Name changed at request of submitter) and two high school friends (names unremembered) had an unusual experience in the woods outside of Huntsville, Texas.  Ted passed away in 1975, and only told me this story once, shortly after we were married and when he was somewhat inebriated, as the experience was terrifying, and not something he or the other boys wanted to be teased about forever in a small town. He was very technical and good on detail (an electronics engineer for Lockheed at NASA), so I believe the story. One of the boy’s relatives owned some land with a cabin north of town near Bedias Creek.  This is the western edge of the great Piney Woods of East Texas, where many legends are based, and some like the Ivory-Billed Woodpecker have come true, and some could be still unknown.  One of Ted’s friends had a ranch on a different creek, and used a pack of six leopard dogs around the house to keep his family safe from javelinas and other predators who might come in close.  Anyway, on a weekend night, the boys were bored and, as was the custom in small towns, decided to go driving and hang out at the cabin as they had before, knowing that the fridge would be well-stocked with soft drinks.  They parked the car on the county road as they did not have a key to the gate, and walked about three/quarter mile to the house and turned on the interior lights. The boys were talking and having a good time for an hour or so, but had the feeling they were being watched from outside.  Thinking maybe some friends (or rivals) might have followed them and be trying to play a trick on them, they turned out the lights, and sneaked out the door away from the kitchen window where they thought they had heard the sounds. The night was fairly clear, but there wasn’t much moonlight and no outside lights, and they weren’t seeing anything unusual as they slowly crept around the cabin to that kitchen window.  Through it they saw the light of the open refrigerator with a six-foot-tall-plus being silhouetted in front of it, apparently drinking a bottle of ketchup.  For years the family that owned the cabin had thought they had an old hermit living in the woods, although they had never been close enough to see him, never found any signs of human habitation, garbage, etc., just see things he might have done, and they had warned people to beware of the hermit. One of the boys yelled “The hermit!  Let’s get out of here!” Quickly the boys decided to split up so one group could get help for the others if needed.  Ted was the fastest (and in trouble with the coaches because he wanted to keep his job selling newspapers instead of running for the high school team) so he took an alternate path back to the road instead of the original one used by the other two boys.  Sure enough, as he tore through the brush and trees, trying to find the path in the dark, he heard something coming behind him, and it was running faster than he was! There was a moment when Ted thought all was lost, as whatever was chasing him was so close that he could hear it breathing.  He could also smell it from 20 feet or more, worse at closer range, and it really stunk, somewhat like a moldy skunk. Then all of a sudden he was at the road, and the other boys were in the car waiting to pick him up, and they drove off, totally terrified.  There was nobody to report this to without getting themselves in more trouble than they needed, because they weren’t supposed to bother the hermit. In retrospect, he said that the thing might not have been chasing him so much as being terrified at the boys” yelling, and had just chosen the same path he had to get away.  He always thought it was a teen-age hermit, and when I asked why, he said he just had the feeling it wasn’t an adult, and what else could it be?  I asked what kind of clothes it wore, jeans, overalls, or ?  He said he couldn’t see the clothes because it was totally covered with long dark hair, about 4-6 inches long, all over, and he couldn’t see a face. Ted was concerned that the hermit might have cut himself while he was trying to copy them drinking a Coke, because apparently he had picked up a small glass bottle of ketchup instead, and the bottle cap opener that was nailed to the wall probably didn’t remove the cap  but broke the glass neck of the ketchup bottle. The being’s size, smell and speed were what Ted remembered most, and never wanted to remember again, so I didn’t ask again, and if he ever told the story to anyone else, I’m not aware of it.  Probably the reason it sticks in my memory is that, at the time,  I was in my first year of teaching middle school English, and the school had just received some motivational paperbacks for the kids.  These books were as much fun to read as comic books, but had more print and fewer pictures, and featured topics the kids really were interested in.   One was about legendary creatures such as the Abominable Snowman, but a chapter also covered Sasquatch and Big Foot, which were totally new concepts to me. Coincidence or serendipity?  Hermit or Skunk Ape?",
  "classification": "Class B",
  "county": "Walker",
  "state": "Texas",
  "latitude": 30.812,
  "longitude": -95.75645,
  "location": "-95.75645,30.812",
  "location_details": "The incident was on a ranch owned by a local family, who had a grocery store in Huntsville TX.",
  "temperature_high": 72.47,
  "temperature_mid": 68.705,
  "temperature_low": 64.94,
  "dew_point": 62.84,
  "humidity": 0.92,
  "cloud_cover": 0.82,
  "moon_phase": 0.11,
  "precip_type": "rain",
  "pressure": 1011.94,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 7.5,
  "wind_bearing": 146,
  "wind_speed": 6.03
}