{
  "reportId": "12727",
  "title": "Bow hunter is escorted from woods by foul-smelling, acorn-throwing bipeds",
  "date": "2004-10-16",
  "timestamp": 1097884800,
  "observed": "It was early bow season around oct 5, 2004 approx 6:30 pm. It was pretty cold and the wind was blowing in all directions. I was sitting in my tree stand on top of a ridge over looking a creek bottom with minimal vegation spaced along it. this area is pretty remote and is a traveling place for our deer. Well it was about dusk when I heard some crows in the tree tops above the creek started to make alot of noise. I then saw three deer running full out down the creek bed, I heard a scream and the a loud thump. two of the deer I saw head in another direction, but the one remained down in the vegatation thrashing around. I thought perhaps it had been wounded by another hunter, and decided to go down there and investigate. As I went down the hill to the creek bed, the wind shifted blowing right in my face, the smell what would i asume was nasty body odor, was so strong it made me feel kinda sick.As I looked around for the deer, a uneasy feeling kinda came over me,I got scared, i then heard what I could only describe as sticks being tapped together or up against down logs or even trees,coming from two diffrent directions, kinda like it was in a circling manner. I then heard some type of weird scream, at that moment I decide to get the heck out of dodge, I turned back up the hillside and proceeded back up towards my tree stand, the next thing I know a white acorn bounced off the top of my head, I dismissed it as pherhaps falling from a tree, but when the next one flew by my head, I relazied something was throwing objects at me, I then got real scared and decided to run, as I got alittle ways away I paused to catch my breath, as I was resting I heard whistling and jabberish popping and clicking sounds, once again in two diffrent directions, I heard leaves crunch and out of the corner of my I eye I saw something very big trying to blend in with the trees and bushes observing me I guess.when I heard the whistling again from behind me I just took off, and never returned. It was like black and tan mix whatever it was and very big. That is the most ever I have been scared in my life, to my knowledge this area is very remote and I have never seen anyone back there and I have been hunting that for years, whatever it was it was after that deer,and for the sounds ihave never heard those types of noises made by any animal organic to that area.",
  "classification": "Class B",
  "county": "Scott",
  "state": "Virginia",
  "latitude": 36.8778,
  "longitude": -82.4179,
  "location": "-82.4179,36.8778",
  "location_details": "scott co. va near dungannon",
  "temperature_high": 54.85,
  "temperature_mid": 46.08,
  "temperature_low": 37.31,
  "dew_point": 34.99,
  "humidity": 0.65,
  "cloud_cover": 0.51,
  "moon_phase": 0.09,
  "precip_intensity": 0.0026,
  "precip_probability": 0.74,
  "precip_type": "rain",
  "pressure": 1007.95,
  "summary": "Mostly cloudy until afternoon and breezy in the afternoon.",
  "uv_index": 3,
  "visibility": 9.52,
  "wind_bearing": 248,
  "wind_speed": 9.63
}