{
  "reportId": "24916",
  "title": "Witness hears big exhale and finds clear footprint the next day on property near Bluffton",
  "date": "2007-05-30",
  "timestamp": 1180483200,
  "observed": "It was approximately 0100 or 0130.  A family member and I had been watching TV in a back room of the house for a few hours. The TV was turned up loudly so my family members could hear easily but by 0100 or 0130 they had fallen asleep so I turned the TV down. I was sitting next to a row of three windows that run along one wall of the room that faces out into the backyard. All of the windows were open and the air was cool. The weather had been nice early summer weather, not too humid and with light rain earlier. I mention there had been light rain earlier because when I heard the sound of something outside the window, although it sounded similar to what car tires sound like driving on wet pavement from far away, it was not.  I heard a fairly long exhalation of breath from just outside the window as if someone was standing outside looking directly in. Since there are bushes planted right in front of the windows, I knew nobody could be standing right in front without crouching down. I was sitting next to the window and the sound sounded like it was from the same level my head was at of between three and four feet. I thought the sound sounded like a living thing but maybe I had been mistaken when, as if one queue, there was another long exhalation just like the first. I immediately stood up in front of the window, looked up (because I was sure that, if I was going to look the thing outside of the window in the face, I would have to look rather high up) and screamed, \"Get out,\" out of the window and went running into the front of the house, still screaming, \"Get out!\" I startled my family member and the dog (who was also in the back room and had remained asleep until I screamed) and they both came running after and caught up with me in the kitchen to find out what was wrong. The following day, I went out into the backyard to look for deer scat thinking I may have heard a deer: there is a holly tree directly to the left of the window I was sitting in front of and heard the sound through and deer have eaten the bottom leaves off the tree. There, literally right up against the corner of the house less than one foot from the wall of the house, as if something had been standing facing the house and leaning against it, was one barefooted human-shaped footprint at least 12\" long and 6\" wide and about an inch or two deep. The print was able to be made, I suppose, because there was dirt mound there from where the bushes are planted, but when I looked for where the left footprint could've been, if something was standing against the corner of the house, I didn't find anything because the dirt was covered with leaves and pinestraw. On the right footprint the odd thing about it was that I couldn't find the little toe: all the other ones were clearly marked. Also, I didn’t realize this until yesterday but the reason that the print may have been deeper on the left side of the print rather than on the right side of the print was that the thing must've been leaning to the left...around the corner of the house to look into the window. I was back visiting the same family member MAY08 and looked to see if any evidence of the footprint existed and nothing did that I could identify. There are many depressions in the soil so I was unable to discern where the footprint depression may have been. My family member had come out to let the dog out to go to the bathroom and had seen the footprint, too, but I told them to go back in the house. We haven’t discussed it with each other because I don’t want to upset or scare them.",
  "classification": "Class B",
  "county": "Beaufort",
  "state": "South Carolina",
  "latitude": 32.29968,
  "longitude": -80.95958,
  "location": "-80.95958,32.29968",
  "location_details": "[Specific directions removed at the request of the witness]",
  "temperature_high": 82.41,
  "temperature_mid": 76.35,
  "temperature_low": 70.29,
  "dew_point": 64.21,
  "humidity": 0.72,
  "cloud_cover": 0.3,
  "moon_phase": 0.45,
  "precip_intensity": 0.0002,
  "precip_probability": 0.44,
  "precip_type": "rain",
  "pressure": 1021.43,
  "summary": "Foggy in the morning.",
  "uv_index": 10,
  "visibility": 6.89,
  "wind_bearing": 96,
  "wind_speed": 5.06
}