{
  "reportId": "3022",
  "title": "Nighttime encounter with campers near Duchesne, in Timber Canyon",
  "date": "1977-09-15",
  "timestamp": 243129600,
  "observed": "This is a sighting reported to my by Mike(last name withheld for privacy reasons), a friend that lives in the same area as I do.  We went to the sight this past Saturday and Mike showed and told us..(a group of about 20 people) what occurred on the night of the sighting.   Mike went back to the sight the week before to make sure he could find it again since it had been 25 years since he had been into Timber Canyon.  He and his younger brother Lynn had gone fishing.  They had been in the area many times before with their father and other family memebers.  They arrived at their intended camp sight, about 7:30...they both had noticed once they entered the canyon that they saw no more wildlife....deer, birds, or anything.  Mike remembers having a erie feeling from the very moment they started down into Timber canyon.  He recalled hearing no noises, and commented to Lynn about this and the weird feelings he had of something or someone watching them.  They had forgotten worms so both went out into the willows and were digging worms...all the while feeling something was watching them.....Mike said the hair on the back of his neck was standing on end when ever he would look around to see if they could see anyone watching them.  They return to the truck, lit a lantern and put on the top of the truck...and proceeded to light a fire to roast a hotdog on.  His brother and he were sitting on a log and he noticed his brother had opened a beer and was not drinking it and was just staring at something and had ceased to talk to him....he looked in the direction his brother was looking and saw a sasquatch trying to sneek from off the road to a clump of willows and then to another and then proceed to peer at them by holding the willows off to one side and leaning over so he (the sasquatch) could get a good view of them.  Mike was so shocked he lost his balance and fell from the log and in getting back up noticed the sasquatch creeping behind the willows moving to the west and south.  Mike and his brother then lost visual sight of IT and could hear very loud thrashing noises of the sasquatch going through the creek and willows and up the canyon to the west and south of the camp site.  Mike said he did not smell any thing...and figured it was because of the smoke from the fire.   Mike estimated the whole sighting and noises lasted two minutes.  His younger brother wanted to stay there and sleep in the camper shell...but Mike was impressed very strongly to leave and get out of there.",
  "classification": "Class A",
  "county": "Wasatch",
  "state": "Utah",
  "latitude": 40.028,
  "longitude": -110.9315,
  "location": "-110.9315,40.028",
  "location_details": "This is located in Timber canyon.  GPS coordinateds are N40  1.680  W110  55.891.  It is about 14.6 miles from Highway 6 (Spanish Fork Canyon, Soldiers Summit) and 20.2 miles from Highway 40",
  "temperature_high": 72.16,
  "temperature_mid": 59.6,
  "temperature_low": 47.04,
  "dew_point": 43.46,
  "humidity": 0.57,
  "cloud_cover": 0.47,
  "moon_phase": 0.08,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1006.36,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 6,
  "visibility": 10,
  "wind_bearing": 157,
  "wind_speed": 0.83
}