{
  "reportId": "2147",
  "title": "",
  "date": "",
  "observed": "Saw a form walking upright at a distance of 200+ yards. We were a little excited (more like scared shitless). There was enough light to just make out that whatever it was, was moving on two legs. We found where it had gouged out the soft earth on the stream it crossed. No discernible footprints, but whatever made the gouge was big. We had to WAG (wild-ass-guess) at the length, over 19 inches. It was longer than the tip of my extended fingers to my elbow. The grass going across the meadow didn't allow for footprints but was pressed down several hours later. We didn't follow the trail towards the trees!! It had been watching us for around 15 minutes, give or take 5. I was asleep when my friend woke me up. Said he heard something moving above us on the exposed rock above our camp. He had his 9mm (personal protection from the typical axe-murderer you meet while camping) in hand and was a little wound up. We listened to it move around with the occasional skip like someone was jumping a short distance to another rock. It moved behind us then down into the meadow that surrounded the stream we were camping on. We saw it cross the stream and slip as it went across on the other side. It moved across the meadow at a quartering angle away from us and into the tree-line. We know it wasn't a bear. We had several run-ins with bears trying to get our food cache at night in Yosemite. Thought we would get away from the crowds on this backpacking trip. Good call, huh? Once we calmed down we discussed what we think we saw, we both came to the same conclusion. I know we didn't halucinate. Our eyes had time to adjust before we finally got a visual of it moving across the meadow. We stayed awake until we had enough light to look the area over quickly and then beat feet out of there.",
  "classification": "Class A",
  "county": "Humboldt",
  "state": "California",
  "location_details": "Klamath National Forest, California (west of the Klamath River). We had followed the river north til we found a feeder stream and headed west. Lat/Long ?, before a hand-held GPS was affordable on the civilian market.",
  "summary": ""
}