{
  "id": "44644",
  "title": "Memory told of a daylight sighting near Chauncey",
  "date": "2014-05-12",
  "timestamp": 1399852800,
  "observed": "I have had two sightings. The first was in July or August of 2002. It was one of those hot, and humid days of summer. Temperatures reached around 100 that day. So my then boyfriend, five year old daughter, his Rottweiler, and me decided to go to the river and swim at one of the many sandbars on the Embrass as some call the Ambraw. So our location was into an area that you would not see people just walking around or being out in. Very secluded very off the beaten path. We were swimming and eating lunch and hanging out when all of the sudden the dog starts going freaking nuts like I never seen. So I go up the incline on the beach towards where my truck was parked to see if maybe it was a farmer that had driven back there for some reason. The incline was steep enough that I could look across the grassy weedy tree area to the edge of a bean field where the truck was parked without anything of me being seen except for my head. When I looked over the edge of the bank right there in front of me, maybe 20 yards away, crossing through the under brush was something that my mind could not grasp. A thin black 7 to 8 foot man like creature. I was so in shock I just dropped down the bank. My boyfriend said what was it? I answered Sasquatch. Let's go!",
  "classification": "Class B",
  "county": "Crawford",
  "state": "Illinois",
  "latitude": 38.87531,
  "longitude": -87.90503,
  "location": "-87.90503,38.87531",
  "location_details": "",
  "temperature_high": 80.06,
  "temperature_mid": 74.27,
  "temperature_low": 68.48,
  "dew_point": 68.63,
  "humidity": 0.81,
  "cloud_cover": 0.12,
  "moon_phase": 0.43,
  "precip_intensity": 0.0032,
  "precip_probability": 0.22,
  "precip_type": "rain",
  "pressure": 1014.84,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 9,
  "visibility": 9.31,
  "wind_bearing": 185,
  "wind_speed": 9.64
}