{
  "reportId": "26005",
  "title": "",
  "date": "",
  "observed": "Last night my friend, his girlfriend, and I went kayaking around Keystone Lake, in Oklahoma. The lake levels have been about 15 ft above normal, and we decided to go kayaking and camping. There is a penninsula that is open during the day to people to use four wheelers and dirt bikes on, but since the water has been so high for about a month it has been inaccessable to them due to the path going out there, is under water. We got out there about 8:00 p.m. and kayaked the mile or so to a nice sandy beach, and set up the tent and started a fire. We cooked hot dogs and fished a bit but caught nothing. Midnight rolled around and my friends girlfriend had to be at work early the next morning so he was going to escort her back to her car. Just as they were getting their gear together, we heard some grunting and repeating howling noise with the same tone pattern about five times. I am an Eagle Scout and a seasoned camper in these parts, so hearing this noise frightened me a bit and made me not want to tend the fire alone on the island. I then kayaked with the two of them back to the cars. My friend and I returned to the camp site about 1:30 or so, we got the fire started again and decided to fish a small wooded area that was under water 50 or so feet from our beach. We did that with no success for 30 minutes or so, and headed back to the beach. My friend was about 20 feet the shore and I was about 30 feet and we passed a lower area with willow trees on our way back to our camp and a very large rock, much too large for a human to pick up and throw landed within feet of his kayak. We stopped and shined our flash lights at the shore to see what threw that at us. We could only see just beyond the trees due to the low hanging willow trees. We sat and talked a minute about what just happend and another slightly larger rock landed in the same area making a huge splash. We both got really scared and back paddled a good distance from the shore. I told him what I thought had just happend and watching a show on Bigfoot one time, I remembered that they throw rocks and make similar noises to the ones we had heard earlier. We made the decision to pack up and head out. We heard or saw nothing else while packing up the tent and gear. We took turns shining a light in the forest while the other packed his gear, because we were both pretty scared. I have camped hundreds of nights and have never left in the night, like we did last night. We kayaked around the island before we left to see if any boats were anchored, but we were definitly the only humans on the island.",
  "classification": "Class B",
  "county": "Tulsa",
  "state": "Oklahoma",
  "location_details": "It is the \"four wheeling\" penninsula right next to the Appalacia Bay boat ramp. It is closed right now due to the lake level being up 15+ feet, so it is an island now, so whatever we saw will still be there unless it can swim.",
  "summary": ""
}