{
  "reportId": "5160",
  "title": "",
  "date": "",
  "observed": "Dear Sir, I am a paranormal researcher/investigator and freelance writer, with a special interest in Bigfoot. Five years ago I interviewed a group of young people regarding a sighting. The sighting took place in the Mojave rive bed in Hesperia California. The first report came from five teenage boys who were exploring down in the riverbed late in the after noon when a noise in the dense under brush that grows in places along the river startled them. They said the noise sounded like something big moving through it. When they moved closer to get a look they said they saw a large hairy ape like creature. As this frightened them, the boys ran home and told their parents, which is when I first heard the story. The boy’s father went down into the area of the sighting with a gun to see if he could see what the boys had reported, but found nothing. The boy’s older sister rode her horse down to the spot on two consecutive days, to try and get a look at the creature. On the second day, her efforts were rewarded. In her statement to me she said, \"I was riding north in the river bed on my way home after searching for several hours, when I came to an area where there are two stands of cottonwood and pepper trees one on each side of the trail. My horse spooked and didn't want to go on. I looked around and to my right I saw a tall hairy thing standing there looking at me. It looked at me for about a minute, then I turned my horse and ran her in the opposite direction and took another trail home.\" I investigated the area and though I wasn't able to see the Bigfoot itself, I did find what seemed to be a nest of sorts where the animal had been bedding down. I also found footprints that measured twenty inches by eleven inches. These prints were in very soft deep river sand so I'm sure the size is out of proportion, but maybe this will assist you in determining the animal’s size. When I asked the young woman about color she said it was a dark brown or black. I didn't think about it after making my own documentation until I read the recent article in the Mohave Daily News Archives. After reading the article I thought my information might be useful to you. My neighbor took some pictures of the footprints, and though they are of very poor quality I might be able to acquire them for you if you want. Unfortunately my witnesses wish to remain anonymous.",
  "classification": "Class A",
  "county": "San Bernardino",
  "state": "California",
  "location_details": "From the Main st. exit on I-15 go east until you get to Choiceana Ave. turn left and go north to Lemon Ave. and turn right. You are now on a dirt road that will take you to the river bed infact you'll be able to see it from Choiceana. In winter the river will have water in it, but if someone is going to go out there, the river is dry in summer. You'll need a guide to find the exact spot, for there are no land marks that you'd recognize if your not from this area. To the north about two miles is a small lake, and to the south about half a day on horse back is Silverwood lake.",
  "summary": ""
}