{
  "reportId": "46805",
  "title": "Hikers are startled by unusual sounds in Staunton State Park",
  "date": "2014-10-11",
  "timestamp": 1412985600,
  "observed": "My girlfriend and I were on a short hike 2 weeks ago in Staunton State Park, in between Bailey and Conifer, CO.  We chose a route which would have less people, as I'd hiked the other routes in the park previously.  After hiking uphill along a stream for about an hour, we saw a rocky outcropping and hiked off-trail briefly to check out the view. It was very quiet out with little wind movement.  There were no clouds in the sky and the temperature was in the mid-50s. Time of day was approximately noon MST. We sat in the sun on the outcropping for about 10 minutes very quietly, enjoying the view and the weather.  We looked down below the cliff and noticed a gentleman riding a mountain bike quickly up the path with headphones in.  As we watched, we heard a very low growl which sounded like a startled exhalation - \"Grrrrrrphhhh,\" followed immediately by a very different, higher-pitched \"Whoooooooop.\"  The mountain biker seemed to hear nothing, as the headphones must have been too loud.  The two noises came from the same direction, approximately 30-40 yards below us on the outcropping through thick forest.  We were unable to see any animals, but the sounds were very clear and definitely came from the same animal.  The animal definitely sounded startled by the fast-moving biker. My girlfriend's eyes got very wide, and she whispered to me that she had no idea what kind of animal made that noise.  I responded that she'd say I'm crazy, but that only primates make the \"whoop\" noise.  We climbed down from the outcropping a few minutes later and searched for whatever made the noise, but were unable to find anything, nor heard any more sounds.  We definitely did not feel threatened in any way.",
  "classification": "Class B",
  "county": "Jefferson",
  "state": "Colorado",
  "latitude": 39.52701,
  "longitude": -105.4147,
  "location": "-105.4147,39.52701",
  "location_details": "Staunton State Park",
  "temperature_high": 59.46,
  "temperature_mid": 51.76,
  "temperature_low": 44.06,
  "dew_point": 36.97,
  "humidity": 0.69,
  "cloud_cover": 0.15,
  "moon_phase": 0.62,
  "precip_intensity": 0.001,
  "precip_probability": 0.13,
  "precip_type": "rain",
  "pressure": 1014.68,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.18,
  "wind_bearing": 244,
  "wind_speed": 5.86
}