{
  "id": "8778",
  "title": "A possible sighting of the River Styx monster crossing a small clearing",
  "date": "2000-10-01",
  "timestamp": 970358400,
  "observed": "I was returning from work in Akron. My route took me past a large open crop field on Rt. 57 near I-76 and Greenwich Rd. I glanced over to the west of Rt. 57 and saw a large very tall figure, completely covered in brown striding across a small clearing between patches of woods. It walked in very large strides and covered much of the clearing in a few seconds as I observed it while driving. It was probably 200 yards or more away. I thought that it was too tall for a man (it appeared maybe 7-9 feet tall) in coveralls and took much larger strides than a man could. I cannot totally remember the arms but they may have been swinging as it walked. I mused that it may have been a Bigfoot and forgot about the incident. I recalled this just recently and told my wife several weeks ago when we passed the field. I read your recent reports and was amazed that it was in the same area that I saw this large whatever on two legs. It is an area that a small creek runs through and farther to the North is River Styx, an area prone to flooding in the past and known for its wildlife back to the 1800s. It is being built up now and the woods are being removed for building lots and such, although at the time of this writing is yet a farmers field.",
  "classification": "Class A",
  "county": "Medina",
  "state": "Ohio",
  "latitude": 41.06019,
  "longitude": -81.79669,
  "location": "-81.79669,41.06019",
  "location_details": "It was north of the I-76 and Rt. 57 interchange approximately 1/4 to 1/2 mile. It was west of Rt. 57 at a distance of 200 yards give or take. It was between River Styx Rd and Rt. 57.",
  "temperature_high": 72.18,
  "temperature_mid": 63.665,
  "temperature_low": 55.15,
  "dew_point": 52.31,
  "humidity": 0.72,
  "cloud_cover": 0.35,
  "moon_phase": 0.13,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.21,
  "summary": "Partly cloudy until evening.",
  "uv_index": 4,
  "visibility": 7.8,
  "wind_bearing": 182,
  "wind_speed": 8.48
}