{
  "reportId": "2786",
  "title": "On-going encounters makes rural family cautious",
  "date": "2001-06-15",
  "timestamp": 992563200,
  "observed": "I will start with what happened back in the late 1970's.  My husbands uncle and a friend were frog gigging on this farm, that we have now lived on for the last 10 years. (It is my father-in-laws land, which has been in the family for over 30 years.)  He said that they just crossed the creek that is directly behind our mobile home (of course our home wasn't here at the time!).  They heard a noise about 30 feet down the creek. It was nightime, so they shined their lights in the direction of the noise.  They saw a animal creature bending down at the creek, drinking water out of its hands. The \"animal\" stood up, on two legs like a man, was gray, and hairy all over.  It then took off up the holler, running on two legs like a man.  It was no bear.  A bear wouldn't run like a human does. My husbands uncle and friend immediately left, they were so scared. Now lets skip to the early 1990's.  My husband and I move a mobile home in on the farm.  For the first time in many years, someone has finally occupied this land.  Our first summer here, in 1991, I would hear all sorts of noises.  Being from the suburbs, and not used to nighttime country noises, I didn't know what they were, and always kept the windows shut, no matter how hot it was inside. I felt like something was just \"out there\". We have always heard weird things over the years. Now lets skip 10 years to this past June 2001. My kids, ages 13, 11, 9 and 6 were playing in the field, out behind our mobile home.  They came in, wanting my camera. They said they found \"footprints\".  I laughed it off, and told them just don't take too many pictures. They took the pictures, I forgot about them for about 3 weeks.  When I went to get the pictures developed, I was shocked at the footprints!  They are nothing like I've seen before. About a week later, the end of June 2001, my kids were playing again, at the creek that runs behind the field, that is behind our mobile home.  Our dog was with them.  All of a sudden they hear something running across the hillside, sounding as if it was tearing down trees as it went. The dog ran after it.  Whatever it was, kept on running, with our dog on its trail.  We then heard the dog start yelping, crying like whatever it was got him. I was too scared to go and see if he was ok.  We waited for him to come back. He did several hours later, covered in some kind of slimy stuff. Like slobber. He was ok, but never did find out what that stuff was. I had told the kids not to go down to the creek again, till we find out what is up on the hill.  Of course, being kids, they didn't listen.  They took off on the hill, to see if there were any small trees or shrubs knocked down by whatever ran through the woods the day before.  They weren't up there very long, before huge rocks down tumbling down the hill at them.  It was like something or someone was up there actually throwing huge rocks at them. I am talking rocks that are bigger than a persons head.  They came running back down the hill. Two days later, around 9 am, I had all the windows open to our mobile home.  Everyone but me was still in bed. I heard a very loud, long growl. I have never heard this sound before in my life.  The dogs, which were sleeping in the yard heard it, and took off on the hill after whatever it was. Over the years, there have been unexplained things and noises happening.  This past winter (around Jan. 2001), something hit the side of our mobile home in the middle of the night. It was like someone had taken a ballbat and smacked the side of the wall where our bedroom is as hard as they can.  We have hiked on the hill, and heard unidentified loud growls.  At night there have been screams and growls.  My husbands uncle, the one who had sighted the \"animal\" in the 1970's had lived in a small shed on our farm in the mid' 1990's.  He would work late shift and come home in the middle of the night. He would have to walk 1/4 of a mile to the shed. He would tell us all the time how creepy it was to walk up the holler at night. And all the sounds he would hear.",
  "classification": "Class B",
  "county": "Cabell",
  "state": "West Virginia",
  "latitude": 38.46118,
  "longitude": -82.07358,
  "location": "-82.07358,38.46118",
  "location_details": "(edited)",
  "temperature_high": 86.61,
  "temperature_mid": 77.275,
  "temperature_low": 67.94,
  "dew_point": 68.97,
  "humidity": 0.79,
  "cloud_cover": 0.19,
  "moon_phase": 0.8,
  "precip_intensity": 0.0038,
  "precip_probability": 0.44,
  "precip_type": "rain",
  "pressure": 1014.24,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 9,
  "visibility": 7.26,
  "wind_bearing": 181,
  "wind_speed": 3.82
}