{
  "id": "4777",
  "title": "",
  "date": "",
  "observed": "While Hunting Ruffed Grouse with friend near Bean and Bear Lakes outside the small town of Silver Bay we heard and then saw a large unidentified creature.  We were near an area where there were alot of berries and were making sure that we didn't stumble upon a bear (which we had done many timees, and let me tell you...this was no bear).  We heard a howling that made the hair on the back of my neck stand up...literally.  ee both hit the deck and reloaded our 12g shotguns with slugs.  Not a word was exchanged.  We were both rather scared.  It was nearing Nightfall, and we had a long way to go to get back to the car.  This is a very rugged and remote area.  The howling was intermittent, but we could hear the animal moving.  It was a couple hundred yards away.  Unfortunately for us it was directly in our path.  This is a swampy lake filled area with heavy growth.  I have travelled all over the world, and this is some of the toughest undergrowth that I have ever seen. We cautiously moved toward the trail (and the animal) and moved a quietly as we could.  We were both experienced woodsman, and we knew this was no Timberwolf, Moose, Bear or cat. We dropped the 3 grouse we had shot as a precaution and contiued along the trail.  Off to our right we heard movement.  I remember being terrified.  It was clear that it was a large creature, but it moved VERY fast.  Faster than any Bull moose I had ever encountered. It followed us on our right flank for a few hundred yards.  It was now approaching dark.  We had lights with us, as well as first aid kits. I turned to my friend and pointed.  At that moment we could see a complete outline of this creature.  The reason it was visible, was that we were in the growth, and it was following, but there was a clearing beind it (an old logging camp area) and the light was still brigh behind it.  We both hit the deck again.  I find it funny that the thought of shooting at it didn't even cross our minds.  We were scared.  I had worked as a wilderness guide, and this was nothing that I had ever seen before.  It walked on 2 feet and stood AT LEAST 7 feet tall.  There was no way to really tell the color (due to the lighting adn our perspective) but it was a dark color.  We continued on our way all the while listening to this thing in the brush following us.  It was amazingly stealthy.  Like I said we were VERY experienced woodsman for our age.  We didn't do drugs or drink like other kids our age...we went hunting and fishing. It finally stopped following us as we crossed a ridge toward a more travelled trail.  We both remember the day like it was yesterday.  We recently spoke of it.  We have both since reloacted to the West Coast (me to San Francisco and He to Seattle).",
  "classification": "Class A",
  "county": "Lake",
  "state": "Minnesota",
  "location_details": "It is a heavily forested area dotted with lakes for fishing and good deer and Grouse Hunting. Lots of wildlife.",
  "summary": ""
}