{
  "reportId": "6775",
  "title": "Child has daylight sighting along Meramec River",
  "date": "2004-12-05",
  "timestamp": 1102204800,
  "observed": "This happened about 1982, in the area of Steelville Missouri. We were camping on the Meremac River. The group consisted of myself, my wife, my son, my daughter and a friend and his wife. The place we camped was on an elderly ladies farm. There were about 5 other campsites, all about 30 yards apart, with our campsite being on the end and closest to where the woods became thick. There was a dirt road that went from our spot into the woods a short distance. While myself and my friend were gathering fire wood, my son...about 7 at the time, sat at the begining of the road playing in the dirt. My wife said all of a sudden he looked down the road, jumped up and made a bee line for her, all the time yelling \" Mommy a big black man. My friend and I heard him screaming and ran back to camp to see what was wrong. I know my son was young at the time, but I'd never seen him so upset. He kept repeating that he saw a big black man standing part way down the road. Now at the time, we lived in St. Louis and my son was used to seeing black people but he insisted this man was differant. After we calmed him down he told us the man was real tall. Way taller than me or my friend, who was about 6'2'. He also insisted the man wasn't wearing clothes but was covered with black hair. My friend and I were both armed and decided to take a look down the road. It was getting dark by then and we didn't see or hear anything out of the ordinary except it did smell like something dead was close. There was to be a huge meteore shower that night so we walked out into a pasture to have a clear view of the sky. The pasture bordered the woods on our left, with our camp and the river to our front. We hadn't been sitting there long when we heard something heavy walking around in the woods. At first we thought it might be a stray cow but the more we listened it sounded more like the way a man would move. What really got our attention was that all of a sudden we heard limbs snapping. Not small ones but big enough to sound like rifle shots. I'm a Vietnam Vet and a long time hunter. I've never heard anything move through woods like that. It spooked us enough that even though we were armed, both carrying .44 cal hand guns, we didn't venture into the woods to investigate. That ended our star gazeing and we spent most of the rest of the night sitting in camp with our pistols close at hand. The next day we found where something had bulldozed it's way through the heavy bush and left some good sized broken limbs and saplings in its wake, but to be honest we didn't look too close. Also the smell of something dead was gone. The rest of the camping trip was un eventfull though I did notice one thing. The lady who's land we were camping on was carrying a 12 gage shotgun every time we saw her. She even had it across her lap when she'd sit on her porch. Never knew her to do that before. She was of old hillbilly stock and not one to scare easy so I asked her about it. She just replied she wanted it close and would say no more. To sum it up, My son's insisting he saw a very big hairy black man, the way it frightened him,the noise that night and the broken trail of brush and limbs, the smell and the elderly ladies keeping her shotgun  close at hand, I have to wonder. Especially since I read, here on your site, of other bigfoot sightings in the area.",
  "classification": "Class B",
  "county": "Crawford",
  "state": "Missouri",
  "latitude": 38.11203,
  "longitude": -91.1569,
  "location": "-91.1569,38.11203",
  "location_details": "Can't remember the exact directions to get there,  my brother in law would know as he grew up in the area and has family there, but it's about mid way, on the river, between Meramec Springs and Onondaga Cave.",
  "temperature_high": 52.93,
  "temperature_mid": 49.625,
  "temperature_low": 46.32,
  "dew_point": 38.11,
  "humidity": 0.88,
  "cloud_cover": 0.5,
  "moon_phase": 0.78,
  "precip_intensity": 0.0106,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1013.94,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 6.83,
  "wind_bearing": 143,
  "wind_speed": 6.3
}