{
  "reportId": "4043",
  "title": "Forest Service employees see footprints in Six Rivers National Forest",
  "date": "2001-11-01",
  "timestamp": 1004572800,
  "observed": "On the day of the incident, a co-worker and myself where sent to close the Port-Orford-Cedar gates for the winter season.  Both of us are Forestry Techs and worked for Six Rivers Nat'l Forest (Seasonals).  As the day progressed and gates were closed we decided to take lunch at the Onion Lake area.  Once we got to the lake we had our lunch and rested in our own way.  I decided to walk around the lake to take my mind off things.  About half way round the lake I spotted something strange in the water, up the lake embankment, and into the forest.  I called to the co-worker.  We saw Bigfoot tracks that lead from the water into the forest.  I ran back to the truck and got a measuring tape and ran back to the tracks.  The tracks measured 14\" long 5 1/2\" wide.  The distance between the tracks were 3'.  We wrote down the track details in our IDEA pads (pocket note books) and then left the area to finish our work day.  We decide not to tell our supervisors because we thought our bosses would not believe us.",
  "classification": "Class B",
  "county": "Humboldt",
  "state": "California",
  "latitude": 41.37861,
  "longitude": -123.7481,
  "location": "-123.7481,41.37861",
  "location_details": "Depending where you are coming from - Take highway 96 to the Fish Lake Road (13N01), follow the road till you see a sign saying Onion Lake.  For better directions call Orleans Ranger District (530) 627-3291.",
  "temperature_high": 57.44,
  "temperature_mid": 50.75,
  "temperature_low": 44.06,
  "dew_point": 46.93,
  "humidity": 0.85,
  "cloud_cover": 0.5,
  "moon_phase": 0.52,
  "precip_intensity": 0.0001,
  "precip_probability": 0.15,
  "precip_type": "rain",
  "pressure": 1018.43,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 8.02,
  "wind_bearing": 177,
  "wind_speed": 4.83
}