{
  "reportId": "41427",
  "title": "Memory told of a nighttime close encounter in the Henning Conservation Area near Branson",
  "date": "1994-08-23",
  "timestamp": 777600000,
  "observed": "I've told this story to numerous people over the last 16 years and have been made fun of quite often. But though I have forgotten many things from my 20's the pictures in my mind .. even the sounds of breaking twigs .. everything from that night is still crystal clear. I have not questioned what we saw ever and still hold true to the fact that what we saw was nothing other than what is called \" big foot \". It was August I believe 1994, Ruth and Paul Henning Conservation Area outside of Branson Mo. 1:00 A.M. A friend of mine and I had just got off work and pulled over at what was then the scenic overlook. A trail at that time wound back and forth in appropriately 60 foot lengths as it progressed up the hill to an old fire tower. If i was there I could show you exactly where we were and where \" it \" was but i will do my best to describe. We had gone up the path two turns when we heard a loud snapping sound in the quiet night. we both instantly froze and looked up. Between the 3rd and fourth path turn we could see it. a huge large slightly slumped big foot. Long arms ... sillouetted almost by the city lights and open area behind it .. we just stood there. Shocked... the friend I was with after what seemed like 5 minutes of frozen still .. yelled HEY .. and then one foot from it ... a second slightly shorter one stood up and turned to look right at us then they both ran off. The running was so significant because they ran on back legs but hunched over with long arms and it was loud. Snapping twigs and pushing their bodies right through small trees in the way. We waited a moment and then walked the trail to where they had been standing. Using a close by tree to estimate the height of the tallest. it had to be at least 7.5 feet tall if it wasn't slumped. We heard another snap in the woods and ran full sprint to the fire tower at the top of the hill and stayed there the entire night. We didn't talk much about it ... still in shock I think ..  Please contact me for photos of the park and any information. Thank you.",
  "classification": "Class A",
  "county": "Taney",
  "state": "Missouri",
  "latitude": 36.66887,
  "longitude": -93.29459,
  "location": "-93.29459,36.66887",
  "location_details": "Ruth Henning conservation area - aka Henning Park scenic overlook",
  "temperature_high": 83.79,
  "temperature_mid": 74.19,
  "temperature_low": 64.59,
  "dew_point": 61.44,
  "humidity": 0.69,
  "cloud_cover": 0.38,
  "moon_phase": 0.58,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.18,
  "summary": "Partly cloudy until evening.",
  "uv_index": 7,
  "visibility": 9.54,
  "wind_bearing": 162,
  "wind_speed": 6.02
}