{
  "id": "2406",
  "title": "",
  "date": "",
  "observed": "I WAS A SENIOR IN HIGH SCHOOL IN THE FALL OF 1982.  THERE WAS A KID IN MY ACCOUNTING CLASS THAT WAS A JUNIOR. I DON'T KNOW HOW WE GOT ON THE SUBJECT, BUT HE STARTED TALKING ABOUT A BLACK BEAR THAT WAS RAIDING TRASH CANS ON HIS ROAD. THE INTERESTING PART ABOUT THE STORY WAS THAT HE TOLD ME THAT THIS BEAR WALKED ON TWO FEET LIKE A HUMAN AND HE DIDN'T KNOW IF IT WAS A BEAR BUT MAYBE A BIG MONKEY. AT FIRST I TOOK IT WITH A GRAIN OF SALT BUT EVERY WEEK HE SEEMED TO HAVE SOME STORY ABOUT THIS BEAR/MONKEY. I GUESS THAT HE GOT THE FEELING THAT I WASN'T TAKING HIM SERIOUSLY SO HE INVITED ME TO COME TO HIS HOUSE \"ANYTIME\" AND HE COULD CALL IT IN WITH A COYOTE CALL. I SAID HOW ABOUT TONITE! I KNOW FOR A FACT THAT IT WAS A FRIDAY LATE SEPTEMBER ABOUT 8:30 PM. I HAD ASKED ANOTHER FRIEND OF MINE TO GO ALONG WITH ME. I TOOK A RECURVE BOW AND A BOWIE KNIFE AND HE TOOK A 22.CAL RIFLE. WE WENT TO MY CLASSMATES HOUSE THAT WAS AJACENT TO MORGAN MONROE STATE FOREST. WE WALKED ABOUT A QUARTER MILE TO A FENCE THAT MARKED THE STATE PARK ABOUT 40 YARDS INTO THE WOODS(THE STATE PARK) MY CLASS MATE HAD BUILT A HUGE TREE PLATFORM THAT WAS ABOUT 8FTX8FT AND ABOUT 12FT. TALL. THE AREA AROUND THE STAND WAS COVERED WITH SAPLING TREES SO THICK THAT YOU COULDN'T SWING A BASEBALL BAT. WE CLIMBED UP INTO THE STAND AND MY CLASSMATE BEGAN BLOWING THE COYOTE CALL (THAT SIMULATES A WOUNDED RABBIT).THE NITE WAS WARM WITH A LITTLE BREEZE AND QUITE PEACEFUL. THIS CONTINUED FOR ABOUT THIRTY TO FORTY MINUTES WITHOUT A RESPONSE. WE WERE ABOUT TO CALL IT QUITS WHEN WE HEARD SOMETHING WALKING IN THE UNDERBRUSH. I THOUGHT IT WAS A RACOON/DEER BUT IT STARTED TO CIRCLE THE PLATFORM AND THE FOOTSTEPS WERE MUCH LOUDER THEN A RACOON, AND A DEER WOULD HAVE SMELLED US AND RUN AWAY. IT SEEMED TO BE LOOKING FOR SOMETHING (THE RABBIT) AND WE HAD REMAINED SILENT. THEN I NOTICED EVERYTHING AROUND US WAS SILENT EXCEPT THE BREEZE . THEN IT STARTED GRUNTING! THE GRUNT WAS VERY UNIQUE AND VERY POWERFUL VERY DEEP CHESTED! A SOUND I HAD NEVER HEARD BEFORE, AND NEVER HAVE AGAIN. WE TRIED TO SHINE A FLASHLIGHT ON IT BUT IT WAS ALWAYS RIGHT AT THE EDGE OF THE LIGHT WE NEVER SAW WHAT WAS CIRCLING US. THE CIRCLING FINALLY STOPPED AND WE ALL HAD TO GET HOME BUT THE AREA AROUND US WAS STILL QUIET, ONLY THE BREEZE AND THE RUFFLING OF THE LEAVES IN THE TREES. THE THREE OF US WERE SCARED TO DEATH ABOUT GETTING DOWN FROM THE PLATEFORM! WE HAD CALLED IT IN AND IT WAS EXPECTING SOMETHING!  WE FLIPPED A COIN TO SEE WHO WENT DOWN FIRST. I LOST AND MY BOW WAS WORTHLESS IN THE SAPPLING COVER SO ALL I HAD WAS MY KNIFE. DROPPING DOWN INTO BLACKNESS(AND IT WAS BLACK) NOT KNOWING WHAT WAS GOING TO HAPPEN WAS THE SCARIEST THING I HAVE EVER DONE IN MY LIFE! BOTH OF THEM CAME DOWN RIGHT AFTER ME AND WE ALL RAN FROM THE WOODS AND ACROSS THE FIELD TO MY CLASSMATES HOUSE. MY FRIEND AND I JUMPED IN HIS TRUCK AND THANKED MY CLASSMATE AND WENT HOME AND NEVER TALKED ABOUT AGAIN. I HAVEN'T REPORTED THIS INCIDENT TO ANYONE EXCEPT A FEW CHOICE FRIENDS AND FAMILY. I KNOW THIS ISN'T A CLASS \"A\" REPORT BUT I THOUGHT THE USE OF COYOTE CALLS MIGHT BE OF SOME HELP. I TRULY BELIEVE \"AND ALWAYS WILL\" THAT WHAT CIRCLED US AND GRUNTED SEVERAL TIMES WASN\"T A BEAR, COW (MY FAMILY RAISED 45 HEAD OF CATTLE YEARLY), OR A PRANK . WE WERE ARMED AND COULD HAVE STARTED SHOOTING ANYTIME IF WE WANTED TOO.",
  "classification": "Class B",
  "county": "Morgan",
  "state": "Indiana",
  "location_details": "",
  "summary": ""
}