{
  "reportId": "2425",
  "title": "Family has evening sighting in Mayslick",
  "date": "1980-10-07",
  "timestamp": 339724800,
  "observed": "Subject: Large White, \"Ape-like\" Creature Reported Date: October 7, 1980 @ 9:30 PM Witness: C.F. Location: Mayslick, Kentucky (Mason County) Investigators: Ron Schaffner and Earl Jones -------------------------------------------------------------------------------- Case Data: C.F. and his family were watching television when they heard a loud noise on the front porch. C.F. said he heard his son's pet rooster disturbed. When he peered out the front door, he saw a white, hairy creature with pink eyes that must have weighed about 400 pounds and was about 7 feet tall. The creature was holding the rooster by the neck and then threw it against the side of the house. It then proceeded around the back of the house in a vacant lot. C.F. claimed to have grabbed his .22 pistol and followed the intruder. He fired on the creature twice, as it ran out of sight. Our investigation began shortly after hearing of the incident through a small article in the Cincinnati Enquirer. We contacted a Maysville, Kentucky newspaper, who in turn told us of a local radio newsman doing his own work into the matter. Doug McGill of WFTM, Maysville was kind enough to give us C.F.'s phone number. We called him and arranged an interview on Sunday, October 12. C.F.  believes that the lights coming from his porch and living room may have frightened the creature and that is why it seemed to go on a rampage. C.F.  said that its white hair was real long - much like a horse's mane. He also stated that the creature was \"man-like\", except that those eyes were like that of an animal. C.F. described other interesting facts. He described the creature's gait as having large strides, but it appeared as moving at a slow speed, as if he (C.F.) could catch up with it. but the faster C.F.ran at it, the further distance between them. He said it almost like a dream - the kind of dream that when a wild animal is chasing you and you cannot seem to run away. There was a clothes line that stretches from a tree to the back porch. He did not know why the creature evaded the line, but he remembers that he almost hung himself because it was so dark. Conclusions: Close scrutiny of the family pet rooster revealed no signs of physical harm or injuries. It would be difficult to believe that this animal could withstand the force of being projected against the house by a creature of the reported size. C.F.  also told us that another pet - a raccoon was found on the roof later that night and no one knew how it got there. It had been in a closed cage earlier that day. The clothes line may have been a depth perception, or night blindness on C.F.'s part. He probably just forgot about it being there. We spent several hours backpacking the surrounding area and could not find any trace evidence, such as footprints, droppings, or hair. There wasn't any recent rain, so the terrain was quite hard. The last instant the creature was observed, it was headed up the gravel road that lies to the west of C.F.'s house. Other members of the family told us about a car with some teenagers that may have seen it. They told us that when their father chased the unknown around the house, this car stopped for a few seconds and then spun away at a high rate of speed, leaving tire marks a good distance up the road. These marks were still visible on our visit. Attempts to track down this car were fruitless. While there is no physical evidence, we are still left with the testimony of Mr. C.F. . His credibility - in our opinion- lends credence to the story. It should be remembered that it was the press - not him that began using the term bigfoot. We can neither prove, nor disprove his story; therefore the case is still listed as an unknown.",
  "classification": "Class A",
  "county": "Mason",
  "state": "Kentucky",
  "latitude": 38.51465,
  "longitude": -83.83695,
  "location": "-83.83695,38.51465",
  "location_details": "",
  "temperature_high": 70.91,
  "temperature_mid": 59.23,
  "temperature_low": 47.55,
  "dew_point": 41.45,
  "humidity": 0.58,
  "cloud_cover": 0.37,
  "moon_phase": 0.95,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.78,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 4,
  "visibility": 9.58,
  "wind_bearing": 227,
  "wind_speed": 5.54
}