{
  "id": "25154",
  "title": "Two elk hunters & tall bipedal creature startle each other at Chalk Creek east of Coalville",
  "date": "2004-10-15",
  "timestamp": 1097798400,
  "observed": "I was hunting Elk with my Bro in Law. Up in Chalk Creek. That is in Summit County in Utah. We had been in this deep canyon for some time. It was getting dark, so we heeded out of it. I can still see this in my head,..We were climbing up out of a small draw onto a flat meadow. As we got to the top of it. We both saw something very black in color move into a small stand of pine trees. It let out a huge Whoooff sort of sound as it went in. Also it moved a pine bow that flipped from the ground to about five feet in the air. My Bro in law said \" What the Heck was that\"!!! As he put a shell into the chamber. This stand of pines was no bigger than a front yard. There was a clearing behind it. I have thought on this for some time. I think that we came in contact with it. And we surprised each other. The Creature was to our left, and we had a Beaver Dam to our right. The thing was about 30 feet away from us in the pines. We were on a Deer path between the pond and the pines. We backed up, and this thing let out a low gutteral growl at us. You could hear it's teeth chatter also. I have felt fear in my life, but a sense of evil came over me. On the way home we talked about what we had saw. We were so close to this thing. I know for a fact it was not a Bear or Moose. A Bear does not move that fast on it's hind legs. I used to work at Lagoon in Farmington. It's an amusement park. I used to feed the animals down there. They had a Leapord that would growl at you when you walked by it's cage. That growl was almost just like what I heard on that mountain. I have been in the hills all my life, and have never seen or heard anything like that. Pleas give me a call.",
  "classification": "Class A",
  "county": "Summit",
  "state": "Utah",
  "latitude": 40.92128,
  "longitude": -111.0837,
  "location": "-111.0837,40.92128",
  "location_details": "It's a CWMU known as Thousand Peaks.",
  "temperature_high": 67.25,
  "temperature_mid": 54.79,
  "temperature_low": 42.33,
  "dew_point": 28.08,
  "humidity": 0.41,
  "cloud_cover": 0.09,
  "moon_phase": 0.05,
  "precip_intensity": 0.0009,
  "precip_probability": 0.23,
  "precip_type": "rain",
  "pressure": 1011.32,
  "summary": "Clear throughout the day.",
  "uv_index": 4,
  "visibility": 9.64,
  "wind_bearing": 231,
  "wind_speed": 5.87
}