{
  "reportId": "32824",
  "title": "Recollection of a road crossing at dusk while working as an MP on Fort Lewis",
  "date": "1986-09-15",
  "timestamp": 527126400,
  "observed": "I was working as a Military Police law enforcement command soldier at Fort Lewis, Washington from November 1985 to December 1986. My barracks were on North Fort Lewis. We commonly drove from the main post provost marshal office via the Pendleton Road route into north fort. In the early fall of 1986, I was travelling this route as I had many times before in the company of my partner and friend, also an M.P., who is from Oregon. We had often spoken and joked about various legends we had heard about Sasquatch inhabiting or existing in the Pacific Northwest, and being from Ohio, I was a thorough non-believer. We were travelling northwest along Flora Rd on north Fort Lewis between the Fort Lewis Museum and 41st Division Drive, approximately ¾ mile from San Francisco Ave, at twilight, when we observed a large fur covered animal cross the road from left (w) to right (e) in approximately four (4 ) steps. It was walking upright, had a long lumbering gait, long arms, a large head, and walked mildly stooped at the shoulders, and appeared to be at least 8 feet tall. We stopped the truck and flipped on the bright headlights. Initially thinking it was a bear, I slowly rolled closer, excited about seeing my first wild bear on post. We were approximately 50 to 80 yards away, at the time. The animal stopped on the right side of the roadway at the edge of the trees, turned and looked towards us, and with one step, disappeared into the trees. I remember trembling and thinking I couldn’t believe my eyes. It was definitely NOT a bear! My partner and I stopped in the roadway, and got out of the truck. We saw where the pine limbs were still shaking where they had been parted by the animal, as it moved through. We could hear it walking ahead of us by about 30 or so yards, and then the walking noise stopped. We walked into the trees, towards where we last heard the sound. We both had our flashlights, but it was not yet quite dark, and were still in our camouflage uniforms. My friend was about 5 yards ahead of me, and we had gone about 30 yards into the woods, when a large limb cracked in a tree just ahead of us and there was a scream unlike anything I had ever heard. My friend turned towards me and began sprinting back towards the road, past me, yelling “run”, with his eyes wide open. I turned, running, to follow him and whatever the animal was, was now behind us, wailing what resembled a scream. We got back to the truck and we both noted that the other was “white as a ghost”. We rode back to the barracks in near silence. We both agreed that we had just witnessed and heard a bigfoot! The next day, after calming down considerably, we went back to the spot and found several high tree limbs bent and broken by something very large and very tall. The ground had a covering of both fresh green and brown pine needles, but no evidence of footprints. It has always been a running joke between us, even after all these years, that we encountered a sasquatch that evening. I have been a believer since that day. Many of our friends laughed at us when we told them, but several later admitted that they had seen something similar crossing the roads during late evening patrols around Ft Lewis, especially in the more remote training areas and roads, and near Solo Point at Puget Sound or near Sequalitchew Lake on North Fort Lewis. I will never forget that day!",
  "classification": "Class A",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 47.10637,
  "longitude": -122.5958,
  "location": "-122.5958,47.10637",
  "location_details": "",
  "temperature_high": 67.85,
  "temperature_mid": 58.865,
  "temperature_low": 49.88,
  "dew_point": 46.18,
  "humidity": 0.69,
  "cloud_cover": 0.84,
  "moon_phase": 0.42,
  "precip_intensity": 0.0025,
  "precip_probability": 0.61,
  "precip_type": "rain",
  "pressure": 1014.42,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 7.58,
  "wind_bearing": 38,
  "wind_speed": 0.41
}