{
  "reportId": "11432",
  "title": "Possible sighting during BFRO's West Virginia expedition, Spring 2005.",
  "date": "2005-04-13",
  "timestamp": 1113350400,
  "observed": "My husband and I attended the BFRO expedition in West Virginia in Spring of 2005. The base camp was next to a river in the mountains near the Virginia border. On Thursday afternoon most of the people crossed the river by canoe in order to hike down the trail along the opposite bank of the river.  After that group set off, Steve, my husband, headed out in his truck with a big handheld radio to see if he could reach the others who had walked down the river trail. I was alone in the base camp. After about a half hour I went outside and stood at the nose of the camper and looked up the road to see if Steve had driven away, then I turned around to go to the river.  I looked through the trees and saw what I first thought were two people from the river group coming back up the trail, around the bend in the river trail.  I walked straight over to the river's edge to get ready to take pictures of them crossing back over in the canoe. When I got to the riverbank I looked across and saw no one, which was surprising. There was no place to hide along the river trail for the next 200 yards. One side of the trail was the riverbank. The other side was the jagged rock face of the river canyon. From the ground upward, the rock face was mostly bare for about the first 15 feet. Then there was thick mountain laurel the rest of the way up, covering the rock outcroppings and ledges. You could not get out of view unless you were to climb up into the mountain laurel above the trail.  It was a near vertical climb, but there was no other way they could have vanished so quickly in any other direction. Then I started thinking about the figures I saw.  They had looked pretty slender, but it was a cold day. Everyone was bundled up for cold and rain and looked a bit “plump”.   The figures I saw seemed lanky with a lazy walk. They were also walking into the sunlight when they came around the bend, but I didn't see any color – no clothes, no light skin, no sneakers, no hats, etc.  They were tree-trunk dark. The taller one was walking closest to the hillside; the shorter one was closer to the river. Steve returned to the camp and I asked him to radio to the group that walked down the river. They had walked past that same bend and would have noticed anyone walking up the trail in the opposite direction. The river group responded and said no one passed them in the oppositive direction. They said anything coming around that bend must have come down from the side of the canyon, then climbed back up the canyon wall. They offered to walk back to that point to provide some scale, for me to compare the height. They asked me to return to where I had been standing when I saw the figures. I went back to the same spot. The river group radioed that they were coming around the bend in the trail. They said to look over at them as they came into view.  When I did it immediately struck me that they appeared much smaller than the figures I saw. There were other things about their appearance that sharply contrasted with the figures I saw. I could see the gaps of air between their arms and torso -- unlike the humans who were so bundled up with rain gear that you could not see any gaps betwen their arms and torsos. Several other things happend along this same river during the expedition. I'll let the other people who were present on the expedition describe those occurrences.",
  "classification": "Class B",
  "county": "Pocahontas",
  "state": "West Virginia",
  "latitude": 38.10833,
  "longitude": -80.17528,
  "location": "-80.17528,38.10833",
  "location_details": "",
  "temperature_high": 50.04,
  "temperature_mid": 41.47,
  "temperature_low": 32.9,
  "dew_point": 37.95,
  "humidity": 0.77,
  "cloud_cover": 0.72,
  "moon_phase": 0.16,
  "precip_intensity": 0.0031,
  "precip_probability": 0.45,
  "precip_type": "rain",
  "pressure": 1010.4,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 6,
  "visibility": 7.19,
  "wind_bearing": 80,
  "wind_speed": 6.23
}