{
  "reportId": "10024",
  "title": "Deer hunter finds a series of footprints on Y Mountain.",
  "date": "1982-10-31",
  "timestamp": 404870400,
  "observed": "I was hunting on the second weekend of the deer hunt and I planned on spending the night alone on the top of Y Mountain. When I arrived at the top I found to my surprise that someone was up there this year ( I was shocked that any person would have hiked to this remote location). I followed the foot prints to where they were going because they were going to the valley overlook... as I was walking it was much easier to step into the tracks of the person (the snow was about 1 foot deep)... as I did this I was shocked at the size of the man I was trying to step into the foot steps of..... I almost could not take such huge steps... as the foot prints went under the shadow of the evergreen tree I saw what shocked me.... the foot print were bare foot!!!!!!!!! I could see toe prints clearly!!!! at fist I could not believe it and I looked again and again and measured them and looked at more thinking I was going crazy ....... I got scared and the hair on my neck stood up!!!!!!!!!!! It was very very spooky!!!! and I was alone and going to spend the night with this animal..... I decided to leave imediately.... As I was leaving the mountain I saw more foot prints on the south side of the mountain going down into Rock Canyon.",
  "classification": "Class B",
  "county": "Utah",
  "state": "Utah",
  "latitude": 40.25622,
  "longitude": -111.6068,
  "location": "-111.6068,40.25622",
  "location_details": "You can get to the location by hiking to the Y on the mountain above Provo. Then hike up the ravine just to the South (the trail head is at the Y on the mountain. The way I went, was up Rock Canyon and then I turned South up the first ravine (3 miles up the canyon). Then hike up the ravine to the top and then turn East and hike about a half  mile and then you turn South and go up to the top of the mountain (you eventually are at the location where you look down into Rock Canyon from the top). It is very very remote and the most difficult access area. This is where I saw the signs and foot prints.",
  "temperature_high": 46.89,
  "temperature_mid": 41.13,
  "temperature_low": 35.37,
  "dew_point": 36.86,
  "humidity": 0.82,
  "cloud_cover": 0.85,
  "moon_phase": 0.46,
  "precip_intensity": 0.0072,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1017.02,
  "summary": "Light rain in the morning.",
  "uv_index": 2,
  "visibility": 9.17,
  "wind_bearing": 235,
  "wind_speed": 1.56
}