{
  "reportId": "3606",
  "title": "Campers have daylight sighting near Leadville",
  "date": "1971-09-15",
  "timestamp": 53740800,
  "observed": "I was camping with my family at the headwaters of Clear Creek Reservoir near Granite Colorado. I was very young at the time.  I was with eight of my cousins and we decided to climb the hill at the north end of the reservoir to get a better view of the area. There were nine of us ranging in age from nine to 14 years old. When we reached the top of the hill we started rolling rocks down the hill. It was then that we noticed, right across the ravine from where we stood, a tremendous amount of crashing through the aspens. At first we thought it was a grizzly bear since it stood on its hind legs watching us from a distance of about 300 feet.  Its hair was golden brown in color and very long. It was very tall, at least eight feet. It just stood there on two legs looking straight at us. I could not see its face. The sun was at its back and its face was in silhouette. But, I could tell that the face was very dark. The head and body were large and were not built like a bear. We stood and watched this animal and it watched us for several minutes. It stood on two legs at all times and sometimes it rocked back and forth. At that time I assumed that this was because it wanted to get our scent or to get a better view. We then decided to run for it. We came down the hill at breakneck speed, and were scolded  by our parents who thought we could have broken a leg running so fast down the hill. My parents claimed it was a bear. But, I have been hunting and fishing these mountains for thirty years. I have never seen a grizzly bear in this part of the state. I have seen grizzly bears before and their fur is brown.  The color of the fur on this animal was unlike anything I have ever seen.   Again,It was very long and golden in color.   To this day me and my cousins swear we saw a bigfoot.",
  "classification": "Class A",
  "county": "Chaffee",
  "state": "Colorado",
  "latitude": 39.25,
  "longitude": -106.3,
  "location": "-106.3,39.25",
  "location_details": "Travel South out of Leadville Colorado about fifteen miles on U.S. 24 to Granite Colorado.  About two miles past Granite turn right (west) on Clear Creek Canyon Road.  Clear Creek Lake Reservoir is about one half mile west after you make the turn.",
  "temperature_high": 70.87,
  "temperature_mid": 51.965,
  "temperature_low": 33.06,
  "dew_point": 27.14,
  "humidity": 0.42,
  "cloud_cover": 0.11,
  "moon_phase": 0.88,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.35,
  "summary": "Partly cloudy starting in the evening.",
  "uv_index": 8,
  "visibility": 10,
  "wind_bearing": 96,
  "wind_speed": 1.68
}