{
  "id": "22101",
  "title": "Multiple incidents around river slough south of Belleville",
  "date": "2007-12-01",
  "timestamp": 1196467200,
  "observed": "We had begun fishing along a slough a few weeks ago.and we had been catching some good fish along it so we descided to clear out our own spot for camping sessions along its bank. The strange things started happening about maybe a week ago now...We were night fishing along the bank when my friend Jacob spied something across the lake looking at us. I pulled the jeep up and shinned the headlights across the lake and he caught a glint of amber like eyes staring at us. He and Jonathon our other friend said the thing was massive. Saying it could have went eight to nine feet tall easily. It was haunched over in a set of dead grass that stood pretty high. It also had brown wavy furr but other than that I never got a look at it as it apparently fled before I could lay eyes on it. Now just last Friday we all descided to go camping and ignored the previous encounter from that night...We set up late in the evening with the cloudy skys rolling in. It rained on us a little bit but we ignored the bad weather and even grilled some burgers over our open pit fire. Me and Jonathon eventually left Jacob alone while we went out and cut some more wood. After we left my dog who is actually a small dog became real anxious according to Jacob. It would bark and howl towards the woods surronding us...then whimper and whine to my friend...Jacob said he felt like he was being watched but didnt wish to ruin our camping trip. He also smelled an oder because the wind just happened to shift for a moment..He says the oder was like a very smell gym rat after a hard work out...but perhaps magnified by ten. We returned shortly after and eventually I took Jacob home because of his uneasyness. Jonathon and I stayed till about 1 Am when the encounter actually happened. We never saw anything though...Jonathon had been sawing down a small tree for more firewood when a loud whooping/moaning sound echoed just thirty feet behind us. The sound was unrecognizeable as any animal we had ever heard and we have both spent many hours in the woods hunting. He and I debated the sound on the other side of the fire nearest to the water when it came again this time much louder and deeper...sounded even closer. I told him it was time to leave as the hair on the back of our necks stood up. I pulled my dog out of the tent...The dog is usually very hyper and happy but on this night he cowered and refused to leave the santuary of the tent. Once out of the jeep he acted very quiet and sat in the backseat unmoving. I was so afraid by this point I clambered into the passanger seat instead of going around to the drivers side where the sound was heard...We took off and left all of our camping gear...The bad feelings we had seemed to disappear once we had left the area. We came back the next day with our camp in good order still but my tent which had been zipped up at the time was open..I looked for any sort of sign but could not see anything other than the burger patties were missing. Also an old hoe we used to shovel up leaves was half way burnt...It had broken on us that night but we moved it well away from the fire..It was found near the fire and partly burnt. We also found what looked like a foot print near the area of the sound but we could not really identify it...It was bigger than my foot though and I wear size 13s.",
  "classification": "Class B",
  "county": "Yell",
  "state": "Arkansas",
  "latitude": 35.06144,
  "longitude": -93.45042,
  "location": "-93.45042,35.06144",
  "location_details": "The location is down south of Belleville. Its mostly farmlands till you hit the slough and the river.  The area where it happened is rather swampy and borders fields. The only tree lines are along the water sources. There the bushes are very thick.",
  "temperature_high": 65.69,
  "temperature_mid": 63.865,
  "temperature_low": 62.04,
  "dew_point": 41.65,
  "humidity": 0.61,
  "cloud_cover": 0.62,
  "moon_phase": 0.75,
  "precip_intensity": 0.0003,
  "precip_probability": 0.19,
  "precip_type": "rain",
  "pressure": 1019.98,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 9.89,
  "wind_bearing": 130,
  "wind_speed": 5.75
}