{
  "reportId": "12396",
  "title": "Possible vocalization heard near Hoop Lake.",
  "date": "2004-08-10",
  "timestamp": 1092096000,
  "observed": "In August of 2004, my family and I were camped at Hoop Lake, in the Uinta Mtns of Utah.  Just south of our camp was the outflow stream of Hoop Lake that cut a very deep gorge, some 100+ feet deep.  Along that gorge runs an ATV trail, that we rode along quite often during our four-day camp.  The ATV trail ends on the shoulder of a mountain, and overlooks about 3,000 acres of meadow and climax forest. On the morning of the incident, my wife, myself and two of our nephews took an ATV ride along the trail.  We ended our ride at the shoulder, and turned off the vehicles. We had been talking about sasquatch sightings and I had expressed the sentiment that I thought it would be awesome to see a sasquatch.  My nephews asked me if it made sounds, and I said that it's vocalizations had been recorded.  They asked what it sounded like, and I told them that I would imitate it. I made as loud a vocalization as I could, trying to recall the tonality, and pitch of the recordings.  When I stopped, the sound echoed off of the walls surrounding the meadow, and down a nearby canyon.  It was quite eery to hear the echoes.  They asked me to do it again, and I did.  The third time I made the call, something answered back from the forest next to the meadow.  The hair stood up on the back of our necks, and we decided that we had heard enough. As we started to leave, one of my nephews shouted \"What's that Uncle B.....?\"  I turned and saw a cow moose bolt out of the trees on a full gallop.  As it ran it continued to look back into the trees. I am not necessarily convinced that what I heard was a sasquatch, but I have heard many different animals (bears, coyotes, elk, deer, hawks, falcons, eagles, and wolves), and the sound that I heard didn't match any of those sounds.",
  "classification": "Class B",
  "county": "Daggett",
  "state": "Utah",
  "latitude": 40.9,
  "longitude": -109.75,
  "location": "-109.75,40.9",
  "location_details": "Drive south, out of Mountain View, Wyoming.  The highway turns east just on the outskirts of town.  Drive to a dirt, forest road that is marked \"Hoop Lake\".  The road goes south into the North Slope of the Uintah Mountains.",
  "temperature_high": 88.59,
  "temperature_mid": 71.485,
  "temperature_low": 54.38,
  "dew_point": 34.38,
  "humidity": 0.27,
  "cloud_cover": 0.04,
  "moon_phase": 0.83,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.48,
  "summary": "Clear throughout the day.",
  "uv_index": 11,
  "visibility": 9.71,
  "wind_bearing": 342,
  "wind_speed": 1.26
}