{
  "reportId": "1311",
  "title": "Daylight sighting by two moto-cross riders",
  "date": "1980-07-20",
  "timestamp": 332899200,
  "observed": "Letter: I know this may sound ridiculous, but I believe I saw “something” in Kansas! This happened several years ago but I remember it very well. While I was still living at home, my parents and I went camping nearly every summer weekend at Milford Lake in North Central Kansas. I rode moto-cross then and there is an area of the lake specially set aside for off-road, vehicle recreation. It was near the School Creek recreation area on the south-west side of the lake. It also had some of the best fishing in the area so it kept my father satisfied. It was during July or August of 1980 when a good friend “Kenny” and I were riding our motorcycles on a public dirt road that paralleled the shore of the lake. The road was outside the off-road area and neither of us had drivers licenses at the time. But boys will be boys and it wasn’t unusual for us to venture out onto the public roads. We weren’t really riding very fast - just kinda of tooling along. The lake was on the left side of the road with the shore about 100 yards away. There was fairly dense brush from the shore of the lake all the way up to the road. On the right side of the road was a hayfield with the large, round, bales of hay still in the field. Kenny and I were riding side by side when we topped the crest of a large hill and both of us stopped “dead” in our tracks. At the bottom of the hill, next to a large tree, was someone or “something” just standing there looking up at us!! We were about 75 yards away and “it” was between us and the setting sun. Both of us turned and looked at each other wide-eyed. We exchanged a “What the hell is that” and when we turned back around it was gone. I don’t know if it went back into the trees or into the field with the large hay bales. I immediately got that major chill that runs down your spine and we were both a little scared to say the least. We hesitated for a few moments and then road like hell down to the bottom of the hill and back toward our camp. I wish I would have had the sense to stop and look for tracks or something but we were just too damn scared. We jumped off our bikes when we got back to camp and told anyone who would listen. Of course, were immediately chastised for the crazy story we had dreamed up. No one believed us and thought it was just two kids trying to stir up a little excitement. Even at a younger age I wasn’t prone to wild stories so my parents were a little perplexed at my strange behavior. Later that night Kenny and I spoke before we went to bed about what we saw. We both agreed that if we had been by ourselves we would have dismissed it as our imaginations. We also agreed on the appearance of what we saw. It had a very large, broad, body, no neck, large head, (larger that a human head for the size of the body) and was very dark in appearance. Needless to say, neither of us got much sleep that night. About two weeks later we both got up enough nerve to go back to the same spot. We looked around for footprints but it had rained - if there were any before they had been washed away. Then we decided to see if we could estimate the size of the creature by having one of us go to the bottom of the hill and stand by the tree and the other stay up at the top. I got the honor of being the one to go down the hill first. Needless to say, I was a little nervous. When it was my turn at the top of the hill, I was stunned. I distinctly remembered the top of the creatures head being about even to a lower branch on the tree. When Kenny stood by the branch it was a full two and a half feet above his head!! Kenny was about 5’7” at that time, so I estimated what we saw was a little over seven feet tall. I was convinced, it could not have been human. We left and went back to camp. Neither of us spoke to anyone else about it but both of us were convinced we had seen a “bigfoot”. I last saw Kenny about four years ago. We talked about old times and eventually the conversation turned to our encounter with our “beastie”. I don’t really know if what we saw was really a bigfoot but we both still agreed it was something we would never forget. H. S.",
  "classification": "Class A",
  "county": "Geary",
  "state": "Kansas",
  "latitude": 39.1489,
  "longitude": -96.9614,
  "location": "-96.9614,39.1489",
  "location_details": "Milford Lake",
  "temperature_high": 101.44,
  "temperature_mid": 86.44,
  "temperature_low": 71.44,
  "dew_point": 63.9,
  "humidity": 0.46,
  "cloud_cover": 0.57,
  "moon_phase": 0.26,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1011.3,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 9.41,
  "wind_bearing": 206,
  "wind_speed": 6.4
}