{
  "reportId": "7809",
  "title": "Teen has nighttime sighting near Fontenelle Forest",
  "date": "2005-01-06",
  "timestamp": 1104969600,
  "observed": "The following occured in 1975 when I was 14 years old.  My family lived in Bellevue, Nebraska (near Offutt Air Force Base) where my father had recently retired from the U.S. Air Force after 24 years of active duty.  I now live in Florida. Actually, this incident was a series of three encounters over a three-day period.  A bit of background seems necessary.  My girlfriend lived on the next block.  Our houses were separated by a field with a stand of trees on the north side of the field; the stand of trees was approximately 20 feet wide at that time and ran East-West.  The stand of trees ran to the East to Bellevue Blvd.  On the East side of Bellevue Blvd. was a heavely forested area that was either a part of, or bordered, Fontenelle Forest.  I would go over to my girlfriend's  house and visit until it was time for me to go back home (my curfew was 10:00 pm during the summer). The first incident occurred as I was crossing the field on my way home around 10:00 p.m.  I was walking in a NW direction with the thick stand of trees to my right.  I heard heavy foot-falls and occasional snapping of branchs within the stand of trees.  Whatever it was within the trees was paralleling me.  When I stopped, it stopped.  When I began walking again, it began walking.  It was very dark in the field and I could not see anything.  After several stops and starts, I became somewhat frightened and ran the rest of the way across the field, climbed over the 4-foot chainlink fence that surrounded our backyard, and ran up our backyard (it was basically a hill) and into the house. The second incident happened the very next night.  This occurrence happened exactly the same way as the first incident. The final incident happened on the third night.  As I crossed the field I again heard the heavy foot-falls and snapping of small branches within the stand of trees.  However, this time I was not being paralled; the thing was heading in a SW direction which placed it on an intercept course to my NW direction of travel.  I could hear it getting closer, but could not see anything because of the extreme darkness.  Near the point of interception, I began to smell a foul odor.  The odor was very stong and almost made me gag.  By now the foot-falls were very near.  I could feel the thing cross in front of me very close, but could not see anything.  The foot-falls were now on my left.  At this point I became extremely scared and began running across the field.  I'm not sure, but I suspect I cleared our 4-foot fence without even touching it. About half-way up the hill (our backyard) I stopped.  I can't explain why I did this, but I simply felt compelled to do so.  I turned around and saw what had crossed my path.  The backyard and a portion of the field was nicely illuminated by a flood-light my father had put on the back of the house. Standing at the edge of the field next to a clothes-line pole, was a creature on two legs.  It was covered in dark brown hair.  I estimate the height at 7 feet.  This is based on the fact that the clothes-line pole was 6 feet in height and the creature's head was a good foot above the top of the pole.  I was approximately 40-50 feet from it, but could not make out any facial features.  I recall that there was eye-shine, but I can't recall the color, possibly reddish.  The thing was extremely thick across the chest.  The arms hung almost to the knees.  This thing was very muscular.  We stood there staring at each other for approximately 20 seconds before I turned and ran into my house (I chickened out before it did). There is no question in mind that what I saw was a bigfoot.",
  "classification": "Class A",
  "county": "Sarpy",
  "state": "Nebraska",
  "latitude": 41.134,
  "longitude": -95.88,
  "location": "-95.88,41.134",
  "location_details": "Georgia Ave. and Tulip Ln. run East-West  My house was approximately 1/3 of a mile from Bellevue Blvd., which ran along the heavily forested area of Fontenelle Forest.",
  "temperature_high": 12.83,
  "temperature_mid": 8.475,
  "temperature_low": 4.12,
  "dew_point": 2.79,
  "humidity": 0.89,
  "cloud_cover": 0.37,
  "moon_phase": 0.86,
  "precip_intensity": 0.0006,
  "precip_probability": 0.29,
  "precip_type": "snow",
  "pressure": 1020.35,
  "summary": "Overcast starting in the evening.",
  "uv_index": 2,
  "visibility": 7.44,
  "wind_bearing": 222,
  "wind_speed": 2.25
}