{
  "reportId": "8935",
  "title": "Various occurences between Lake Kissimmee and Tiger Lake that may be BF-related",
  "date": "1985-11-15",
  "timestamp": 500860800,
  "observed": "The incidents all took place on a private reserve of land called River Ranch over the Thanksgiving holiday weekend of 1985, friday night through early sunday afternoon. My uncle and I arrived at the family cabin at around 10 p.m. friday night and for the next hour or so we opened up the cabin, tested the generator and put the food in the refrigerator. My uncle had planned a full day of hunting the next day so we turned in after everything was put away. I had no trouble falling asleep and all was peaceful and very quiet. The next thing that happened still puts a chill up my spine 20 years later. I just remember waking up for no reason at almost 2 a.m. and then feeling very unsafe. About 10 seconds later, I heard some kind of crunching on the ground near the screen porch. Louder than the sound we were making ourselves walking on the same ground. Then, a few seconds later, I heard the screen door open then close quickly but not long enough for someone to come in. It was just click, woosh click. The second thing that struck me as odd was that my uncle's red nose pit was awake but still curled up at the foot of the bunks. I could see his eyes moving around but he was not going to move a muscle. Not the case at home. I didn't move from the bunk until it was light enough to see. From that point on, the only way to describe the rest of the trip is that it was very bizarre and un-relaxing. We are both 100% convinced that we were being watched and maybe even stalked by something.",
  "classification": "Class B",
  "county": "Osceola",
  "state": "Florida",
  "latitude": 27.84434,
  "longitude": -81.30249,
  "location": "-81.30249,27.84434",
  "location_details": "100 thousand + acre ranch and private hunting reserve between Lake Kissimme and Tiger Lake. Long leaf pine, palmetto heads and oak hammocks. I will provide more specfic directions after I speak to a researcher.",
  "temperature_high": 77.22,
  "temperature_mid": 67.77,
  "temperature_low": 58.32,
  "dew_point": 61.5,
  "humidity": 0.82,
  "cloud_cover": 0.39,
  "moon_phase": 0.12,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1022.3,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 8.02,
  "wind_bearing": 80,
  "wind_speed": 5.93
}