{
  "reportId": "27327",
  "title": "Wilderness campers have an unknown visitor in the Trinity Alps of Northern California",
  "date": "2010-08-29",
  "timestamp": 1283040000,
  "observed": "I have been backpacking in the Trinity Alps for 12 years and have ran into many bears and even mountain lions but this experience was much different. My wife, brother, and another friend of ours went packing to Bear Lake in the trinity alps. It was our last night and we were the only ones at the lake. Since it was in August fire wood was scarce and we had none for our last night. We sat in our dark camp until about midnight then everyone wanted to sleep. My brother and our friend shared a tent and my wife and I shared one. I lay in my tent and couldn't sleep. I looked at the time and it was 1:30 am. My wife was asleep and I heard what I thought was my brother walking around in camp. It walked around for at least a minute so I whispered my brothers name to see if it was him but it kept walking around and not responding which made me very nervous. I heard the steps getting closer to my tent and I started to smell a horrible animal stench. I had left my backpack leaning against a log about 15 feet from our tent. Whatever it was walked over and picked up my pack off the ground and was holding it above my tent. I could see the shadow of something very large  standing outside the tent trying to rip open my pack as it held it above our tent which had no food in it., Our food pack was up in a tree on the other side of camp with only freeze dried food. I was in such shock I yelled at it and it stood still. My wife, brother, and our friend all woke up from my yelling. My brother was trying to get out of his tent when the animal dropped my pack on top of our tent and ran out of our camp.",
  "classification": "Class B",
  "county": "Trinity",
  "state": "California",
  "latitude": 41.1139,
  "longitude": -122.7,
  "location": "-122.7,41.1139",
  "location_details": "It was Big Bear Lake. The trail head is off HWY 3 about 40 miles north of Weaverville and about a 5 mile hike to the lake.",
  "temperature_high": 67.09,
  "temperature_mid": 58.83,
  "temperature_low": 50.57,
  "dew_point": 42.86,
  "humidity": 0.58,
  "cloud_cover": 0.35,
  "moon_phase": 0.66,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1012.12,
  "summary": "Partly cloudy starting in the evening.",
  "uv_index": 7,
  "visibility": 9.65,
  "wind_bearing": 339,
  "wind_speed": 4.69
}