{
  "reportId": "270",
  "title": "Campers awakened by late-night visitor in the Indian Heaven Wilderness",
  "date": "1985-07-01",
  "timestamp": 489024000,
  "observed": "In late June or early July of 1985 I was camping at Cultus Creek Campground in WA with my significant other, my 12 yr. old son, and our Queensland Blue-Heeler \"Panda\". It was our second day there, and we were having a great time because there was no one else in the campground. This campground is on the edge of Indian Heaven, near large huckleberry fields. We had been doing extensive hiking when Panda suddenly appeared to  become ill. She clearly didn't want to continue the hike. The only thing I could think of was that maybe she had \"altitude sickness\", so I told my family that I would take her back to camp so she could rest. The dog stayed glued to my side all the way back to camp, and even after we got there. I noticed \"rustling\" in the brush as we were hiking back down, but gave it no thought as I've done alot of camping and feel quite comfortable in the outdoors. Late that night (actually early the next AM) Panda began barking and yelping and digging frantically at the door to the tent (which was zipped shut). Obviously we all woke up. By that time there was complete silence outside. I said to my friend that I wanted to let her in the tent, but he said \"No, it's probably only a deer.\" As soon as I spoke we could hear heavy  \"2-footed\" footsteps running away. Nothing more occurred that night, or the rest of the 2 weeks we camped there. I have always been interested in Bigfoot (for the past 50 yrs), but I never associated this incident with them. Until I began reading reports on the 'net I didn't know this was an area where they had been sighted. I don't recall hearing any screams or banging on trees while we were there. The only odd thing was that the next day we walked all throughout the campground and we were still the only people there! We were located in the last site in the campground, right by the creek. I didn't think of looking for any kind of footprints or anything, so this isn't really much of a \"report\". Just an unusual experience I suppose.",
  "classification": "Class B",
  "county": "Skamania",
  "state": "Washington",
  "latitude": 46.04722,
  "longitude": -122.1914,
  "location": "-122.1914,46.04722",
  "location_details": "I really don't know. My friend used to be the Ranger there many years ago. He drove & I didn't pay any attention to how we got there. Since it's an established campground it shouldn't be hard to locate.",
  "temperature_high": 83.6,
  "temperature_mid": 69.025,
  "temperature_low": 54.45,
  "dew_point": 47.42,
  "humidity": 0.54,
  "cloud_cover": 0.58,
  "moon_phase": 0.48,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.3,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 6,
  "visibility": 9.77,
  "wind_bearing": 349,
  "wind_speed": 3.27
}