{
  "reportId": "2943",
  "title": "",
  "date": "",
  "observed": "Since the 1930's my Granddad and father have hunted the area of Michigan around Mio, from mid state to the Mackinaw Bridge and over to Lake Huron.  As I was grew older starting in the 60's, our family often enjoyed camping summers and fall, and archery hunting every fall in the area east of Mio and southeast of McKinley along the Ausable River, and camped near O'Brien Lake. I didn't think about MI until I started researching BF behavior, and remembered the things I heard while hunting.  The two times I remember hearing pounding was in the late 80s. In 1986, the family was camped there and archery hunting in October once again.  My brother, two brother-in-laws, Dad, and I were once again together archery hunting.  We usually spread out around the area pretty well, and were always separated while hunting.  This afternoon, while I was just sitting enjoying the beautiful fall day, I heard what I can only describe as the sound of pounding of wood on a tree a ways off into the deeper woods.  My first thought was who would be cutting down a tree way out there because they would have several miles to drag it back.  But then as I listened, I noticed something was missing; the familiar metallic ka'ching, ka'ching of an axe on wood was not present.  This was definitely the sound like a branch of piece of wood was being rapped on the side of a tree.  The beating lasted about 5 minutes, then stopped and I didn't hear it anymore.  I didn't really think anymore about it after that but never forgot it either.  Nothing else out of the ordinary occurred that year. I had been successful getting my first really trophy buck in 1986, so was excited to go up again in 1987, with the family and my brother to once again archery hunt.  However we were all disappointed once we arrived at our favorite spots.  The forest sevice had clear cut a huge holding right where we usually hunted.  So we moved back closer and hunted along the Ausable River.  We hadn't been hunting there for a couple of reasons, one of which was it was harder to hunt the swamp around O'Brien Lake and the fact that we had seen bear tracks there alot.  But as the clear cutting had moved us, we planned our strategy and liking ambush areas.  One morning my brother and I walked in the center of a section of mixed hardwoods and pines and sat.  He and I sat about 75 or 100 yds apart.  Later towards lunch time, I heard the tree knocking to the west of us, again no metallic kaching, just wood on wood, then about 15 minutes later a pine tree to the west of me about 40 to 50 yds away started shaking violently.  The entire tree, not just branches but the whole tree.  The tree was about 4 inches in diameter and about 20 feet tall.  At first I thought it a bear, but as I watched it went from side to side almost touching the ground on each side then shook like something was 'wringing' its neck.  Bucks will rub on trees but only a few branches move.  Bear have 'leaned' on trees and pushed on them but I never saw where they could grab hold of a tree and just shake it.  As I was getting hungry for lunch, I decided to start walking out not too long after that; also I didn't want to meet whatever could do this to a tree.  My brother came out and met me not long after I started walking out.  I didn't notice any odors, nor could I make out any animal shapes in the patchwork of shadows and bright sun.  I didn't think anything about it again until this year because as I was stationed near Dayton OH, and now live here, I've definitely seen two Bigfoot here in Ohio and heard another, and without a doubt they are the most exciting thing in your life once you see one, and scary too.  I thought Whitetails were the most exciting thing, but not anymore.  I still hunt though but now I know what to recognize and to keep looking over my shoulder when everything goes quiet or the beating happens. ",
  "classification": "Class B",
  "county": "Oscoda",
  "state": "Michigan",
  "location_details": "(edited)",
  "summary": ""
}