{
  "id": "11687",
  "title": "While checking deer feeders, hunter has encounter on Neches River.",
  "date": "2005-06-15",
  "timestamp": 1118793600,
  "observed": "I went to the river camp in the afternoon, at the end of October 1999, to fill my deer feeders. I had a late start and I was afraid I would get stuck (if it started raining) in the bottom so I parked a 1/2 mile or so from the camp. There was a chance of rain in the area which was good because it had been dry, but it doesn't take much for this area to get wet, quick. I filled two, 2 and 1/2  gallon buckets with feed corn and took off walking down the road that leads past the first feeder. I noticed before I got to it that the feeder was missing. After a closer look I found the feeder hanging in the tree. It had been wrapped around the limb it was tied to, like a teather ball. The feeders we were using were made of 4\" heavy PVC drain pipe about 2 feet long. The rope was about 10 feet long.  I was thinking of climbing up the tree (or better of it) when I saw something move to my left. It was about 75 feet away and was hiding  behind a large oak tree. I had seen it for just a second and thought I was seeing some strange looking, shaggy hog.  As soon as I moved toward it, it started to move off. I followed it for a couple of minutes in this fashion but I could never get a good look. It was very good at keeping the brush and trees between it and myself . As this is in a place where the river over flows regularly (the run-off end of a slough), there is excessive amounts of dead trees, brush and briars at times. Sometimes it piles up so thick, it looks like beaver dams. I could only catch glimpes of it because of the thick cover.  Because of it's shaggy appearance I had begun to believe it was an emu or maybe two. I know this sounds strange, but a couple of weeks earlier, a man in one of the hunting clubs up the road told me someone had emptied a cattle trailer full of unwanted emus in their club and I was convinced this is what I was looking at. We continued on this way movin up the river. We came to the old R/R crossing at another camp house and boatramp across the  river. We were to a point were it/they either had to step into the open, go back the way it/they came or turn and face me.  When it stepped out I really couldn't believe it, at first.  It was a bigfoot, sasquatch, wooleybooger, or whatever you want to all it. There is nothing else it could have been. I was 50 feet or less away from it. The left side and back were to me and I couldn't see the face. It was about 7 feet tall, walking upright, and covered with long shaggy hair. It was longer on the arms (which hung to the knee) and covered its (hands ?). The hair was dark gray-ish black, and reminded me of old hay rolls that had been left out in the pasture, uncovered. It had huge, wide shoulders and the head just sort of blended into them. I did not see the feet. I would estimate its weight at 300 lbs. Although it was large, I would have to discribe it as \"lanky\".  As it moved over the bank, paused, and moved down to the river out of sight, I noticed the hair on its rear end was thinner and I could see its butt. It was black and I could see the muscles working. The sighting lasted about 10 seconds. By then my hands were shaking from the adrenaline rush I was having. I haven't had a rush like that since I was a little boy, about to take my first deer (or try, I missed). After I steadied myself (20 seconds or so) I decided to go see where it went. I figured it had crossed the river. You can walk across here easily when the river is down (and it was). I took about ten steps and a very loud \"snap\" came from directly behind me, at about 200 ft. That's when I left. I went straight back to my feeder, dumped the corn out on the ground and got the hell out of there. I was feeling flighty, to say the least. There is no doubt in my mind that when I started following this animal, it was on all fours. If at anytime it would have been on two legs (at 7 feet tall) I could have seen it clearly. It took full advantage of the thick cover. It didn't stand until it reached the opening of the river crossing. I've heard the \"booger monster\" stories all my life, but never really believed them. I now realize this animal has been there all along. I've seen some strange things, in the woods, I couldn't explain. Some of them don't seem so strange anymore. If I see it again, he can go his way and I'll go mine.",
  "classification": "Class A",
  "county": "Tyler",
  "state": "Texas",
  "latitude": 31.0232,
  "longitude": -94.47903,
  "location": "-94.47903,31.0232",
  "location_details": "Neches River. Cow pasture across river from our camp.",
  "temperature_high": 94.77,
  "temperature_mid": 83.545,
  "temperature_low": 72.32,
  "dew_point": 70.97,
  "humidity": 0.7,
  "cloud_cover": 0.09,
  "moon_phase": 0.27,
  "precip_intensity": 0.0049,
  "precip_probability": 0.18,
  "precip_type": "rain",
  "pressure": 1014.38,
  "summary": "Light rain starting in the afternoon, continuing until evening.",
  "uv_index": 11,
  "visibility": 8.84,
  "wind_bearing": 246,
  "wind_speed": 1.29
}