{
  "reportId": "15371",
  "title": "Possible sighting by teens in Salt Fork State Park",
  "date": "2006-07-28",
  "timestamp": 1154044800,
  "observed": "It was Friday July 28,2006 at Salt Fork State Park in Cambridge Ohio. I was hiking with my dad, mom, 2 little sisters and my aunts niece. we have been into the whole bigfoot thing and decided that we would go hike and hopefully see him. well at about 6:30 pm or so we started hiking and had seen footprints. so we kept hiking hoping to see him, and as we were hiking i would here deep sounding grunts and out of the corner of my eye would see big dark figures moving. well we made it to the top of the hill which went to the road and my mom had told me that i would be to scared to walk back by myself so i did and my sister and cousin followed behind me. we started our way back into the woods and i ran down the hill and as i was waiting for my sister and cousin to make it down the hill, i got this feeling as if someone was watching me and i had got the goosebumps and there were no other sounds or animals around.it was about 7pm and i turned my head and saw a figure around the size of 8-10 feet tall on 2 legs, dark brown/black hair/fur and it had big yellowish eyes staring right at me. now i believe in bigfoot/sasquatch so i would say it was bigfoot. he was standing behind a big tree and was staring right at me with his big hand holding onto the tree. it was almost like he was peeking around the tree.i was so scared the i started walking faster and then into a run and my sister and cousin came running after me..... i stopped to catch my breath because i was crying n could hardly breath and looked over again and there he was again behind a rock. i had then told my sister that i had seen him and i thought he was following us. well my dad had told us if we see him to scream for him and run. well when i tried to scream nothing came out so we all ran about 2 miles back to our cabin. when we had gotten to the pavement my sister and cousin had came out and told me that they had seen him too but didn't tell me right away because they didn't want to scare me anymore. throughout our hike my sister and i heard grunts and would see tall figures but weren't positive of what they were.",
  "classification": "Class B",
  "county": "Guernsey",
  "state": "Ohio",
  "latitude": 40.11632,
  "longitude": -81.52101,
  "location": "-81.52101,40.11632",
  "location_details": "over by cabin 53 u go down a hill and across a log and up the hill on the other side. walk on the trail closest to the lake and all the way up. there are huge rocks and trees...... as u walk u will be able to see a grassy area..... right before u get to the grassy area is where the sighting happened.",
  "temperature_high": 82.54,
  "temperature_mid": 76.895,
  "temperature_low": 71.25,
  "dew_point": 68.57,
  "humidity": 0.76,
  "cloud_cover": 0.63,
  "moon_phase": 0.11,
  "precip_intensity": 0.0037,
  "precip_probability": 0.46,
  "precip_type": "rain",
  "pressure": 1015.31,
  "summary": "Light rain in the morning.",
  "uv_index": 6,
  "visibility": 9.31,
  "wind_bearing": 234,
  "wind_speed": 8.19
}