{
  "id": "10660",
  "title": "Motorist has nighttime sighting of animal east of Lebo",
  "date": "1974-11-09",
  "timestamp": 153187200,
  "observed": "My husband and 2 sons and I lived in Emporia. Through our church my husband had become involved with the scout program. They were having a weekend campout and awards ceremony maybe 50 +/- miles East of Emporia. He called about 10:00p.m. saying he had forgotten the awards and asked me to bring them to him. I left about 10:40 and went East out of Emporia on (I think) highway US 50. Shortly after passing what I believe was called Beto Junction I turned South and curved around to the East as it was supposed to be the shortest route. The road had no shoulders and was filled with pot holes forcing me to go at a very slow rate of speed, no more than 30 miles per hour and slowing further than 30 at times. I had gone only a few miles  when I saw movement to my right side about 50 feet ahead. Thinking it was deer I slowed to almost a crawl partly due to the road condition as well. What I saw was not a deer but something walking quickly in an upright position to the fence. The creature just lifted the right leg (it was facing me) and stepped over the barbed wire, took a couple steps and was in the road. I came to a complete stop being only 20? feet away from this creature. It stood in the middle of the road with my lights on it. It looked at the car and I looked at it. I opened my door and stepped out keeping the door in front of me and we looked at one another for what seems like a full minute. Visually, the creatures form was maybe 7 feet, hair covering the body, not being short like fur but generally 2-3 inches on most of the body.   There was hair covering on the chest area but much more sparse. It seemed to be uniformly porportionate with the arms being the only exception and that was minor. One other thing visually, the eyes appeared to be red and almost glowed red on their own and not as reflection might produce. I remember an odor, musky, wild, best describes it, but nothing I had smelled before. The other thing that struck me was a feeling of calm and not fear. I distinctly have remembered I should have felt threatened but there was no feeling of being in any danger. Just as though we were both curious. The creature began to move and I got into my car as \"he\" continued across the road with just a couple steps, went down into a narrow ditch and then stepped up and over the fence on the North side so easily. It continued for a few steps, stopped and looked at me again and then strode with long strides toward the trees. I sat there a couple minutes and did not see this creature again. ",
  "classification": "Class A",
  "county": "Coffey",
  "state": "Kansas",
  "latitude": 38.3908,
  "longitude": -95.6491,
  "location": "-95.6491,38.3908",
  "location_details": "There is a backroad after passing Lebo (as I remember) that turns South for 1/2 to 1 mile then turns back East. There was also a newer backroad but I mistakenly took the old one as it was late and not well marked. It definetly blacktop though in very poor condition.",
  "temperature_high": 50.29,
  "temperature_mid": 49.66,
  "temperature_low": 49.03,
  "dew_point": 43.89,
  "humidity": 0.89,
  "cloud_cover": 0.83,
  "moon_phase": 0.85,
  "precip_intensity": 0.0155,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1017.75,
  "summary": "Rain starting in the afternoon, continuing until evening.",
  "uv_index": 2,
  "visibility": 5.03,
  "wind_bearing": 159,
  "wind_speed": 9.38
}