{
  "id": "40715",
  "title": "Possible daylight sighting by a passenger traveling along I-80 over the Meander Creek Reservoir",
  "date": "2012-03-24",
  "timestamp": 1332547200,
  "observed": "I have never told this story to anyone besides my immediate family members because I tend to doubt myself. I believe there could be such things as Bigfoot, although I am not sure. I even went on an amateur investigation with my family last year in Salt Fork--we never saw anything but heard what we think were some other explorers whooping like us. I have hesitated to say anything because I don't want people to think I am making it up since I have been very vocal about my fascination with the subject to my students and friends. But seeing that someone else thinks they saw a Bigfoot near Meander Reservoir makes me want to tell my story too. Anyway, I am originally from the Youngstown area, although I live in Cleveland now. My husband, daughter, and I often travel to Youngstown to visit family in that area. On a drive home last year (it was in late March--the last time we went home before my father died) I swear I saw a huge figure standing flush with the treeline overlooking Meander. I was in the passenger seat so I got a decent look. We were driving over the bridge heading toward the turnpike to go back to Cleveland. The figure was huge--very tall and hairy. It was standing up and holding onto a tree looking out over the water. The location was among the trees along the bank closest to the bridge, if that makes sense. I'm not good at distances, but I was close enough that I could see it wasn't a person just from the massiveness of it. I have seen a lot of bears, and although some have been making their way into Ohio lately, it definitely wasn't a bear. I was in disbelief--I have always wanted to see a Bigfoot but I was speechless at the time it was actually occurring. I did say to my family \"I think I just saw a Bigfoot!\" but they didn't believe me. I talk about it once in a while, but since it happened so fast, and mostly since I had no clue it was possible for them to be in this area, I have convinced myself that I must have been mistaken. Now I don't think I was.",
  "classification": "Class B",
  "county": "Mahoning",
  "state": "Ohio",
  "latitude": 41.11447,
  "longitude": -80.14099,
  "location": "-80.14099,41.11447",
  "location_details": "I-80 bridge over Meander Reservoir--heading West toward the turnpike. The sighting was on the West bank of the reservoir, right at the tree line, close to the open area beside the bridge. I think there is also a linked fence near there.",
  "temperature_high": 61.34,
  "temperature_mid": 55.885,
  "temperature_low": 50.43,
  "dew_point": 55.16,
  "humidity": 0.88,
  "cloud_cover": 0.86,
  "moon_phase": 0.07,
  "precip_intensity": 0.0138,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1011.47,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 7.91,
  "wind_bearing": 114,
  "wind_speed": 4.9
}