{
  "reportId": "49813",
  "title": "Woman remembers being shocked to see a running, hairy biped in her backyard in Elyria",
  "date": "1985-08-15",
  "timestamp": 492912000,
  "observed": "Mid August 1985 Elyria Ohio- property butts up to Lorain County Metro parks. My husband XXX and I had recently moved into our newly built home. We both worked during the day and Jim had already left for work. We had two large dogs at the time, both over 100lbs and I was taking the dogs out to their kennel. It had been raining that morning which turned into a light mist and a slightly clearing sky. I had just arrived back into the house when I heard the dogs ferociously barking. I went to see why the dogs were barking and noticed they were jumping in the pen both looking in the same direction. I looked in the direction the dogs were barking to see a large reddish brown hairy bipedal creature running away towards the creek. As it ran I noticed it had a slight bend in the knees with long arms slightly swinging. It also had a small point to the top of it's head.  I watched it for approximately 30 seconds from my kitchen window viewing it from the side and then from the back as it jumped from the drop off into the creek. Needless to say I stood in disbelief trying to sort out in my mind what I had just seen. The only thing that made any sense was that I had just seen a \"Bigfoot\".",
  "classification": "Class A",
  "county": "Lorain",
  "state": "Ohio",
  "latitude": 41.40985,
  "longitude": -82.11172,
  "location": "-82.11172,41.40985",
  "location_details": "Approximately one mile north of Midway Mall in Elyria, Ohio.",
  "temperature_high": 79.95,
  "temperature_mid": 72.925,
  "temperature_low": 65.9,
  "dew_point": 67.38,
  "humidity": 0.84,
  "cloud_cover": 0.88,
  "moon_phase": 0.97,
  "precip_intensity": 0.0396,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1014.23,
  "summary": "Heavy rain starting in the afternoon, continuing until evening.",
  "uv_index": 5,
  "visibility": 5.36,
  "wind_bearing": 236,
  "wind_speed": 3.93
}