{
  "id": "29414",
  "title": "",
  "date": "",
  "observed": "Just got up for work and was walking the dogs outside my home. I looked toward the end of the street and it looked like a truck or something in the middle of the road. I turned away for a few seconds and looked back again. It had covered a distance a person couldn't cover and stopped as soon as it saw me looking. The wind was blowing toward the creature so the dogs did not pick up on it till after we were in the house. So we started this little game where I would look away and it would move quickly forward. When I would look toward it again it would freeze. It didn't growl or make any noise. It finally hit me that this was not a game, I was not seeing things and that it was moving directly for me and the dogs. Frankly I really didn't want to believe what I was seeing. Judging by the posts, mailboxes, trees etc. that it stood by it was probably between 8 to 9 feet tall, had long hair, long arms, very muscular, big chested and was HUGE! It was built like a brick building so to speak. I have never seen an animal that big that could be so agile and move so fast and quietly. As soon as I knew I was not seeing things I carefully manuvered the dogs to the house and shot into the house. After we were in the house the dogs barked as it followed me up the driveway!!!!!! I think it came right up to the front screened door as the motion light kept going on. Frankly I was too afraid to look out the windows and cowarded with the dogs in the kitchen till I thought it was gone. The odd thing was that for the next 3 mornings (same time)there was a very strong musty or poopy odor outside the front door that hung like a wet blanket in the air. As soon as I opened the door and smelled it I shut the door because I felt it was in the yard. As a result of this encounter I would only go outside after daylight and when I heard other cars moving in the neighborhood. I started going to work late (had an hour and 1/2 ride to Bonita Springs) but wouldn't tell my boss why I was coming in late. My step-dad was sick so he thought it had something to do with that. He would NEVER have believed me if I told him that I saw a Skunk Ape and was afraid of it! My neighborhood had a variety of wildlife in it: Bobcats, rabbits, birds, gators etc. ",
  "classification": "Class A",
  "county": "Charlotte",
  "state": "Florida",
  "location_details": "Near Charlotte Harbor",
  "summary": ""
}