{
  "id": "43853",
  "title": "",
  "date": "",
  "observed": "This happened Jan. 13 2014 .....first sighting at 1930 and seen in pond reeds 1950. Because of footprints found in yard I bought a million candle power spot light....at 1930 I went on back porch and about 300 yards down an incline I shined it in a field and got red eye shine. As soon as I hit it with the light it stopped like...uh oh I just got made! The eyes looked up towards light for 3 seconds ...lost eye shine....looked back up and was thinking what to do....then it moved fast towards my light and I got scared and went back in house. told my father n law ...we went out and used two spot lights in the direction. I could not see anything. We both got in my suv and drove to the field where I saw eye shine and pulled off a side dirt road...got out and hit light into reeds by pond and I picked its eye shine up high in reeds. then my father n law got him with his spot light. it was looking and then it went low to ground and was going from left to right in a small creek embankment and would look and then move and then would stop and look long enough where we could see its eyes blink. Could not see any body because of distance...only eye shine. have video of encounter but only a got 1 minute because I-phone stopped recording due to no more memory for recording. I was more worried about not losing sight of its location. Next day we went to the spot and the reeds where 10 foot tall and the eye shine was about 7.5-8 foot range. Ground was frozen in some spots and spongy grass in others....meaning step down and grass comes back up....one track found and have picture. I bought the spot light and was purposely looking for the thing that left its prints in my yard 5 nights before this. I now have night vision with capability to record and I am keeping my video camera charged to get this on video.....believe this is hanging around for food at pond.",
  "classification": "Class B",
  "county": "Lehigh",
  "state": "Pennsylvania",
  "location_details": "pond with koi fish....geese bed at night in pond....deer in area use for water hole",
  "summary": ""
}