{
  "reportId": "13070",
  "title": "Youth has pre-dawn encounter on the way to deer stand near Mitchellville",
  "date": "2005-11-18",
  "timestamp": 1132272000,
  "observed": "Note: the witness names have been changed for privacy. My name is Jim, and I've reported a vocalization experience which happened approximately 11 years ago in the same area. Regarding this following report, I'm submitting it on behalf of my nephew, who is the primary witness and who experienced the sighting. I've discussed this experience with him, and questioned him at length about his sighting.  I can confidently endorse this young man, knowing him to be intelligent and level headed, with no previous history of exaggeration or embellishment. He is 14 years old, a high school freshman, and has lived in this area since his birth.  However young, he has a substantial amount of hunting and wilderness experience, and he's familiar with the indeginous wildlife of the area.  He contacted me by phone on the evening of the 18th to discuss his deer kill, along with his unusual sighting of the morning.  I've followed up with him in person today, November 19, 2005, to reconfirm his account prior to posting the report to your organization.  His account follows; \"My name is [Jason].  In the early morning hours of the 18th of November, prior to dawn, I prepped my hunting gear and left my house. My deerstand is approximately 600 yards behind my parent's home.  Directly behind our house is a large open field, with an estimated 250 yards east to west, and 500 yards north to south.  The perimeter around this area is medium growth forest [e.g. Oak, Silver Maple, Elm, Sassafras]. I was walking back to my stand on the far edge of this field, along the edge of the forested tree line.  I had parked my ATV at the treeline and began to walk the rest of the way back, and was carrying a flashlight and 20 gauge Remmington Express shotgun. As I approached a turn in the treeline, I immediately saw something walking toward me, at a distance of about 45-50 feet.  I could only make out a dark silhouettte.  At first, I thought it was my uncle who was also hunting in the area behind my house, but quickly realized that it was NOT my uncle, for several reasons; 1) it had no orange hunting vest, 2) it was extremely large, and 3) as soon as I saw the creature, it evidently saw me and it turned quickly, then ran into the tree line (towards my treestand).  Again, it was extremely large. Unfortunately, it was too dark to visualize any specific features, but the silhouette seemed to be approximately 7-8 feet tall. It was definately walking on two legs, and it was entirely too fast to be my uncle. (My uncle is a coal-miner who has an ankle injury and cannot jog or run at this time.)  I didn't have any time to shine my flashlight on it, or pull up my shotgun to take aim. The entire sighting lasted approximately 10-15 seconds, possibly shorter.  I didn't notice any smell before or after the sighting, and didn't hear any sounds. The creature moved with unusual quiteness and stealth.  I also heard no foot-falls as it ran, but I realize that I may have been too shocked to notice sounds.  I then moved to my deerstand where I got up into the stand as fast as possible, then called my mother to let her know that I had made it to the stand and told her about the sighting.",
  "classification": "Class B",
  "county": "Saline",
  "state": "Illinois",
  "latitude": 37.63,
  "longitude": -88.55,
  "location": "-88.55,37.63",
  "location_details": "8 miles south/southeast of Harrisburg, Illinois, 2 miles south of a small burg called Mitchellville, at the edge of the Shawnee National Forest.",
  "temperature_high": 51.63,
  "temperature_mid": 43.06,
  "temperature_low": 34.49,
  "dew_point": 23.94,
  "humidity": 0.61,
  "cloud_cover": 0.08,
  "moon_phase": 0.59,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1028.4,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 2,
  "visibility": 9.99,
  "wind_bearing": 196,
  "wind_speed": 5.69
}