{
  "reportId": "407",
  "title": "Possible vocalizations heard while motorists were taking a break at turnout near La Manga Pass",
  "date": "2000-04-19",
  "timestamp": 956102400,
  "observed": "We were on Highway 17 in southern Colorado, heading south through the Rio Grande National Forest toward Chama, NM. As we neared the border, Highway 17 began snaking up a five mile grade beginning at the Conejos River and cresting at La Manga Pass (10,230ft). Midway up the grade, we pulled off at a turnout to take a break and survey the surrounding forests, enjoying the view the elevation afforded us. The morning was quite brisk and one of the individuals in our party let out a \"whoop\" as we exited our vehicles. Soon after the echoes of the \"whoop\" had faded into the distance, we heard what sounded like a very loud roar (made by some type of nearby \"animal\"), unlike anything I'd ever heard before, that lasted for several seconds. Following a short pause there was another roar, then a pause, and then a final roar. The \"roar\" can best be described as being almost exactly that (sound, duration, pausing) which is currently found on this website, listed as a potential Bigfoot \"howl\" recorded in Ohio. In fact, listening to the \"howl\" and noting the distinct similarities to the \"roar\", is what prompted me to submit this report. In the silence following the final roar, I felt the hair on the back of my neck stand on end and uttered the only thing that came to mind at that point. Namely, \"What the hell was that?\" And, needless to say, I apparently wasn't alone in my thoughts as, with minimal discussion, our group quickly departed. In retrospect, even though we were seemingly alone on the grade, someone could have been playing tricks on us. Whatever, whether it was someone or something, the \"whoop\" issued by a person in our party is seemingly what precipitated the sounds we heard.",
  "classification": "Class B",
  "county": "Conejos",
  "state": "Colorado",
  "latitude": 37.1137,
  "longitude": -106.3681,
  "location": "-106.3681,37.1137",
  "location_details": "Highway 17...Rio Grande National Forest...midway up the grade rising from a small bridge over the Conejos River to La Manga Pass.",
  "temperature_high": 52.77,
  "temperature_mid": 39.07,
  "temperature_low": 25.37,
  "dew_point": 16.48,
  "humidity": 0.36,
  "cloud_cover": 0.25,
  "moon_phase": 0.54,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1012.1,
  "summary": "Partly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 10,
  "visibility": 10,
  "wind_bearing": 276,
  "wind_speed": 9.7
}