{
  "reportId": "7386",
  "title": "Observer hears scream changing to low \"demonic\" chuckle",
  "date": "1974-12-15",
  "timestamp": 156297600,
  "observed": "I was around 12 years old and watching my 4 younger brothers one evening while my parents went out for a few drinks when I heard something that scared me like nothing else I have ever experienced before or since.  It scared me so badly in fact that I was too embarrassed to ever mention it to my parents, certain that they would merely ridicule me for lack of any evidence to back up such a wild and unprovable claim. I had sent my brothers all to bed an hour or so before and had been lying on the living room couch watching television around 11pm when I heard a noise outside the window the couch was situated under.  It was quite loud and extremely close, just outside the window against the side of the house... close enough that I could hear an intake of breath from the source of the sound. I was horribly frightened by the sound, because I had never heard anything like it in my entire life.  It was a howling scream that sounded like something dying and it gradually shifted to a gurgling chuckle or laugh-like sound that lasted maybe around 10 seconds. It did not repeat and no other sound were heard. I have heard many screams from human and animal sources including rabbits, deer, dogs, cats, racoons and possums but this sounded nothing like any of them even remotely, and I certainly never heard anything besides another human produce a true laugh. What I heard did not sound human at all, it actually sounded \"evil\" to me, for lack of a better description, and it scared me so badly that I waited around 30 minutes before mustering enough courage to don boots, jacket and grab a flashlight to go outside and investigate. It was mid-winter and had been snowing since early evening so there was several inches of fresh snow on the ground but after searching all around our house and yard I could not find a single track to indicate what had caused the sound. There is a gap between houses where the sound came from that is maybe 12-15 feet wide with a shrub-line roughly 6 feet from the side of our house, and all the snow was totally undisturbed. This really upset me, because I had been hoping that maybe a boy that lived a few doors down at that time had somehow come over and created the noise as a prank to frighten me, even though I found it nearly impossible to convince myself that the sound could be made by a human, nor reproduced so realistically by any portable recording devices available to teens in the early 1970's. Talking myself into thinking it a prank had been how I managed to dredge up enough courage to go outside and investigate in the first place... so now I was truly frightened and immediately went back in the house and stayed there until my parents returned home. I never associated this event with bigfoot until a few days ago as I was reading a few bigfoot sighting reports on the net, merely as a lark, and was amazed at how similar some of the sounds reported fit the description of what I heard that night. In fact, just reading some of the descriptions has caused me to relive a little of the terror I experienced so many years ago... and I'm not a person that has ever had any phobias or natural fears. The scream was frightening, but nearly as terrifying as the inhuman laugh it became before tapering off. I saw the term \"diabolical\" used to describe a sound heard by someone filing a report and I have to totally agree that this is maybe the most apt description I could ever imagine of the sound I heard that night. I do not mind whether what I say here is ever believed or dismissed as false, I merely wanted to get the information across in the hopes that somebody else has reported something similar at that same place and time in history and what I report might possibly add a little more information to clarify other more credible and evidenced events that others might report.",
  "classification": "Class B",
  "county": "Berrien",
  "state": "Michigan",
  "latitude": 42.0288,
  "longitude": -86.5153,
  "location": "-86.5153,42.0288",
  "location_details": "The area where this occured was bordered on the north by I-94/Exit 23, on the south by Lincoln Towship Public Cemetery (right behind our house), on the east by north-south running railroad tracks with a factory and woods beyond... and on the west by St. Joseph Ave. which leads from the highway into downtown Stevensville about a mile south from there. About half a mile west from the house you find very hilly and wooded dunes area that follows along the Lake Michigan shoreline. Lake Michigan is maybe 1 mile due west from the house.",
  "temperature_high": 39.75,
  "temperature_mid": 37.675,
  "temperature_low": 35.6,
  "dew_point": 34.99,
  "humidity": 0.87,
  "cloud_cover": 0.99,
  "moon_phase": 0.07,
  "precip_intensity": 0.017,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1006.01,
  "summary": "Breezy in the morning and rain until afternoon.",
  "uv_index": 1,
  "visibility": 5.4,
  "wind_bearing": 153,
  "wind_speed": 13.28
}