{
  "id": "25082",
  "title": "Retired police officer recalls he and a friend being intimidated from continuing their hike, near Bonita",
  "date": "1968-08-15",
  "timestamp": -43545600,
  "observed": "In late August of 1967, C.H. and I, E. M. a Chicago Police Officer were walking on a trail on the NE part of the Menominee Wisconsin Indian Reservation. It was late afternoon as we walked south on the trail, in front of us about 50 feet away in the woods, we heard screaming so loud we did not think ten men altogether could have duplicated the sound which did not stop for at least three minutes with no break for breathing. The scream was very high pitched unlike any noise we had ever heard. Whatever it was, it then started shaking and breaking tall birch trees. These trees were far larger than any human or group of humans would have ever been capable of breaking. We were astounded and started to run north on the trail out of the area. This thing followed us running paralel to us along a ridge. It was still screaming and shaking the trees for about 200 feet. For many years we never told anyone about this incident but with numerous reports similar to ours about bigfoot in the Wisconsin area we have started to tell people about this strange espisode. We were on the trail going South from St. Joseph and Marsh Lake Menominee Reservation. The Reservation is about 65 miles NW of our house in Door County. At the time the Indians on the reservation said they would not going into the area by the lake because they said something large and strange lived in the area.",
  "classification": "Class B",
  "county": "Menominee",
  "state": "Wisconsin",
  "latitude": 45.02176,
  "longitude": -88.5233,
  "location": "-88.5233,45.02176",
  "location_details": "The Northeast area of Menominee County.",
  "temperature_high": 72,
  "temperature_mid": 71,
  "temperature_low": 70,
  "dew_point": 56.09,
  "humidity": 0.82,
  "cloud_cover": 0.71,
  "moon_phase": 0.74,
  "precip_intensity": 0.01,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1015.38,
  "summary": "Rain starting in the afternoon, continuing until evening.",
  "uv_index": 4,
  "visibility": 7.3,
  "wind_bearing": 116,
  "wind_speed": 6.58
}