{
  "reportId": "14525",
  "title": "Evening encounter with fisherman laying catfish lines on the Alapaha River",
  "date": "1976-10-08",
  "timestamp": 213580800,
  "observed": "I will start this with what my uncle had always told me and my father about what he called the monkey people (thought he was B.S.). On the second weekend in Oct. 1976 First day of bird hunting season I had stopped in the morning and set 4 catfish lines on the Alapaha river where it joined my uncles land (2 miles from Alapaha Ga. on US Hwy 82 east) This area is known as the [little lot] by local old timers. After I had finished hunting at just about dark - 7PM or so.I stopped back to see if I had any catfish this is on a winding private dirt at least a mile and a half from my uncles home. I had left my gun in the truck and only had my pocket knife to cut the lines-as I worked with the lines I heard a sound I had never heard before very deep very loud breathing then I smelled a strange smell the smell made me feel uneasy I was unable to see anything but as I backed towards the truck it moved out into a clearing and I was able to see it from about 10 feet. At around 6 foot tall it looked wet as if it had came from the river it also had green river scum on its left leg and side. It stopped dead still when it seen me and I wasted no time getting the hell out of there.",
  "classification": "Class A",
  "county": "Berrien",
  "state": "Georgia",
  "latitude": 31.24842,
  "longitude": -83.13654,
  "location": "-83.13654,31.24842",
  "location_details": "2 miles east of Alapaha Ga on 82 hwy right on Ocilla road 500 ft right on dirt road (farm road) then one & half miles.",
  "temperature_high": 76.32,
  "temperature_mid": 67.525,
  "temperature_low": 58.73,
  "dew_point": 70.77,
  "humidity": 0.94,
  "cloud_cover": 0.95,
  "moon_phase": 0.51,
  "precip_intensity": 0.1033,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1011.7,
  "summary": "Heavy rain until afternoon, starting again in the evening.",
  "uv_index": 4,
  "visibility": 5.26,
  "wind_bearing": 164,
  "wind_speed": 4.22
}