{
  "reportId": "14714",
  "title": "Early morning sighting by newspaper deliverer near Mountain View",
  "date": "2005-11-15",
  "timestamp": 1132012800,
  "observed": "I was delivering newspapers on a lightly snowing early morning in Novemeber of 2005. Id guess it was 4:30 or so, just before dawn. The roads were barely dampened. It was a very pretty almost wintry scene. The high Uintas range was behind me. I turned from highway 411 to highway 410, which takes one back into the town of Mountain View. There are no lightposts until you cross the bridge and drive maybe 1/4 or 1/8th mile. As I turned from hwy 411, I looked towards the first light, about a fourth mile away. It could have been 1/2 mile. There was something pretty big walking. It was walking toward me, and it looked like it was all one bulky thing- no coat or hat lines that I could see. It seemed to have its head pointed slightly downward. Not a lot, just a tad. It also seemed like its arms were slightly long. It didnt seem to be bothered by the cold or the light snow. It was just walking like it had somewhere it was going. It walked diagonally across the road, towards a clump of brushy trees. It seemed like it strode big, but not in a big hurry, but not a casual stroll, but it  crossed faster than a man. It walked on two legs but not exactly like a man...Ive seen moose, deer, elk, steers, skunks, foxes, one little bear, porcupines, you name it, but it wasnt any of these. I got to where I had seen it go into the brush area, and there was nothing. There wasn't a roadway where it had crossed, being in between two ranch houses, located farther in than where this thing was. Being an isolated area at that time in the morning, I slowed to see if I could see anything like if it had been a person for some crazy reason out for a walk there at that time of morning, and it was a bit cold. I figured if it was a person, Id see it walking on one of the ranch house roads, but no, nothing was there. I felt pretty uneasy, so I continued to drive home. The area there is pretty, with a river running East and West just before where I saw that larger than a man thing. It may have been between 7 to 9 feet tall, but I'm estimating with the size of the lightpost, the trees it disappeared in, things like that. I couldn't see if it was black or brown, but it didn't seem dark enough to be black. Years ago in the early eighties we had lived in Lyman, six miles past Mountain View. We had a dog, as a lot of our neighbors did. One night while my husband was on graveyard shift, the dogs raised a ruckus. It was a pretty moonlit night I think in summer. Or almost fall. But I looked out my bedroom window and saw walking behind our house in the alley something really big, swinging its arms and seemed silently just striding past. I got so scared I pulled my covers over my head and didnt move for a long long time. My dog and others were howling. After a while things quieted down.   Way back I had a friend who had been driving up in the Uintas on the Utah side who claimed a bigfoot thing walked in front of their truck, stopped and looked at them, them continued on. This was I think in the late sixties to 70.  The Uintas are beautiful, and are probably  8 to twenty miles within distance of where I saw that thing in Nov of 2005. I didnt hear anything when I stopped to look. If it was hiding in the bushes, it wasnt moving, because I didnt hear any limb cracking. But I did have a strong sense that something was staring at me. I normally see a deer or two in that area, but I dont think I saw any that morning, I dont recall for sure. For awhile I would go through that area (still having to deliver papers) feeling like something watched me at times.  I'm pretty spooked by this whole thing.",
  "classification": "Class A",
  "county": "Uinta",
  "state": "Wyoming",
  "latitude": 41.2,
  "longitude": -110.5,
  "location": "-110.5,41.2",
  "location_details": "Well, if you are coming west from a small town called Milburne, you would turn left(towards north) from highway 411 onto highway 410. It takes you into Mountain view, a slightly larger town. If you were to be coming from the north from  Mountain View, you would continue south on highway 410 and eventually you could go to the Uintas. Im not good at directions.",
  "temperature_high": 35.93,
  "temperature_mid": 28.325,
  "temperature_low": 20.72,
  "dew_point": 13.07,
  "humidity": 0.65,
  "cloud_cover": 0.13,
  "moon_phase": 0.49,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1034.42,
  "summary": "Partly cloudy overnight.",
  "uv_index": 3,
  "visibility": 9.74,
  "wind_bearing": 269,
  "wind_speed": 2.8
}