{
  "reportId": "7455",
  "title": "Hunting couple has visual and auditory encounter near coast",
  "date": "1999-10-15",
  "timestamp": 939945600,
  "observed": "This happened during hunting season in 1999 in the hills above Greyland, WA. When you drive down the highway there are signs directing people to drive up in the nearby hills in case of tidal waves. It was up these dirt roads that my husband and I were hunting. The weather was cold in the morning, there was frost on the ground, by noon it had warmed up and was mild out. This is written from the view of someone who at the time of this incident knew very little of big foot, and really didn't give them any thought. We encountered a bear hunter early in the morning that told us he had spotted bear sign the day before and was back to continue the hunt. He also commented to us that this was the worst smelling bear he had ever tracked. By late morning he had his bear and we again spoke with him. I put my head in the canopy of his truck to look at the bear and did not notice any foul smell. My husband and I continued hunting for deer. We decided to split up. He dropped me off at an old overgrown road and was going to drive over to the one that ran parallell to it. The plan was for me to walk out slowly to the clear cut then go to the right and meet up with him. As I reached the edge of the clearcut, I stopped to scan for deer. I started from the right slowly looking to the left, nothing. As I stepped out of the cover of the brush to my left, about 100 yards away, underneath the branches of a fir tree and back against the trunk, I saw what looked exactly like the face of a big foot. Now I had never given much thought to these things but this looked so much like one that I froze in my tracks. I was so scared that it took me fifteen minutes to drop my pack, which I was carrying in my left hand, and pick up my binoculars that were hanging from my neck. I had to talk my self into moving. I told my self that it was probably a stump under the tree. I got my binoculars to my eyes and looked at it and it still looked exactly like the pictures you see that people draw. It looked like it was crouching down trying to hide from view underneath the branches. The tree was not big maybe 20 feet tall. It looked like it was staring right at me. I thought from the first that this thing was a threat to me. I knew nothing of them and was very afraid. Well, I finally decided I could get one shot off before it got to me, my rifle is a bolt action, and I'm not very fast on the draw; it didn't help that I was shaking like a leaf. If I made it to the end of the road, then I would be in sight of my husband, who is a very good shot. Keep in mind that this line of reasoning was the fear of the unknown. I came out to where I could see my husband and waved to him while walking fast to meet up with him. I told him that there was something under a tree that looked exactly like the sasquatch pictures. He asked if I wanted to go back and check it out, I said no. I was happy to be back in his company. It was late afternoon by this time and we decided to hunt the right end of the clear cut. He left me sitting against a dirt mound looking across the end of the clear cut. My husband went farther to the right on the next hillside so he could watch the same area. I didn't feel afraid because the truck was just down the road less than 25 yards and I would just go get in if anything happened. We were both watching the clear cut and it was almost too dark to shoot, when across the cut where the edge of the old growth timber was still standing came the the loudest howling, screaming carrying on that I have ever heard. My husband described it like the howling of a coyote having its legs wrenched off but far to loud for a coyote to make. I can only describe it as a wall of screaming and howling that came up from the valley floor and blanketed everything, there was no place that howling, screaming wasn't. I sat forward and thought what the heck is that. The sound was coming from in front of where my husband was hunting, we estimate this to be 400 yards. I stayed put but was straining to see what was screaming like that in the corner of the woods, which would be maybe 600 yards from my position. It seemed to be staying just inside the tree line so we couldn't see it. After about twelve minutes of this my husband stood up to leave. When he did the screaming abruptly ended, there was dead silence.....not a sound anywhere. He came back to where I was and we decided it was time to leave. We did not do any investigating of sasquatch until two years later when my husband and his relatives were hunting up at Rim Rock lake and had another encounter. When we started checking sasquatch noises on the internet that's when we heard again the howls and screams that we had heard in the foothills by the ocean. We also think that the bear hunter smelled a sasquatch not his bear. And that the thing under the tree probably was a sasquatch watching me. We now go out with cameras and tape recorders hoping for another encounter.",
  "classification": "Class A",
  "county": "Grays Harbor",
  "state": "Washington",
  "latitude": 46.81045,
  "longitude": -124.072,
  "location": "-124.072,46.81045",
  "location_details": "From Hwy 105 turn onto Smith Anderson Road. There will be a tidal wave evacuation sign on a dirt road on your right. The road is now gated due to people dumping garbage in the hills.",
  "temperature_high": 58.58,
  "temperature_mid": 46.585,
  "temperature_low": 34.59,
  "dew_point": 37.86,
  "humidity": 0.78,
  "cloud_cover": 0.33,
  "moon_phase": 0.2,
  "precip_intensity": 0.0002,
  "precip_probability": 0.45,
  "precip_type": "rain",
  "pressure": 1030.33,
  "summary": "Partly cloudy until evening.",
  "uv_index": 2,
  "visibility": 8.85,
  "wind_bearing": 70,
  "wind_speed": 1.68
}