{
  "reportId": "3918",
  "title": "Hunter has unexplained, late night encounter while in small boat on Saddle Creek",
  "date": "1985-09-01",
  "timestamp": 494380800,
  "observed": "Hello. i was reading the article the lady wrote from Polk County Fla.I was raised in Lakeland and grew up Hunting in the area around the County dump where the lady also lived or lives. I can tell you one thing you can beleive her.  There has always been something in the Swamps around that area. From the Tenneroc Mines thrue Saddle Creek all the way to The old mines around the dump. and also north of Polk City in the Green Swamp. I remember hog hunting or (poching)on the County landfill land and having the Hell scared out of me by something that was big/ loud /and smelly. And i even lost a couple of Dogs to what ever it is? I got a quick glance of something one night. I was traveling up the creek in a 10 FT.boat with two Dogs.About a quarter mile up the creek and i started hearing something that seemed to be following me on the bank to my right i thout maybe it was my imagination and then i started hearing a loud like blowing nouise then i started shining my light up the bank and the noise stoped then the Dogs started acting funny so i stopped thinking it may be hogs so i tried puting the Dogs on the bank and they started whining and would not go so i knew something wasnt right so I paddled back out and started feeling reel strange myself so i started to continue when my Bay Dog started barking madly then i turned my light on and shined up and down the bank then i seen a large Ape like thing go over the hill running away from me. It was to thick to get a good look so i was scared stiff then i got the nerve to turn and leave so i did. When i passed the area where i seen it i looked and seen a group of tracks i didnt stop to examine so i paddled my butt off till i got back to my truck and loaded up and left. ther is more to tell and me and some freinds did make a return trip. call for more info.",
  "classification": "Class B",
  "county": "Polk",
  "state": "Florida",
  "latitude": 27.9664,
  "longitude": -81.95285,
  "location": "-81.95285,27.9664",
  "location_details": "North of 540 up the Saddlecreek about 1/2 mile up the creek on the right side in the swamp close to the Dump.",
  "temperature_high": 79.54,
  "temperature_mid": 70.31,
  "temperature_low": 61.08,
  "dew_point": 67.21,
  "humidity": 0.84,
  "cloud_cover": 0.98,
  "moon_phase": 0.57,
  "precip_intensity": 0.0783,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1010.99,
  "summary": "Breezy until afternoon and heavy rain in the morning and afternoon.",
  "uv_index": 6,
  "visibility": 7,
  "wind_bearing": 161,
  "wind_speed": 14.03
}