{
  "reportId": "2110",
  "title": "",
  "date": "",
  "observed": "I had gone backpacking/training trip with four pack animals in preparation for an extended backpacking trip into the Wemineuch Wilderness.  Two of my goats are experienced packers and two were new.  After several shorter treks I had gone to Spring Creek Pass where I planned to walk part of the Colorado Trail -- possibly down to Durango -- then resupply and go back to the Wemineuch.  After reaching one of the local creeks one of my goats started getting sick so I decided to head back toward the truck and bide my time while I assessed his situation.  There were tons of people on the trail last summmer and I wanted to be alone so I went off near Jarosa Mesa and found a meadow surrounded by thick forest where I didn't feel I'd encounter anyone.  We stayed two days. During that time the dogs and particularly the goats were periodically nervous, then they would calm. Goats point to what they see or hear but whenever I would look I would not see anything. I checked the area thinking there might be bear or mountain lion nearby but didn't find signs that would indicate a den and although there was bear scat in the area it was not fresh.  Still, this was a time of drought that had the bears hungry all over the state and they were having bear problems down in Lake City right then so, especially with a sick goat, I stayed alert to the possibility.  Especially since I was also near one of the only water sources. In the meantime I was doctoring my goat and working with the others. At one point when I was playing tug-of-war and growling with my dogs (an older border collie and a border collie pup) the goats alarmed and bunched around us pointing at the woods but when I checked I couldn't see anything and the dogs didn't react.  I periodically got the feeling we were being watched, then it would pass. The puppy occasionally got interested in something in the woods but would come back. When I work with the goats, I sing a lot.  They have also developed a fondness for the pennywhistle so I had spent a lot of time in the afternoon just playing music with all of us sprawled around the meadow together. The meadow was rich in smells but aside from the plant smells from walking around there was more a musky elk smell than anything.  Lots of signs of deer and elk in the area.  At dusk the animals got extremely nervous. I had just gone inside my tent to get something, both dogs were inside with me and the goats just outside.  I suddenly heard this alarm vocalization unlike anything I've ever heard from my animals, but easily could have been.  Under the circumstances I could easily have made vocalizations I had never made before. The goats were beside the tent and whatever it was was right behind the tent. I knew it was something big because my dog will tear after a lesser beast barking but the only times I've encountered a bear or a mountain lion with him he stays right with me and gives a quiet growl that says, \"This is serious.\"   I grabbed my pepper spray fearing it was a bear and started out of the tent, turning as I crouched out the door and yelling (don't ask me why) at the dogs to stay inside. The goats were beside the tent pointed at the back.  There it was. A bigfoot. I couldn't see its whole body because it was blocked by the tent but if it was a female the breasts weren't prominent.  It had medium chestnut fur, was standing erect on two legs, probably 8 feet tall (I have a brother who is 6'7\" and a nephew who is 6'10\" and growing so I have some perspective), and probably only 12 feet away staring straight at me.  The face had fur -- less around the eyes but not as bare as your sketch -- and the eyes were all brown -- no whites. Like a deer's eyes.  Its arms were hanging at its sides. Everything was totally silent. My dogs were beside me but we were all frozen in place.  I know that if anything threatened me one of my dogs would die defending me.  On an instinctive level I was as terrified as I've ever been but even at the time I knew I didn't feel threatened.  I wouldn't have dreamed of using the pepper unless it had attacked.  In retrospect I thought it was interesting that I didn't have (at least under those circumstances) fight/flight instincts. I simply froze in place.  Perhaps if it had done anything menacing I would have reacted differently.  But I felt simultaneously terrified (instinctively) and amazed.  Before that moment I had never even known if I believed in bigfoot or not.  Had I thought about it I would have assumed it would be something to ponder in the Pacific Northwest, but certainly not in Colorado.  Had never once, for all the thought I've put into \"what would happen if I encountered...\" thought of the possibility of encountering one and was totally unprepared for and in awe of it. It seemed unhurried.  We stared at each other for what felt like a long time, then it made a low rumbling sound and turned its head and I caught just a glimpse of another back behind it.  It looked back at me, then they turned and loped off out of sight.  I could feel the vibrations in the ground. I got the feeling that nothing in the encounter was threatening to me or the goats.  That they were curious. There was a slight breeze and I was upwind (somehow I doubt that was accidental) so I didn't notice a particularly strong smell.  I think I had felt the vibration as it/they approached but thought it was the goats.  During the entire encounter from the vocalization on, except for the breeze, it was totally silent and the sound (birds etc) resumed a few minutes later. We all slept very peacefully that night. I found no tracks but the ground was so dry and hard I couldn't make a very good track when I tried. The next morning I packed up and left more because I felt like I was intruding in someone else's space than feeling danger.  I felt like I was being watched and gauged from the animals that they did too. My older dog stayed right beside me, alert and ready to act.  The puppy seemed unphased by it all.   The puppy had come back at one point earlier in the day having rolled in what I thought was human manure...now I'm not so sure.",
  "classification": "Class A",
  "county": "Hinsdale",
  "state": "Colorado",
  "location_details": "Near Jarosa Mesa down toward Rambouillet Park.",
  "summary": ""
}