{
  "id": "26381",
  "title": "Man recalls adversarial encounter with an unknown creature near French Gulch",
  "date": "1973-04-15",
  "timestamp": 103680000,
  "observed": "I never thought I would write this sort of thing on this forum, but well...here goes. Way before I joined the Church, my young wife and I worked for a private school at the end of the road near French Gulch CA. This is on the edge of the Trinity Mountains (Big Foot Country), and about 25 miles into the woods, behind Clair Engle Lake. It was pretty isolated. Once in awhile log trucks would go by, but mostly no one used the road to come there or go past. I was assigned midnight bed checks, and had to walk through the entire compound. This was a former ranch: the main house and girls cabins on one side, along with the Teacher's and staff cabins and trailer, and across the creek, and up the pasture alongside the woods, the boy's line of cabins. To cross the creek, I could either wade or ford, where the cars crossed, or walk past the cook house, that sat next to the creek and cross over on a suspension bridge, that was about jeep wide. We used it only for walking. I sometimes waded because bears would come raid the trash cans, and that was a bother to get past them sometimes. It was a bit crisp that night, so I decided to walk the bridge, cross the pasture, and walkup the half mile or so along the cabins, to check each one. My boots made a hollow thumping noise as I crossed, and the bridge began to sway like it always did, with a side to side motion, as well as a rolling wave to the deck. The water was about 5 feet below me, and only filled about 10 feet across the bottom. The edges of the creek, about 20 feet per side, were dry and exposed rocks and boulders. The creek was about 2 feet deep and swirled softly, chuckling between and over the rocks. There was no moon, but there was sufficient starlight, to see, once I had walked from my trailer, to the bridge, about a quarter mile. A single yard light was on up at the owner's house, but none down at my end of the headquarters compound. I walked up to each cabin, and checked them all. Everyone was asleep, no deer were in the pasture, and the one horse we had, was up at the top end of the pasture, snorting at me, and pawing the ground. That was not unusual, so I just headed back to the bottom of the hill toward the bridge. The stars were bright, and the sky was black. As I approached the bridge, I thought I could hear something near the trash cans on the creek side of the cook house. Something was snuffling around and then banging trash can lids onto the ground. \"Crap,\" I thought, \"Bears. I could hear whatever it was knocking over the cans, and rooting around in them. I was a bit frustrated, since the day guy was supposed to have taken them to town, that afternoon, to dump them to avoid just this sort of thing. I picked up a couple of large smooth river rocks, and stepped onto the bridge. This bridge is about 60 feet long, a suspension bridge, about 15 feet wide. The cables are too high, except in the middle to touch, to use as a hand rail, then too low in the middle to use for that either. The planks are 3\" thick, 10 inches wide, very heavy, and heavily oiled. They made a deep thump when trod upon. I stepped quietly onto the bridge, and drew back my arm. The animal had stopped, and with a whiff, dropped the can it was exploring with a crash. I threw the river rock as hard as I could, and it thumped down, just under the eaves of the building, and rolled into a can, Wham! I peered into the darkness, and shadow under the eaves of the cook shack, but could not see anything but a darker shadow, where I though this animal was. The animal gave out another \"Woof,\" like a bear would when he is trying to sniff something out. As it stood, I realized, that although I couldn't see much, I could tell that a head and shoulders had risen about the edge of the eaves. \"Wow!\" My head was trying to compute, \"animal on top of a trash can, or a big animal on the ground, that eave is at least 8 feet from the ground...\" It wasn't making sense, but the moment didn't last long. With a rumble deep in its chest it began moving out into the open, toward the end of the bridge. I by now was almost to the middle, so I started backing up, and got to about 1/4th of the way from the end. I started hollering at it, and chucked the other two rocks I had with me, one landing at his feet, and the other hitting somewhere near his hip.  He came up out of a crouch, and stood erect. He was just shorter than the bridge uprights, and they were ten feet tall! \"Oh, crap\", I thought. As he walked forward, the gait was more like a big man, than any bear I had ever seen. Only he was far bigger than any man I had ever seen either. Its legs where long, and this was NO BEAR! Now here you are going to have to trust me. I have hunted all my life, and I am no city boy. I know a bear when I see one, and I had no reason to expect anything else here. I began shouting at it, as I backed up. He stepped onto the bridge, and in two steps was over the free-swinging portion. The bridge sagged, and I jumped up and down, stomping my feet, and shouting. I backed to the ground, and bent to pick up some more rocks. I stepped forward, pounded on the bridge, and threw another rock; saying \"Hey, get!\" As the rock sailed I thought that I was using some puny weapons. I also realized my voice was pretty weak. I was scared **itless! I threw two more rocks in quick succession, and they bounced on the deck, and flew off into the dark, one splashing into the creek. He dodged them handily. His eyes glowed in the dark, and he took a step closer. I started jumping up and down, and getting the bridge to moving sideways and up and down. I had a hold of one of the upright cables, and I had the bridge going pretty good. The animal held onto the cables, above his head, and then with one hand, he vaulted the cables, and disappeared below the bridge. I thought he was headed my way under the bridge, and I jumped back off and grabbed a two handed rock, to smash his face or whatever I could. I realized I could hear him splashing in the creek, and peered into the darkness, and saw the form running upstream into the back country. I stood a second, heart pounding, and realized there was a foul stench in the air, as a slight breeze carried his scent from that side of the bridge. It smelled of dead animals, and rotten food, and funky bad feet and armpits. I made my way across the bridge, across the compound, hefting the two handed rock, and eventually got to my trailer. No lights had come on in any of the cabins, or at the owner's house, and no one had come to help me. I slid open the glass door, stepped inside, and slid it back, and leaned against the wall. My wife was in back reading, with a small light on. She looked at me and asked me what was wrong. I don't know what that was, I won't argue for Bigfoot, nor any other animal. I know it was not a bear. I know what that looks like.",
  "classification": "Class B",
  "county": "Shasta",
  "state": "California",
  "latitude": 40.8333,
  "longitude": -122.6417,
  "location": "-122.6417,40.8333",
  "location_details": "From Hwy. 299, & then up the French Gultch Rd.",
  "temperature_high": 63.45,
  "temperature_mid": 56.13,
  "temperature_low": 48.81,
  "dew_point": 41.4,
  "humidity": 0.66,
  "cloud_cover": 0.86,
  "moon_phase": 0.44,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.88,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 9.62,
  "wind_bearing": 189,
  "wind_speed": 3.03
}