{
  "id": "5220",
  "title": "",
  "date": "",
  "observed": "First off, I am a very objective and reasonable person, this is true.  In 1979, my father and I went camping in a remote spot on the summit of Mount Shasta, well away from anyone else.  At approximately 3 AM, on a moonless night, I was awakened by a noise within our camp. At the time, I thought that it was my father up to relieve himself.  Which I thought was odd, since he rarely woke up, because he usually slept like a log. I was sleeping in the bed of our truck, since my tent was mildewed. I could hear something moving around the truck thru the windows of the camper shell. Something kicked over the ice chest, and I laughed out loud, thinking my father had tripped over it. Yet, I heard no cussing, as he was prone to do.  Something hit the truck with such force, that the truck rocked violently. I thought I it was a joke being played on me by my father. Then, I heard something that sounded like a rabbit \"screaming\", yet, much louder, almost raspy, yet very piercing.  Needless to say, I was afraid for my life. I grabbed my rifle and waited. Then I heard nothing but the sound of my father unzipping his sleeping bag, and then his tent. He asked if I was “OK”, and what happened.  He had awakened to the sound.  This may sound like a prank, fuelled by my father, but he would not dent his truck for a prank, that was his baby, and the pay for repairs was certainly not worth the laughs. The camp was a mess, and we noticed that the eggs were gone. Nothing else.  There were no visible tracks.  We were far from the road, so bare earth was not around.  We had no fire only a camp stove.  I don't know what the significance of the missing eggs was all about, but we did find the carton a ways from the camp that morning.  I doubt any of this will help in your research, but the egg thing still puzzles me.  We, obviously, left that morning.",
  "classification": "Class B",
  "county": "Siskiyou",
  "state": "California",
  "location_details": "A dirt road 20 miles north of Weed, heading south towards Mt. Shasta.",
  "summary": ""
}