{
  "reportId": "15457",
  "title": "Daylight sighting by hunter along powerline route near Newnan",
  "date": "2006-08-29",
  "timestamp": 1156809600,
  "observed": "I was 19 years old at the time. My family and myself dont ever talk about what happened. It happened one evening in the woods in mid November of 2003. My grandfather owns about 4,000 acres in Coweta County. The land consists of a small cabin, some barns, 3 lakes, and lots of off road trails winding and criss crossing everywhere throughout the woods. My father, grandfather, uncle, and 1 cousin hunt the land as much as possible during the hunting season. We had our own 4 wheelers and would depart to our separate tree stands or specific areas to hunt each day. We have all hunted this land for a very long time, since i was 10 years old. Never before have any of us seen, heard ,or even thought about bigfoots being in these woods,ever! My father and I had just purchased a set of 2 way motorola radios to communicate between each other while hunting. well this particular spot i was going to hunt that evening was very deep in the woods in the north east corner of the property. My father and i had scouted this area the day before and we had noticed some strange things. Along the edge of the power line, for about a 20 foot stretch, there were tree limbs, about as round as my wrist, and a good 15-20 foot from the ground, broken and snapped off. There was this rock about thirty feet into the woods from the power line. This huge rock had been recently overturned but the thing was about 4 or 5 feet wide by 3 feet tall. This part of the woods had main power lines running through it which are very favorable to hunt deer on. I had decided that night that if a bear was in this area, I wanted to hunt it. I went there in the morning to set up my stand and scouted the area a little better. We met back at the cabin at 10:00a.m.. My grandfather said that he has never once seen a bear or bear signs of any kind in the 20 plus years hes been hunting in coweta county. He said it sounded ridiculous and that i shouldnt go hunt there by myself, but the thought of being able to bag a bear in these woods was too much! The time came to depart to the evening hunt. My dad told me to keep in touch with the 2 way radios if anything happened and that he would be located about half a mile or more from me. I rode my 4 wheeler down the familiar trails and parked it a couple hundred yards from my newly found hunting destination. As I approached my stand i had put there that morning i noticed a nasty smell in the air, not strong but would catch wiffs of it with the breeze. it smelled like old garbage. I was sitting in the tree stand for a good hour with no action, but the whole time that smell was barely present. My stand was about 40 feet into the woods from the power line near the overturned rock. the power line itself was streched along my left side with the thick woods to my front right and rear. I had a natural path through the woods to the power line, a perfect opening to see anything crossing. i was quietly looking around waiting for a bear to appear when all of a sudden i heard the familiar sound of a deer approaching fast from behind. i looked over my left shoulder to see a doe running through the woods at full pace from the powerline, running fast like something had spooked it. Out of the corner of my eye i saw a flash of movement through the woods along the edge of the power line, just where the doe was running from . i lifted my gun and peered through the scope to try and catch a glimpse of the figure that was making its way along the edge of the powerline. I was hoping it would be my bear and was waiting for it to cross that opening through the woods to the powerline for a clean, clear shot but when the creature/figure stepped into that opening, I saw through the scope that it wasnt a bear but looked human. Just 1 simple stride from this giant thing and it was out of sight of the opening. i was so stunned that i couldnt fire off a shot; besides i thought it was a man. But the thing was very tall, possiblly 8 feet. It had a cinnamon- dark brown hairy looking body. The shoulders were broad and squared and its long arms swung from side to side as it walked at a very fast pace. It happened so fast, i could only get a good look at it for a split second, letting me see enough to know that it wasnt a hunter. After it ran across the opening to the power line i heard a big commotion, starting at the powerline about where that thing should have been and heading into the woods right towards me! I tried to grab the motorola radio to get help from my father but was shaking so bad that i fumbled with it. I quickly lifted my rifle to get ready to blast whatever this big mysterious creature was. 3 more doe came bounding up looking spooked as hell which was the commotion i heard coming my way from the powerline.  The 3 doe ran as fast as they could and outta sight behind my right shoulder. Nothing followed them, nor did i see or hear it again, but that nasty smell still lingered in the air. I called my father on the radio and told him to get over to my spot to get me . I told him I wasnt getting out of the tree stand until he gets there. He came quickly to retrieve me and found me very disturbed. I told him everything that had happened and he didnt know if he believed me or not, but knew i had seen something.",
  "classification": "Class A",
  "county": "Coweta",
  "state": "Georgia",
  "latitude": 33.48295,
  "longitude": -84.7681,
  "location": "-84.7681,33.48295",
  "location_details": "n/a",
  "temperature_high": 89.69,
  "temperature_mid": 81.145,
  "temperature_low": 72.6,
  "dew_point": 73,
  "humidity": 0.79,
  "cloud_cover": 0.25,
  "moon_phase": 0.18,
  "precip_intensity": 0.0009,
  "precip_probability": 0.1,
  "precip_type": "rain",
  "pressure": 1011.58,
  "summary": "Rain overnight.",
  "uv_index": 8,
  "visibility": 8.26,
  "wind_bearing": 242,
  "wind_speed": 3.15
}