{
  "reportId": "49847",
  "title": "Tall figure seen in the shadows at Mohican State Park",
  "date": "2015-09-18",
  "timestamp": 1442534400,
  "observed": "Early Fri. morning, Sept. 18,2015, 3:00AM. My wife and I were camping at Mohican State Park in east central Ohio. We were camping in our van. My wife went to bed at about 10:30PM, I turned in about 1:30AM. I had to leave the van to relieve myself. I opened the van's side door. I have the interior lights set not to come on when the doors are opened. I glanced around outside, as I always do, and stepped out of the van. The center of the road, running through the camping area is about 25 to 30 ft. from where I was standing. On my side of the road there are individual campsites bordering the road, on the other side of the road is the Mohican River. My dying campfire cast a faint glow, the slightly overcast sky provided separation from the skyline and the tree line in the immediate area. Out of the corner of my eyes I detected a slight movement on the road but everything was bathed in shadow from the trees. I felt I was seeing a shadow of something. I leaned forward peering into the darkness for a better look. The shadowed form booted toward the entrance of the camp area. All I could see was its silhouette. It was upright and moving on two feet. It stood at least 8ft high. I watched in disbelief as it covered about 50ft distance with what seemed like 5 or 6 strides and disappeared into the darkness. I did notice that it had a slender appearance. I knew at once it was a Bigfoot. I had heard of other sightings in the area. I stood there, still in disbelief, running through my mind what I had just seen. I questioned everything else it could have been. Nothing else fit. My mind finally told me, \"Robert, you know what you saw. A Bigfoot.\"",
  "classification": "Class B",
  "county": "Ashland",
  "state": "Ohio",
  "latitude": 40.61111,
  "longitude": -82.29642,
  "location": "-82.29642,40.61111",
  "location_details": "From Loudonville Village limits: take State Route 3 south 1/2 mile to SR 97 turn right just past bridge.Take SR 97 west for 2.9 miles until you see a multi stacked sign with Camp Area 'B' in the middle,  turn right on to Park road 51 for approx 1/10 mile then turn left on to Park road, drive approx. 1.2 miles to the Covered Bridge and then turn right on the far end in to Camp Area \"B\" (See sign). Once in the parking lot drive to the far end approx. 200 yards and you will see the camp sites. Camp site # 2 is where the sighting was reported to have been made.",
  "temperature_high": 80.94,
  "temperature_mid": 74.04,
  "temperature_low": 67.14,
  "dew_point": 57.58,
  "humidity": 0.7,
  "cloud_cover": 0.1,
  "moon_phase": 0.17,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.47,
  "summary": "Partly cloudy overnight.",
  "uv_index": 5,
  "visibility": 9.41,
  "wind_bearing": 194,
  "wind_speed": 6.32
}