{
  "reportId": "27692",
  "title": "Mushroom hunter hears vocalizations and finds footprints near Jubilee College State Park",
  "date": "2010-05-05",
  "timestamp": 1273017600,
  "observed": "Well, I went out hunting with my Lab, I got a full-blooded Lab, my dog. And as usual I went out on a Wednesday. It was a nice sunny day out, nice weather, around 72 degrees, 75 degrees, very good weather. I drove back into the area where I've been hunting every year for the last 20 years. And that's when I had an experience. The dog kept acting up. And I also noticed a kind of a stench smell and I thought maybe it was something dead. And I kept hearing something of more of like a grunt noise. So I kept hearing that and as I heard that I thought maybe somebody was playing jokes or something on me or playing a prank but then I realized there was nobody else I knew out there, there weren't any other vehicles so I went ahead and started looking around  for mushrooms. I walked maybe less than ten feet and I heard a few more grunt noises toward me and they seemed like they weren't that far off, I had that feeling that someone was watching me and as I stood there I heard it went from a grunt to, oh I would say, a loud more of a scream or yell. I have never heard nothing like that in my life before. And it proceeded twice after it did it the first time it did it again a few seconds later and then I heard three like movements in the trees, like cracking and the brush was moving and lo and behold here comes my Lab running back, with the hair all the way up from her neck and all the way down to her tail, and her tail all the way between her legs and her head down and she was looking towards the area where I had heard the noise. The dog was scared, I have never seen my dog ever act like that. That is when it kind of scared me because I thought if the dog is that scared what is it? Well then I ended up getting in the vehicle, it scared me and I still had that feeling I was being watched. I got in the vehicle and backed my truck all the way up the road that is along side a corn and soybean field I backed up and proceeded towards the back entrance where I came in and I parked it almost mile from where I was actually at when I had these experiences and I went on the opposite side of the corn field. As I went over there I thought I will hunt over here, it seems like it is more open, a lot of thickets and brush but not as thick as where I was at and it was quite away off and there was still plenty of daylight, sunshine. When I got out and walked down in there I looked across the creek and the water was probably no more than four or five inches deep. And there isn't really a lot traffic over there and when I walked I couldn't believe my eyes I seen footprints, actual footprints, and I knew it couldn't be human, a human wouldn't have walked in that area barefoot, for one there is too many thickets and he would have been crazy if he did and two it was so big Shaq couldn't have a foot that big. The first one I found was the right foot and the big toe you could see it very clear, and the other one was four feet away and it was the left foot. On it you could see the heel and the toes. Basically after that I came the next day. My son-in-law, who is an ex-police officer, wanted to go out. He was a non-believer and a skeptic and basically didn't believe me. He wanted me to prove to him I wasn't lying. So I said, \"I'll let you be the judge, maybe I'm making a mistake, maybe I didn't see what I seen.\" We went out the next day and found other tracks that were in the same area from where I found the first set of tracks. So instead of finding two sets of footprints we found like six of them. They were all scattered in an area within fifty yards along the creek. That was on May 6th, which was a Thursday.",
  "classification": "Class B",
  "county": "Peoria",
  "state": "Illinois",
  "latitude": 40.82944,
  "longitude": -89.73378,
  "location": "-89.73378,40.82944",
  "location_details": "",
  "temperature_high": 72.29,
  "temperature_mid": 58.26,
  "temperature_low": 44.23,
  "dew_point": 41.82,
  "humidity": 0.47,
  "cloud_cover": 0.22,
  "moon_phase": 0.74,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1009.54,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 9,
  "visibility": 9.96,
  "wind_bearing": 284,
  "wind_speed": 6.07
}