{
  "reportId": "25462",
  "title": "Man remembers an encounter while fly fishing at a remote lake in the Olympic Mountains near Hood Canal",
  "date": "1980-08-15",
  "timestamp": 335145600,
  "observed": "It was the summer of 1979 or maybe 1980.  My friend and I hiked up the Mt. Jupiter trail to go fly fishing at one of the Jupiter Lakes, which I think might be referred to as #2.  You drop down over the ridge to the north before getting to the summit of Mt. Jupiter to reach the first 3 of 5 lakes I believe.  There is no trail to the lakes, so you must drop over the ridge to get down to the first lake, sometimes hanging on to a bit of brush.  There are 3 lakes on this side.  We got to the first, followed the outlet and went and camped at the 2nd lake down.  I think we stayed two nights.  It was probably the 2nd day when this incident happened.  There were some other guys that had camped on the other side of the lake and had left about 2-3 PM I recall.  My time frames are not exactly clear anymore.  Nonetheless, the guys that had been camping on the opposite side of the lake had left about 3 hours previous to what I call a “didn’t pay enough attention encounter”.  I was fly fishing the shoreline sort of off to the side on the opposite end of the lake.  Being an intense fly fisherman concentrating on my fishing, I saw what was, I thought at first, a person had returned to the camp to get something they might had forgotten.  I didn’t pay any attention because I had remembered there were people that had camped there.   At the moment, while concentrating fishing, I didn’t look directly at the camp, but saw a figure out of the corner of my eye.  It was probably their for a minute or maybe less.  Out of the corner of my eye, this figure, walked back and forth maybe a couple of times in the area and finally walked with a large stride, across the campsite and disappeared into the woods.  After it had disappeared, the thought of the stride struck me as odd.  It was a big stride, arms swinging, just as the video of the sasquatch that was spotted in the late 60’s down in Eureka, California.  After it had disappeared, the oddness of the stride made me look over at the campsite.  Then it hit me how very odd it seemed because of the movement and stride of the figure out of the corner of my eye.  I was actually upset for not taking a better look, and further upset because I had my camera quite handy at the time.  I carry it to take pictures of trout I catch.  I don’t remember where my friend was at the time since it was a long time ago, but anyway, I told him about it.  I said let’s go over there and see if we can find some tracks, so we did.  When we got there we discovered the campsite area was a huge rock mass with moss growing on it.  We found no tracks, but we didn’t look that hard either.  I must say, that we could hardly sleep that night.  Nothing more unusual happened that I can recall.  I had seen the film of the sasquatch spotting down in Eureka by the Patterson guy, long before this hiking/fishing trip, so the swinging of the arms and stride had sort of stuck in my mind and this thing, whatever it was, had that same movement.  Too bad I didn’t look straight at it…too bad I didn’t snap a photo.  I regret it to this day.  I can say that the creature coloring was a brownish reddish color.  It didn’t dawn on me until after this thing disappeared, that I didn’t see any clothing from the “corner of the eye” observation encounter…  I just thought I should report this after all these years.  I never have.  I can say that the area is very rugged country and is not easy to get to.  The campers on the north side of the lake had come somewhere up from the Dosewallips River where I don’t know of any trail access, so they must have “bushwacked” to get to the lakes from that side.",
  "classification": "Class B",
  "county": "Jefferson",
  "state": "Washington",
  "latitude": 47.71782,
  "longitude": -123.0533,
  "location": "-123.0533,47.71782",
  "location_details": "As described above.  Mount Jupiter.  Mount Jupiter Lake #2",
  "temperature_high": 69.13,
  "temperature_mid": 62.835,
  "temperature_low": 56.54,
  "dew_point": 51.53,
  "humidity": 0.74,
  "cloud_cover": 0.81,
  "moon_phase": 0.16,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.43,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 8.94,
  "wind_bearing": 202,
  "wind_speed": 4.52
}