{
  "reportId": "24512",
  "title": "",
  "date": "",
  "observed": "In January of 2003 two friends and I were bobcat hunting in western Johnston County.  It was a cloudy day, which increased our chances of seeing some cats.  I enjoy hunting but was a little green behind the ears as far as hunting bobcats.  However, two of us were able to harvest our 1st cats at two different stands.  The other guy was not an experienced hunter and just enjoyed being out seeing some country he had never seen.  He and I were driving together with the other friend following us.  We crossed a cattle guard going into a heavily wooded pasture and we're driving somewhat slowly.  Then out of the woods came something.  It was about 30 ft in front of us, and walking on all fours.  It was very muscular with a heavy coat of grey fur.  I was amazed and the definition of the back muscles.  After about three seconds I asked, \"What is that?\"  In a long drawn out reply he says \"I...don't.... know?\"  I then said, \"Why won't it look at us?\"  I never accelerated and just continued to creep down the road.  It was odd how the front appendages really didn't support this creature.  It's back legs kind of kicked out as it scurried across the road.  We were able to view him for probably 6-7 full seconds.  It's hard to tell how tall this thing was because it stayed bent over as it walked (like a monkey).  From what I saw, it stayed at around 3 and half ft above the ground.  But its butt was never more than 6 inches off the ground as it walked.  Within seconds it vanished.  We both thought it looked and walked like a gorilla.  I said it has to be a large bobcat if anything.  And that's what we kind of agreed upon for years.  Until recently I saw a close-up photo on Monster Quest of a creature in Florida that appeared like a gorilla.  Last month I called the friend and asked him what it was he thought we saw five years ago.  We agreed this thing looked to be about 150 to 175 lbs in weight and could no way be a bobcat.   I told him that in 1999 in that same area I did hear a scream one night about a half mile south of the sighting.  He asked why I never told him that story.  I guess I never linked the two occurrences till recently.",
  "classification": "Class A",
  "county": "Johnston",
  "state": "Oklahoma",
  "location_details": "The sighting was north of Mannsville OK.",
  "summary": ""
}