{
  "reportId": "26927",
  "title": "",
  "date": "",
  "observed": "I arrived at the area at around 2 in the afternoon.  I was in this location because it is an area that I have found signs of interest in the past.  I began my hike down a maintenance road that is gated off to normal traffic.  About a quarter of a mile down the road I dropped off into a dry creek bed to continue to the area.  This creek bed makes for an easy travel rout and is a great place to look for tracks.  After a lengthy walk I climbed out and headed into a dense section of timber and the hillside I was planning on scouting that day.  I slowly worked my way along the hillside in a zig-zaging pattern so that I could thoroughly search the area.  Along the hillside I did find 2 arches, several tree breaks, and an interesting structure of 3 small saplings woven together.  As I continued up the hill my attention was focused on looking for more sign when a very quick sharp noise stopped me in my tracks.  I wasn’t sure exactly what it was that I had herd, but I knew it was out of place.  I was fairly certain that it had come from the top of the hill above me so I stayed in place and focused my attention in that direction.  I stayed put for about 2-3 minutes trying to figure out what I had herd.  As I stood there I began to get that uneasy feeling.  Not fear, but the feeling of being watched, or something being “out of place”.  I decided not to let my imagination get the better of me and began to take a couple of steps farther up the hill, but kept my eyes and ears focused on the crest of the hill.  I had taken no more than 5 steps when the noise came again.  This time I know I herd 2 very distinct, sharp “clacks”.  It was 2 rocks being smacked together.  This obviously stopped me again. I decided to just change direction and head back down the hill and out of the area.",
  "classification": "Class B",
  "county": "Winneshiek",
  "state": "Iowa",
  "location_details": "About 5 miles south of the town of Cresco.",
  "summary": ""
}