{
  "reportId": "598",
  "title": "Vocalizations and Footsteps heard",
  "date": "2000-10-28",
  "timestamp": 972691200,
  "observed": "A couple weeks ago we all heard it and it sent my then 10 year old son running into the house, still light out but getting dark. It was still pretty far away. Three Sundays ago (10/15/00) the dog kept going off, starting around midnight till 2:30am, my husband,C., went out several times with the rifle but never heard or saw anything. At 2:50am the dog went ballistic and C. told me it was my turn. When I opened the front door you could he it over the dog barking. It was all the way back into my property behind the horse lounge ring at the back of the property line. It continued to sound off as my husband was loading the other rifle for me and then it sounded like it killed something, this was awful. When we got outside, we stood behind the truck about 50 yards from where the noises were coming from. Then it stopped but heard no movement in the woods, the dog continued this entire time sounding off. After about 5 minutes of silence, my husband shot off a round into the ground and could hear it break branches as it moved behind that old parts truck in the woods. Then he let off another round and it went farther in the woods and that was it. I called Fish & Game and went through the same old BS I did a couple of years ago. I went to K-Mart and bought a GE auto voice recorder and we started setting it out at night. We got it on tape that same week, we never heard it from inside the house but were able to hear the dog barking. I have let several people listen to it and no one can ID it. Again, this is not like anything that I heard prior or like on those tapes. Last night (10/28/00) we had a party after my art show, two of the people who previously heard the tape were there. We had a fire going for a bar-b-que and we were all pretty loud. At around 10:00pm you could hear it over all the noise in the same general area. They ALL HEARD IT. Except two women that went to get Lotto's at the store. Three male friends and one of their girlfriends were over by the lounge ring where they had parked their car. When we ran over to them, the one guy who had  previously heard the tape said \"what the #@!% was that?\"  We heard it moving in the woods and we ran in the house for the recorder and the rifles. Total Chaos!! There were no kids present at this time only adults. We listen to it WALK in the woods and you could hear it breaking branches as it moved. One guy said \"Its big whatever it is\" And another turned to me and said \"it sounds as though it's walking on two feet\". We never mentioned that from the first experience, but we heard it and it did sound as thought it was two footed. C. went back into the house to get the flashlight and he and R. went into the woods, whatever it was stayed at least 100-200 feet away from them. The whole time R. (ex-law enforcement officer & paramedic) could hear it breaking the branches as it moved through the woods as he guided my husband in the general direction it was moving in, (My husband can't hear certain tones from a far distance) never saw or heard it again.  We also had a Realtor friend, D., and some good ole boys. A good mix of people and no one could ID the sounds, only that whatever it is has an attitude and is big. The comment was made by more then two people that it sounded as thought it was on two legs. Could not find any tracks, deep layer of oak leaves.",
  "classification": "Class B",
  "county": "Marion",
  "state": "Florida",
  "latitude": 29.01175,
  "longitude": -82.03495,
  "location": "-82.03495,29.01175",
  "location_details": "",
  "temperature_high": 82.95,
  "temperature_mid": 69.955,
  "temperature_low": 56.96,
  "dew_point": 55.95,
  "humidity": 0.72,
  "cloud_cover": 0.01,
  "moon_phase": 0.05,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.86,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 8.32,
  "wind_bearing": 331,
  "wind_speed": 1.28
}