{
  "reportId": "414",
  "title": "Year long sightings by family",
  "date": "1974-07-15",
  "timestamp": 143078400,
  "observed": "These thing's which we called skunk ape's,would come on our property at night and eat mango's,and other fruit. They would also sometimes come to the travel trailer and look in the windows as if they were curious. On one ocation they had picked up a 100 lb. hog out of the pen, bit three large bite's out of it,and spit it out. It was like he was taking out chunks to get to the liver. That's all he ate of the hog. when they would come around we also noticed that the horses would go crazy! they appaerantly had came from the everglades looking for food. During this time there had been a large fire which had burned off a very lage part of the everglades! We susspected that the lack of cover had driven them into the rural areas in our vacinity and there had been many sightings. I saw the whole family of these creatures at one time! The first one I saw, I thought was a big one. I later realized that this must be the young one. It was about 7 ft. tall and had brown hair. Later, I meet up with \"dad\". He was huge, about 12 feet tall and had silver-gray hair. The \"mom\" was 8 to 10 feet tall with brownish-gray hair. They all had long arms, hardly any neck and man can they run fast. They stink real bad, too. We tried hunting these things, but it was like they were playing a game with us. At that time there was a big reward out for one of these things. We spent about a year hunting these things.  They are real intelligent. We even shot at them at close range and they would just rub the spot and look at us as if to say \"Why did you do that\"?. they would just turn and run away. Myself, wife, cousin,and even a police officer witnessed these event's and a nieghbor. I know this seem's far fetched or unbelievable, but I swear this is the truth! I tried to report this back then ,everyone thought that we were crazy! After that year, we didn't see them any more. They probably moved back to the Everglades when it started growing back up. The closest I came to one of them was about a foot, I walked up on it. Thing is, they NEVER showed any aggression towards us, even after getting shoot at. We could always hear them outside at night chattering a lot.",
  "classification": "Class A",
  "county": "Palm Beach",
  "state": "Florida",
  "latitude": 26.5931,
  "longitude": -80.21295,
  "location": "-80.21295,26.5931",
  "location_details": "This location is somewhat rural.It is on the outskirts of Lkae Worth. It used to be a hog farm, and is somewhat secluded. West of Lake Worth, near the Everglades.",
  "temperature_high": 86.38,
  "temperature_mid": 81.15,
  "temperature_low": 75.92,
  "dew_point": 69.96,
  "humidity": 0.71,
  "cloud_cover": 0.5,
  "moon_phase": 0.86,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.62,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 9,
  "visibility": 8.55,
  "wind_bearing": 103,
  "wind_speed": 3.3
}