{
  "reportId": "21660",
  "title": "Woman describes childhood incidents -- possible tracks and vocalization near outside rural home near St.James/Rolla",
  "date": "2007-01-09",
  "timestamp": 1168300800,
  "observed": "My parents had just settled on a new house for our family the day before Christmas.  We were so excited that we couldn't wait, so we moved in on Christmas Day.  There were only two bedrooms in the back of the house, which were claimed by my parents and younger brother.  I was happy enough with a \"study\" in the front of the house, which had very large windows on two sides, practically covering the entire wall area.  Because of the unusual size and shape of the windows, we didn't have anything immediately to cover them, but we weren't concerned because we were in a secluded area off the road and woods all around.  Also, the front side of the house where my room was located, was on a slope, so no one could walk right up and actually see into my room without a ladder.  When I woke up that first morning in my new room, I was excited to see the beautiful layer of snow all around the wooded yard.  I was startled, though, to see a set of footprints coming from the back of the house, from the woods.  The footprints came up along the side of the house and then circled around to my front window.  I told my parents immediately, and my dad went out to investigate.  The footprints were huge, like twice the size of my dad's foot in width and almost twice as big in length.  My dad dismissed it as someone walking through the woods with boots on and not worried because the windows were too high for someone to see into.  The shape was not right for a boot, though. I would have dismissed that completey except that the early summer of 1981 , another incident occurred which my mom, brother and I have never been able to forget or quite reconcile.  We were standing outside at dusk.  My uncle had just dropped by to check on us because my dad had been away on a trip.  He had just driven out of our driveway and we turned to walk back inside.  There was an eery feeling and we all noticed how there was silence.  No crickets chirping or frogs croaking, or other usual evening animal sounds.  Then a monstrous roar came from the darkness of the woods behind us.  No one said a word, we just all three took off running for the front door.  I still get goosebumps when I think about that sound.  I've never heard anything like it in real life ever before or since.  It sent a chill of fear right to my core.  It was deep, and long and powerful.  My uncle did return an hour later and looked around the house with a flashlight.  He didn't see or hear anything.  We dismissed it as a panther scream but never really were convinced that it was that.",
  "classification": "Class B",
  "county": "Phelps",
  "state": "Missouri",
  "latitude": 38.01223,
  "longitude": -91.64719,
  "location": "-91.64719,38.01223",
  "location_details": "V Hwy. exit off Interstate I-44, about a mile or mile and a half west.  There is a housing development on the right and our house was maybe a quarter of a mile past that on the left, sitting back in the woods, near a secluded quary which was filled with water.  There was a pond just to the side of the house.  The house sits back from the road with many trees in front of it, hard to see from the road.  There are a few scattered houses right along that area.  My parents no longer live in that house, but are nearby in St. James.",
  "temperature_high": 42.63,
  "temperature_mid": 32.815,
  "temperature_low": 23,
  "dew_point": 22.72,
  "humidity": 0.55,
  "cloud_cover": 0.43,
  "moon_phase": 0.7,
  "precip_intensity": 0.0001,
  "precip_probability": 0.13,
  "precip_type": "rain",
  "pressure": 1025.79,
  "summary": "Breezy in the morning and mostly cloudy until afternoon.",
  "uv_index": 1,
  "visibility": 9.68,
  "wind_bearing": 297,
  "wind_speed": 12.4
}