{
  "reportId": "175",
  "title": "Campers encounter large animal near Cle Elum",
  "date": "2000-07-30",
  "timestamp": 964915200,
  "observed": "We were having a family reunion and on saturday night everybody was having a good time. When everybody decided to settle down for the night it was about 1-2:00 in the morning. On Sunday morning one of the family members who had slept in a tent said that they had here a growl type high pitch yell they sounded almost man like but with power behind it. Enough power that it seemed to have come off of the mountain side that was behind us. While talking about it one other family member claimed that they heard it also. They both agreed that it was about 5:00am when the grumble occured. That following night everybody was cooking dinner on the barbecue's, steak, hamburger,etc. At about 10:00pm we decided to go the the \"frog ponds\" is what we called it. Parts of the creek that cut through land and made little swimming holes. A half hour later and only one frog, we decided to go down stream, cut through camp and go about 50 yards out. We were all four having a good time laughing and joking around when we came to a little road that seemed to lead to a camp next to ours that was empty. Then this awful smell like human feces, maybe even worse, was in the air. We thought nothing of it and was joking about somebody passing gas. Granted we had two dogs with us, one an 8 yr. old german shepard and a 6 yr. old husky. We all heard this rustle in the heavily wooded area to our right. Thinking that it was a deer or elk we all got down low and shined our flashlights hoping to catch a glimpse of the animal. Then we heard another rustle, very loud, like it was pushing over trees only coming in our direction. Then two very heavy thuds that were to close to being human like then a deer maybe even a bear was heard, and like cowards, maybe smart ones, we ran back to camp. All of that happened in a matter of seconds which seemend like minutes. After we calmed ourselves and grabbed a gun, three of us headed back determined to figure out what it was. The fourth was so terrified she was sick to her stomach. We found nothing to be in the area and no other sounds were heard. Although we didn't realize it at the time there was absolutly no odor in the air surrounding us. And we also realized that the dogs that were with us had no reaction to what happened either. We preceded to go back to camp and tell some of the others. Five more men got there guns and went to look for tracks. Still no odor and nothing was really found in the darkness. One witnessed a den like area across a marsh type area of the creek. Where it seemed that something had just made itself comfortable for a while to rest. What ever was out there we felt that it knew we were coming before we even knew what was going on. It seemed like it wasn't even scared or intimidated by us to turn and run away. It did just the oppisite. The terror we felt was more then anything I've ever felt before. We brought or tents in the middle of camp after deciding not to let the fear make us pack up and leave.",
  "classification": "Class C",
  "county": "Kittitas",
  "state": "Washington",
  "latitude": 47.47745,
  "longitude": -121.0415,
  "location": "-121.0415,47.47745",
  "location_details": "If you follow the road through Cle Elum on through Roslyn and Ronald and then about 15 miles more you will come to a guard station on you right. You take an immediate right up the hill on a dirt road. Follow that road almost exactly 9 miles up and you will come to a camp area on your left with a fairly large open field. That is where we were camped.",
  "temperature_high": 84.87,
  "temperature_mid": 73.645,
  "temperature_low": 62.42,
  "dew_point": 58.31,
  "humidity": 0.64,
  "cloud_cover": 0.08,
  "moon_phase": 0.99,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.68,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 9.83,
  "wind_bearing": 315,
  "wind_speed": 3.61
}