{
  "id": "4138",
  "title": "Two brothers have encounter while building house.",
  "date": "1983-07-15",
  "timestamp": 427075200,
  "observed": "I had bought a lot in the subdvison of Westwood in 1983 and my brother and myself had been working to put up the walls on my house and had worked into the late evening and were useing gas camp lights to see by. My brother had been a logger in Washington State. He had come home with tells of bigfoot. But ofcourse no one in the family beleived him but me. I had had my own incounter years ago when I was in my teens on a hunting trip. So when the smell hit us brought by the slight wind our heads came up at the same time and my brother looked over at me and smiled. MY heart was thumping so hard I had to catch my breath. The smell was very bad like that of a bad potato. I walked out to the road where my car was with my rifle on the hood. As I stated we were in the middle of nowhere in a very empty part of the subevsison with swamp behind my property.We had tents set up near the road so we turned the lanterns off and just listened to the night sounds and heard the sounds of something very large moveing around us. The night went by quitely thought. But the next night was very scary. We had just put up our tools and turned the lanterns off. we sat out on the road in lawn chairs. it was very dark. My lot was on a cirle. It had been very quiet but about fifty yards to the side of us all hell broke loose there were at the least three very large animals began to scream and kakle and make a primemate type bableing. I got up and used the head light of my brothers motorbike to try to see them but when I moved they were gone and the night was very very still. We had many more enconters with them after that put mostly from a distance.They would check us out in the daylite from time to time. The one we were sure was a male would watch us from the pine trees about 250 yards away but we saw him good enough to see he was about eight feet tall very broad in the chest and had tall sloping forehead. Like I said we had many encouters with them but it is to long to go into here.",
  "classification": "Class A",
  "county": "Montgomery",
  "state": "Texas",
  "latitude": 30.23333,
  "longitude": -95.60834,
  "location": "-95.60834,30.23333",
  "location_details": "These incidents occured in Montgomery county Texas between The Woodlands , Tex and Conroe,Tex off highway 1488 in a very rural and mostly empty subdvison.",
  "temperature_high": 82.18,
  "temperature_mid": 77.945,
  "temperature_low": 73.71,
  "dew_point": 73.9,
  "humidity": 0.92,
  "cloud_cover": 0.93,
  "moon_phase": 0.19,
  "precip_intensity": 0.0443,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1014.26,
  "summary": "Rain in the morning and overnight.",
  "uv_index": 7,
  "visibility": 5.48,
  "wind_bearing": 102,
  "wind_speed": 6.28
}