{
  "reportId": "50746",
  "title": "Possible aggressive behavior at new rural cabin site near Stanton",
  "date": "2015-12-22",
  "timestamp": 1450742400,
  "observed": "This is the second incident I've had at my family's property in Stanton Kentucky. The first one was scary and all (had a rock thrown at my dads truck and made a huge crash in the dark) but this one has basically scared me away from my parents house at night! This was right before Christmas and we had record high temps close to 70 so I was hanging out on their front porch. Last time I was there I smacked some wood planks together and got a response so I figured I would try again. So I stood up and grabbed a piece of wood (we just built their deck so there are pieces laying around) and hit the hand rail of the deck 3 times very slow. I waited not even 15 seconds and got 3 hits back. I was shocked because it sounded like it was no more then 50 feet away. My mom and dad keep a big spotlight style flashlight right by their front door because I refuse to get out of the car without them shining the light for me lol. I'm a chicken I know. But I ran and grabbed the light and started shining it along the woodline and saw tree branches moving... There was no wind so I know something had to be there. Well I went back in freaking out and sat on the couch... I waited about a hour and went back out and was just standing there and heard footsteps off to the side of their house. Again no more then 50 feet away. This time I didn't get the light because I didn't want it to run away... I sat out there for probably 15 minutes and something walked basically back and forth the whole time. I tried to take a video with my phone but it just sounds like someone breathing...",
  "classification": "Class B",
  "county": "Powell",
  "state": "Kentucky",
  "latitude": 37.53918,
  "longitude": -83.46014,
  "location": "-83.46014,37.53918",
  "location_details": "I would have to talk with someone to explain because it's way out in the country. It's on upper Cane Creek in Stanton KY so its easy to  Google.",
  "temperature_high": 60.36,
  "temperature_mid": 58.41,
  "temperature_low": 56.46,
  "dew_point": 54.41,
  "humidity": 0.92,
  "cloud_cover": 0.28,
  "moon_phase": 0.4,
  "precip_intensity": 0.0076,
  "precip_probability": 0.9,
  "precip_type": "rain",
  "pressure": 1012.65,
  "summary": "Partly cloudy until evening.",
  "uv_index": 2,
  "visibility": 8.86,
  "wind_bearing": 186,
  "wind_speed": 4.55
}