{
  "reportId": "47702",
  "title": "Early evening sighting near a home and strange deer kills investigated at Canyon Lake",
  "date": "2015-01-09",
  "timestamp": 1420761600,
  "observed": "On January 9th, 2015 @ about 5:20-5:30 p.m. at Canyon Lake, Texas, my family and I were backing out of our drive way, and the weather was bad that day, kind of hazy, misty rain, and it was about 37 degrees. I had my high beams on because it was beginning to get dark outside.  As I backed out of the driveway my lights caught the attention of a very big creature about 9 foot tall grayish blonde in color with a 4 to 4 1/2 ft across from shoulder to shoulder, standing in front of an oak tree, it turn towards me from about 40 yards away, and it stood with its arms down at it's side, I asked my son to look and I looked away briefly, when I looked back it was gone.  The following Friday my wife and step daughter, while walking along the shoreline of the lake, discovered a bloody and strange deer kill site (fresh kill), the deer's neck was broken and twisted all he way around, lungs, heart, and liver were gone and the deer's intestinal content was thrown about, the back half of the deer was eaten,the front shoulder was eaten,but not the other shoulder. I called the BFRO and left a message, J.D. from San Antonio came out and took pictures of the scene, I asked him if I should roll the deer over because of the shoulder bone sticking out.  After rolling over I pulled the hide back and there was a sharp edged stone underneath the hide with flesh and blood on the stone--I kept this stone--there was also a 10 feet dragging kill-blood streak across the rocks, then it abruptly stops, and the deer's carcass seems to be thrown about 15 feet from that spot with no blood stains in between the two spots.  Upon further investigating I discovered a 5 foot long stick about 1 1/4 in diameter-rigid, with a sharp end on it, and the end of it had deer hair and flesh on it, like it was used to either stab the deer or just to hold it down, then it broke the deers neck, the kill was made from the waters edge side not the woods side, meaning the thing that killed the deer was hiding in the water...I also discovered tracks some were 19 inches long but were not castable, not enough definition, also found some tracks that were 14 inches long, and some 11 inches long along the shoreline down from the kill site, all of them were not castable it had also been raining that whole week off and on.  Upon even more research we discovered At least 5 other deer carcasses in the general area.  Called area fish and game warden out and she walked the area and observed all of the evidence on Sunday January 18th..",
  "classification": "Class A",
  "county": "Comal",
  "state": "Texas",
  "latitude": 29.52533,
  "longitude": -98.15854,
  "location": "-98.15854,29.52533",
  "location_details": "Canyon Lake near Startzville, Texas",
  "temperature_high": 39.31,
  "temperature_mid": 36.155,
  "temperature_low": 33,
  "dew_point": 28.12,
  "humidity": 0.69,
  "cloud_cover": 0.7,
  "moon_phase": 0.64,
  "precip_intensity": 0.0015,
  "precip_probability": 0.61,
  "precip_type": "rain",
  "pressure": 1029.97,
  "summary": "Partly cloudy in the evening.",
  "uv_index": 2,
  "visibility": 8.88,
  "wind_bearing": 26,
  "wind_speed": 9.22
}