{
  "reportId": "3028",
  "title": "Daylight sighting by lady while her husband was clearing trees",
  "date": "2000-06-01",
  "timestamp": 959817600,
  "observed": "My husband has described a hairy biped that has been seen by him on at least 2 occassions, and by his father on one occasion on Brindley Mountain in Morgan County Alabama. This biped is well known to residents of this side of the mountain. I have always been sceptible, thinking perhaps they are seeing bears or such. My husband is a seasoned outdoorsman however, and he rarely mistakes wildlife. In summer of 99, my husband was clearing land for a family member close to the bluff where sightings were reported off and on. I was sitting on a car watching him in a tree, (hes a tree surgeon). I happened to look off toward the tree line for no reason that I recall, and I saw perhaps several hundred feet off, a tall reddish manlike creature with no apparent neck, standing off in the shadows of the treeline. I looked up at my husband and gestured toward the area. Upon looking back, the creature was gone. My husbands nephew was also sitting next to me, and he saw the same thing I saw. I still to this day wonder what in the world I saw. I know bear, having seen many, and having travelled out west, and this was no bear. Since that incident, my husband was hunting, and he and his father saw from their tree posts the same creature. He would have to tell you the details. He has had I believe one other sighting, but there are many accounts within his family and surrounding neighbors on the bluff. I have heard screams late at night around 2 or 3 am, that no one can match them to any certain animal. They are very similar to sound files we have heard online. Very much like a bobcat/hounddog combo. It is like a howl,scream very loud and drawn out. We continue to watch for further evidence, but have not had or heard of any activity for a couple of seasons to date.",
  "classification": "Class A",
  "county": "Morgan",
  "state": "Alabama",
  "latitude": 34.4881,
  "longitude": -86.6333,
  "location": "-86.6333,34.4881",
  "location_details": "Off of Hiwaay 231South, out of Huntsville towards Arab. Take a right on Apple Grove road to Water Tower Road, Left onto Darden Drive that winds around to the property on the edge of the bluff,",
  "temperature_high": 89,
  "temperature_mid": 76.34,
  "temperature_low": 63.68,
  "dew_point": 59.64,
  "humidity": 0.6,
  "cloud_cover": 0.06,
  "moon_phase": 0.97,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.96,
  "summary": "Clear throughout the day.",
  "uv_index": 11,
  "visibility": 9.07,
  "wind_bearing": 159,
  "wind_speed": 3.09
}