{
  "reportId": "18403",
  "title": "Possible road-crossing sighting in daylight near Strawberry",
  "date": "2007-03-25",
  "timestamp": 1174780800,
  "observed": "I was up off old strawberry road on sunday afternoon about 4pm. Take left before you get to strawberry proper off 108. I was getting the dogs out of the truck. Its a one lane old road, there was a turn about 300 yards away. I caught something out of the corner of my eye, looked up and saw the top halves of what I took to be two people walking across the street very quickly with their hoods up (I assumed hoods because of the peak on the head). They were almost across the street and at the point in the curve where I could not see them anymore... when I looked up. I figured they would be coming toward me or I would be able to see them going away from me as there is no trail up the hill from where I saw them and they crossed at a turn in the road where I could not see, but could see the road before and after the turn.  Never saw them again. I didn't worry about it, took the dogs for a walk down to check out the river for opening trout season in a couple days. An hour or so later I got back to the truck after letting the dogs romp around in the stream for a while. I drove down to the turn to take a look. There was a slip mark running about 2 1/2 feet down the muddy slope and what looked like another ball of the foot impression in the embankment as well.  There is no trail going up the hill here...there is a fire / private road directly across from where I saw the 2 figures crossing the road.",
  "classification": "Class B",
  "county": "Tuolumne",
  "state": "California",
  "latitude": 38.20835,
  "longitude": -120.0416,
  "location": "-120.0416,38.20835",
  "location_details": "Already posted....left turn on old strawberry road. Pass a water tower on the left a turn or two more down the road. There are some walking sticks (I figure) leaning against a large tree right where I parked (left side of the road)...they were there last week when I was by the area as well so they are probably still there.",
  "temperature_high": 65.7,
  "temperature_mid": 55.535,
  "temperature_low": 45.37,
  "dew_point": 43.62,
  "humidity": 0.68,
  "cloud_cover": 0.17,
  "moon_phase": 0.25,
  "precip_intensity": 0.002,
  "precip_probability": 0.74,
  "precip_type": "rain",
  "pressure": 1018.16,
  "summary": "Clear throughout the day.",
  "uv_index": 7,
  "visibility": 9.86,
  "wind_bearing": 245,
  "wind_speed": 4.35
}