{
  "reportId": "2452",
  "title": "",
  "date": "",
  "observed": "In January of 1979, I was visiting some friends at their farm in Cambria County, just outside of Patton, Pennsylvania.  They had recently had one of their beef cattle butchered and I was helping wrap the meat. Their farm was at the top of a ridge, and could only be reached via a gravel and dirt lane winding through the woods approximately 1/2 mile. My mother had told me if I wanted a ride home I was to meet her at the bottom of their lane at 7pm, as she would be returning from town.  (unless you had a 4 wheel drive you could not make it up their lane with snow and ice). I had dallied around and stayed too long to meet my mother, It was about 9:30pm and my friends father asked me if I wanted a ride to my uncles house (where we were staying). My friends were making fun at me for needing a ride home, so I turned it down. I had walked home at night numerous times during both winter and summer. They gave me a nap sack to put a few steaks in for my help, and a large metal flashlight (which I would not really need as there was snow on the ground, and a full moon that night). As I left their house I was aware of a very strange odor in the air (like stale armpits or dirty socks), but figured it was something from their coal furnace. I started down the lane when I felt a very real feeling that someone was watching me, and the hairs of my neck stood on end. I looked up toward their farmhouse and approximately 80 to 100 yards away, standing on the raised edge of their pond was a huge, dark, hairy animal.  As I turned to look at it, it did not move. As soon as my eyes focussed on it I knew right away that it too was looking at me. I know this sounds very strange, but even though it was far away, it was as if we were staring at each other from across a room. I did not react with thinking, as I was scared out of my mind. I did make a decision (why I do not know) to run down the lane and try to get some distance between myself and it. As I ran down the lane I began hearing crashing sounds coming from an old logging road approximately 200 feet into the woods to my left. While I ran the noise kept pace with me, and when I fell on some ice I was sure it would overtake me. By the time I got to the end of their lane I was not aware of any more noises and never lost pace as I ran the next 3/4 mile up the asphalt road to my uncles house. I beat on the door and when it opened I collapsed inside, and passed out. My Uncle and Aunt asked me what was wrong, and I was too afraid to tell them out of fear of being ridiculed. Years later after watching an episode of \"In Search Of\" I saw the Patterson BigFoot film, and ABSOLUTELEY KNEW that was the same creature I saw that night years earlier.  I have to say that I know what I saw, and I did not see a man, black bear, or deer. When I made eye contact with this thing, I knew it was a thinking, contemplating being, and not just a wild animal. I was raised in the country, and I have seen all of these animals both at night and day. To this day I will not go into the woods near there after dark, whether I am in a vehicle or not! Strange or not I can count on one hand (without using my thumb) the number of people I have told this story to.",
  "classification": "Class A",
  "county": "Cambria",
  "state": "Pennsylvania",
  "location_details": "It was on the Semelsburgers farm, just outside of Patton.",
  "summary": ""
}