{
  "reportId": "40223",
  "title": "Memory told of a possible nighttime sighting by a teenager snowmobiling south of Houghton Lake",
  "date": "2013-04-06",
  "timestamp": 1365206400,
  "observed": "I’m 50 now, but when I was 15 my father had a modern cabin, I designed and drafted, in lower upper Michigan, near Gladwin, Michigan.  I saw your Michigan episode today and wanted you to know about something I saw in the woods near Streaked Lake.  I know the county pretty good as I hunted, fished and snowmobiled in the area.  We lived in Brooklyn, MI and would travel to the cabin on my dad's days off.  The winter of 77/78, don’t remember the month, my younger brother and I were out doing nighttime, off trail snowmobiling.  We were on the state park next to my dads place.  My brother was leading, we were in Cedar Pines most of them not more than 10 inches in diameter (I know this because my dad use to have me cut firewood, and poles for fences.) Snow was pretty deep and we were moving over snags pretty good at about 10 mph.  My brother took a turn ahead of me, he was about 50 feet or so in front of me, as I began my turn to follow to the left my headlight caught something next to a 6” cedar, it stood about 7 or more feet, it had its left hand on the tree, looking over its bicep at me, its body was turned toward my brother.  I thought I was seeing things but its body was showing on the other side of the tree.  A bear came to mind but then as I was watching it, a gorilla is what I thought.  As I made my turn it was about 10 feet off to my right.  I picked up speed, craning my neck as I watched it stand there following me with its head.  I caught up to my brother and told him to head back to the cabin but on the trails.   I stayed right behind him until we got back to the cabin about 20 minutes.  I never saw the thing follow so I have always been somewhat reluctant to say something.  When we got inside, I told my dad and brother what I had seen.  I was pretty terrified when I saw it and stayed that way through the night.  The next morning we took the machines back out and followed are trails in the snow.  We found some type of foot that was bigger than my dads.  To this day, after spending many years also in the Yellowstone area, after leaving the service and working for the West Yellowstone PD, and Gallatin County SAR, I cannot believe what I saw.  I have been on snowmobiles and in my truck driving the trails around the park for hunting or recreation and have seen many grizzlies of various colors, plus a bunch of elk, deer, and bison.  This object was not any of those.",
  "classification": "Class B",
  "county": "Gladwin",
  "state": "Michigan",
  "latitude": 44.12,
  "longitude": -84.50999,
  "location": "-84.50999,44.12",
  "location_details": "Heavy Cedar Pines, off trail snowmobiling on state lands near father's cabin.",
  "temperature_high": 43.74,
  "temperature_mid": 42.68,
  "temperature_low": 41.62,
  "dew_point": 22.87,
  "humidity": 0.61,
  "cloud_cover": 0.81,
  "moon_phase": 0.88,
  "precip_intensity": 0.0006,
  "precip_probability": 0.41,
  "precip_type": "snow",
  "pressure": 1018.09,
  "summary": "Mostly cloudy throughout the day and breezy in the afternoon.",
  "uv_index": 4,
  "visibility": 9.6,
  "wind_bearing": 140,
  "wind_speed": 10.45
}