{
  "id": "3533",
  "title": "Hunter hears late night wood knocking near Nelsonville, by Wayne Nat'l Forest",
  "date": "1998-11-19",
  "timestamp": 911433600,
  "observed": "My \"encounter\" was completely audio related and contained no visual input. It was late November 1998 and I had travelled to the home of my brother-in-law in Southeastern Ohio for Thanksgiving and the opening day of deer season   He lives with his family on the edge of Wayne National Forest. Things went well for the first two days, with several members of the group taking deer, and I retired to bed on Wednesday evening exhausted after a day of trudging up steep hills and down deep draws on drives for deer. The first thing I remember about the incident is that I had been hearing the \"sound\" for sometime, and had been thinking it a part of my dream. It then occurred to me that in fact the \"sound\" was actually not in my head, and I sat upright in bed with chills running down my back and stared at the window. At first I didn't hear anything and almost convinced myself I had in fact been dreaming when I heard it again. It was the unmistakable sound of someone rapping a large branch or small \"log\" on a tree trunk. The hollow thudding echoed across the draw just below my window and startled me due to its proximity to the house. I remember suddenly being fully awake and looking at the clock which read 2:23 a.m. when the thudding occurred again, only much to my surprise, it sounded quite far away. I was trying to assimilate this whole thing when the answer to the second rap again came from below the house. It sounded like it had moved location slighly and by now it had my full attention while I cautiously peered from the window-hoping to God that I didn't see anything. It was at about this time that I remembered a story on a website dedicated to Bigfoot about the possibility of these creatures communicating by making loud noises, such as rapping logs against trees. Suddenly I heard another rap and again it came from a good distance away, and like the third rapping sound, it too sounded like it had moved location. This \"communication\" continued on and off-at very regular intervals- for about 20 minutes-before it ceased all together. During the entire episode I can say that the \"sounds\" moved about quite liberally and never seemed to get much closer together. I also would like to state for the record several other things. • I am an avid outdoorsman and Army Infantry veteran. I am telling you this only to indicate that I am quite accustomed to moving about in the dark and I have a healthy respect for the outdoors. I'm not spooked when I hear a new sound in the woods and I don't get the \"willies\" in the darkness of the woods very easily. This sound, however, unnerved me quite a bit, and when I say I hoped I wouldn't see anyone or anything outside my window-well who would at that hour. It would scare the crap out of you to see a large shape or worse looking back at you. • I can only describe the sounds I heard as communication. In my opinion, they were entirely too deliberate and methodical in response to one another to be anything other than a purposeful method of describing ones location. I can say unequivocally that they were not the sounds made by falling branches, nor were they the sounds made by other animals moving about in the woods. •  I doubt very seriously there were \"humans\" in the woods at that hour making those sounds. For one thing the area I was in has only one road access, and this road ends at the garage of my brother-in-law. Nobody could get in there by vehicle. The area is also quite remote, with one entire side of the property bordering The Wayne National Forest. It is unlikely anybody would risk a cross country hike in the dark, and on that terrain, to spend a half hour in a remote location banging logs on trees just for the heck of it. Matter of fact I cannot think of any reason why anyone would do so under any circumstances. Secondly, it was late November. The temperature must have been in the teens and I have serious doubts that any individual would be trapsing about in the woods, at 2 something in the morning, even if they could get back there, to do something as foolish as that, especially as they would have been risking injury  to do so.",
  "classification": "Class B",
  "county": "Athens",
  "state": "Ohio",
  "latitude": 39.47642,
  "longitude": -82.24155,
  "location": "-82.24155,39.47642",
  "location_details": "I am not at liberty to give details of the location as the incident occurred on my in-laws property. I don't have his permission  to use his name, nor do I have permission to allow people on his property, should they so desire. Additionally, my in-law is a high-ranking public official in a nearby town, and I am sure he wouldn't like the possible extra attention this story could bring.",
  "temperature_high": 60.81,
  "temperature_mid": 50.78,
  "temperature_low": 40.75,
  "dew_point": 44.62,
  "humidity": 0.72,
  "cloud_cover": 0.52,
  "moon_phase": 0.02,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.64,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 8.65,
  "wind_bearing": 212,
  "wind_speed": 9.48
}