{
  "id": "34572",
  "title": "Man recalls hearing strange howls while camping in High Point State Park",
  "date": "1990-06-15",
  "timestamp": 645408000,
  "observed": "This happened roughly in 1990, High Point State Park in NJ. Camping with my much-younger siblings. I was about 23, they were about 8 and 9. Camping area was around a small lake. Picture a straight road with a left-hand turnoff to the camping area. Campsites were accessed by a horseshoe-shaped access road that went around the lake. Hillsides sloped up from the far (non-lake) side of the access road. A few folks were camping right near the turn off. We went all the way around the lake to the far side, away from everyone. It was about 20 yards from the access road to the lake -- we put up the tent close to the lake, so about 20 yards from our vehicle.  Made a fire. About dusk, from directly across the lake from where we were camped, up on the hillside there, we heard a long, loud howl. Will describe it later, but my little brother and sister asked what it was. I said, \"A moose,\" knowing full well it wasn't but not really thinking much about it. After it got dark and we were roasting marshmallows, we heard the same sound, now closer to us, to the left. My siblings asked the same question, I gave the same answer. It started to drizzle so we went in the tent to sleep.  Sometime in the middle of the night, after we were all asleep, we were awoken by the same howl, except much closer and much louder than before.  So loud that if I had to yell at my brother and sister I'm not sure they could've made out what I was saying.  Same question, same answer. On the way out of the campground the next day, I asked the ranger on duty if he'd heard \"the howling last night.\" He sort of laughed and said no. Like an idiot I thought he stayed there overnight, but he could've lived an hour away for all I know. Anyhow, I didn't remember any of this...UNTIL I was watching a \"strange creatures\" show ion late night cable about 8 years later, and heard a howl supposedly made by a bigfoot. Every hair on my arm stood up -- I remembered everything.  I called my siblings and asked them to play the sound -- found it on the nascent internet somewhere, I think.  They then remembered the noise too and were freaked out, but I don't think they remembered the details as well as I did because they were so young at the time. I've been an outdoorsman all my life and know and have heard every sound made by every known animal in the North American woods. This sound was not like any of those. I describe it as sounding like it was made by a huge man with at least 2x the lung capacity through a PA system. It was that huge, long and loud.  And remember, this was way before this stuff was on TV much and way before the Internet -- I was in no way influenced by that stuff. If I had any clue about it at the time, I wish I'd looked for tracks. It had been raining, and I'd bet that animal was near the truck on what I believe was a dirt road. Ah well. Incidentally, this experience ended up in me producing a novel, \"Dark Woods,\" years later.  It was published but is out of print so this is not a plug!",
  "classification": "Class B",
  "county": "Sussex",
  "state": "New Jersey",
  "latitude": 41.29596,
  "longitude": -74.68832,
  "location": "-74.68832,41.29596",
  "location_details": "Can't remember but I went back there many years later just to see it, was easy to find. Not a big state park.",
  "temperature_high": 75.58,
  "temperature_mid": 67.355,
  "temperature_low": 59.13,
  "dew_point": 60.09,
  "humidity": 0.81,
  "cloud_cover": 0.68,
  "moon_phase": 0.73,
  "precip_intensity": 0.0045,
  "precip_probability": 0.52,
  "precip_type": "rain",
  "pressure": 1015.94,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 5.9,
  "wind_bearing": 163,
  "wind_speed": 3.68
}