{
  "reportId": "1366",
  "title": "huge human-like handprint found on top of a vandalized sign.",
  "date": "1975-07-20",
  "timestamp": 175046400,
  "observed": "I lived for about 7 years in Leadville back in the 1970’s and that town has a long history of Bigfoot reports.  While living there I was involved in several related situations. One of my foster sons was employed for a time with the U.S. Forest Service working in the sign maintainence shop.  They had quite a rash of Forest Service signs being ripped down.  If you are familiar with the signs they use they are constructed of massive timbers and quite sturdy.  Some of the signs were over 8 foot off the ground to the top yet they had been torn down with apparent ease.  At first they suspected local teenagers or possibly bears as being responsible.  To make it more difficult for the vandals the Forest Service put a thick layer of grease along the tops of some of the signs.  Within days, one of the signs was again vandalized.  The grease on the top of the damaged sign show a huge human like handprint. A few weeks later we decided to go on a late night cruise in the area where the damage had taken place - just a mile or two below Turquoise Lake west of Leadville.  The dirt road we followed had a steep drop off to a stream on the left.  To the right was a large open sagebrush meadow with thick timber behind.  A large boulder, at least 15 feet tall, was in the middle of the meadow.  We had stopped on the road above the stream and were visiting when we heard something \"sloshing\" in the water below our vehicle.  When we trained a spotlight on the area, the sloshing stopped, only to start again when the light was turned off.  A few minutes later we spotted a large figure run across the road about 100 yards in front of our headlights.  We also heard heavy footsteps crushing the sagebrush.  We immediately drove to the spot where we had seen the creature and checked for footprints.  Non were found but a trail of mashed sagebrush lead towards the treeline.  We swung the spotlight around the area just in time to catch a glimpse of a dark primate, about 7 - 8 feet tall, cross in front of the aforementioned boulder and disappear into the dense forest behind the meadow. I don’t remember any particulars but believe the incidents occurred during the summer of 1975 (probably July or August) and time was sometime around 10 pm.",
  "classification": "Class A",
  "county": "Lake",
  "state": "Colorado",
  "latitude": 39.26944,
  "longitude": -106.3833,
  "location": "-106.3833,39.26944",
  "location_details": "",
  "temperature_high": 78.52,
  "temperature_mid": 63.765,
  "temperature_low": 49.01,
  "dew_point": 49.84,
  "humidity": 0.61,
  "cloud_cover": 0.7,
  "moon_phase": 0.42,
  "precip_intensity": 0.0129,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1016.89,
  "summary": "Rain starting in the afternoon, continuing until evening.",
  "uv_index": 9,
  "visibility": 9.85,
  "wind_bearing": 163,
  "wind_speed": 1.04
}