{
  "id": "50318",
  "title": "More strange incidents reported from an old Farmplace near Blaine",
  "date": "2015-11-21",
  "timestamp": 1448064000,
  "observed": "This is a follow-up report. It is about the 50 lb. dog food a week, and the x tree marker I found by my deer stand in early fall of 2015. First the dog food. I moved my game cam to see if I can figure out why so much dog food is has been missing. No surprise there. Just pics of me and the dogs. What is surprising is I haven't had to buy any dog food for around three weeks! Again this is down from a 50 lb. dog food bag a week to a 50 lb. bag bought over three weeks ago and the only thing changed is the camera. The other thing is what some call a tree marker. I found this in early Oct. When I went to check on my deer stands. It is made out of two large branches that cross to make a x shape. It also has a twig in the middle that is y shaped upside down. One end of the big branches is stuck in the roots of one tree and the other end is supported by the branch of another tree. The other branch that makes the x has one end stuck in the ground and the other in a branch on another tree (the one with first branch stuck in roots) with a smaller branch put in to hold it. When I first found the x marker the leaves had started falling and I found three of different colors and put them on center twig half way down the y. The next week they was gone. Ok no big deal. Before leaving I put an apple in the crook of the tree the x was on out of reach of deer and placed three more leaves on the y twig, made sure they would stay by breaking the y's end. The next week I went back and no leaves and apple is gone. Maybe some other critter got the apple, I don't know, My game cam is still on dog food. Anyway I left another apple a jar of pb and tied on a piece of blaze orange string on the x. This time a couple of weeks go by and some friends and I go riding and I asked if they would want to see the x. It was night, we rode to the x, apple was there but the peanut butter was missing. We looked around and couldn't find it. I said look for tracks, none found, so we checked out the x and my friend found a hair on the x marker. We went back home and she pulled the hair out of her pocket so we could check it out. It is an inch long and curly but the weird thing is its clear looking. I still have it and pics of the x marker, however what gets me is when I went hunting on the 21st of Nov. I went to the stand by the x marker (10 ft away) and the jar of peanut butter was on my stand with the lid on it and 2/3 missing!! I am the type that has to see or have real good proof of bf before I believe. However a lot of strange stuff has been going on around here and I wanted to share.",
  "classification": "Class B",
  "county": "Lawrence",
  "state": "Kentucky",
  "latitude": 38.05344,
  "longitude": -82.5446,
  "location": "-82.5446,38.05344",
  "location_details": "",
  "temperature_high": 61.43,
  "temperature_mid": 47.51,
  "temperature_low": 33.59,
  "dew_point": 27.44,
  "humidity": 0.52,
  "cloud_cover": 0.16,
  "moon_phase": 0.35,
  "precip_intensity": 0.0011,
  "precip_probability": 0.57,
  "precip_type": "rain",
  "pressure": 1016.03,
  "summary": "Mostly cloudy starting in the evening.",
  "uv_index": 2,
  "visibility": 9.91,
  "wind_bearing": 205,
  "wind_speed": 4.1
}