{
  "reportId": "24644",
  "title": "",
  "date": "",
  "observed": "I was camping with my wife and friends from the 23rd to the 24th of August, 2008. My wife and I shared a campsite and our friends shared a campsite, with 2 tents, on a second campsite about 50ft. away from us. I had drank no alcohol before going to bed so I slept fairly lightly. I awoke at 4:50am. Just as I awoke, I heard a loud sound that seemed to me to be someone hitting a treetrunk with a large branch. I lifted my head in the tent and looked around for any light sources and saw none. I also heard no voices. I was intrigued enough to continue listening. Our closest neighbor had a Dachsund and the next closest had two larger dogs that were tied up outside their tent. Once I heard the first loud sound the outside dogs started moving around but didn't bark. They made some moaning sounds but that's all. From what I could tell, as far as sounds, something or someone walked through the campground from lower to higher through a ravine. It had very heavy footsteps. It sounded like it broke fairly large branches on the ground. Once it crossed the campground's asphalt, the neighboring dogs started crying, whimpering and moaning. I then heard what sounded like a rock or something similar, being thrown against a tree near our tent and falling to the ground. Right at the crescendo of the crunching branches I decided to get up and unzip our tent window and at the same time the tent of the owners of the dogs opened and a woman came out and grabbed the dogs to quiet them down. That was the last I heard of the crunching, footstep sounds. Also, there had been crickets making noise all night until this event. Once this started, the cricket noise reduced to only crickets at a great distance. By the end of the incident there were no forest sounds at all. The next morning, we walked over to the ravine that I thought I had heard the biped walking through and found no footprints due to the extremely dry ground. I spoke to a family right next to the ravine and they had heard nothing that night but had heard footsteps the night before. The husband/father is a hunter and told me that he had seen bears 2 or 3 times in the past in those mountains but had never seen them down in the campgrounds in that area. Mountain lions are fairly common in those mountains, but what I heard seemed to be heavier than a mountain lion. Plus, whatever animal I heard sounded like it had two feet as opposed to four. I later found out that one of our friends had heard footsteps around his tent at about 4am. He thought it was our other two friends, camping with us, playing a joke on him.",
  "classification": "Class B",
  "county": "Riverside",
  "state": "California",
  "location_details": "",
  "summary": ""
}