{
  "reportId": "12019",
  "title": "Witness sees biped leaving her yard",
  "date": "2005-06-15",
  "timestamp": 1118793600,
  "observed": "I recently moved into this house in May of 2004 and when exploring found different animal trails. Thinking they were deer, I occasionally follow them. After seeing that deer like to feed in the lawn area, I started putting apples and other fruit out for them. Within the last couple of months I have heard some things at night and when I checked I never saw anything but I always would smell a strong musky odor. The dog would go out barking; I knew he would come back in smelling like a skunk. He always came right back without a smell. When he went out chasing deer, he would always stay out for some time. I started to put fruit out on the table by the house. In the morning it was gone. A couple of nights ago I awoke with the motion sensor light coming on. I smelled that smell but by the time I got to my feet to look out the window all I saw was something large and dark walking on two legs, heading back into the trees. Unfortunately, the creature had moved into the shadows. The ground is solid so I have not been able to see tracks of anything, not even the deer that I do see crossing the property. I smell him almost nightly and continue to try to get a better look at him. I could not honestly tell if it was Bigfoot or a man but from where I saw him he was walking past a pull trailer and he stood with his shoulders well above the top. I am 5'5\" and the trailer is taller then I stand. This is why I THINK I may have a Bigfoot around. I often feel like I am being watched. One last thing. When I first moved here, I had chickens and each night 1 or 2 would end up missing. There where never any feathers around so whatever took them carried them off. A coyote, racoon, skunk, etc. would kill at the site and there would have been feathers. I never did find any feathers, not even near the house. ",
  "classification": "Class A",
  "county": "Josephine",
  "state": "Oregon",
  "latitude": 42.354,
  "longitude": -123.4034,
  "location": "-123.4034,42.354",
  "location_details": "From Hwy 238 drive about 2 miles, take a right on New Hope Road, drive about 3 miles, take right on Fishhatchery Rd., drive just under 2 miles to Wetherbee Dr.",
  "temperature_high": 68.7,
  "temperature_mid": 61.265,
  "temperature_low": 53.83,
  "dew_point": 42.45,
  "humidity": 0.62,
  "cloud_cover": 0.18,
  "moon_phase": 0.28,
  "precip_intensity": 0.0004,
  "precip_probability": 0.39,
  "precip_type": "rain",
  "pressure": 1011.97,
  "summary": "Partly cloudy in the evening.",
  "uv_index": 10,
  "visibility": 9.6,
  "wind_bearing": 357,
  "wind_speed": 1.53
}