{
  "reportId": "36852",
  "title": "",
  "date": "",
  "observed": "Unknown Encounter Oct. 11-12, 2012 Location:  Alpine Lakes Area, Kittitas County, WA I am a 45+ year experienced outdoorsman, having hiked and climbed extensively in the Alpine Lakes Wilderness, Mt. Rainier National Park, and the North Cascades.  Over the last few years I have also enjoyed the show “Finding Bigfoot”, but I never thought I would be writing about a personal experience.  Oh well, here I am. My employer had a vacation moratorium in place this entire summer because of a major computer software conversion, so as of the 1st of October, I was excited to finally be able to get out in the mountains for longer than a Fri, Sat night.  So Oct 7th, a friend dropped me and my 8 yr. old lab off near Snoqualmie Pass for a Mon-Fri trip cross-country and on the Pacific Crest Trail and had plans to meet me Friday at Pete Lake above Salmon La Sac.  Every day was like the movie “Ground-Hog Day”, a picture-perfect image of the day before.  I made my way to Pete Lake on Thursday afternoon, intent on being established there when my buddy arrived on Friday.  However, the conditions there were not what I was expecting and the low lake level made for muddy silty water pumping.  So I decided to make the 4-mile push late in the day to another lake and figured I would find a place to camp with a better water supply. From the trail-head at Pete Lake, it’s about a mile down to where I camped very close to the lake shore.  There were no vehicles in the lot at the trail-head, it was dusk and there was no one seen between there and our camp site.  I took the dog a short distance further down the trail not knowing how far it was to the next parking area where the boat launch is.  With nothing close that way and nearly dark, I headed back gathering some fire wood as there was nothing around our camp site.  When I got back to the camp area and started unpacking to settle in is when things changed.  I was overcome with a feeling of dread, unlike anything I have ever experienced in the back country before.  I had a baby-rattle I had attached to the dog’s pack while we hiked to warn bears we were coming, and I carried it all night long shaking it constantly.  I also had a bright goose-neck LED reading light and I clipped it on a tree branch aimed back up the trail so I could see that direction.  I also made an “emergency” fire for my own protection, even though I figured there must be a ban because of the forest fires.  I had to have the light.  These are things I have never done before, and they seemed totally necessary.  Conditions were like they had been all week; about 50 degrees, clear, and perfectly still.  My dog started growling after dark and this continued intermittently all night. About 8, I heard a very loud high pitched scream from what seemed like across the lake.  The high pitch was immediately accompanied by a lower pitch scream and both went on together for about 4-5 seconds.  Later in the evening, I remember hearing it again, but I didn’t note the time.  After my wood supply was gone, we got in the tent and I knew I would be awake all night.  Sometime after 11:00 I heard a loud rock-against-rock sound from again what seemed to be across the lake immediately followed by a 10 second or so roar of rock-fall.  Soon after this, a “hoo, hoo,hoo sound came from above on my side of the lake followed by the same exact sound from another direction above (this was defiantly not an echo).  It went back and forth 3 or 4 times so I could really listen closely.  I have to say, my brain was in denial all night, as I had attributed the screams to kids probably partying on the road that traverses high above the other side of the lake (but I never heard laughter, or any other sound, or saw headlights up there or light of any kind).  I figured the hoots were a couple of owls communicating, but listening closely the sound seemed to be coming from a long way off because of the way it resonated through the valley and seemed too powerful to be a little owl.  Anyway, it was just creepy. Then at 2 am I was convinced something was happening around me when a large perhaps bowling ball-sized rock was thrown into the water not more than 20-30 feet from my tent.  I said out loud to my now barking dog “well that was either a really big fish, or…” Then a second rock clunked off another rock on the shore line and landed in the shallow water.  She barked and I yelled to get away from us.  I was terrified.  That was it till the first hint of dawn when I un-zipped the tent to get packed up and get out of there.  The dog immediately bolted thru the tent door and headed toward the water barking.  I told her to stop which she did and I jumped out and took a look.  I never saw anything, but while I was packing up, she sat still staring south into the woods along the shore.  This is not her normal behavior as she usually wanders around smelling everything.  At one point I heard what seemed like a voice that my mind processed as a little old hillbilly man with a cob pipe saying “heh, heh, heh”.  I can’t remember the exact sound, but that’s how my mind processed it.  The dog growled and tried to go into the woods in that direction.  I again stopped her, got finished packing and we headed back up toward the trail head.  There was no one camped between there and the trail head, and the parking lot was empty.  It was about 8 AM when we started down the long forest road leading toward the other end of the lake. A family drove by and said Hi as they were heading in to take a hike, and about 9 or so, my buddy rolled up disappointed I wasn’t at Pete Lake as he wanted to camp out with me for a night.  I said “just get us out of here and we’ll talk about going somewhere far away from here”.",
  "classification": "Class B",
  "county": "Kittitas",
  "state": "Washington",
  "location_details": "I-90 Exit 50 (Bullfrog) to Roslyn, north on 903 to Salmon La Sac, left on 4600, 3-4 miles up this road.",
  "summary": ""
}