{
  "reportId": "23315",
  "title": "Two turkey hunters near Trout Lake are screamed at by a large black animal",
  "date": "2006-04-16",
  "timestamp": 1145145600,
  "observed": "I took my friend out turkey hunting near Mt Adams. We went out the evening on the 15th to camp overnight before opening day. We arrived at our camp and got settled in. I got out my crow call and made a call, I had heard a turkey reply so I felt we had a good chance. We woke up about a half hour before sunrise and headed out. As we were walking to our hunting location we heard a tree limb snap and looked to our left, we observed a large dark in color animal walking away from us. I use the term walking because it did not sound like a deer or elk running from us. We wondered what it was and decided to continue on. We got to our area about thirty minutes later and set up our decoys and got in our ground blind. I started to make turkey calls and had heard a few reply. We sat there still calling when we heard this scream. It sounded like a police siren but only the first note. It lasted for maybe a second and sounded like it came from right behind us. I felt the hairs on the back of my neck stand up and looked to my right to notice a dark in color large animal moving away from us in a rather fast pace. It was big enough to move the small trees that were in its way. We immediately packed up our decoys and left the area. I was very confused by what had just happened and did not want to tell people about it. I felt that I would just get made fun of about it. About four months after it happened I talked to the Washington State fish and game about it and they told me that it was a cougar. I have hunted since i was in high school and am now 33. I have seen and heard plenty of animals that live in this state. I am 100 percent convinced that whatever made that sound and was observed by me and my hunting partner was not an elk, deer or bear and was to large to be a cougar.",
  "classification": "Class B",
  "county": "Klickitat",
  "state": "Washington",
  "latitude": 45.99935,
  "longitude": -121.4821,
  "location": "-121.4821,45.99935",
  "location_details": "i was near Mt Adams so I'm thinking it was Adams County or Klickitat. We were in between Trout Lake and Glenwood.",
  "temperature_high": 51.45,
  "temperature_mid": 44.53,
  "temperature_low": 37.61,
  "dew_point": 34.35,
  "humidity": 0.73,
  "cloud_cover": 0.56,
  "moon_phase": 0.6,
  "precip_intensity": 0.0049,
  "precip_probability": 0.39,
  "precip_type": "rain",
  "pressure": 1010.62,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 9.44,
  "wind_bearing": 174,
  "wind_speed": 4.09
}