{
  "reportId": "49977",
  "title": "Motorist has a nighttime sighting on I-95 near Rowland",
  "date": "2015-10-13",
  "timestamp": 1444694400,
  "observed": "Early on the morning of 10/13/2015 while driving through North Carolina I saw the unexplainable and it blew me away. At approximately 12:30am I was driving south on I95 near exit 2 or 3 just a few miles from the South Carolina border with a tractor trailer approximately 400-500 yards in front of me. I had been following this truck for awhile when it looked like something had either been hit by the truck, kicked up or maybe a deer crossed behind the truck. In quick order, first the right taillight then the reflective material in the middle then the left tail light went dark and came back on. Instantly I cancelled the cruise control, steered my vehicle to straddle the center line thinking I would either have to avoid some debris in the road or avoid a deer that could be standing in the road and leaned towards the windshield to get a better look. As I approached the spot where this happened there was nothing in the road, but standing on the median side of the road was for lack of better understanding a Bigfoot! It was hairy from head to toe and huge. At least 7' tall. As I got closer it took two huge steps and went down the side of the embankment into the median. I was literally no more then 10-15' away from it when passing it. I was able to hit the high beams as it took the second step. This entire scenario played out in probably 10 seconds or so. I can not come up with a reasonable explanation for what I saw. It was not a man, no clothing and hairy plus the stride length was insane. I'm 6' 4\" and no way I could have a stride that long. It was not a bear, it was standing on two legs and had arms and hands. This thing was nearly impossible to see even with the head lights on high beam it was so black. The only reasonable explanation I could come up with it was some nut job in a ghillie suit playing frogger. However the two steps it took were much longer then any man could make.",
  "classification": "Class A",
  "county": "Robeson",
  "state": "North Carolina",
  "latitude": 34.5287,
  "longitude": -79.26708,
  "location": "-79.26708,34.5287",
  "location_details": "I'm not sure if it was just prior to exit 3 or 2.  I was kind of in a state of shock and was not really concerned with that at the moment.",
  "temperature_high": 78.49,
  "temperature_mid": 68.005,
  "temperature_low": 57.52,
  "dew_point": 60.41,
  "humidity": 0.77,
  "cloud_cover": 0.09,
  "moon_phase": 0.02,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1007.79,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.98,
  "wind_bearing": 225,
  "wind_speed": 8.32
}