{
  "id": "1995",
  "title": "",
  "date": "",
  "observed": "This happened in late August of 1997 in a side valley of Goldstream Valley, a relatively populated area just north of Fairbanks.  Although it's quite close to the Fairbanks area and there are many houses and roads in the main part of Goldstream, the side valleys are still as wild as they were a thousand years ago. I was hunting ruffed grouse in one if these side valleys (I prefer not to say which one).  I was on a south-facing aspen covered hillside, and had hunted all afternoon and evening, intending to spend the night out on the hill and hunt my way back in the morning. As I was making camp, a black bear almost walked right into me.  I heard him coming from a ways off, and scared him away before he got closer.  later on, it will become apparent why I mention this.  So I was sleeping out in the open, no tent, under a spruce tree.  Sometime in the middle of the night, I was awakened by something prowling around my camp, maybe thirty feet or so away from me, walking in a circle.  I mentioned the bear before. . . this was not a bear I heard in the night.  My father is a hunting guide, and I literally grew up hunting bears.  I KNOW what a bear sounds like when it's walking.  Whatever this thing was, it was walking on two legs, with a bit of a shuffling sound between each step, like it was dragging its feet a bit.  The leaves on the forest floor were dry like potato chips, and it was breaking a lot of branches--I could hear it and follow its movement quite distinctly. I have to say here that I've spent a LOT of time in the Alaskan bush, and have never before or since been truly afraid of anything I've encountered, but I don't mind saying that on that particular night I was literally shaking with fear. It circled my camp for what seemed like hours, but it was probably only five minutes or so.  Finally, remembering something I had once read about the Athabascan Indians' beliefs regarding \"woodsmen\", I started talking to it, albeit in a shaky voice, saying I wanted no trouble that night.  The thing stopped dead in its tracks, then a few moments later, I heard it trotting downhill, away from me.  Talking to such a creature may sound kinda cornball, but all I know is that it worked. I've kicked myself for this many times since, but the next morning, I didn't bother to look for any tracks, hair, etc.  I just packed up and resumed my hunting.  I had no further trouble with the woodsman. As a final couple of notes, I do recall hearing kind of low muttering sound as it was prowling around me.  Also, having since done some reading on Bigfoot sightings, I've noticed that a lot of people report the animal having a strong foul odor  to it.  However, I did not smell any particular odor, foul or otherwise.",
  "classification": "Class B",
  "county": "Fairbanks",
  "state": "Alaska",
  "location_details": "I would prefer you don't include this in my posting, as I still hunt the area regularly...",
  "summary": ""
}