{
  "reportId": "1270",
  "title": "Newspaper article about \"The Lockridge Monster.\"",
  "date": "1975-10-28",
  "timestamp": 183686400,
  "observed": "Newspaper article : Milwaukee Sentinel, October 28, 1975 IOWA BEAR-LIKE CREATURE NOTHING TO MONKEY WITH Lockridge, Iowa (AP) - Skeptics call it \"The Lockridge Monster\", but the bear-like creature with a monkey face reportedly seen in this turkey farming community is no laughing matter. \"If someone's playing a joke, they're sure liable to get shot,\" said Mrs. Gloria Olson, a farm wife who says he saw the mysterious animal. Stories about a \"four legged, black haired thing in the cornfield\" began circulating after Herb Peiffer saw it in his tractor lights while driving to his turkey pens. At first, Peiffer was reluctant to discuss it with his family. \"He thought we would would make fun of him,\" Mrs. Peiffer said. Lowell Adkins, a hunter, later found 10 inch tracks near the carcasses of four partially eaten turkeys. Some think the tracks were a bear's, possibly a black bear from northern Wisconsin or Michigan. But no one in Jefferson County recalls ever seeing a bear in the area and until the mystery is solved, some parents aren't letting their children go outside after sundown. \"It was just before dark and I was driving past an old deserted farmyard when I saw it,\" Mrs. Olson said. \"To me, it looked like it had a monkey's face and kind of had hair all over. \"I didn't tarry too long,\" she said. --------------------------------------------------------------------------------",
  "classification": "Class A",
  "county": "Jefferson",
  "state": "Iowa",
  "latitude": 40.995,
  "longitude": -91.75205,
  "location": "-91.75205,40.995",
  "location_details": "",
  "temperature_high": 59.52,
  "temperature_mid": 47.265,
  "temperature_low": 35.01,
  "dew_point": 41.7,
  "humidity": 0.64,
  "cloud_cover": 0.6,
  "moon_phase": 0.78,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.65,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 9.28,
  "wind_bearing": 327,
  "wind_speed": 7.91
}