{
  "reportId": "102",
  "title": "Couple hears unknown howl, later finds possible deformed track",
  "date": "2000-08-19",
  "timestamp": 966643200,
  "observed": "This weekend 8/19/00 while hunting off of Salmonberry Road off HWY 26.  I was looking for bear tracks on a trail that I have hunted before; anyway,  when I came out at the trails end on one of the logging roads I decided to take a walk up the road with my fiance.  I always keep an eye on the sides of the raods for traks to see where an animal may have crossed. Well about a half a mile up I saw a track, with very decerable toes (5) and I put my foot up nxt to the print, I am a size 12 and the print was about the same.  The funny thing was, the print looked like the foot was broken and healed wrong, I do know that it was not human and it deffinatly was not any type of animal I hunt for.  My fiance also saw this print as well. As we first hit the trail,  I should mention we both herd a howl the likes of nothing I have never heard before in my LIFE, the hair on the back of my neck stood on end, even my fiance said that it was the wierdest thing she ever heard.  There was no noticable odor in the air at that time.  This was all in the morning at about 6:10am. I will be checking this area again in about a week.  I will not forget that howl\\moan for as long as I live.  It is monday and I can still hear it in my head.",
  "classification": "Class B",
  "county": "Tillamook",
  "state": "Oregon",
  "latitude": 45.7351,
  "longitude": -123.466,
  "location": "-123.466,45.7351",
  "location_details": "All information is listed in the above statement. Please contact me ASAP",
  "temperature_high": 71.44,
  "temperature_mid": 59.135,
  "temperature_low": 46.83,
  "dew_point": 52.97,
  "humidity": 0.8,
  "cloud_cover": 0.57,
  "moon_phase": 0.65,
  "precip_intensity": 0.001,
  "precip_probability": 0.52,
  "precip_type": "rain",
  "pressure": 1020.7,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 5,
  "visibility": 9.83,
  "wind_bearing": 220,
  "wind_speed": 2.41
}