{
  "reportId": "2995",
  "title": "A van driver and passenger observe a large animal walking",
  "date": "2001-08-22",
  "timestamp": 998438400,
  "observed": "I was driving East on Highway 90 Between Livingston and Bozeman Montana. It was about 7:30 am. Montana has long stretches of road and we had been driving for quite awhile. I happened to glance up to the right of the road and couldn`t believe what I saw. A very large reddish brown animal was walking upright about 125 yards from the side of the road. It was very large. I don`t know exactly how big or how much it could have weighed but I do know the hands of the animal hung to about the tops of the fence posts it was walking next to. Those posts are about three to four feet of exposed post There were two of us who saw the creature walking. After we passed it I said, \"what the heck was that?\" My friend responded by saying, \"I don`t know what you saw but it looked like chewbacca to me\". Instead of pulling over and continuing to watch the creature or flag someone down to see it for themselves, we just kept on driving. I will never frogive myself for this and if I ever have another encounter I will definately act differently. I now live in Portland Oregon, the heart of Sasquatch country. This sighting has provoked an interest in me to find out what is out there. I know something is there. I have begun my own expeditions into the local wilderness as I know an encounter is basically chance and this area has been flooded with Sasquatch sightings. The skookum cast is especially interesting and I hope it brings some credibility to the search.",
  "classification": "Class A",
  "county": "Park",
  "state": "Montana",
  "latitude": 45.66722,
  "longitude": -110.8069,
  "location": "-110.8069,45.66722",
  "location_details": "The southern side of U.S. 90 on the Livingston side of the Bozeman hill.",
  "temperature_high": 87.05,
  "temperature_mid": 72.345,
  "temperature_low": 57.64,
  "dew_point": 38.7,
  "humidity": 0.35,
  "cloud_cover": 0.06,
  "moon_phase": 0.14,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1010.8,
  "summary": "Partly cloudy starting in the evening.",
  "uv_index": 7,
  "visibility": 9.78,
  "wind_bearing": 163,
  "wind_speed": 3.08
}