{
  "reportId": "14457",
  "title": "Daylight sigting by a deer hunter near Gulf Hammock",
  "date": "2000-10-01",
  "timestamp": 970358400,
  "observed": "One day in the fall of 2000, while hunting, I was standing on the dirt road that surrounded the wooded hunting area.  We were all spaced a few yards apart and out of each others line of sight and shooting lane.  As I was listening for the dogs and looking up and down the wood line, hopefully for my shot at the deer, I caught something out of the corner of my eye on my left side. The road that I was on was just wide enough to fit two full-size trucks passing each other, and the swamp monkey, that's what we all called the supposedly made up animal that lived in this area, crossed the road in two strides.  It looked like it could have been about 6 ½ - 7' tall. We had one gentleman that hunted there with us that was just under 7' and I would say it was about the same height as him from a distance.  It had such a thick build with gray hair or fur covering all of its body.  A somewhat fluid stride for its massive size. Not knowing what I actually saw and wondering if maybe it was hunters from another camp, I turned around and started to walk to the person that was closest to me in the other direction, hoping that they had a truck that I could ride back to camp with them in, being the only female and not knowing exactly who or what it was that I saw, I thought it best to go find someone else from the camp at that moment to be around. The day was a nice cool, bright fall day, approximately 11:00 am.  That night at camp over dinner I had told the others  what I had seen and they all said that I saw my first swamp monkey. The next day I didn't venture too far out of camp to hunt by myself, because what ever it was had crossed from another camp into our hunting area.  After a while I did get the nerve up to get a little pellet gun and walk down the road to look for squirrels.  I made it down about 50 yards down the road and started to notice that there were no sounds from the woods. No birds, no squirrels, nothing.  Then I heard something just inside the wood line breathing and grunting  growling   thinking it may be a wolf or bear I turned around and started to walk back to camp.  What ever was next to me did the same.  I started to walk faster then jog, the animal in the woods did the same.  Laughing to myself I stopped to catch my breath, so did the noise in the woods.. no more footsteps but more harsh breathing.  I couldn't see any shapes or movement but decided to run the rest of the way back to camp and did not look back.  That was the last time that I had any such encounter of that kind.",
  "classification": "Class A",
  "county": "Levy",
  "state": "Florida",
  "latitude": 29.191,
  "longitude": -82.6505,
  "location": "-82.6505,29.191",
  "location_details": "Private Hunting Grounds.... Intersection of Hwy 19 & CR 326   East on 326 approx 3 miles to dirt road on right...follow in to about the 3rd or 4th dirt road on right   Padlocked & Gated  entrance",
  "temperature_high": 82.1,
  "temperature_mid": 72.605,
  "temperature_low": 63.11,
  "dew_point": 66.8,
  "humidity": 0.8,
  "cloud_cover": 0.48,
  "moon_phase": 0.13,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.39,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 5,
  "visibility": 8.06,
  "wind_bearing": 26,
  "wind_speed": 8.61
}