{
  "reportId": "2271",
  "title": "Night time sighting by New Brunswick resident near Lawrence Brook",
  "date": "2005-12-11",
  "timestamp": 1134259200,
  "observed": "On a friday night in October of 1969 at 9:30pm,  me and another person were sitting in a car on Serviss Ave in North Brunswick, New Jersey. I was 15 years old at the time, and had just come home from a night out. We were parked on the right hand side of the dead end side of the block.  There are two houses on the right side of the street, then there is woods, and then Lawrence Brook. The moonlight was shining from behind the car towards the brook. While talking I glanced up towards the brook when I seen two red eyes in the middle of the road about 35 to 40feet away. Immediatly I said \"whats that thing in the road?\" The driver turned his headlights on and thats when we could see that this thing was not a dog or, person, or bear.  This thing was hunched down on the ground, and from the ground to the top of its head, it looked to be three and a half to four feet tall. After the headlights were turned on it sat there for about thirty second. We saw that it was hairy with three to four inch length reddish/brown hair and while standing it was about five feet tall. After the thirty seconds it stood up turned around and sort of waddled into the woods at a snails pace.  We guessed it was ticked off by the headlights, and good thing because we were scared and locked our doors. Once it went into the woods I exited the car and ran into the house. The driver threw the car into reverse backed out into Nassay Street, threw the car into gear and sped off down to Livingstone Ave. After I went inside my house I told my mother, whose answer was it must have been a dog or bear, and thought nothing of it.  This was a one time occurance and I have not seen anything like it since, but I did hear other things when I lived there.",
  "classification": "Class A",
  "county": "Middlesex",
  "state": "New Jersey",
  "latitude": 40.478,
  "longitude": -74.4611,
  "location": "-74.4611,40.478",
  "location_details": "Take Livingston Ave  to Nassau St go up one block to Serviss Ave make a left and a you are there.",
  "temperature_high": 38.04,
  "temperature_mid": 31.96,
  "temperature_low": 25.88,
  "dew_point": 23.54,
  "humidity": 0.76,
  "cloud_cover": 0.44,
  "moon_phase": 0.37,
  "precip_intensity": 0.0012,
  "precip_probability": 0.38,
  "precip_type": "snow",
  "pressure": 1003.88,
  "summary": "Mostly cloudy starting in the evening.",
  "uv_index": 2,
  "visibility": 7.2,
  "wind_bearing": 244,
  "wind_speed": 6.6
}