{
  "reportId": "55789",
  "title": "Possible wood knocks and tree push while biking near Lenexa",
  "date": "2013-07-15",
  "timestamp": 1373846400,
  "observed": "Ex special forces vet. Thus happened in the middle of July 2013. Lenexa, Kansas, Johnson County. Bike/walking path along small park. South of park. I was riding my bike from North to South. Area is very wooded and flows along a river. It was very below normal temperatures that week. Felt more like fall. High low 60s that week. Which was odd and weird. What happened as I'm heading up a large hill. To my immediate right or west. I heard a large wood knock. And I looked to my right and heard thus commotion in the very heavy brush. I had this feeling something very large was in there. And looking right at me. I've seen many types of animals in and around the area. From a mountain lion, a family of Bob cats. And hundreds of deer. I've rode those trails hundreds of times. As I was riding up the large and long climb I'd say 100 yards from first incident. Smack, another wood knock. Also loud. Now I'm thinking if bigfoot does exist, what a perfect time to come through this area. This river bed runs all the way to the Kansas river. By Bonner springs KS. So, when I heard the second smack, I said no way can someone be down in that bed. The effort required to get through the brush would be almost impossible... when I heard the first thump I said to myself. No way was that a bigfoot. But if it was it was warning another one. It was a tree falling or wind blowing. It was a large thud. And movement in the brush. My gut was telling me I was being watched. Then up the trail another one. Again, it was cool, foggy and little wind. Only reason I'm writing this is what the retired police officer from Wyandotte wrote. Thus bed would feed to the same area. But, about 20 miles south. If I was going to travel and not wanting to be seen. This would be the perfect area to accomplish this journey. And there are several areas to portage across the river. I have always had a high sense of awareness. Attention to detail off the charts.",
  "classification": "Class B",
  "county": "Johnson",
  "state": "Kansas",
  "latitude": 38.5735,
  "longitude": -94.477,
  "location": "-94.477,38.5735",
  "location_details": "Shawnee mission bike trail",
  "temperature_high": 88.25,
  "temperature_mid": 79.625,
  "temperature_low": 71,
  "dew_point": 65.27,
  "humidity": 0.65,
  "cloud_cover": 0.13,
  "moon_phase": 0.24,
  "precip_intensity": 0.0004,
  "precip_probability": 0.08,
  "precip_type": "rain",
  "pressure": 1020.09,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 9,
  "visibility": 9.74,
  "wind_bearing": 106,
  "wind_speed": 5.77
}