{
  "reportId": "1553",
  "title": "",
  "date": "",
  "observed": "Here's a little background about the events that led up to my encounter. I was preparing for a fall elk hunt in North-Central New Mexico. I had gathered together a pile of clothing for donation to my favorite local charity. On the Wednesday before I was to leave on my hunting trip I had taken this pile of clothes into my garage and was going to place them on a shelf to be delivered to the charity as soon as i returned from my hunting trip. I had just started to lean over my ATV when I wrenched my back. I was in the worst pain I had ever experienced. I crawled back into the house and climbed into bed. After about a day and a half's bed rest, I was eager to go hunting, though my back was still in great pain. I somehow managed the 3 hour trip to our regular hunting area. After arriving at the campsite, my brother, my cousin, and myself downloaded the 3 ATV'S that we would be using on our hunt. This turned out to be a huge mistake on my part as I agrivated my already sore back. We sacked out for the night. In the morning we got up about 5:00 am. We rode up into the area that we would be hunting and separated. My brother and I were going to stay on a traditionally productive fenceline. Since my back was hurting from the ride up, my brother suggested that I take a stand and rest my back. I accepted his advice and took a stand near a clearing with a few good  lanes. The weather, although clear and sunny, provided quite a chill. It wasn't long before the cold weather caused my back to tighten up. I was in excruciating pain. My first thought was to get into the nearest clearing where i could get the sun to shine on me and perhaps relieve the shivers. It was at this time that i had decided that relief was a little more important than the prospect of bagging an elk. I literally crawled about 50 yards to the nearest clearing and leaned myself against a tree stump that stood no more than 20 inches above the ground. As I had hoped, the sun provided enough heat to stop the shivers. I was still pretty much imobile. But, the shivers were gone. As you can imagine, I was so focused on the pain in my back that I did not pay too much attention to my surroundings. It was about 9:00am at this point. As I was laying there, I kept hearing what I thought was a group of squirrels running up and down the forest pines that were nearest to me. I tried to lay as still as possible. But due to the pain in my back, my motions were jerky to say the least. I had my back to the sounds that I had thought were being created by scampering squirrels. But, as my jerky motions forced me to work my way in the directions of the sounds, I caught the glimpse of a softball sized rock bouncing off of the trees. At first I was a bit stunned at this. Then I recalled some old folklore that reffered to rock throwing as a \"trademark\" of the sausquach. Suddenly the realization hit me that in my condition (back pain), there was no way that I would be able to defend myself in a confrontation. I tried to rationalize these flying rocks. But the thought of a hunter trying to scare game out of a relatively open clearing just did not jive. Besides, there was no way that even a pretty physically fit man could heave rocks of this size with a force that i would describe as dangerous (if the rock was to have hit a person), for more than a couple of minutes. I would have to say that the rocks were being thrown at intervals of less than 1 minute. At this time I was really starting to worry and was scared. Besides the sounds of the rocks bouncing off of the trees and hitting the ground, there was absolutely no noise. Well, the beating of my heart was pretty loud in my chest. I decided that something was really not right. I called my brother on our 2 way radios. He was about 500 or 600 yards away. By this time, the rock throwing had been going on for at least an hour and ten minutes. My brother arrived and saw the rocks as they bounded off of the trees and landed one by one just yards away from where we were huddled. If he hadn't seen and experienced the same thing I was, I would wonder if the whole experience was a hallucination. We talked about this strange event for a few minutes and we glassed the tree line for any sign of what we concluded could only be a \"creature\" throwing in what had to be an overhand motion (judging from the velocity of the flying stones). My brother and I witnessed this together for about 30 minutes after he arrived. To this day, I have pondered what might have thrown those stones. The only two possibilities other than a Bigfoot that would have any possible validity are a bear rooting, or another hunter. But, based on the size of the rocks being thrown, the velocity, and the length of time that they were thrown for, it seems unlikely that either of the other 2 possibilities are in fact true. My brother and I are both experienced woodsmen and have hunted that area for a number of years. I have spent a great deal of time reading this as well as other quality Bigfoot websites. The thing that strikes me in particular is the pattern of stories in which the witness claims silence. These creatures seem to have the ability to move through the forests without making a great deal of noise. That is one other factor that makes me believe that my rock throwing experience was an interaction with something that is not yet known to science. Here are two more bits of information that may be of intrest. First, the rocks were exiting the trees at about 8 feet off of the ground (they were being thrown with pretty extraordinary force). Second, the terrain was relatively rocky. After the rocks stopped flying, my brother and myself ventured toward where we thought the rocks came from in search of whatever track or signs  we could find. But due to the rocky nature of the terrain, we were unable to find a trace.",
  "classification": "Class B",
  "county": "Rio Arriba",
  "state": "New Mexico",
  "location_details": "",
  "summary": ""
}