{
  "id": "4977",
  "title": "Ron Schaffner case report: The 1978 Minerva Flap",
  "date": "1978-08-21",
  "timestamp": 272505600,
  "observed": "INVESTIGATORS: Ron Schaffner (Ron@bfro.net), Earl Jones, Jim Carnes Jim Rastetter, Iona Boyce, Barbara Mudrak,(Akron Beacon-Journal) and James Shannon (Stark County Deputy Sheriff) CASE DATA: All of our interviews and field investigations were conducted on the weekends of September 9 and 30, 1978. Other interviews were conducted by the late Jim Rastetter and his research team, the press and local law enforcement. We will list the incidents by date since there are several encounters. There are also many newspaper reports from this time period mostly from the Akron Beacon-Journal. The reader should be aware that these incidents are multiple witness sightings which adds some credence to the reports. The reports of large felines in conjunction with the hominids are a subject that I have never been able to explain. I will begin with the first major sighting which occurred on 21, August: Evelyn Cayton's family and friends were out on the front porch when they heard noises in the direction of an old chicken coop just to the right of the house. They saw two pairs of yellow eyes that seemed to be reflecting a porch light. Scott Patterson went to his car and turned the headlights on in hopes of getting a better look. The eyes were emitting from what appeared to be two \"cougar-type\" felines. Then, the party saw what looked like a large bipedal hairy creature step in front of the large cats as if to protect them. This creature then preceded to lurch towards Patterson's car. The witnesses fled to the house and called the Stark County Sheriffs Department. While waiting for the deputies, the bipedal creature appeared at the kitchen window - about four yards from the kitchen table. Patterson pointed a .22 caliber pistol at it, while Evelyn Cayton loaded a .22 caliber rifle. The creature stood outside the window for close to ten minutes. They all could clearly see the creature because of the back porch light. They decided they would not shot at it unless the creature made any advances toward them. The biped suddenly left without harming anyone. (Sketch of creature is on file with us.) \"It doesn't seem to want to bother anyone\", said Mary Ackerman. \"It was just curious. We all felt that it wanted to be friends\" Deputy Sheriff James Shannon arrived about 15 minutes after the call was made and about 5 minutes after the creature left the scene. A strong stench was still lingering in the area when Deputy Shannon began to interview the witnesses. Shannon later told reporters that it smelled like \"ammonia-sulphur\". Extra deputies were brought in and the searched the entire area on horseback and in jeeps. (The land behind the Cayton's was an old abandoned strip mine and beyond that were dense woods going up a gradual hill.) Unusual, but unsubstantiated foot prints were discovered. 22, August: Mrs. Mary Ackerman, of Minerva drove to the Cayton residence to pick up her daughter and friend. (Mrs. Ackerman is Evelyn Cayton's daughter.) As she turned into the driveway, she saw the same creature standing on top of the hill next to the strip mine. She watched it until it walked out of her view. 23, August: The creature appeared again at Cayton residence. Howe Cayton was not sure if it was the same thing. He fired a gunshot into the air and the figure departed. 8, September: During the late daylight hours, Mrs. Ackerman observed two \"ape-like\" animals across the strip mine. She stated that she thought the creatures were standing in a tree but wasn't sure because of the distance. Again, she watched them for a while, until they were no longer visible in the thick weeds. 9, September: Jim Rastetter interviewed Henry Colt who lives about 5 miles east of Minerva on U.S. 30. He told Jim that he was walking through some woods by his house when he caught a glimpse of an unknown furry animal. Mr. Colt said that the animal was squatting next to a tree and let out a sound similar to a loud cough. Actually, the incidents leading up to the August 21 sighting began about the first of the month. Mrs. Cayton believes the creatures' appearance were due to her husband (Herbert) cutting down the thick brush next to the pit and that he also dumped some garbage around for the raccoons. Several nights later, Cayton's grandchildren and their friends came running in the house crying in a frightened state. They claimed to have seen a large hairy monster in the pit. Mrs. Keck, Mrs. Cayton and Howe Cayton went outside to see what had scared them. They saw a creature that was covered with dark matted hair. They estimated it to be about 300 pounds and 7 feet tall. \"It just stood there\", said Mrs. Cayton. \"It didn't move, but I almost broke my neck running back down the hill.\" Mrs. Cayton claims that she later observed the creature in the daylight. It was sitting in the pit picking at the garbage. She could not make out any facial features due to the amount of long hair covering its face. She remembered that the creature had no visible neck. MORE GROUND LEVEL ACTIVITY AND COMMENTS: What about the two phantom cougars? This is one of the most puzzling aspects of this case. The \"ape-like\" creature was described by the witnesses as if to be protecting the big cats. If Patterson's testimony is truthful, the how should we ascertain such statements. Does this mean that these creatures live in harmony with each other, or is it more soft evidence to indicate that all this phenomena is originating from the same source? deputy Shannon said that he received many reports of bear and \"panther-like\" bobcats in the area. Was the creature a bear? Although the Ohio Division of Wildlife debunked the idea of bears, we know that they are coming into eastern Ohio from Pennsylvania. We also discovered a bear explanation was used by local law enforcement to down play the incidents. This reasoning was used to keep the local vigilantes and hunters away from the woods. We asked Mrs. Cayton; \"Do you think what you saw were bears?\" She answered; \"No, not unless they were mutated.\" Canine Activity: Prior to the August 21 sightings, one of the Cayton's German Shepherds was found dead with a broken neck. The dog had been chained up with a collar to the dog house. The collar was found next to the dead animal still in tacked to the chain. We can speculate that either; 1. The creature jerked the dog out of the collar, or: 2. The canine was so scared that it broke its own neck trying to escape. Consider the following: The other shepherd (\"Missey\") was still in a schizophrenic state during our investigations. At times, she is extremely calm and affectionate and on other occasions, she is scared and vicious. Missey has spent a lot of time digging, which is not uncharacteristic of a canine. However, she dug a tunnel about 8 feet into the ground. This hole is almost large enough to contain two medium sized dogs. Could this be a hiding place for the dog for when the creature returns? (We have photographs of this \"tunnel\".) EVALUATION: According to the Cayton's and Mrs. Mudrack, the Sheriff's department did an excellent investigation. However, there are some conflicting reports. The deputies stayed with the family until the early morning hours. They studied alleged prints and hair, but came up with no monster. They covered up the incidents to discourage hunters. They supposedly took the soft evidence to a local college in Canton for analysis. When we tried to obtain this evidence, Mallone College told us they did not receive anything. Many investigators have since talked to the Cayton family. I believe that they are sincere people who would have no real benefit to hoax. Evelyn had just been released from the hospital due to an ulcer and a thyroid tumor. her doctors told her to avoid emotional stress, so why would she fabricate a story like this? She did not need this type of publicity. One must not forget that this is a multiple witnesses incident. With this many witnesses, (interviewed separately, then as a group) it could be easy for one to \"slip up\", but all stuck to the same story. One cannot forget about the deputies' investigation and other phenomena surrounding these incidents. The witnesses were unfamiliar with the term \"Bigfoot\", until the press caught wind of the story. Barbara Mudrack gave us an excellent character reference of the witnesses. She told us (prior to our on-site investigations) that she really believed that the Caytons were telling the truth about their visitor. Earl Jones and Myself visited the Caytons on two separate occasions. On our second visit, we backpacked and spent the night in the upper woods looking for physical evidence. We came up with no evidence, nor did we witness anything unusual. We did feel the need for more hours logged, but were unable to do so, for lack of financial means. ( Could not afford lost time from our jobs.) This case is by far, the most complex and interesting one from my files.",
  "classification": "Class A",
  "county": "Stark",
  "state": "Ohio",
  "latitude": 40.74451,
  "longitude": -81.0758,
  "location": "-81.0758,40.74451",
  "location_details": "U.S. Route 30, west of Minerva, Ohio in Paris Township; Stark County",
  "temperature_high": 76.74,
  "temperature_mid": 67.435,
  "temperature_low": 58.13,
  "dew_point": 54.79,
  "humidity": 0.7,
  "cloud_cover": 0.15,
  "moon_phase": 0.62,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1025.78,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 8,
  "visibility": 9.63,
  "wind_bearing": 37,
  "wind_speed": 4.13
}