{
  "reportId": "42745",
  "title": "Strange occurrences outside a home lead to a daylight sighting by a father and son near East Canton",
  "date": "2011-09-09",
  "timestamp": 1315526400,
  "observed": "It was toward the end of summer in September 2011 that I had my sighting of a tall hairy bipedal creature. I went to bed around 9:30pm on September 5th and it was a warm summer night approximately 70 degrees outside. I usually don’t get much sleep as I get older and it seems to get worse the older I get. I had awakened at about 2 a.m. in the early morning of the 6th, I had decided to go outside and smoke a cigarette because I don’t smoke in my house. I proceeded to the living room where the french doors are located to go out to the rear deck on my house that is positioned on the S.E. Corner of my house. I walked out on the rear deck and I stood there just in front of the french doors where the ashtray was sitting on the hand rail and I noticed that the moon was mostly full and set in place and that the temperature was rather warm. I was facing my back yard and enjoying the moon light and I might have been there for approximately two to three minutes when I heard a low guttural growl coming from my left from the cornfield. I live on a dead end street and the property that is located beside me is a corn field that belongs to a gentleman that lives up the street. There is a single line of large pine trees that divide my property from the corn field and as I looked over to my left after hearing the growl I couldn’t see anything even though the moon was shining in my direction. I still continued to stand there and about one minute later I heard this low guttural growl once again. I proceeded to extinguish my cigarette and walk back into the house not telling anyone about what happened. The next night I went to bed approximately ten p.m. and again I couldn't sleep and had awakened about one a.m. and  I got up and headed out to the rear deck totally dismissing what I had encountered the previous night. I was standing in the same area again enjoying the warm night and the moon was only showing at about sixty percent but it was still bright and very little clouds that night. The same thing occurred again, it must have been a few minutes as I stood there and I heard the low guttural growl coming from the same area from my left. This time it seemed to be a bit louder and I looked over between the pine trees but I couldn't see anything but darkness. I originally thought it might have been a bear but after checking bear sightings I dismissed it because none  has been reported for my area. At this time I am getting a little nervous because whatever this was it sounded extremely large and seemed to have a large set of lungs. I proceeded back into the house and just as I entered through the door way my wife had gotten up and she was headed to the door to go out to the rear deck. I stopped her and told her about the growls that I have been experiencing that night and the previous night. She replies with “I know,I have heard them before” and with a look on my face I thanked her for not telling me. I hadn't went outside at night for the rest of the week because I had no idea what was lurking in the shadows and I didn't know if it was still hanging around. The next day I had contacted my oldest son and told him what was going on around the house and he said he could come over on Friday the ninth after work and we could check things out. Now it's Friday the ninth and I got home from work at about 5:30 that day and my oldest son was already at my house waiting on me. We proceeded to walk through the the tree line that connects to the south eastern corner of my back yard and it runs along the edge of the corn field and as we were walking through we started to notice strange stick structures that didn't make sense and it seemed to rule out something done by nature. We finally got to the end of the tree line and it meets a large field with tall grass that gets five to six feet high and part of it seems to be swampy and has some cat tails growing on the one side. The temperature that day was warm and sunny with very little cloud cover and no rain but the ground of the field still seemed to be wet and muddy and definitely a paradise for ticks. My son and I made it partially through the field and we stopped to look across the field toward the wooded area and we were facing the south eastern direction over at some crab apple trees that was located on the tree line on the other side of the field. We were standing side by side and out of my peripheral vision I noticed some movement out of the corner of my left eye at the edge of the tree line that was approximately two hundred feet from where we were standing. I asked my son if he had seen the movement as I pointed in the direction of the wooded area and he relied “No I didn't see it” I then said lets go investigate that and see what it could have been. It was about five fifty p.m. by that time and I didn't know if it was deer or anything else because I just saw the movement but couldn't tell shape or color of the subject in question. We finally made it through the field to the tree line and there was a small creek about three foot wide with very little water flowing through it and we also noticed a trail where the deer had been crossing that creek in that same area and it was heavily traveled because the tree roots were showing. We both jumped across the narrow creek and started to walk the deer trail which followed the edge of the narrow creek and I told my son that I was going to check the creeks edge for any type of prints because I know I had seen something move over in that area. My son elected to wait up on the trail while I was searching the creeks edge. I was looking on both sides of the creeks edge when my son alerted me and wanted me to come look at something that was odd to him so I proceeded up the small embankment and walked over to where he was standing. He said “stand where I am and follow the creek down to a large tree on the creeks edge and tell me what that is”. I looked down to the tree which was about a good three hundred feet and I noticed something dark that seemed to be squatting behind that tree but I couldn't tell what it was but I know it wasn't moving so I dismissed it as a log or tree stump. I went back to the creeks edge to continue looking for any type of prints in the soft mud but came up empty handed. I told him we should go into the woods a little deeper just to see what else we can find and I walked back up to the deer trail and just for curiosity I went to the spot where I previously stood to look down to the large tree where we both seen that dark object and this time the area looked different. We walked the deer trail which followed the narrow creek and had noticed the narrow creek tees into a larger creek that was about 15 foot wide but we didn’t see a good spot to cross until we followed it a little farther and we had found a shallow spot that we could cross. Once we crossed the larger creek we split up and I headed south and he headed north and I had been looking around for about five minutes and I heard him call my name and wanted me to go to his location. I walked over to where he was and he was standing in a small clearing that had the greenest grass I had ever seen and this clearing was surrounded by thick brush in the shape of a U. He had noticed an unbearable smell in that area and he asked me if I could smell it and I replied “Yes” but then I asked him what it was because we couldn't pinpoint what type of smell it was because it had a combined odor of rotten eggs and rotted flesh. We both started searching that immediate area for a possible dead animal or anything that could have made that nasty odor. We didn't come up with anything and it was starting to get about 6:30 that night so I told him that we should go but we can come back another time and he agreed. We went back to the large creek and crossed over and walked along the deer trail until we got about twenty feet from the area that we had originally crossed the small creek that took us to the field with the tall grass and he was walking in front of me he stopped and he was looking to his left and I asked what he was doing. He said “look” and as I looked over to my left I couldn't see what he was looking at so I asked him again what he was looking at and he pointed to his left and told me to look with a more stern voice but yet again I couldn't see because I had a tree and limb covered with leaves obstructing my view. I hunched down about six to eight inches to look below the limb and about 100 ft. from us we saw a huge hairy creature standing in a bipedal fashion with a forward gate staring in our direction. There wasn't much between us and this creature but some brush and small saplings and as we stood there in amazement because of the size of this human looking creature I asked my son what it was doing and he replied “It's moving its upper body back and forth” at this time I really don't think that it had set in to our minds what we were exactly looking at but I can say that it seemed as though time stopped and I have no idea how long we actually viewed this thing. We both just stood there and watched this thing and we never moved an inch because I think we were in shock from the massive size. This unexplained creature appeared to be at least seven and a half foot tall and had to weigh a minimum of six hundred pounds. The hair was a dark reddish brown and it had a matted and dirty look to it and most of the face was covered with hair but from what you could see it appeared to be of human trait. The ears were covered with hair and it was standing at an angle to us but I could see the legs were extremely muscular and large and the arms length seemed to go just slightly past the knees. I just couldn't help but to stare at this creature because I couldn't believe the size and just how big it was. I believe that as it was swaying its upper body back and forth because I knew that it knew that we were there but I don't think it knew what our exact location was and it was trying to find us as we were kind of hidden behind some brush. It seemed as my son and myself broke out of some type of hypnosis I looked at my son and said “we need to go”. He agreed and he said he was running but I told him not to run and that we would walk out but we can keep an eye and see if we were going to be followed. We finally made it to the small creek and jumped across and headed across the field with the tall grass as we kept looking behind us to see if we were being followed but didn't notice anything. We made it across the field and took a short cut through the corn field and as we both stepped into my back yard we turned around and looked in the direction of where we just came from and just slightly north of us in the wooded area we both heard two really loud tree knocks and my son looked at me and asked if I heard that and I said “Yes I did”. To this day I will never forget what I had seen that day and I will remember it like it was yesterday and nobody can convince me that it was anything else other than what we call bigfoot. From that day I vowed to become a researcher in the bigfoot world and my goal is to get enough proof of this creature so it can be recognized to mainstream science and documented so we can protect this creature and its habitat.",
  "classification": "Class A",
  "county": "Stark",
  "state": "Ohio",
  "latitude": 40.79438,
  "longitude": -81.31219,
  "location": "-81.31219,40.79438",
  "location_details": "About 1/4 mile north of Route 30",
  "temperature_high": 74.38,
  "temperature_mid": 68.585,
  "temperature_low": 62.79,
  "dew_point": 63.22,
  "humidity": 0.87,
  "cloud_cover": 0.82,
  "moon_phase": 0.42,
  "precip_intensity": 0.0012,
  "precip_probability": 0.15,
  "precip_type": "rain",
  "pressure": 1013.48,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 5.46,
  "wind_bearing": 324,
  "wind_speed": 2.52
}