{
  "reportId": "7566",
  "title": "Bow hunter has daylight sighting near Alpine.",
  "date": "1993-09-04",
  "timestamp": 747100800,
  "observed": "I was archery deer hunting in September 1993, when I had a visual encounter with this creature.  Around 7:00 a.m., I was slowly stalking down a hiking trail in a heavily wooded area when I began to feel extremely uneasy and almost unnerved.  I had the intense feeling that I was being watched and/or followed.  There were no other people in the area other than my hunting companions and they were not in this general vicinity.  I kept moving along the trail literally one step at a time, all the while anxiously looking around for the source of my uneasiness.  After about 25 minutes, I was standing on the trail just looking behind me when I saw this creature walking rapidly down the same trail towards me.  I watched it walk closer and closer for about 6 - 8 seconds (it seemed like minutes) then when we were about 70 - 80 yards apart, it turned 90 degrees from the trail and disappeared over a ridge.  I followed it to the top of the ridge to try and get another look at it, but when I heard a sound that can only be described as a cross between a grunt and throat clearing, I decided I had enough and left the area. I returned to the area 6 weeks later to novicely investigate and came across what I can best determine to be a posssible bed.  The following year, while hunting the same area I came across an abandoned shelter that has no human signs as far as being built or utilized.",
  "classification": "Class A",
  "county": "Greenlee",
  "state": "Arizona",
  "latitude": 33.6247,
  "longitude": -109.3191,
  "location": "-109.3191,33.6247",
  "location_details": "",
  "temperature_high": 92.6,
  "temperature_mid": 76.92,
  "temperature_low": 61.24,
  "dew_point": 53.15,
  "humidity": 0.46,
  "cloud_cover": 0.54,
  "moon_phase": 0.61,
  "precip_type": "rain",
  "summary": "Mostly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 10,
  "visibility": 10,
  "wind_bearing": 233,
  "wind_speed": 1.6
}