{
  "reportId": "31594",
  "title": "Memory told of a possible sighting of two juveniles tree climbing at sundown near Farmville",
  "date": "1980-08-30",
  "timestamp": 336441600,
  "observed": "My ex's step father was born in Amelia County, Va, so my husband hunted a lot where his step father had family land there, I would sit in the car while he went hunting. It was getting dark [dusk] and I could hear children playing, but just over looked it. A few minutes later my husband scared me when he came up to the car from the rear, and eased the door open to put his shotgun in the back. He was uneasy about something, so I asked what was wrong. He told me to roll up the car windows, but leave a crack for air. He was scaring me, which he never did, he was scared of NOTHING. He pointed to a large tree in the field ahead of us. What I saw was the SAME animal you showed in the Dec 31, show [NY State]. It made the hair on my neck rise, and a chill go down my back, I still feel that fear even today. It looked like 2 of them, just crawling around a huge oak tree. One of them went behind the tree, then appeared at the base, and looked around the tree at us. Chills ran down my spine, and we started the car and we left. We were going to spend the night, but drove home to Lynchburg, VA that night. He never went back to that spot again, and it took him a long time to even go back there hunting.",
  "classification": "Class B",
  "county": "Amelia",
  "state": "Virginia",
  "latitude": 37.303,
  "longitude": -78.193,
  "location": "-78.193,37.303",
  "location_details": "I would have to ask, a friend who hunted with my husband sometimes on directions, husband Andrew passed away 5 yrs ago. Just remember going by Appomattox surrender grounds, and taking a left before entering farmville, va",
  "temperature_high": 90.87,
  "temperature_mid": 80.21,
  "temperature_low": 69.55,
  "dew_point": 67.46,
  "humidity": 0.69,
  "cloud_cover": 0.47,
  "moon_phase": 0.67,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.18,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 8.02,
  "wind_bearing": 184,
  "wind_speed": 4.69
}