{
  "reportId": "29244",
  "title": "Deer hunter recalls possible early morning encounter near Boone Lake",
  "date": "1993-10-20",
  "timestamp": 751075200,
  "observed": "In late October of 1993 my brother and I were deer hunting on a large farm in Piney Flats Tennessee. Piney Flats is located halfway between Bristol and Johnson City. The farm bordered Boone Lake. A lake that had been made in the 1930's and 1940's with the construction by The Tennessee Valley Authority.I had scouted the area the evening before,so I could have an idea of where I would be hunting.I entered the woods well before daylight the next morning. I was hunting with a single shot muzzle loader.I sprayed myself with human scent shield prior to entering the woods.I walked through a high grass field,crossed a barb-wire fence and entered the woods. I walked up a ridge and sat down on top of a large rock facing that was protruding out of the side of the hill. Where I was sitting was directly above the trail that the deer had been traveling.I could see shapes of trees and the outline of the woods against the fence. I began to hear something walking in the high grass of the field to my right.I then heard the barbed-wire cling together as if it something had crossed it.I then heard the leaves begin to crunch and crush underneath steps being taken.I could see something walking in a zig zag pattern below me. The pattern continued but it was slowly walking toward me. I then began to hear the sound of a grunt and low toned growl.As the figure came closer I could make out the shape of a man walking up the hill in a zig zag pattern. As I continued to watch the thought ran through my head that someone had walked upon my spot to hunt and then I realized that the gentleman who owned the farm had only allowed my brother and myself to hunt.The rock I was sitting on was approximatly seven and a half to eight feet off of the ground. This figure was standing five to six feet infront of me but was looking me eye to eye.It grunted and growled in a low tone as if someone who was congested or out of breath.(thats the only way I can describe it)I could make out the shape of hair that was around the head area.I could also distinguish shoulders ,arms and a torso.The shoulders were very wide and no neck was visible.I coughed as if to alert that I was already hunting this spot. The figure continued to stand in front of me and breath heavily.I then waived my hand and coughed again.At this point the figure turned walking back down hill on two legs,swinging its arms and going the same direction it had came from.I observed the figure until it walked out of my sight and hearing range.No one believes me.At one time ,this area was populated with members of the Cherokee Tribe. I have always heard of legends out west by Native Americans but never in this part of the country.I have spoken with one other person who has wittnessed the figure about one mile from where I did.With my encounter I detected no smell, but truth be told I was so astonished I wouldn't know if I had.",
  "classification": "Class B",
  "county": "Sullivan",
  "state": "Tennessee",
  "latitude": 36.42846,
  "longitude": -82.31094,
  "location": "-82.31094,36.42846",
  "location_details": "See Report",
  "temperature_high": 81.2,
  "temperature_mid": 72.11,
  "temperature_low": 63.02,
  "dew_point": 58.87,
  "humidity": 0.76,
  "cloud_cover": 0.47,
  "moon_phase": 0.19,
  "precip_intensity": 0.0006,
  "precip_probability": 0.05,
  "precip_type": "rain",
  "pressure": 1018.77,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 6.82,
  "wind_bearing": 197,
  "wind_speed": 3.84
}