{
  "id": "12709",
  "title": "Daylight sighting by hiker outside Middleport",
  "date": "2002-09-21",
  "timestamp": 1032566400,
  "observed": "I witnessed a Sasquatch at about 225 yards distance for approximately 15 seconds, while it traveled around 75 yards along the back of a stone quarry near Middleport, NY in the Fall of 2002/September. I stop there to look for deer in a large field behind the quarry that are always there and immediately noticed when I exited my truck a dark biped moving very rapidly through waist high field grass on very uneven rocky terrain. It seemed to float through the grass as I could not see its legs due to the height of the grass it moved through. Immediately I noticed that it was completely the same color and it seemed to hold its arms at its side as it moved very, very quickly from left to right. At first sight I thought it was a girl with very long hair but quickly noticed that it was completely the same color with no obvious clothes coloration and moved much too fast although at the distance I was I could not make out any actual features and at no time did it look in my direction, but I believe I startled this creature by pulling into the stone driveway which makes considerable noise. As it crossed a path next to a corn field and angled slightly away from me I noticed that its glutteal area was somewhat lighter colored. The biped then moved directly into a standing corn field and was not seen after that time. When I say traveled very quickly, I mean it was really moving very rapidly but at no time did it seem like it was running as you or I would look if traveling at that speed due to fact that there was no discernable movement of its arms as it \"floated\" through the tall grass. I am convinced that this was a sasquatch I witnessed as I have been an avid outdoorsman since a very young age, hunting, hiking and camping for over 40 years and very experienced with animals in the wild and I know what I saw that afternoon was remarkable.",
  "classification": "Class A",
  "county": "Niagara",
  "state": "New York",
  "latitude": 43.19501,
  "longitude": -78.54224,
  "location": "-78.54224,43.19501",
  "location_details": "Mountain Rd. runs parallel to Rt. 31A and parallel to the Erie Canal about 1/2 mile North of sighting location. A large stone quarry operation is on both sides of road and area is generally farmland with considerable woodlots in general area.",
  "temperature_high": 73.58,
  "temperature_mid": 66.77,
  "temperature_low": 59.96,
  "dew_point": 63.86,
  "humidity": 0.78,
  "cloud_cover": 0.67,
  "moon_phase": 0.51,
  "precip_intensity": 0.0011,
  "precip_probability": 0.83,
  "precip_type": "rain",
  "pressure": 1011.54,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 9.34,
  "wind_bearing": 220,
  "wind_speed": 10.59
}