{
  "id": "35031",
  "title": "",
  "date": "",
  "observed": "I was fly fishing by a lake in WA. I was all alone. I was setting up my camp I got bored and started singing softly. A short time later I started smelling what smelled like dirty cat litter. I thought that was really odd after a while I just ignored it. Then I started breaking the big branches to make my fire. After breaking the really big branches I heard a loud very loud knock. I thought that was odd because I was the only one around I was high up. So I thought maybe that was a bear coming down a tree or something. So after that I did some screams to try to scare it away. So I started my fire I had some meat out by the fire. After a while I started hearing whistles I was like what the heck I never heard a bird like that. Mind you I’m in the mountains a lot so when that happened I started to be on my guard. I also lived in Yosemite for 9 months. After cooking one pork chop I had one still laying on the rock beside me. I started hearing rustling in the trees behind me so I grabbed my bear spray. I went to go check it out and didn’t see a bear. So I went back to camp didn’t think about anymore. After I was done with my dinner a big rock came crashing by almost hitting my car. I thought it was just a rock falling from a cliff. Then I started thinking about it there’s no cliffs by me what the heck! So I started screaming to scare it away. I did that for a minute or two then relaxed for a bit. Then another big rock was thrown so I got really pissed off and started really yelling. Then I thought my mind is just playing tricks so I ignored it. Then maybe 20, 30 minutes later a really big rock was thrown. When that happened again I knew it wasn’t my mind playing games with me. So I was thinking is this really happening? A couple of minutes passed another rock thrown. So I started to yell again then I heard a really angry loud whoop sound like I never heard before. I could feel it inside me it was that loud like you were at a concert or something. I got really scared and drove away.",
  "classification": "Class B",
  "county": "Kittitas",
  "state": "Washington",
  "location_details": "",
  "summary": ""
}