{
  "id": "43204",
  "title": "Possible early evening sighting while driving by a vineyard near Taylorsville",
  "date": "2013-10-18",
  "timestamp": 1382054400,
  "observed": "Leaving from Wilson Mills, NC ... I went to visit with my fiance and her family in Taylorsville / Hickory North Carolina on Oct 15 2012. On October 18th 2013 around 5:45 pm, I left to meet her and her nephews to take them to a Haunted Trail (For Halloween) after she got off of work. I left from their mobile home, and turned right onto Friendship Church Road in Taylorsville to get on 16. It is about 5 miles from their home on Friendship Church Road to Hwy 16. About 30 seconds after I pulled out of the driveway, onto the road, I looked into an open field on the left, they sell muscadine grapes (there is a dirt road that leads into the vineyard area) and about 30-40 yards off the road, and about 15 yards off of the dirt road/path there what at the time was a bear sitting on its butt, I saw it only for about 4 seconds while passing. I got down the road about 1/8 mile and turned around in a local church parking lot, when I got back, there was another vehicle turned into the dirt path, I slowed down and rolled my windows down, and the lady asked me \"Do you see that thing?\" which I didn't see it anymore, she then pointed, I looked, and it was walking on two legs into the tree line. We then spoke for a few more minutes, before I left. I told her I turned around to get another look. I knew then it was not a bear after I saw it walking on two legs like a human. I learned about the BFRO on Finding Bigfoot show on Animal Planet last night, and wanted to share my story.",
  "classification": "Class B",
  "county": "Alexander",
  "state": "North Carolina",
  "latitude": 35.84103,
  "longitude": -81.20877,
  "location": "-81.20877,35.84103",
  "location_details": "I'm not familiar with the area all that well, but I do know it was on Friendship Church Road in Taylorsville, about 3 - 4 miles from Hwy 16 which I was heading to.",
  "temperature_high": 66.74,
  "temperature_mid": 60.595,
  "temperature_low": 54.45,
  "dew_point": 51.85,
  "humidity": 0.8,
  "cloud_cover": 0.03,
  "moon_phase": 0.49,
  "precip_intensity": 0.0001,
  "precip_probability": 0.18,
  "precip_type": "rain",
  "pressure": 1014.18,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.15,
  "wind_bearing": 26,
  "wind_speed": 1.54
}