{
  "reportId": "14223",
  "title": "Possible night time sighting by hunters in a marsh near Port Clinton",
  "date": "1974-04-20",
  "timestamp": 135648000,
  "observed": "I am 45 years old, ret. Navy and currently work as a correctional officer in Ca. I grew up in Ohio. I've had one visual sighting and on two occasions heard something that I could not identify. The sighting took place in a marshy inlet off the Little Portage River near Port Clinton Oh. It was 1974 my buddy and I found a new place to set turtle hooks. We set the lines and decided to camp out over night and check the hooks early in a.m. There was a little island in this marsh, that we use to set traps that we set up camp. We made a fire, turned on the radio and talked. It was approx. 1030 p.m. moon lit night and very still. My friend heard something in the water and ask \"whats that\" I told him to turn off the radio. We heard a splash...splash...splash. He asked if it was a deer. I said don't think so, a deer would swim if water is deep enough or lope through the water. We could now start to see ripples in the water in the moon light. Stll hearing splash...splash...splash. Then we could see something walking into the moon light. It was about 75 yards away it stopped and I assumed was looking at us. I said what the hell is that! My friend in a shaky voice said maybe it's Mr W. checking his traps? I said no look were he is standing. The water was 2 1/2 to 4 ft all through the marsh, plus 1 1/2 to 2 ft of muck and it is very hard to walk in. This thing was standing waist deep, stood there for about 45 sec. turned his head and continued to walk with ease through the marsh. I watch (in awe) till I could no longer see him. I turned to my buddy to get his opinion, he was already packing the boat. We left. The first time I heard (it)? Was summer 1977 just got home from work. I was sitting, talking with my Dad in our back porch. It was about 1000 - 1030 p.m. We lived on a canal, across the road was a small marsh, so tipical night sounds ( frogs,crickets,owls and others). We heard this noise, that made your hair stand on end. It was like a scream, howl and yodel all rolled into one. I said what the @#&* was that? Dad ( shaken) said that was a great blue heron. I said no it wasn't. A bobcat? Nice try Dad! No it wasn't. Then he said I don't know. But that was the first time that I've seen my Dad lock the doors before we went to bed. The next time that I heard a very similar sound, was 1983 in the fall I was squirrel hunting with my cousin in Clyde Oh. It was about 0430 in a large woods on his property. He never heard anything like that before.",
  "classification": "Class B",
  "county": "Ottawa",
  "state": "Ohio",
  "latitude": 41.48962,
  "longitude": -83.06977,
  "location": "-83.06977,41.48962",
  "location_details": "I THINK CLYDE IS IN SENECA CO.",
  "temperature_high": 67.98,
  "temperature_mid": 58.685,
  "temperature_low": 49.39,
  "dew_point": 31.19,
  "humidity": 0.53,
  "cloud_cover": 0.32,
  "moon_phase": 0.93,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1025.48,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 9.24,
  "wind_bearing": 160,
  "wind_speed": 7.43
}