{
  "id": "7676",
  "title": "Hunters have strange night experiences near Groundhog Meadow",
  "date": "1978-09-15",
  "timestamp": 274665600,
  "observed": "My son and I arrived at the horse corral near Groundhog Meadow late on a Friday night in early September 1978.  We spent all Saturday building two deer blinds with the intent on coming back to the area to hunt later that year.  The area, at that time, didn't receive very much recreational activity, and we saw no one else while we were camping. Saturday night, three strange incidences occurred.  First, early in the evening, my son and I heard two screams.  The first scream was located near the horse corral.  The scream sounded like it was from something very large.  It was very loud and low-pitched, sort of like a very large angry man.  I have heard mountain lions in the past, since I have hunted all my life, and this was nothing like that.  A few minutes later, we heard another scream, just like the first, but it came from the east, like from the Emigrant Wilderness.  We both acknowledged that we had heard the screams, but neither of us knew what it was.  My son checked the horse corral and didn't see anything. Later that evening, as we were sitting around the campfire, I noticed a pair of red eyes looking at me from near the horse corral.  The area where the eyes were was in total darkness and I do not know if the firelight could reach that far in order to cause the eyes to reflect red.  At first, I just thought it was a deer or other animal, but then it dawned on me that the eyes were at least six to seven feet off the ground.  Since I knew the area very well, I knew that there were no trees or other objects in that area for something, like an owl, to stand on.  After it watched me for about 30 minutes, I asked my son if he also saw it.  He did.  He and I continued to be watched for another 30 minutes (one hour total).  After I briefly looked away and I turned back, the eyes were gone.  The next morning, both my son and I checked the area and confirmed that no trees or other objects were present for an animal to stand on and appear to be seven feet tall. The last incident happened the same night when we went to my camper to eat dinner and go to bed.  The camper was on the bed of my utility truck, and was at least five feet off the ground.  As we were making sandwiches, we both heard and felt a loud bang or thud on the side of the camper (on the front driver's side of the camper).  The camper was hit so hard, it shook the whole truck.  We grabbed our flashlights and immediately went outside, expecting to see either a tree limb or a very dazed deer.  We saw nothing.  We even circled the camper and didn't see anything.  We both then realized that whatever had hit the camper had to be at least five feet tall and could not have been a deer running blindly in the dark.  We thought that all the incidences were strange, but nothing else happened that night and we went home the next day.  We returned to the area to hunt later on that year.",
  "classification": "Class B",
  "county": "Tuolumne",
  "state": "California",
  "latitude": 38.2395,
  "longitude": -119.8792,
  "location": "-119.8792,38.2395",
  "location_details": "We were camped at the horse corral near Groundhog Meadow near Herring Creek Reservoir.",
  "temperature_high": 81.72,
  "temperature_mid": 66.775,
  "temperature_low": 51.83,
  "dew_point": 49.6,
  "humidity": 0.58,
  "cloud_cover": 0.08,
  "moon_phase": 0.46,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.88,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 9.77,
  "wind_bearing": 135,
  "wind_speed": 0.94
}