{
  "id": "27067",
  "title": "Motorists pulled over on a rural highway at night describe standoff in headlights east of Clayton",
  "date": "1980-01-12",
  "timestamp": 316483200,
  "observed": "I have been reluctant to share my story because of my field of work, and do not want to have people think I am “crazy” as this could damage my career. But, as I get older, I feel this incident needs to be documented. The incident occurred in the winter of 1980 a few miles east of Clayton, Alabama in Barbour County. I was traveling with my Aunt, Grandmother and four younger cousins to a relative’s house. It was dark and probably around 9pm from the best I can remember. For some reason, my Aunt needed to turn around and proceeded to pull off the roadway by a small clearing. I was in the front seat of the car with my Aunt, who was driving, and my Grandmother. As we turned off the road, the headlights caught a figure in mid-stride. It then immediately froze and did not move anymore. It was about 30 yards from the car – very close. I could see the entire side view of this creature and its body was slightly turned so that it was looking at us. The most terrifying thing in my memory is this things huge eyes glaring at us. The best way I can describe the creature’s expression is “stunned.” The face was covered in hair except for around the eyes. The hair was dark and appeared longer and wavy looking on the arms and legs. It was very tall and massive yet lean looking. I would say it was easily over 7 feet tall, if not more. When it “froze” in the headlights, one arm was slightly extended behind the creature and it held this position. At this point, my Grandmother was crying and begging my Aunt to drive away. Two of my younger cousins were huddled on the floorboard in the backseat crying. I was terrified but could not look away.  My Aunt kept telling my Grandmother “there is no way he can get in this car” and she kept the car still and we watched this motionless creature for about two to three minutes. It was almost completely motionless. It was as if the creature thought we could not see him if he did not move. I don’t know how it stood so still. The hair on my neck is standing on end as I type this. It scared me terribly. He kept staring at us with his eyes stretched very wide. I’ll never forget that “look” he gave us. Finally, my Aunt decided to flash the lights on and off real quick. The instant she did this, the creature jumped towards the woods and was gone. He was about 10 yards from the woods but made it there in less than a second. I can’t believe how fast this huge creature could move. This event traumatized me. I have never been able to go in the woods alone or enjoy camping since this event. I tried to deer hunt but could not enjoy it and quit – I can’t sit alone in a tree-stand without thinking of this creature and becoming tense. I can’t imagine coming upon this thing alone in the wilderness. I know these creatures exist. There is no doubt in my mind. I saw one up close and personal. We never saw the creature again.",
  "classification": "Class A",
  "county": "Barbour",
  "state": "Alabama",
  "latitude": 31.86801,
  "longitude": -85.35995,
  "location": "-85.35995,31.86801",
  "location_details": "County Road 79 South and Highway 30",
  "temperature_high": 57.93,
  "temperature_mid": 52.87,
  "temperature_low": 47.81,
  "dew_point": 31,
  "humidity": 0.47,
  "cloud_cover": 0.66,
  "moon_phase": 0.82,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1023.98,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 8.3,
  "wind_bearing": 28,
  "wind_speed": 8.35
}