{
  "reportId": "20068",
  "title": "Bigfoot spotted by driver in Cranberry River region of Monongahela National Forest.",
  "date": "2007-06-30",
  "timestamp": 1183161600,
  "observed": "I had just left the Cranberry River in the Monangahela National Forest where some family members were camping. I took a short cut through Cranberry Ridge that comes out in Camden on Gauley to get home. It was midnight (12:03 to be exact.) I was almost to the Webster County Line when I saw what I thought at first was some idiot in a monkey suit in the middle of the road in front of me. I beeped my horn at it.He started to run very fast, in long strides and then I realized it wasn't a man. He wasn't wearing shoes. His feet looked hairy. He was covered in reddish brown hair and about six feet tall. The hair was all even in length. He ran about quarter of a mile up the hill in front of me then tore through some elderberry bushes and disappeared down the mountain. I only got a really quick glimpse of his face so I can't accurately describe it. The next day I went back and looked at the spot where he ran through the bushes. There were some kind of prints in the mud holes in the road and the elderberry bushes were broken and bent where it went through.",
  "classification": "Class A",
  "county": "Nicholas",
  "state": "West Virginia",
  "latitude": 38.33109,
  "longitude": -80.51374,
  "location": "-80.51374,38.33109",
  "location_details": "Shortly after leaving Richwood (heading in the direction of Cranberry Glades) take the left turn up Hinkle Mountain (signs along the main road note the Cranberry River and Monongahela National Forest). At the top of the mountain, turn left onto the forest road that takes you into the national forest. Go over the Cranberry River Bridge and take the next left. (There is a small campground and outhouse at the turn.) Go up the mountain and take your first left turn (a dirt road). That is the road until you come to the pave road. I saw it about two miles before you get to the paved road.",
  "temperature_high": 76.47,
  "temperature_mid": 65.255,
  "temperature_low": 54.04,
  "dew_point": 60.11,
  "humidity": 0.75,
  "cloud_cover": 0.51,
  "moon_phase": 0.51,
  "precip_intensity": 0.0015,
  "precip_probability": 0.21,
  "precip_type": "rain",
  "pressure": 1017.54,
  "summary": "Partly cloudy until evening.",
  "uv_index": 8,
  "visibility": 7.3,
  "wind_bearing": 303,
  "wind_speed": 4.02
}