{
  "id": "12351",
  "title": "Possible vocalizations heard by residents outside Elkton",
  "date": "2005-08-19",
  "timestamp": 1124409600,
  "observed": "This happened tonight. I had gone outside on the porch to have a cigarette about 9:00 pm and my two German Sherpards went out with me. I was outside about 2 -3 mins. when less then 100 feet from me just at the woods edge I heard a very loud yell/scream. My two dogs immediately jumped off the porch and took off towards the sound and I ran inside to get a shotgun and light. The dogs where running around sniffing the ground frantically but staying in the yard and not going into the wood. With my flashlight in one hand and gun in the other I went out into the yard and was looking around for a clue as to what could have made such a weird loud noise. Even though we live in the country we do have a few houses around us and the only thing that I could come up with is that it had to be some kid messing around and at that time I became mad and yelled \" you might think messing around here playing games is fun but I'll tell you I have a gun and someone could very well get hurt messing around like this in the dark\". I had barely gotten the words out of my mouth when I would say about 25 yards into the woods came the scream again. The dogs dashed into the woods and even though they normally obey me very well, all of the yelling would not get them to return to the yard for about 5 mins. Two things stand out as very odd about what happened tonight. One is that it was right in my yard, granted it was at the edge but it was in the yard none the less. It made such a loud yell as though it wanted me to know that it was there! The other thing I find strange is that the dogs never once barked or growled. You would have to know my dogs to understand how strange that is. They are very protective of the yard. They will bark at a leaf blowing though, and if anyone comes up the drive, watch out! They love to hear themselves bark. They did not bark once, they just kept running around as though they had gone nuts. My wife was in the living room and heard it.  It was loud enough to hear it with the windows closed and the TV on. I am 45 years old, have hunted and camped a good part of my life, spending a lot of hours outdoors and I have never heard anything even close to what I heard tonight. ",
  "classification": "Class B",
  "county": "St. Johns",
  "state": "Florida",
  "latitude": 29.7788,
  "longitude": -81.45421,
  "location": "-81.45421,29.7788",
  "location_details": "It happend on St. Ambrose Church Rd. You take St. Rt. 207 east out of St. Augustine for about 7 miles. Off to the right is a road that y's off, That is St. Ambrose Church Rd. I am about 3 miles down the road on the right.",
  "temperature_high": 90.44,
  "temperature_mid": 84.58,
  "temperature_low": 78.72,
  "dew_point": 75.23,
  "humidity": 0.76,
  "cloud_cover": 0.27,
  "moon_phase": 0.51,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.44,
  "summary": "Humid throughout the day and partly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 8,
  "visibility": 7.9,
  "wind_bearing": 182,
  "wind_speed": 1.64
}