{
  "reportId": "36247",
  "title": "",
  "date": "",
  "observed": "My husband and I were watching a movie in his brother's barn,  where we have set up a movie projector and screen.  It was during the last half of the second movie, when we started hearing loud splashing noises coming from the lake, not far from the opening of the barn door, where we were sitting.  My husband asked if I heard that, and I said \"yeah, it is probably fish jumping, or maybe a raccoon or something.\" We continued to watch the movie, still hearing loud splashing noises.  As the splashing continued,  it sounded too big and noisy to be fish jumping.  It sounded like something large walking along the shore.  When the movie was over, my husband went up into the loft of the barn to disconnect the projector and computer.  I stood at the barn entrance,  trying to see out towards the lake and see if I could see anything.  While trying to peer out into the dark,  I suddenly felt very uneasy,  like I was being watched.  The hairs at the back of my neck stood up, and I said to my husband \"I really want to you to come back down here!!\"  Now,  I keep horses at my brother-in-laws place, and I am out there all the time, all hours of the day and night.  I am very familiar with this property and the surrounding area, and have never felt uneasy like that before. When my husband came back down,  I handed him a small flashlight and asked him to shine the light down towards where the splashing noises were coming from.  He took the flashlight and walked down to the water's edge.  When he started walking towards the water, the noises stopped.  Then he shined the flashlight and there was nothing.  I was watching still from the barn.  After a second or two,  I heard the noises further down to my right.  When my husband would shine the light, the noises would stop,  then continue in a different area of the lakeshore.  He came back to the barn and said he wasn't sure what was going on, but that it \"definitely was not normal.\"  We both felt a little creeped out, and decided to go home. The next morning, I went to the barn to take care of my horses, and decided to look around the lake shore area and see if I could find any tracks or evidence of what was going on down there.  I came across a very large footprint!!  I stood there staring at it for a few minutes, trying to figure out if I was really looking at what I thought I was looking at.  It looks human in shape, but very large.  My husband wears a size 14 mens, and it was much bigger than his foot.  There were other prints that appeared to be partial, like a heel impression,  a half footprint, etc.  But this one was the only one that I could not reason off as anything else but perhaps a Bigfoot footprint! Especially when coupled with the events of the night before.",
  "classification": "Class B",
  "county": "Lafayette",
  "state": "Missouri",
  "location_details": "Please do not include exact directions in report online.",
  "summary": ""
}