{
  "reportId": "11818",
  "title": "Fisherman has close sighting on Breitenbush River",
  "date": "2003-06-15",
  "timestamp": 1055635200,
  "observed": "I believe it was in June of 2003 when I was fishing on the Breitenbush River approximately 4 miles upstream from Detroit, OR. The river flows through a fairly steep gorge at this point. Because of a hip replacement I had less than a year before, I moved very slowly and deliberately down to the river. The weather was clear and the ground dry. The river is approximately 50 ft wide, swift, and could be as deep as 10 feet. I had been fishing for about 15 minutes when I heard a loud branch snap across the river. In retrospect, I would say the snap sounded like a dry 3-inch branch snapping. I placed the sound about 20 feet up the bank. Since I was armed and very immobile with my bad hip, I decided to continue fishing. My thought was that there was a bear or elk in the thick brush. I kept an eye on the other bank but soon lost interest. I then heard a second loud snap similar to the first. Now, whatever it was had my attention. There was something big across the river in the brush. However, I was armed and separated by the river. I continued to fish with my eye on the other side. As I continously scanned the area, I observed what I first thought was a man move from right to left through a clearing near the source of the sound. The sighting lasted only about 3 seconds. There was no sound as \"it\" moved. My actual thought was, \"Oh, there's a man over there.\" I then thought, \"Damn', he was one big...\" I was approximately 25 yards away when I saw \"it\". As my mind digested the information I realized that what I saw had the profile of a sasquatch. I remember a barrel chest, no neck, and it was bi-pedal. I climbed back over the hill to my car to drive over to the other side. No way could I cross directly. Approximately one quarter of a mile upstream, I found a place to park and a path. The path along the river was well above the point where I spotted \"it\". Because of my hip, I could not cut through the brush to the river. There was no lower path.  ",
  "classification": "Class A",
  "county": "Marion",
  "state": "Oregon",
  "latitude": 44.7679,
  "longitude": -122.095,
  "location": "-122.095,44.7679",
  "location_details": "Included in text",
  "temperature_high": 81.99,
  "temperature_mid": 65.805,
  "temperature_low": 49.62,
  "dew_point": 48.46,
  "humidity": 0.61,
  "cloud_cover": 0.1,
  "moon_phase": 0.55,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.09,
  "summary": "Clear throughout the day.",
  "uv_index": 10,
  "visibility": 9.88,
  "wind_bearing": 334,
  "wind_speed": 4.76
}