{
  "reportId": "8685",
  "title": "Morning sighting in the Lukachukai Mountains of northeast Arizona",
  "date": "1981-11-07",
  "timestamp": 373939200,
  "observed": "It was my first day of the 1981 Navajo deer season. I have hunted these Lukachukai mountains for deer through my teenage years with brother T., uncle DJ, and cousins. I was twenty years old then. It was about 7 A.M., November 7, 1981 when our hunting crew reached the top of the mountain, southwest of Cove, Arizona. The weather was cold with shifting fog, the ground was frozen from the drizzle, the night before. Two cousins and I were to walk the upper mountain ridge that arced to the northwest. I packed my day pack and loaded my rifle. By then my cousins had already walked ahead of me, on a well used trail, which rounded a hill to a saddle which splits the mountain range. I wanted to catch up with them, so instead of following the trail, I climbed up the hill and over. As I reached the top and began to go down the other side I stop and yelled my cousins name's to locate them. I first heard crashing of oak brush, below me 40 to 50 yards to my left. I could not believe what I was seeing walk down hill on two legs. The oak brush was about armpit high on the thing. By then the smell had reached me. Which was musky, wet smelly hair, undescribable scent. I was shocked. The thought of shooting it came mind, as I watched it through my rifle scope, but it walked to similar to a human. I did not shoot. I watched it walk down, to the big trail below, about 70 to 80 yards and into the forest. I then hurriedly made my way down to the north, towards the forest road we came up on, and stayed on the road back to meeting area to the northwest end of the ridge. I think it followed, because of the movement I could hear in the oak brush while walking on the road. I shot once to scare what ever was moving, in the oak brush. What I saw, was a very large black hairy being that walked upright on two legs. The upper body was broad and muscular. The hair appeared coarse. The smell was bad. I can only say, what I saw that day was a bigfoot.",
  "classification": "Class A",
  "county": "Apache",
  "state": "Arizona",
  "latitude": 36.54165,
  "longitude": -109.29,
  "location": "-109.29,36.54165",
  "location_details": "Southwest of Cove, Arizona. Lukachukai Mountain range. Approximately 8-10 miles to top of mountain on windy forest road.",
  "temperature_high": 50.93,
  "temperature_mid": 41.93,
  "temperature_low": 32.93,
  "dew_point": 38.36,
  "humidity": 0.77,
  "cloud_cover": 0.67,
  "moon_phase": 0.35,
  "precip_type": "rain",
  "pressure": 1017.22,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 2,
  "visibility": 9.88,
  "wind_bearing": 274,
  "wind_speed": 4.16
}