{
  "reportId": "42726",
  "title": "Nighttime sighting by a man walking his dog in a subdivision next to the Ocala National Forest",
  "date": "2013-10-26",
  "timestamp": 1382745600,
  "observed": "I was walking my dog on October 18th, at around 9:00 to 9:10....We had just got back from dinner. We live in a subdivision that backs to the Ocala National Forest. As I was walking towards the end of the subdivision, where there is nothing but open land and empty lots, with some sporadic trees. While turning around, I saw a figure crouching down.  It immediately caught me off guard and quite frankly scared the sh*t out of me.  The minute I spotted the figure, I pulled back on my dog and grabbed my gun.... (I have a permit to carry and we have had a lot of neighbors reporting bears and wildlife in this area) I backed away from the figure and yelled, \"I got a gun, I will shoot you....**and other things.. I had the leash in my left hand along with my flashlight.  As I shinned the flashlight at this figure again, I yelled at it again.. \"I will shoot you, I'm not kidding!\"  Thinking this was a hoax of some kind.  My light caught this figure's face and I got a reflective shine back at me.... The figure stood up and walked behind this small patch of trees.  This figure was huge.  Looked just like a large ape man, covered in hair. I pulled my dog back with me, and got the heck out of the area.  I didn't see where it went to after this.",
  "classification": "Class A",
  "county": "Marion",
  "state": "Florida",
  "latitude": 29.1795,
  "longitude": -82.0435,
  "location": "-82.0435,29.1795",
  "location_details": "Ocala Fl - Subdivision, specific street omitted. I will gladly meet someone back there, talk to someone about it, but do not want to be interviewed, recorded, or my name published. I am a business professional in this community, and just rather not be a part of any backlash or comments.  I know what I saw and I am not crazy.",
  "temperature_high": 74.41,
  "temperature_mid": 61.65,
  "temperature_low": 48.89,
  "dew_point": 48.72,
  "humidity": 0.65,
  "cloud_cover": 0,
  "moon_phase": 0.74,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1022.49,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.86,
  "wind_bearing": 15,
  "wind_speed": 3.7
}