{
  "id": "39610",
  "title": "Fisherman experiences possible daytime activity three consecutive trips near Conconully",
  "date": "2012-05-02",
  "timestamp": 1335916800,
  "observed": "What happened to me occurred at my favorite fishing spot on the upper Conconully Lake near the town of Conconully Washington in Okanogan County. The incidents I am about to tell you about happened on 3 separate visits to this spot but they were in a row. The first time I was fishing and had been there a a couple of hours when across the lake I heard several knocks on trees. I looked for up towards the area they had came from and saw nothing.  The hill side has a lot of trees on it and is very steep and no roads on that side of the lake.  On my next trip to same location had again been there for a couple of hours when I heard a big splash from a very big rock landing in the lake several feet out in the water.  The rock came from the same area I had heard the knocking on my previous trip.  I looked the area over to see if I could see where it had come from and if anyone or thing was in the area. I could not determine where it had come from but it had to come from up the side of the hill.  I could see no one or anything else in the area.  I thought to myself that maybe a bigfoot could have tossed it into the lake cause I could not see any man doing it, as it was just too big a rock and it was thrown too far out into the lake.  On my third trip back to the same location my son Robby was with me.  I had told him of my last two visits to the location and what I had heard and saw.  We spent the afternoon there fishing without incident and were packing on our gear to leave when we both heard up behind us, rocks come rolling and the sounds of something very big moving across the hill side above us. It made both of us a little unnerved.  We did not see anything but it was not something we had heard before. It was not a deer as I have seen them in the area before and they had not had any trouble with the terrain and it could have been a bear but I have not seen any bear in that area before. What ever it was that caused the rocks to slide was big and moving at a pretty good pace. It was too far up the hillside for us to see.  Each time I was there the weather was fine and it was in the early spring. It is a great place to fish and I will continue to go there. I haven't heard of anyone else having any incidents like mine before and I have been back to same location many times since without any more incidents like I have just told you about.",
  "classification": "Class B",
  "county": "Okanogan",
  "state": "Washington",
  "latitude": 48.57806,
  "longitude": -119.6985,
  "location": "-119.6985,48.57806",
  "location_details": "",
  "temperature_high": 56.71,
  "temperature_mid": 49.815,
  "temperature_low": 42.92,
  "dew_point": 32.54,
  "humidity": 0.57,
  "cloud_cover": 0.66,
  "moon_phase": 0.37,
  "precip_intensity": 0.0015,
  "precip_probability": 0.52,
  "precip_type": "rain",
  "pressure": 1011.77,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 9.85,
  "wind_bearing": 190,
  "wind_speed": 2.2
}