{
  "reportId": "28525",
  "title": "Possible vocalizations and stick structures found in Bachelors Grove Cemetery",
  "date": "2010-11-02",
  "timestamp": 1288656000,
  "observed": "The following on-site interview was conducted by Stan Courtney on the 2nd of Nov 2010. The first name of the witness has been changed. Stan - How long have you been coming out here? Mark - I've been coming out here longer than I want to say, it's like early 1970's. Stan - And then how long have you been coming out here as a researcher? [ Bachelors Grove Cemetery in Cook County Forest Preserve ] Mark - I've been here, on and off, for ages. But the last three or four years I've been out here a lot. I'll spend an entire day just walking through the woods. That is when I started noticing things and I never realized what it may have been. [ A large teepee, pyramid structure, Cook County Forest Preserve ] Stan - The area we are standing next to right now, I don't know whether you would call it a structure but it is a group of about ten or fifteen trees that have all been pushed as a big teepee-like structure. Mark - They have been bent, they aren't all dead either. Stan - Has this structure always been here? Mark - I can't remember. Back in the 1980's I never really came back here that much, but it has been here the last ten years or so. And at one point there was much more of a structure. Somebody or something has taken some of it apart. Stan - Other than this particular structure have you found other things that you found interesting? [ One of several live trees that appear to be bent over and pinned to the ground, Cook County Forest Preserve ] Mark - Yes, there are unusual bent trees through-out the woods. I've never understood what goes around pulling full-grown trees over. If a tree breaks in a storm they usually snap or they de-root, these are just broken like at a four, five or six foot level like they have been yanked, fibers are still all connected, it just appears to be pulled over, there are dozens of them throughout the woods. In the area we are standing in now, there are all these broken logs all over the place. Stan - Have you been out here at night? Mark - Yeah, but not for ages, when I was a kid we did. But there are weird noises here. I have heard numerous stories of weird howls and growling. Stan - What have you heard yourself? Mark - I have heard deep growling before, just a couple times and I don't know what it is. It wasn't wind, there was definitely some real deep gruffy kind of moaning, growling sounds. Stan - What about footsteps? Have you ever heard footsteps? Mark - Oh yeah, you hear those out here a lot, but there are deer out here and everything, but sometimes when you walk down the path, that path is quite aways through the middle of the woods to get out here, and you're being followed sometimes. I come out here myself when there is no one else around and I'll swear I'm being followed sometimes. Stan - Earlier today there were sirens going off and we did hear what I thought was a howl. It was about 200 yards distant. So we heard something this morning that I don't think was a siren. Mark - I actually did at first but after I started listening it was a different noise than the siren. Stan - What about smells? Mark - Others report weird smells, real like freaky dead smells, that will come all of a sudden all over you. Stan - And you've smelled that? Mark - Yeah, I don't know how to describe it, we just call it death, kind of a weird freaky smell. Stan - This is an interesting area and of particular interest to me is that it is in Cook County. We're not talking about a so-called wilderness. Tell me about this woods and does this connect to other woods. Mark - This is actually the biggest section of woods in all of Cook County, it's massive, it runs from one side of the county to the other. If you look on a map it's huge, you might have to cross a street but once you cross you're in another massive forest preserve. Something could hide here anywhere it wanted. The woods go into Will County, it is a gigantic forest preserve. Stan - Does it connect up to any rivers or major streams? Mark - Yes, you can get to that side too, this actually goes all the way to IL 45. On the west side of IL 45 this runs all the way up to 55, the Interstate, this is just a massive area. All you have to do is just cross the street. Stan - In other words, nothing would have to be permanent in here. Mark - No, something in here could be cross town in the next day with no problem, and basically we are on the fringes where there are still rural areas. The woods are so interconnected that technically something could walk from here to the Joliet area if it wanted to, going at night it could just cross the fields. Stan - Do you ever get that watched feeling in the daytime? Mark - I actually got it today, I was going to ask you. There are days when I come out here I know I am being watched, just don't know from where. Sometime you come out here it's like being in the park, it's a nice beautiful forest reserve, and other times you come out it is just so creepy, you just feel like there are eyes everywhere. Stan - And did you say that you had stuff thrown at you before? Mark - Numerous things we've had things thrown at us, not acorns but those bigger nuts. They've actually smacked us before. I was out here with a friend where we had a log, six inch thick by six foot long physically fly out of the trees and land within about three feet of us. Then we actually left, looked up and said \"We can take a hint\" and then we walked out of here. Its just logs don't fall out of the sky very often. Stan - Have you ever experienced a bluff charge? Mark - No. There are deer out here too, but you will also hear something crunching because this is thick woods and then all of a sudden you hear nothing. Stan - Have you ever heard woodknocks? Mark - You know, to be honest, I probably haven't paid attention, I might have, I never looked at it from this point of view. We have a huge deer population, we have water right there. These are such thick woods, we're talking fall now, you should see this place in the summer, you can't see in here at all. Stan - It's a beautiful forest preserve. Mark - Yes, it is a neat forest and it is exciting to find out that what we have been seeing and hearing is indicative of possible sasquatch activity.",
  "classification": "Class B",
  "county": "Cook",
  "state": "Illinois",
  "latitude": 41.63243,
  "longitude": -87.76622,
  "location": "-87.76622,41.63243",
  "location_details": "Bachelors Grove Cemetery which is near the intersection of 143rd Street and Ridgeland Avenue.",
  "temperature_high": 51.69,
  "temperature_mid": 42.315,
  "temperature_low": 32.94,
  "dew_point": 29.68,
  "humidity": 0.62,
  "cloud_cover": 0.06,
  "moon_phase": 0.87,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1029.57,
  "summary": "Clear throughout the day.",
  "uv_index": 2,
  "visibility": 9.94,
  "wind_bearing": 100,
  "wind_speed": 5.47
}