{
  "reportId": "2806",
  "title": "The \"Big Muddy Monster\" flap of Murphysboro",
  "date": "1980-11-15",
  "timestamp": 343094400,
  "observed": "In the early eighties and late seventies many  incidents concerning what could only be classified as an unidentified homonid were reported in the area of Southern Ill. In particular, the area of Jackson Co. and the town of Murphysboro. The sightings also included Carbondale. The (for lack of a better term) \"creature\" or \"creatures were seen, heard, and even smelled for quite a few years. Although sightings have declined or stopped completely there are still plenty of local people who recall the reports as well as the fear they felt during this time. Although some of the finer points of the reports differ there remain some aspects that coincide. Such as: It seems as though the creature used the river (The Big Muddy River) as its main travel way. Most of the incidents occured either around the river or on the river itself. Perhaps the creature used the river not only as a path but also for water and a possible food supply. And a particular point of interest in this case is the fact that this creature was always accompanied by a foul, sour smell. In fact, most reports have the people actually smelling the creature before seeing it. Also my personal favorite aspect of this group of stories is the fact that although confronted with people many times this creaure never became violent or acted in a hostile manner. The differing aspects of this group of  sightings include the color, and size. Some have the color being anywhere from black to brown to reddish. Mostly it was a dirty brownish color and always the hair was matted with mud and plant material no matter the color. Size was estimated from 4 foot to the incredible size of 7 foot tall and weighing somewhere between 120 up to 300 lbs. Most have the creature being the size of a big boned man around 6 foot 4. Even though there were never creatures or even a family group could help explain the many different sizes and colors of the creature. Along with the different light settings and the distances from the creature to the veiwer. Also, as with anything people can't see or understand or fear they will make fun and make up their own stories as a joke. Since the sightings always seemed to originate around the vicinity of the Big Muddy River, the creature was quickly dubbed \"The Big Muddy Monster\" (I worked in a screen printing shop for a while and even years after the sightings we still made Big Muddy Monster T-shirts for the local retailers!). Supposedly, there is at least one article in one of the local papers about all the sightings and an actual warning for those going around the river. I have not seen this yet. I have just started looking, but too many people remember it for it not to be true.The most prolific sighter was an older man who owned a junkyard close to the river. This man was not only the most frequent veiwer but also as far asI can tell the first to encounter the creature first hand. It seems that the man was smelling something rotton in the junkyard and while searching for the smell made the first sighting of the creature. The man became quite used to the creature being there. And after several reports were made and no follow ups on the reports by local authorities the man just co-existed with the creature. Just staying out of the junkyard when he smelled that smell. He also told of many vocalizations ranging from the grunt up to a howl hitting all points in between. Another main story that was repeated over and over was about two men racoon hunting in the river bottoms. It seems as though the hunters dogs got on the trail of the creature and tracked it to an old barn in a field in the bottoms. The men, although armed with small caliber rifles, decide not to gointo the barn when they heard low pitched growling. They said they have been in the woods for years and had never heard anything like that before. One of the men tried to get his dogto go in and it refused so he picked it up and threw it into the open door of the barn. The man said that the dog barely had time to hit the ground when a high pithed shreik rang out and the dog bolted for the cover of the woods with the men close behind running for their truck. With sunrise and another dose of courage and more friends and weapons the hunters returned to the barn to find nothing but foot prints that followed them to the edge of the road where their truck had been the night before. Maybe for an instant the hunters became the hunted. I realize that with all stories the myths and legends grow. The fish that gets away gets bigger and the monster always gets scarier. I've tried to tell the stories as I've heard them. In this small little town you'll find those who believe as well as those who don't. But those who have seen ... have seen. I believe!",
  "classification": "Class C",
  "county": "Jackson",
  "state": "Illinois",
  "latitude": 37.745,
  "longitude": -89.3595,
  "location": "-89.3595,37.745",
  "location_details": "Jackson County  Murphysboro Il. Near Carbondale, 1 1/2 hour east of St. Louis Missouri",
  "temperature_high": 43.65,
  "temperature_mid": 39.075,
  "temperature_low": 34.5,
  "dew_point": 39.84,
  "humidity": 0.89,
  "cloud_cover": 0.97,
  "moon_phase": 0.26,
  "precip_intensity": 0.001,
  "precip_probability": 0.41,
  "precip_type": "rain",
  "pressure": 1022.35,
  "summary": "Overcast throughout the day.",
  "uv_index": 1,
  "visibility": 4.64,
  "wind_bearing": 3,
  "wind_speed": 11.31
}