{
  "reportId": "13237",
  "title": "Daylight sighting near an abandonned mining chamber near Amigo",
  "date": "2005-12-03",
  "timestamp": 1133568000,
  "observed": "I don't know if what I saw was two bigfoots or something else, but one thing I know is they were things I've never seen before. I also know they weren't bears. I worked in the coal mines near a small town called Amigo. What I used to do (my job description) was coal sampler. I would drive around all day collecting coal for chemical analysis, from the high walls to the deep mine. The deep mine is more remote since they just put the belt head in. It is so far from the plant to the deep mines it would take me about 30 to 35 minutes driving in the mountains. Last week I was driving back from picking up a sample and noticed something running back up in the woods. It was two does. Then I noticed something was laying on the ground. I beeped my horn thinking it was a bob cat and up jumped this light tan (just a little bit darker than the deers skin) thing. I froze. It was definitely wasn't a man or bear. All I know is it was walking upright. It did something that looked like it clapped its hands.  Then I watched it kneel down and crawl into an airshaft for an abandonned mine. To my surprise, another one appeared out of nowhere and ran past it. I could tell this one was only a couple inches taller than me (6-7). I do know it was something I’ve never seen before.  The second one kneeled down and crawled into the same airshaft.",
  "classification": "Class A",
  "county": "Wyoming",
  "state": "West Virginia",
  "latitude": 37.58135,
  "longitude": -81.29745,
  "location": "-81.29745,37.58135",
  "location_details": "Heading to the deep mine Poca #2, the airshaft would be on your right hand side. Look a little past the bridge where the stream flows south. All this is private property.",
  "temperature_high": 37.22,
  "temperature_mid": 36.03,
  "temperature_low": 34.84,
  "dew_point": 19.91,
  "humidity": 0.63,
  "cloud_cover": 0.66,
  "moon_phase": 0.07,
  "precip_intensity": 0.0062,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1018.99,
  "summary": "Rain in the evening and overnight.",
  "uv_index": 1,
  "visibility": 9.36,
  "wind_bearing": 188,
  "wind_speed": 1.69
}