{
  "reportId": "27387",
  "title": "Large unknown bipedal animal seen possibly chasing deer near Dixon",
  "date": "2010-02-28",
  "timestamp": 1267315200,
  "observed": "I will try to make this short. I live in Illinois in a rural area, my house is set in the woods and seeing wildlife from the kitchen window is pretty standard. Its middle winter and the visibility into the woods is much better than summer. Anyway its not uncommon to get glimpses of deer running through the woods farther back in the woods at this time of year with the better visibility , although its just that glimpses. So a few days ago in the middle of the day I witnessed some deer running at a rapid pace back in the woods I wasnt able to get a good look at them , but they were running fast , like I said the visibility wasnt great , but I saw what I thought was a larger upright looking animal chasing behind the deer. I jokingly said to my mom who was trying to see what i was watching \"its a bigfoot\" not really believing that I got a  good enough look to concur it was anything. Then today my mom told me she was walking the dog in the woods and found a huge piece of poop with fur in it... I just wanted to pass this info along to you incase it interest you .. I live in gran detour illinois , I searched some sites and in the 70's there were casting of footprints made in the area...contact me with any questions",
  "classification": "Class B",
  "county": "Ogle",
  "state": "Illinois",
  "latitude": 41.90703,
  "longitude": -89.41539,
  "location": "-89.41539,41.90703",
  "location_details": "",
  "temperature_high": 37.45,
  "temperature_mid": 34.365,
  "temperature_low": 31.28,
  "dew_point": 25.79,
  "humidity": 0.76,
  "cloud_cover": 0.8,
  "moon_phase": 0.51,
  "precip_intensity": 0.0001,
  "precip_probability": 0.27,
  "precip_type": "snow",
  "pressure": 1017.72,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 9.97,
  "wind_bearing": 337,
  "wind_speed": 5.38
}