{
  "reportId": "50123",
  "title": "Audio recording of possible screams, growls, and fight with a dog from the Late 70's near Prosperity",
  "date": "1978-10-01",
  "timestamp": 276048000,
  "observed": "I HAVE AN AUDIO TAPE OF THIS EVENT, IT HAS NEVER BEEN HEARD BY ANYONE OTHER THAN A FEW NEIGHBORS AND FRIENDS AROUND THE TIME THIS HAPPENED.   It was a fall evening, I was doing homework at our trailer, which was 1/2 mile from where my dad was building our house. He would get home from work around 4:00 and work out there till 10. One evening he came flying out the road in his truck and pulled in the driveway, then ran to the trailer asking my mom for the tape recorder. I was curious and asked him what was going on, he said that there was something in the valley fighting with a dog. So I grabbed my coat and wanted to go see, he let me go with him, but told me to stay in the truck, I didn't listen and tried to follow him. So he told me to stand by the cows feed trough, which was near the house at top of field. He grabbed a wooden club and put the tape recorder in his shirt pocket and started walking down the hill towards the noise. I remember that when this creature growled, it shook the ground where I was standing, about 200 yards away. I was scared, and even more scared for my dad, who was now about half way to it. Another weird thing was that the 6 head of cattle we had were standing head to head in a circle at the edge of the woods. It took my dad about 5 minutes to get to the woods, where this creature was fighting a dog, you can hear the leaves crunching under every step he took. But when he got nearer it was too dark in the wooded valley for him to see the creature. So he returned back up the hill. The entire time that the recorder was on, you can hear this earth moving growl along with a dog fighting with it. Oddly, our neighbors dog (HENRY), who came around a lot, was never seen or heard from again. My dad wouldn't let me go near that valley for a while, but eventually I was allowed to go down there.  And when I did, I looked around the area I heard the battle, and found a bunch of deer hair and bones scattered around a 20 foot area, But no (HENRY). Back when this happened I was about 8-10 years old, and didn't think of looking for hair samples or DNA, or even footprints. Looking back, I wish I would have thought of all that stuff. But I do still have the tape recording, I really want someone from the BFRO to take this tape and get it transferred to digital. Everyone of our neighbors listened to this tape, and no one can say what it is for sure. I told my cousin about this event a few weeks after it happened, and her eyes got big and told me that one of her friends and her mom seen some big creature walking through a field below their house. The thing that made me wonder if it was the same creature is that her friend lived no more than 4-5 miles from me.                                                                                                                                                                                                                                                                                 This Event happened in Washington county, Pennsylvania                                                              On our 10 acre farm in Morris Twp. around 1978-1980",
  "classification": "Class B",
  "county": "Washington",
  "state": "Pennsylvania",
  "latitude": 40.04755,
  "longitude": -80.25645,
  "location": "-80.25645,40.04755",
  "location_details": "",
  "temperature_high": 65.34,
  "temperature_mid": 56.31,
  "temperature_low": 47.28,
  "dew_point": 54.89,
  "humidity": 0.83,
  "cloud_cover": 0.82,
  "moon_phase": 0.98,
  "precip_intensity": 0.0025,
  "precip_probability": 0.65,
  "precip_type": "rain",
  "pressure": 1017.55,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 6.11,
  "wind_bearing": 275,
  "wind_speed": 3.36
}