{
  "id": "856",
  "title": "",
  "date": "",
  "observed": "Well, my younger brother saw it when he was around 8-9 years old, in the late '70's. Our home was somewhat isolated and had  woods all around it.  We  played in the woods a lot.  He told me that once he saw \"Chewbacca\" standing in the woods watching him.  Over the years he heard weird noises coming from the woods when he was walking down the road, like screams and grunts that were almost like words.  He describes them as \"chanting\"  or sing song. Also, while by myself in a field beside our house, I heard a very frightening noise coming from the woods at the edge of the field; like growling and snarling  coming from somewhere behind the trees.  I saw nothing, but the best I can tell you a very large animal made those noises. Since the noises were loud I could tell the direction they were coming from easily and it was way above my head from the tops of the trees.  I never heard any animal before or since that made a noise like that. Being around 10 or 11 years old, I didn't hang around to check it out, but later I told my brother and he related to me about the time he saw \"Chewbacca\".  Then one of us wondered out loud, \"Was it Bigfoot?\"  To this day, we don't know.",
  "classification": "Class B",
  "county": "Allegheny",
  "state": "Pennsylvania",
  "location_details": "Traveling outbound from Pittsburgh, PA on Ohio River Boulevard, go straight through communities of Belleview, Avalon, Ben Avon until you reach Emsworth.  When you reach Camp Horn Road, make a right.  Go about a quarter of a mile and make a left onto Eicher Road.  Go up Eicher road to where it forks, make a sharp left, go up that part and you will be on Roosevelt Road.  Now you will see straight ahead of you almost a very large hill, a long driveway with a small house at the top.  In the 1970's behind this house was a field with woods behind it.  That is where I heard those noises.  Now, make a right turn onto Roosevelt Road and drive up past the woods on your left, those are the woods my brother heard strange noises.  At that time the woods went back for miles behind the house, that is where he saw Chewbacca. I won't tell you which house it was we lived in, I have not been around there since 1980, and those people living there now don't want to be bothered, maybe they would even sue me.  For all I know, those woods have even been cut down.",
  "summary": ""
}