{
  "id": "28797",
  "title": "Fishing couple describes possible rock throwing on reservoir 10 miles south of Huntington",
  "date": "2002-07-01",
  "timestamp": 1025481600,
  "observed": "My wife and I were night fishing for catfish on a Wednesday night on the Salamonie Reservoir when our occurrence happened. We were in a boat, at a remote part of the reservoir not accessible by vehicle or foot.  The nearest road is over 1 mile away. There was no one else at the boat dock when we put in, and I saw no other boat or boat lights on as we motored to are fishing spot.  We were sitting there fishing for about 3 hours. It was roughly 3-4 a.m. and we were sitting roughly 30-40 feet from shore.  All of the sudden there was something thrown at us from shore, something very large and heavy.  The object thrown at us had to have weighed in the neighborhood of 30-60 lbs. by the splash it made in the water about 10 feet from the boat. I instantly grabbed the 5 million power spotlight and lit up the area on shore. There was nothing.  We sat there for about 5 minutes with the light on shore discussing what had just happened. We then decided no human couldn't have possibly been there being so remote, nor threw something that heavy that far.  The splash actually made waves enough in the water to move the boat. I then started the boat and made fast tracks for the boat ramp. I first thought it might have been just kids messing around, but, like I said, nothing moved near shore for 5 minutes. I had the whole shore line illuminated, and the object, probably a rock from shore, was very, very heavy by the splash.",
  "classification": "Class B",
  "county": "Huntington",
  "state": "Indiana",
  "latitude": 40.74765,
  "longitude": -85.57069,
  "location": "-85.57069,40.74765",
  "location_details": "If you cross over State Road 9 going south, look to the left, as you can see, that is the idle only part of the Salamonie Reservoir, it is not near any county roads, no campgrounds, no homes, nothing is back there but woods and water.",
  "temperature_high": 90.94,
  "temperature_mid": 80.99,
  "temperature_low": 71.04,
  "dew_point": 71.17,
  "humidity": 0.72,
  "cloud_cover": 0.12,
  "moon_phase": 0.72,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.72,
  "summary": "Humid throughout the day and partly cloudy until afternoon.",
  "uv_index": 9,
  "visibility": 7.79,
  "wind_bearing": 253,
  "wind_speed": 5.83
}