{
  "reportId": "9796",
  "title": "Man recalls multiple witness incident as a teenager camping south of Cloquet",
  "date": "1977-09-03",
  "timestamp": 242092800,
  "observed": "This happened a long time ago, I just found your website and I thought I might as well talk about our incident.  Those of us involved do not talk about it much, I probably the most.  There was 6 of us and we were camping on the Otter Creek south of the airport in Cloquet, MN, Carlton County.  It had to have been in 1977. I was 16 and the others were 15-16 years old.  This was my fishing and camping site on the pipeline and I had built a lean too and we were all out there that Friday evening drinking some beer and going to fish for trout in the morning.  We had a camp site with a fire pit and we had a good bon fire going.  We were sitting around the campfire it must have been around 9-10 P.M. We were not drunk out of our minds.  In the distance we heard this walking coming from the east in the woods following the creek.  I had been chased by a bear out there on occasion so I felt it was a bear coming down the creek.  Then it sounded like a person walking through the woods so we thought it may be the Game Warden, who knew all of us kids and he may be checking for trout lines.  Then came the odor, Worst case of B.O. I have ever smelled to be honest. I again thought this is a bear because of the smell and I started to get a little nervous because we had food out there but it was hung up in a tree. As it approached us, it came far enough into the light to show a shadow.  It was on 2 legs standing up, very tall, every bit of I would say 8 foot, and walking in very huge strides, swinging it arms, making alot of noise.  It stayed enough away from us and circled to our south and stayed close enough to see the shadow. Once it circled us it was back on it's line heading west as it had been the whole time we had heard it coming, following the creek bed.  We were all so scared as to who or what it was we sat in silence around the fire as it passed, watching, and not sure of what we were watching. Again I can tell you the smell was obnoxious.  To be honest, I have smelled bears before and since, and they really do not have that kind of obnoxious odor. As I said before, I am the only one that really talks about it, seeing your web site I see back in that time period there were several sightings in St. Louis County which is a county bordering Carlton County.  I had no idea there had been sightings in this area before.  I can not say for sure what it was because all I seen was a shadow. But a srange type of shadowed figure to see in the woods. A bear could not walk that long on 2 legs, plus a bear does not take the strides that this creature did.  The only thing I can come up with is that we had an experience with a Big Foot.  We never did go and look for foot prints the next morning.  I think we were all glad it did not come into our camp because we had no clue as to what it was.  I have no reason to tell a story about this and I am not known by people as a story teller.  Seeing your web site, I felt it belongs here.",
  "classification": "Class B",
  "county": "Carlton",
  "state": "Minnesota",
  "latitude": 46.69303,
  "longitude": -92.49979,
  "location": "-92.49979,46.69303",
  "location_details": "Off of Moorehead Road, you come to the Pipeline and go North untill you come to Otter Creek. We camped at the south bank on the west side of the pipe line.",
  "temperature_high": 68.39,
  "temperature_mid": 61.935,
  "temperature_low": 55.48,
  "dew_point": 49.01,
  "humidity": 0.77,
  "cloud_cover": 0.42,
  "moon_phase": 0.69,
  "precip_intensity": 0.0192,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1021.71,
  "summary": "Rain starting in the evening.",
  "uv_index": 4,
  "visibility": 9.31,
  "wind_bearing": 139,
  "wind_speed": 3.82
}