{
  "reportId": "48354",
  "title": "Woman recalls scary night while at a Girl Scout campground in Bear Brook State Park",
  "date": "1970-10-31",
  "timestamp": 26179200,
  "observed": "In one part of Bearbrook State Park is the Girl Scout Day Camp location. Across the street from New Rye Rd is the Camping Museum & the Snowmobile Museum. There used to be a nature museum. If you keep going straight on that dirt path, you wind yourself up into the Girl Scout Campground. It was a 2 week event. The older campers were allowed to have a single overnight in the last few days. It was '67/'68, late July. There were 3, 5-person tents, I was a senior and in the tent closest to the woods. The evening was spent cooking hotdogs & hamburgers & marshmallows & sa'mores with lots of singing laughing & screaming. We all retired around 10 pm. In the middle of the night, around 1 or 2 am, I was woken by something softly grunting & pushing down on the top of the tent. We have racoons but no bears in (I get the irony) Bear Brook State Park. The other girls in my tent were trying to stay quiet, but still panicking not so quietly. I said \" it's just one of the other girls.\" I am a camper since age 9 with a father who was a practical joker. So I said loudly \"That's not how you do it. This is how it is done\" & I dug my nails into the canvas & making a roaring growling sound clawed down the canvas hard & fast & hit something soft but solid on the outside of the cloth. I was picturing a man's hand/fist kind of like knuckles???. There was a loud grunt/growl & crashing away from us through the underbrush just on the other side of the tent. Now the girls in my tent are screaming hysterically about bears, The rest of the campers are opening my tent and all pandemonium broke loose. No-one admitted to playing a prank. & the leaders in the other 2 tents all day insisted everyone was accounted for & no one had left the tents not even a potty run. There was a funky smell though, that no-one could recognize. The park rangers swore there were none in the area, they were all up north for the summer. We had never heard of bigfoot, I fear I am repeating myself, so didn't even know such a thing existed. So, unexplainable incident, that with hindsight, I am thinking, could it have been??? The entire area, for square miles, has always been swarming w/ deer, even still, today.",
  "classification": "Class B",
  "county": "Merrimack",
  "state": "New Hampshire",
  "latitude": 43.11074,
  "longitude": -71.35414,
  "location": "-71.35414,43.11074",
  "location_details": "Don't know any closer than that. It was midnight with no street lights, just highbeam headlights, moon & stars. The west end of Deerfield Rd is Route 28 in Allenstown.",
  "temperature_high": 56.27,
  "temperature_mid": 45.16,
  "temperature_low": 34.05,
  "dew_point": 32.1,
  "humidity": 0.73,
  "cloud_cover": 0.57,
  "moon_phase": 0.04,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1032.91,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 9.14,
  "wind_bearing": 140,
  "wind_speed": 1.24
}