{
  "reportId": "19232",
  "title": "Motorist spots a tall unknown figure crossing Walter Boardman Loop",
  "date": "2007-05-19",
  "timestamp": 1179532800,
  "observed": "On the 19th of May 2007 at around 8:30 AM, My Wife and I were on our way to the local bait shop on the Flagler/Volusia county line in central Florida. Our usual route to this shop at Highbridge Rd. is via Old Dixie Hwy through Walter Boardman also known as \"the loop\". I was turning left off Old Dixie onto Walter Boardman and I looked ahead on the road and saw 2 vehicles approx. 1/2 mile in front of me on Walter Boardman. At that instant behind the vehicle  closest to me I saw a tall, dark figure on 2 legs swiftly cross the road from south to north. The figure that I saw was taller than the vehicle ahead of it and it appeared to cross the road in 3 or 4 stiff-legged strides. I said to my Wife \"did you see that\"? She replied that she had not as she was looking for something in her purse, by that time it was already in the woods. I sped up to reach the area where the figure crossed the road, my Wife and I scanned the woods where it had disappeared and saw no trace of it. I knew right away that this was not a regular animal or man because it was extremely tall, dark and fast, although it did not appear to be running, the strides covered a great distance.We continued towards our destination and arrived at Bulow Plantation Ruins, a state park where we fish. We mentioned what I had seen to the Ranger who dismissed it as a black bear. I disagree, it was lean and too fast to be a bear walking on hind legs. I wish that I could have gotten a better look up close but I have and will continue to look carefully as I drive \"the loop\" for another sighting of this very interesting creature.",
  "classification": "Class B",
  "county": "Volusia",
  "state": "Florida",
  "latitude": 29.3396,
  "longitude": -81.0834,
  "location": "-81.0834,29.3396",
  "location_details": "",
  "temperature_high": 79.81,
  "temperature_mid": 69.5,
  "temperature_low": 59.19,
  "dew_point": 56.4,
  "humidity": 0.55,
  "cloud_cover": 0.36,
  "moon_phase": 0.11,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.7,
  "summary": "Partly cloudy until evening and breezy until afternoon.",
  "uv_index": 11,
  "visibility": 9.64,
  "wind_bearing": 40,
  "wind_speed": 13.26
}