{
  "reportId": "4182",
  "title": "",
  "date": "",
  "observed": "I believe this event took place in the late 1970’s to the very early 1980’s.  My best guess is 1978 or 1979.  My father, mother, younger brother and I were camping in a State Park off of Highway 101, in Mendocino County, CA.  Our parents were in their late thirties, I was 16 or 17 and my brother was 10 or 11.  (Of course these ages are approximate and may have been a year or two less or more).  We also had our dog with us, a 60-pound Black Lab - Dalmatian mix.  It was late July to early September and very likely Labor Day or the weekend after Labor Day. The park in situated on both sides of the Eel River, and is for the most part second growth or new growth Redwood forest mixed with other trees and brush of the area.  The main section of the park is next to Highway 101. The far side of the park, away from the highway and across the river, is only open from the end of May to the middle of September.  The rest of the year the access bridge is removed and stowed above the high water line. The far side of the park has more foliage and is frequented by bear, deer, raccoon, skunks and other animals.  We were camping on the far side of the park as far up the hill as possible. I believe this event occurred toward Labor Day or the weekend after Labor Day for the following reasons; we had something of a ritual in making a final “end of the Summer” trip to this park, the park was very quiet meaning other campers had made an early start home to avoid holiday traffic or were not there at all being the weekend after Labor Day, and on this particular morning my father stayed in camp to do some paper work.  He was a high school math teacher so he usually did lesson plans or other work only in the late summer. Mom, my brother, the dog and I decided to take a short hike up a trail on the edge of the campground.  The trail worked its way up over the crest of the hills for about two miles and ended above a barn and farm located in a clearing at the bottom of the other side of the hills.  The trail is mainly up hill, makes several cut backs, and passes across two or three unpaved fire roads.  It was a clear sunny day and there was no one else out on the trail. Our dog liked to take the point position to see the animals ahead.  She was an avid hunter of rabbits and liked to chase deer.  I had often seen her race after deer, taking dangerous inclines and thick brush at full speed.  On this day I do not recall her scaring up anything to chase.  The three of us talked as we went up the trail.  During the last half mile to quarter mile of the trail my mother gave us a serious order to stop. We paused while she looked and listened to an area behind us to our left.  She asked if we heard any thing, but I do not recall if my brother or I did. We walked on, more slowly now, listening to the forest.  After about 50 yards we felt like we could hear something moving in the woods, behind us to our left, and once again stopped.  The noise stopped when we stopped.  This time we indicated that we did hear it.  The dog was in the middle of the trail listening as well but did not go into the brush to investigate.  We continued on now for another 50-100 yards and we were almost to the crest and the vista area.  Again we thought we heard the noise paralleling us to our left but were not 100% sure.  We all stopped again.  Before we could again acknowledge the sound, there was a loud wooden knocking noise off to our right.  It was 3-4 quick “knock - knock - knock – knock”.  Initially I thought it was two tree trunks rubbing together in the wind.  I looked up to see if I could see anything, but there was no breeze.  Before I could look back down, there was a loud forceful huffing of air coming from the bottom of the tree.  It was something like a growl but not quite.  It was low and guttural, and was a rapid exhalation of air from a very large animal. Whatever it was, that was enough for us.  It was my mother who spun around and said, “Let’s go.”  No one disagreed and we turned and sprinted all the way back to camp.  I think we covered the two miles without a stop.  Instead of taking the lead, the dog took up the rear position, which in my mom’s opinion was meant to protect us from whatever was behind us.  This was the first and only time we heard anything like that and was the only time we have ever even contemplated running in fear during a hike.  I do not recall any smell in the area. The incident has never felt right to me and I have thought back to it on several occasions.  My mother has always thought that a bear was stalking us.  (She has always had a very strong apprehension of bears, and always warned us not to get between a cub and its mother, or try to feed a bear or approach any bear.  Nonetheless, we have chased them away on more than one occasion.).  I have heard of stalking behavior in bears before, but only in grizzlies, browns and polar bears – not in the California black bears.  Additionally, the behavior of the animal did not seem like a bear either, and did not elicit the response from our dog that I would have expected for a bear. I discovered this site about 12 months ago and the similarities of other’s reports with my incident made me think that this was a bigfoot.  Assuming the accuracy of other’s stories, it seems to be a more plausible explanation than being followed by a bear as well, as a better fit with the facts.  I spoke to my mother recently about it and she still felt it was a bear, besides she said, “Bigfoot are only up in the Pacific Northwest.”  I separately spoke to my father about this site and he thought I was pulling his leg.  After I told him that I believed the stories were sincere, and told him some of the common details of the events, he immediately brought up that time “you guys came running down from the trail.” I did not send this sooner because it is a class B and twenty plus years old already.  I have heard a couple of stories regarding other incidents, but none that I have first or second hand knowledge of. What may be of interest is that I have seen a nest like the one in Report 2928.  I cannot recall exactly where I saw it but it was within the last 5 years.  It was some where in the Sierras, and I think it was in the Mammoth Lakes area.  I recall being off trail, cutting between lakes, or trying to relocate a trail when I saw it.  In any case it was well off the trail and quite a way from the town or trailhead.  Thinking it was a human’s hand made shelter, I was surprised at the amount of effort that must have went into building the little A frame.  It was tucked in between some tree trunks and the roof was a tight thatch of broken limbs.  It just struck me that a tent would have been easier to move and set up, and would have afforded better protection overall.  I glanced around but did not see any garbage or clothes or other signs of a camp.  There was no smell that I recall.  I was also surprised at how far away the nest was from the town – whoever this belonged to was trying to stay well away from the trail and others.  I guessed that it must belong to someone that really wanted to be left alone, so I went on my way.",
  "classification": "Class B",
  "county": "Mendocino",
  "state": "California",
  "location_details": "Standish - Hickey State Park. Across the river, the upper end at the south corner of the camping sites area, there is a trail that goes up over the hill.",
  "summary": ""
}