{
  "id": "43733",
  "title": "",
  "date": "",
  "observed": "My father-in-law called me around 4pm on January 12, 2014 and told me he had went out to burn trash and found some strange tracks leading from the woods into his backyard in the snow.  I went over with my camera and a tape measure to see what it was.  Until yesterday we had about 15 inches of fluffy snow on the ground.  Yesterday it had warmed up and rained and we lost about 7 inches of that snow so I thought that the tracks were probably just a deer or dog and between the rain and melting snow the tracks had appeared larger than they really were.  When I got there I was first impressed with the size of the tracks.  It was definitely not a deer or dog.  I began taking pictures of the tracks and have several pictures of them.  I also measured the tracks which measured 17.5 inches long.  What really impressed me was the stride between steps.  All of them were at least 2.5 - 3 feet apart and several were more including one that I took a picture of, with the tape measure in the picture with a stride of 4.5 feet.  My father-in-law is 6'2\" and he could not duplicate the stride especially with the snow on the ground.  Also, he wears a size 13 boot and his tracks were not near as big and wide as these were.  I have pictures with the tape measure for reference to show the size and stride of the tracks and steps.  We followed the tracks into the woods and they lead to a ridge that dropped almost straight down approximately 100 - 120 feet to a creek bottom.  Whatever made the tracks actually walked straight up that ridge and you can see the tracks in the pictures I took.  We couldn't do it because we just kept losing our traction and slipping.  The tracks never slipped.  This thing walked straight up the ridge without missing a beat.  The deer tracks and coyote tracks all went along the ridge but nothing else walked straight up it.  No human could have done that especially with all the snow we had, not to mention I don't know any human with a 17.5 inch track and 4.5 foot stride.  Also, beside one of the trees that the tracks went by there was an area about 3 feet in diameter that was yellowish brown.  It appeared to be urine.  I collected a sample of the yellow snow and put it in a plastic container and put it in my freezer.  My wife and I own an assisted living home for elderly and developmentally individuals.  We are well known in our community and I am known for my honesty.  I am not trying to get attention or make up some far fetched story.  I don't know what exactly made these tracks but it was something large and heavy and did things that I don't believe any human I know could do.",
  "classification": "Class B",
  "county": "Hillsdale",
  "state": "Michigan",
  "location_details": "This portion of land is along what is known as Lost Nations Game Area in Hillsdale County.  It is several hundred acres of wooded land with deep creek bottoms and high ridges.  It is mainly all hardwoods along with pines and swamp land.",
  "summary": ""
}