{
  "reportId": "17292",
  "title": "Late night sighting by motorist near Decker Montana",
  "date": "2007-01-15",
  "timestamp": 1168819200,
  "observed": "Hi, My name is [J.G].  I was driving for express shuttle.   My job was to deliver railroaders to their train.   Or to move crews from one train to the other.   A few months ago, I saw something that just wasn't right.   No crew in the van because I'd been called to the coal mine to move one crew from a train to another train at the mine. On the way out there, it's a long lonely road at night.   I dropped down over the Decker hill and something was walking along the right hand side of the road.   There's always Indians, \"Native Americans\" walking out that road looking to get a ride.   That's what I thought I saw.   But it walked across the road in front of me.   I had to hit the binders hard.   It wouldn't look at me.   Just stood on the left shoulder of the road.   It did kind of look over it's shoulder at me but I didn't get any facial features.   It swayed when it turned. I did notice that it had long hair, almost like it was groomed. Probably 8-10 inches long.   Couldn't tell you what color it was because it was almost midnight and it was in the headlights. The next day, I had to make a daylight run.   I stopped and measured bushes, fence, and such.   This thing was at least 8 feet tall.  I looked for hair on the barbed wire, or tracks.   Nothing. This happened in the old town of Decker Montana.   Decker was moved with the coal strike.   I remember where the old town was.  When you are driving North, you drop over a hill and the town was on the left.   My mother in law used to have the restaurant.   But it's gone now.   However, this is where I encountered him/her when I dropped over the hill. I did see deer before and after the sighting.   It was almost like they weren't worried because they were within 200 yards. Go ahead, call me a crack pot.   All my friends have.",
  "classification": "Class A",
  "county": "Big Horn",
  "state": "Montana",
  "latitude": 45.0262,
  "longitude": -106.8331,
  "location": "-106.8331,45.0262",
  "location_details": "The old town of Decker.  It's not there anymore.   They wanted to mine coal under it, so they moved it.   But the sighting was right at the old town of Decker.",
  "temperature_high": 21.26,
  "temperature_mid": 14.785,
  "temperature_low": 8.31,
  "dew_point": -2.39,
  "humidity": 0.63,
  "cloud_cover": 0.25,
  "moon_phase": 0.88,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1032.82,
  "summary": "Mostly cloudy starting in the evening.",
  "uv_index": 1,
  "visibility": 9.94,
  "wind_bearing": 246,
  "wind_speed": 7.02
}