{
  "id": "25768",
  "title": "Man recalls a possible brief sighting near Buchanan, while looking for dog",
  "date": "1993-02-07",
  "timestamp": 729043200,
  "observed": "My dog had come up missing and I heard him barking far away and kept on calling him.   We lived in a very wooded area, so his barking was hard to hear.   When I found him, he was on a beaver  dam in the middle of a pond.  I never told this to anyone, not even my wife.  It just seemed so unreal.  When I saw my dog, he was looking to his right and that is when I saw a figure some seven to eight feet tall.   it stood there for what seemed minutes, but was most likely only seconds. It was very muscular and I knew what it was and only could be.  A bigfoot?  It couldn't be, but it had to be.  We don't have bears this far south in michigan.   Anyway, it ran off, away, from me and was gone so fast I even doubted if it was even there in the first place.   It was in the dead of winter and I had a very hard time getting my dog, a german shepard to come off the beaver dam.   We walked back to our house and I never told anyone about this. My wife had seen a cougar cross the road in front of her three days before that and I ripped her about seeing things, so there was no way I was going to tell her this.   That is about it.   Really nothing else to tell, thanks for listening.  I am interested in more research or being part of any research.  It has really peaked my interest since this happened to me.   Now I dig up anything I can.",
  "classification": "Class B",
  "county": "Berrien",
  "state": "Michigan",
  "latitude": 41.77945,
  "longitude": -85.99374,
  "location": "-85.99374,41.77945",
  "location_details": "take warren woods road out of Buchanan to Boyallake rd. go right on boyallake rd to 15001 address and then walk across the st. back into the woods about a qaurted of a mile to pond",
  "temperature_high": 39.19,
  "temperature_mid": 36.05,
  "temperature_low": 32.91,
  "dew_point": 23.2,
  "humidity": 0.8,
  "cloud_cover": 0.68,
  "moon_phase": 0.53,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.57,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 6.3,
  "wind_bearing": 212,
  "wind_speed": 6.37
}