{
  "reportId": "9811",
  "title": "Hunters hear early morning vocalizations near Mossy Rock",
  "date": "2004-11-12",
  "timestamp": 1100217600,
  "observed": "On 11/12/04 my husband and I were hunting in the Mossy Rock, WA area in a clear cut next to a stand of timber, (This was about 6 days after opening day of Elk season.) It was about 0710, and a clear, dry, morning. Rob, my husband, was about 50 yards from me closer to the woods, I was on the upper part of the clear cut, I had heard the tail end of the first scream.  Rob had asked me, \"if I heard that?\"(We had ear bob radios on) I stated,\"Yes'\" than about 1 minute later, we both heard another Scream! Very close and very Human like.  When Rob reached me, I told him that, \"That! was Bigfoot!\" He said, \"That's what I thought!\" I have seen documentaries on Bigfoot,  however, Rob never has, so he had no idea what Bigfoot might sound like.The area was the 520 GMU, but if you need more info. just E-mail me back. Both of us are in a branch of Law Enforcement, so most everyone we know thinks we were hearing things, however, both Rob and I grew-up in the woods and wide open spaces both of us know, that was nothing he or I have ever heard!!! I am an Animal Control Officer for Pierce County and the closest thing that it may have been other than the scream off the doctumentary, was a half human, half baboon in a leg hold trap, really pissed off! ",
  "classification": "Class B",
  "county": "Lewis",
  "state": "Washington",
  "latitude": 46.44165,
  "longitude": -122.3416,
  "location": "-122.3416,46.44165",
  "location_details": "",
  "temperature_high": 50.76,
  "temperature_mid": 48.515,
  "temperature_low": 46.27,
  "dew_point": 41.97,
  "humidity": 0.92,
  "cloud_cover": 0.68,
  "moon_phase": 0.01,
  "precip_intensity": 0.0003,
  "precip_probability": 0.2,
  "precip_type": "rain",
  "pressure": 1020.84,
  "summary": "Foggy in the morning.",
  "uv_index": 1,
  "visibility": 4.31,
  "wind_bearing": 137,
  "wind_speed": 2.86
}