{
  "reportId": "7940",
  "title": "Bother and sister are followed by a brown, hairy creature walking on two legs",
  "date": "1980-08-25",
  "timestamp": 336009600,
  "observed": "I was at home when my brother called to say that he had run out gas and needed me to walk the gas can down to his location which was about 3 blocks away. Upon arriving at the location, he was looking in the direction of the creek bed next to his parked car. He claimed he could hear something in the weeds moving around and complained of a nasty smell coming from the area. When I arrived, I immediately noticed the smell he was talking about and at some time, I could hear whatever it was moving around in the weeds. All of a sudden, my brother grabbed my hand (because he saw the creature) and said lets get out of here. As we proceeded back towards our house, I turned around and I could see six to seven foot tall upright walking animal covered with very thick hair approaching us at a very rapid pace. I noticed its shoulders were extremely wide and when it walked, it made strides that were very non human like in proportion. We ran back to our house and it followed us never catching up to us. When we made it back to our driveway, a car was coming in the other direction. Then, my brother and I turned around to catch another look at the creature as it was running into the weeds on north side of the road. My brother and I decided not to stick around and we quickly made our way up our driveway into the safety of our house. After this encounter, we came to a logical conclusion that what we were fortunate enough to see something that fit the description of the so-called animal called Bigfoot. There is no way it could have been a bear because bears can't run on two legs. I have no idea what else it could have possibly been. ",
  "classification": "Class A",
  "county": "Lawrence",
  "state": "Ohio",
  "latitude": 38.54852,
  "longitude": -82.66616,
  "location": "-82.66616,38.54852",
  "location_details": "County Road 22 (Lawrence Street Road) right near Private Drive 2050.",
  "temperature_high": 84.27,
  "temperature_mid": 73.935,
  "temperature_low": 63.6,
  "dew_point": 65.5,
  "humidity": 0.79,
  "cloud_cover": 0.32,
  "moon_phase": 0.48,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.01,
  "summary": "Foggy in the morning.",
  "uv_index": 7,
  "visibility": 4.88,
  "wind_bearing": 85,
  "wind_speed": 2.55
}