{
  "id": "8381",
  "title": "Young man has midnight close encounter.",
  "date": "2004-03-26",
  "timestamp": 1080259200,
  "observed": "This is a story I have been reluctant to even think about.  One night me and three other friends were in a storage shed located on the back of my friends property fetching things we needed.  We decided to head back to the house after we got what we came for and I was left behind attempting to latch the door because it was very old and hard to get it to fasten properly.  My three buddys had walked off at this time leaving me headed towards the house.  I was walking the exact same path they were taking actually more of a faster trot when I heard a noise like disturbed leaves to the left of me.  Curiously startled I stopped and looked in the direction of the noise and there it was.  Now at this location it happens to be at the back of the house and there is a chain link fence and about fifteen feet seperating me and this creature.  The thing I most remember is the size of this thing and the silouette of the creatures head to neck and shoulders.  Where a human has a visible neck line what I witnessed had not,  but I did notice huge shoulder mucles too supernatural to be of anyone I've seen.  I didn't notice how dense the hair on the body of this creature was so it could of added to the size of what I saw.  I didn't mention this but there was only moonlight for me to see this by. Also this things abdomen was also tremendous and in a well defined v shape atop curvy big legs.  I have read some of the other reports and alot noticed a pungent odor but I did not and I believe that there was only fifteen feet at the most between me and this creature.  But what I did notice was a deep deep breathing sound and then a deep growl rumble like a cougar kind of intermitent if that makes sense and after that it promted me to slowly walk off out of fear.  This occurance only took about thirty to fortyfive seconds but I remember what I saw.  I never mentioned this to anyone until about a year later when my friend had told me about something strange that happend in the woods near the property.",
  "classification": "Class A",
  "county": "Oklahoma",
  "state": "Oklahoma",
  "latitude": 35.42014,
  "longitude": -97.21555,
  "location": "-97.21555,35.42014",
  "location_details": "",
  "temperature_high": 74.45,
  "temperature_mid": 69.19,
  "temperature_low": 63.93,
  "dew_point": 61.12,
  "humidity": 0.74,
  "cloud_cover": 0.68,
  "moon_phase": 0.18,
  "precip_intensity": 0.0003,
  "precip_probability": 0.21,
  "precip_type": "rain",
  "pressure": 1017.04,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 8.96,
  "wind_bearing": 170,
  "wind_speed": 17.16
}