{
  "reportId": "2398",
  "title": "Sighting by a fisherman at night near Kilgore, and separate nighttime sighting by a family in a mobilehome",
  "date": "1978-06-30",
  "timestamp": 268012800,
  "observed": "The report I am filing with you may be lengthy but I deem it necessary to the understand the account. It was the summer of 1977 or 1978 on the outskirts of town. My father's best friend and fishing buddy was fishing about a mile behind his mobilehome at a farm pond in a wooded area. It was about 2:00-3:00 a.m. when he noticed that the sleeping horses in the trees were startled and ran. He said at the time he thought nothing of it and continued fishing. When in the light of the moon standing across from him on the otherside of the pond was a bigfoot. In response he left everything and ran home. He said that he wasn't sure that it was a bigfoot but it was at least 6.5 feet tall, very broad and covered with hair. This is the background information to my account. It was later that same year in the Fall and my father was going with his fishing buddy on an all night catfishing trip. My Mom decided to go out to their house for the evening with my brother and myself.  My Mom and her friend decided we would watch some late night television and play games while the men were out fishing. It was approxiametly 1:30, and my Mom and her friend were talking and my brother and I were listening on the couch when there was a thud on the side of the mobilehome. The thud was heavy and you could feel it in the floor. The sound came from the backside facing the woods. My mother's friend looked out and said she saw nothing, about that time a pounding came to the door and continued for 10-20 seconds. She looked out the peephole and said it was to dark to see a thing, she then went to the window and looked out and screamed. She looked at my mother and stated it's that thing he told me about. She ran to the rear of the mobilehome and got a gun and came back. They made my brother and me get behind the couch. My Mom and her started to scream, they said they hoped it would scare it away, my mother picked up the phone to call the Sherrif. As soon as she dialed the noises from outside stopped. We sat and talked about it for the rest of night. She said the thing looked at her when she peered out the window,she said its eyes were human in shape but colored like an animals, his body was covered in brown long hair, it stood at least 6.5 feet tall and appeared to be angry. The next morning when my Dad and his buddy showed up they discovered a few prints around the backside of the mobilehome and by the front door. It acted like it was curious at first but was showing aggression. This occured at 1:00am-2:00am in September of 1977-78. Location : Outskirts Kilgore, NE Texas There was one witness on the first occasion and six witnesses on second occasion : my mother, father, brother and myself.",
  "classification": "Class B",
  "county": "Gregg",
  "state": "Texas",
  "latitude": 32.4125,
  "longitude": -94.81806,
  "location": "-94.81806,32.4125",
  "location_details": "",
  "temperature_high": 94.61,
  "temperature_mid": 84.23,
  "temperature_low": 73.85,
  "dew_point": 71.64,
  "humidity": 0.68,
  "cloud_cover": 0.36,
  "moon_phase": 0.85,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.37,
  "summary": "Humid and partly cloudy throughout the day.",
  "uv_index": 10,
  "visibility": 6.08,
  "wind_bearing": 155,
  "wind_speed": 2.62
}