{
  "reportId": "40841",
  "title": "Motorist has possible nighttime sighting just north of Springfield on Veterans Parkway.",
  "date": "2011-07-16",
  "timestamp": 1310774400,
  "observed": "I was driving on Veterans Parkway in Springfield. Heading north at 60 mph. There is a heavly wooded area with a pond in the area also. It is a four lane highway with two lanes going south and two going north divided by a grassy medium. It was 2 a.m. and I was the only vehicle on the road, nothing else in sight. Then about 200 yards ahead of me I noticed something moving across the two southbound lanes. At first I thought it was a deer, since I see them frequently. So I hit my bright lights and saw it was something bigger than a deer. At my speed of 60 mph, no way it should have been gone when I reached the area where it crossed the road. It seemed to move effortlessly cross the road, in only a few strides. I was in amazement not knowing what it was. I know for a fact  it wasnt a deer. And this is not bear country, it wasn't a horse or a dog, wolf, coyote or any other animal familiar to this area. Then I wondered if it could have been the elusive BIG-FOOT. When I saw it I hit my bright lights, it had two legs and it was hunched over like it had long arms draggin right above the road. It moved so fast, not like a human or an animal and I've seen animals cross the road but this was big steps. Where I saw it, the area is very damp and has lots of deer. Its close to the water and sewer treatment. And if you know the area you know the foul smell. Good for a bigfoot. I wish I could have been more ready for it but I was like stunned. Thinking \"What was that?\".",
  "classification": "Class B",
  "county": "Sangamon",
  "state": "Illinois",
  "latitude": 39.83627,
  "longitude": -89.65926,
  "location": "-89.65926,39.83627",
  "location_details": "On Illinois Rt 4, between J David Jones and 8th Street exits on Veterans Parkway.",
  "temperature_high": 89.06,
  "temperature_mid": 80,
  "temperature_low": 70.94,
  "dew_point": 67.48,
  "humidity": 0.68,
  "cloud_cover": 0.01,
  "moon_phase": 0.55,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.09,
  "summary": "Clear throughout the day.",
  "uv_index": 10,
  "visibility": 9.79,
  "wind_bearing": 128,
  "wind_speed": 3.84
}