{
  "reportId": "10062",
  "title": "Man Hears Evening Vocals in Prior Sighting Area",
  "date": "2004-12-18",
  "timestamp": 1103328000,
  "observed": "I returned from a two hour drive to Seattle Saturday night, after visiting family for an early Christmas celebration. I walked onto my back porch and noticed an unrecogizable sound. Since I'm into nature observation and tracking, and had heard audio recordings of alleged Sasquatch vocalizations, this possibility was in the back of my mind. I walked to the edge of the ravine and listened intently to the patterns of barks and growls. They were more audible than any canine and had an order to them which reminded me of sogbirds, repeating notes over and over. They didn't sound like any coyotes or elks or other fauna. I went into a slight panick at the thought of it being a Sasquatch, which I was sure it was. I ran back to my house as fast as I could and grabbed my tape recorder which I usually use for recording bird songs. I spent the next twenty minutes waving the microphone into the night air. I then went back inside to see if it was working, but found to my dismay that the battery in the microphone was dead! By the time I got it working, the animal had stopped vocalizing. Throughout this twenty minute period, several dogs gradually began barking with greater and more frequent intensity. It was interesting to contrast the difference in the dogs barking to the complex patterns of the alleged Sasquatch noises. The sounds were more structured, they had a greater range of expression and caried further through the forest. The next day, I went out on foot to the spot and found the broken and trampled branches, the ripped tarp, the coyote carcass, the dog food bowl and the unknown animal scat. I surmised this was a form of territorial marking. Perhaps the Bigfoot picked up the items from a backyard or killed the coyote. There didn't appear to be any recent human activity there. There were no regular trails, the terrain was steep, and slippery, the nearest house about 800 feet away. Tommorrow I am planning to return with my camera and a flash, extra film and a ziploc bag or two to collect any samples, and document the site.",
  "classification": "Class B",
  "county": "Grays Harbor",
  "state": "Washington",
  "latitude": 46.988,
  "longitude": -123.8647,
  "location": "-123.8647,46.988",
  "location_details": "In dense lowland forest, the ravine behind my property, which is semi-wilderness about a mile from the city limits where the real wilderness begins.",
  "temperature_high": 56.53,
  "temperature_mid": 50.79,
  "temperature_low": 45.05,
  "dew_point": 44.68,
  "humidity": 0.88,
  "cloud_cover": 0.46,
  "moon_phase": 0.25,
  "precip_intensity": 0.0002,
  "precip_probability": 0.04,
  "precip_type": "rain",
  "pressure": 1028.74,
  "summary": "Mostly cloudy in the morning.",
  "uv_index": 1,
  "visibility": 7.67,
  "wind_bearing": 88,
  "wind_speed": 8.2
}