{
  "reportId": "23211",
  "title": "Possible camp stalking at Glade Run Pond, Monon. Nat. Forest",
  "date": "1985-07-12",
  "timestamp": 489974400,
  "observed": "My encounter happened in West Virginia at Glade Run Pond in Webster County within the Monongahela National Forest.  This is a rather remote area.  The pond is located well over a mile behind a gated forest service road off of a gravel county road that runs deep in the national forest above the Cranberry River. It was likely the summer of 1985.  My best friend, Mark, and I decided to hike back to the pond to go bass fishing and camp for a couple days.  The weather was very nice and the first day had come to an end.  I had caught a bass and it was on a stringer staked to the bank of the pond.  We enjoyed a big fire (started with the aid of a Zippo can of lighter fluid), nice meal and good conversation at our own private paradise buried deep in woods.  The day ended typically with not another soul in sight. It was not long after we had lain down to for the night in our sleeping bags that we heard a bizarre howl or yell a good ways up the mountain above us.  It was like a “woooooooop, woop, woop, woop” sound.  It was a strong, very substantial sound.  The call was repeated a few times and then all became silent again.  We looked at each other, lightly illuminated by the campfire through the tent, and said, “what was that?!”  Even though we both grew up in the woods camping, hiking biking, hunting, and fishing, neither one of us had ever heard a sound like that before.  Unnerved, we eventually calmed down enough to start to fall off to sleep. Then, just inside the woods behind the tiny clearing where we were camping, we heard the call again.  It was jarring!  At a distance of less than 50 feet, the call of this creature blared though our tent!  WOOOOOOOOOOP, WOOP, WOOP, WOOP!!!  We both about died right there.  The sounds being belted out were not from an owl or fox or bobcat or any other creature we were familiar with.  Plus, this thing obviously had big with powerful lungs!  After the first couple calls, I decided that I wanted to see what was going to kill us instead of lying there like a sandwich in a wrapper.  So, I started to reach for my flashlight.  As the nylon of my sleeping bag made a slight sound, Mark clamped down on my arm like a vice grip and firmly whispered through his teeth, “don’t move!”  I told him I wanted to see it.  Again he firmly whispered, “don’t move!” After a few minutes of bone chilling monster calls being directed toward us point blank range, all became quite again.  Eventually we felt comfortable enough to talk and could not determine what we had heard.  The only thing that we could think of was Bigfoot but the thought of it made no sense.  It took us a while, but we somehow eventually fell off to sleep. The next morning we awoke in disbelief.  We reviewed our mental notes and realized that we had not shared the same nightmare but rather the same reality.  We had certainly heard something that we could not even begin to rationalize. As we made our way out of the tent, the world looked the same.  It was a nice morning.  We decided to start a fire and fix some breakfast but our can of Zippo was not readily available.  Then we noticed a small pile of stones where we had left it.  Underneath the rock we discovered our lighter fluid.  Neither of us had covered the can up, and yet, there it was, covered neatly with a pyramid of rocks near the fire pit where we left it.  This was really odd since we were alone while camping in a place that is not readily accessible during the day, let alone in the night.  Plus, the covering of the can would have had to happen in the middle of the night since we were up half the night scared for our lives while the devil himself yelled at us.  We could only guess that a bigfoot had become offended by the smell of kerosene and covered it up himself. A short time later we made our way down to the pond to do some fishing.  The first thing I did while down there was to check on my catch.  However, my fish was gone, stringer and all.  We each know that losing a fish and a stringer is not uncommon.  However, combined with the event, we thought that a bigfoot could have made off with our fish. We each left there that day convinced that we had encountered a bigfoot at Glad Run Pond.  We have told this story over and over through the years and it still gives us chills.  My eyes even tear up a bit when I make the woooop sounds.  We each are still avid outdoorsmen.  The hours we have spent in the woods hunting and fishing and camping are substantial.  We even had mules for many years that we used for long multi-night camping and hunting trips into the WV wilds.  We still go to Glade Run Pond from time to time.  However, we have never heard that same sound or had a similar experience again.  Whatever happened that night will never be forgotten by the two of us.  We will be telling this story to our great grand children!",
  "classification": "Class B",
  "county": "Webster",
  "state": "West Virginia",
  "latitude": 38.312,
  "longitude": -80.429,
  "location": "-80.429,38.312",
  "location_details": "located in the Monongahela National Forest above the Cranberry River and near the Cranberry Back country and Wilderness Area.",
  "temperature_high": 81.94,
  "temperature_mid": 74.045,
  "temperature_low": 66.15,
  "dew_point": 64.67,
  "humidity": 0.75,
  "cloud_cover": 0.65,
  "moon_phase": 0.83,
  "precip_intensity": 0.0033,
  "precip_probability": 0.41,
  "precip_type": "rain",
  "pressure": 1016.36,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 8,
  "visibility": 6.58,
  "wind_bearing": 190,
  "wind_speed": 1.34
}