{
  "id": "55672",
  "title": "",
  "date": "",
  "observed": "I have been keeping this to myself since last year. I have been a deer hunter for over 30 years and wont go back in the woods after what happened. I'm going to bullet point this incident. I was deer hunting. Deer were running around the woods crazy that evening. I had a small buck run past my stand, it was getting dark. 5:30ish. He ran out into the middle of the field and stood there looking at the direction he came from for about 15 min, Then ran off. 10 or 15 mins later I then heard this large something coming through the woods. Small trees breaking and leaves crunching. I had no idea what it was, I had my back against the wide tree 16' in the air, (the tree is wider than my back) and you cant see me or my stand from behind. It stopped right behind me, it is now dark, I could hear it breathing, it was 8 yards behind me, I didn't move, it stood there for about 5 minutes then started sniffing the air like it was smelling for something, then it started to move slightly, it was dry out and leaves covered the ground so you can hear anything move. Then 2 loud tree knocks, I then started to get a chill down my back, as I reached for my bow I heard 2 screams, I had my bow in hand and my shooting trigger was on my bow string and I WAS AT FULL BRAW. The screams vibrated the woods. It stood there pacing behind my tree, left to right then stopped to smell the air again, it started to move West at a regular walk/pace. I let off my bow, reached around the tree, clicked on my head lamp and about 12 yards from me was a 8' tall 700/800lb tall black figure, it grunted when my light came on and ran along the river bank and back into the woods. I did not see a face, I saw the back of IT. I will say this, It was hunting that night, it was smelling for scent and chasing deer, looking for food. At the time my bow was loaded with a 1.5\" expandable broad/arrow head, Yes I was at full draw not knowing what was going on, when my light was on and I drew my bow back again I was ready to shoot if it came back across the stream. I know the exact yards as I have hunted this location for around 5 years, I bow hunt so I need to know the yards for arrow placement. This Sasquatch which what it was, was a massive animal. I don't know if it would harm anyone or persons but the power that I could see it its body was unbelievable. Yes I was scared but I saw something that only a few people in the world have seen.",
  "classification": "Class A",
  "county": "Jackson",
  "state": "Missouri",
  "location_details": "I-70 is about 2 miles south from my location",
  "summary": ""
}