{
  "reportId": "3667",
  "title": "Eerie vocals in the forests of Karlin.",
  "date": "2001-07-20",
  "timestamp": 995587200,
  "observed": "My girlfriend and I both live in a small area, filled and surrounded by hills and forests.  During the summer I would often stay at my her house until midnight before going home.  Often (once or twice a week) I would hear strange noises coming from the woods next to her house as I walked to my car.  It sounded like people laughing, only a little different... it's tough to explain.  It was like laughter, but there was something off about it.  It just didn't sound like human laughter.  The sound was terrifying.  It was almost like it was artificial, but I know that it couldn't have been someone trying to play a trick.  There are very few people nearby, and they're all older people and farmers.  Anyway, the \"laughing\" continued for two or three months.  Eventually, my girlfriend admitted that on her daily walk through the hills she had heard strange sounds as well, but the calls she heard were more like babies crying rather than people laughing.  She also found it to be eerie and inhuman.  she eventually heard the laughter too, as did her mother and one of her neighbors.  it disappeared for some time, but then came back about a few weeks later, just in time to keep her and her visiting sister from sleeping.  After that, whatever it was became more bold.  It started venturing into her yard at almost exactly 2:00 AM every morning.  We would both hear it walking around outside, going through her trash, and knocking things over.  Her dogs would usually get riled up and bark at it for about an hour every night (until it left, I suppose). One dog was apparently kicked or attacked by it, because I heard it being struck and a sharp yelp, then the following day it seemed to limp a bit and was afraid of us.  After that, I didn't really hear much from whatever it was again.  The phenomena went on for over half a year, but as soon as it started getting cold things suddenly stopped.  Maybe it migrated, I don't know.  I don't know what it looked like either, since I never actually saw it.  I tried to find it, but never came up with any physical evidence other than missing apples and overturned garbage cans.  I've figured it was probably a MoMo, or something of that sort.  I can't say with certainty, but I can say that it wasn't normal.  Nothing that lives in Missouri makes sounds like that.",
  "classification": "Class B",
  "county": "Polk",
  "state": "Missouri",
  "latitude": 37.54661,
  "longitude": -93.41,
  "location": "-93.41,37.54661",
  "location_details": "4893, S. 136th Rd. Bolivar, MO. 65613.  The forests and hills of Karlin, between Bolivar and Morrisville.",
  "temperature_high": 92.19,
  "temperature_mid": 83.16,
  "temperature_low": 74.13,
  "dew_point": 72.33,
  "humidity": 0.73,
  "cloud_cover": 0.09,
  "moon_phase": 0.99,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.73,
  "summary": "Humid throughout the day.",
  "uv_index": 10,
  "visibility": 7.92,
  "wind_bearing": 179,
  "wind_speed": 3.99
}