{
  "reportId": "15075",
  "title": "School teacher remembers his close encounter with a sasquatch while hunting near Cape Fair",
  "date": "1975-07-15",
  "timestamp": 174614400,
  "observed": "I was hunting with a friend and we had been out since early morning, it was hot and we were tired. We were just trying to get back to the car, which was parked, on a dirt road about a mile up a ridge that was directly in front of us. The brush we were walking through was thick, really difficult to get through. We were walking single file and I was behind my friend with my head down concentrating on just trying to get through the brush with out tripping. Suddenly I heard an incredibly loud disturbance to my left and at the same time my friend had froze in his tracks. As I looked to my left, this animal, there is no doubt a Bigfoot, came tearing down the ridge right in front of us. It could not have been 10-15 feet from us. It was so close, it must have been sleeping and we woke it, because something that big would have made a lot of noise crashing through the brush on approach, and I heard nothing until it was right on us. We both watched it run past us to our right, on down this ridge and disappear into the forest. It was huge, covered with black fur and long, long arms. As it went by us it turned its face toward us and its face was flat and hairless, but almost black, like its face had been caked with mud all its life. It was bent forward slightly, running and it was still 7-8 feet tall. I was shocked at the speed. This encounter took no longer than 10 seconds. We both stood there scared to death, really scared. We both were familiar with the concept of Bigfoot, and had heard the stories of \"monsters in the woods\". After we both got under control, I said, \"what was that\" and my friend said \"I don’t know but I'm getting out of here\". We both started to run as best we could for the fence line and the road about a mile in front of us. When we reached the road, we were climbing a fence that lined the road, as were crossing this fence we heard the most bone chilling scream I have ever heard in my life. This just added to our terror and we continued to run for the car. We did make it out of there with nothing else to report. I had returned to that same area many times after, always with the same friend and never saw or heard another thing. That was 31 years ago and I can still remember it like it was this morning.",
  "classification": "Class A",
  "county": "Stone",
  "state": "Missouri",
  "latitude": 36.67065,
  "longitude": -93.65774,
  "location": "-93.65774,36.67065",
  "location_details": "",
  "temperature_high": 86.86,
  "temperature_mid": 74.745,
  "temperature_low": 62.63,
  "dew_point": 59,
  "humidity": 0.61,
  "cloud_cover": 0.29,
  "moon_phase": 0.24,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.33,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 9,
  "visibility": 9.36,
  "wind_bearing": 157,
  "wind_speed": 6.51
}