{
  "reportId": "28499",
  "title": "Possible bigfoot activity and interesting photos taken at Clear Creek Park",
  "date": "2010-10-09",
  "timestamp": 1286582400,
  "observed": "On Saturday, October 9th, 2010, I was finishing up a senior photo shoot at Lake Romona on Clearcreek Rd in Fairfield County, Ohio. Upon arrival at the lake, immediately we observed rocks being thrown into the lake. There were three of us who witnessed it, my wife and young son had gone up another trail however and they were not present. My photo subject and I had gone to the lower area to try and get a few shots, but the rock throwing continued. Also observed was tree knocking and limb breaking by the creature at this time and after we had gone back to where we originally heard it. We were across the lake from it, and at that time I had decided to take a quick succession of pictures to try and find what was throwing the rocks at us. At this point in time, all of us decided to leave the area. Since I had my wife and young son with me, I didn't want to run the risk of them getting hurt. It was when I got home that I realized that I had actually gotten  two images of the creature. I also believe that I have another of it observing me when I was taking the picture of the boy in front of the lake, but it is not as clear as the other two. To me in the photos its face resembled an orangutan, only it was completely black. Also of interest is that the creature appears to have something white in its hand.",
  "classification": "Class B",
  "county": "Fairfield",
  "state": "Ohio",
  "latitude": 39.59947,
  "longitude": -82.63536,
  "location": "-82.63536,39.59947",
  "location_details": "From Tarlton, follow 159 and turn right onto Julian Rd. Right to Drinkle then left onto Clearport Rd. Next, go right onto McDonald Rd. SW then right on Clearcreek Rd. SW. Turn left to stay on Clearcreek Rd. SW then turn left to arrive at Lake Romona.",
  "temperature_high": 82.91,
  "temperature_mid": 66.805,
  "temperature_low": 50.7,
  "dew_point": 43.71,
  "humidity": 0.58,
  "cloud_cover": 0,
  "moon_phase": 0.07,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.81,
  "summary": "Clear throughout the day.",
  "uv_index": 4,
  "visibility": 9.91,
  "wind_bearing": 255,
  "wind_speed": 3.3
}