{
  "id": "7632",
  "title": "Bigfoots observed demonstrating intimidation behavior near Lake Tawakoni",
  "date": "2003-12-24",
  "timestamp": 1072224000,
  "observed": "Several Bigfoot were observed with binoculars in a deeply wooded area. They were dodging in/out of the tree line, like a game of cat and mouse, with each other. Thought it was a hoax being played on me and just watched them move closer in my direction. We also heard some cackling noises in the distance that I likened to hyenas or coyotes. Separate from these noises were dogs barking in the area. Horses in the area that became real jumpy. After walking into wooded area, we disturbed a large creature that let out a very deep and loud growl that I've never heard any animal make before and we heard a loud thud like a heavy animal jumping. Shots from a .45ACP handgun were fired in the vicinity followed by heavy footsteps and branches/brush being disturbed by the same heavy animal making a hasty retreat. We went into the same distance and reached a creek bed area. There was dead silence and we noticed some smudged prints near the water's edge but didn't hear a splash or any other noise. We got the feeling that we were being watched and feared that whatever we were following had doubled back on us and might corner us with our backs to the water. By this time, it was darker outside but in the more open areas you could see without a flashlight. As we were leaving the area, we heard very heavy footsteps and stomping along with tree branches crashing to the ground that I likened to a bull dozer without the engine rushing behind us. We got to a clearing and turned to face whatever it was and saw a HUGE, silver-grayish colored Bigfoot just at the tree line. It was in the 10 O'clock position from where we were and it was stomping and \"bluff charging\" or \"mock charging\" at us and throwing branches. The trees in this area were middle growth to mature trees and he (appeared to be male by the aggressive nature and sheer size...) was rattling these trees with no problem! We squatted down to get a better look and to take aim at him in case he charged. He stayed within the tree line and rocked back and forth like a gorilla. The only sounds that were heard, at this point, were the stomping and the branches being thrown at us. He was about 20 yds. away from us and the large branches were coming very close. I had the gun aimed right at him and I'm convinced that he had a better sighting on me than I had on him because he reacted just like a squirrel on a tree does. I was thinking about taking a shot at him when suddenly from the 12 O'clock position, we noticed another Bigfoot that was shorter than he was and wasn't as thick, up top, and appeared to be female because of (her) actions. The larger one(10 O'clock position) was at least 8 or 9 feet tall and was very massive in the shoulder areas. The smaller one(12 O'clock position) was at over 7 feet tall and was standing there rocking back and forth, but not as violently as the larger one. (seemed like she was following his lead and waiting to see what he would do next....) As long as I pointed the gun in their direction or shined a flashlight at them, they stayed behind the trees and tried to hide their faces. It became a sort of hide-n-seek as I shined the light to see their faces. I did catch a glimpse and the face appeared more sloth-like, from what I saw. They had BIG heads, the eyes were dark looking despite the growing darkness and flashlights. On one, I did notice a sort of frowned expression on the face and it almost looked sad. At this point, I couldn't shoot because I wasn't sure that it still wasn't a hoax, although I understood what I was looking at. Also, it almost seemed like they could almost understand things more than other animals. (I won't say they were thinking and reasoning.....) But, it was as if they were upset that I shot at them and was asking me \"WHY?\" The larger one (10 O'clock position) became more agitated and wanted us out of the area and began to stomp more and more, so we decided to slowly back out of the area (with gun pointed in their direction) and leave. As soon as we got out of the area, we then heard what I likened to a loud shouting type of horse whinnying shout. That I labeled their victory call, for running us out of the area. I had a camera hanging from my neck but didn't touch the camera until I got home and noticed it hanging from my neck! I was very much afraid and wasn't sure if I'd make it out of there alive or not.",
  "classification": "Class A",
  "county": "Hunt",
  "state": "Texas",
  "latitude": 32.94722,
  "longitude": -96.10222,
  "location": "-96.10222,32.94722",
  "location_details": "",
  "temperature_high": 59.46,
  "temperature_mid": 49.395,
  "temperature_low": 39.33,
  "dew_point": 27.96,
  "humidity": 0.57,
  "cloud_cover": 0.08,
  "moon_phase": 0.05,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.09,
  "summary": "Clear throughout the day.",
  "uv_index": 3,
  "visibility": 9.99,
  "wind_bearing": 142,
  "wind_speed": 2.98
}