{
  "reportId": "23956",
  "title": "Man recounts boyhood sighting at Fairfield Summer Camp near Ligonier",
  "date": "1967-09-14",
  "timestamp": -72576000,
  "observed": "I was a camper at camp fairfield in the summer of 1967. I was eight yrs old my first time at camp. It was sponsored by wilinsburg baptist church. I lived in wilkinsburg until i graduated high school in 1977. It was a two week camp arrived on saturday and left on sunday  fifteen days later. We were assigned cabins by age. My brother being older was assigned a different cabin. There was about 10 boys to an open cabin and a counselor who slept inside with us. I had never really overcome a little bed wetting and had an accident a few days into camp. This opened me to huge ridicule and laughter. I need to go to the bathroom late at night to prevent a repeat occurance. Only one problem, the common outhouse was about 70 to 100 yrds down an unlighted path. There was no way i was going to use a flashlight alone at eight and go to the bathroom. We were not allowed to pee off the porch into the bushes for obvious reasons. So i devised a plan. I would wait until the other boys and the counselor would fall asleep ,then sneak out a few feet from the cabin to quickly pee. This worked beautifully for about 5 or 6 nights. The head counselor always made head count about 11 oclock. Because lights out was 10 oclock. He would come down the path and count us all by flashlight and go to each cabin counting. I would wait for this count then after about a half hour sneak out and back in. This particular night it was raining lightly. I remember seeing the counselor with a yellow rain coat as he counted. He went on the path as usual. I remember at lunch everyone saying a bear had been overturning the garbage at night. This revelation redoubled my resolve not to venture to the outhouse after dark. This night i heard footsteps returning to the cabin thru the forest not the path from another direction. I thought it strange the head counselor would return. He had never returned before. And why would he cut across the woods instead of the path. I heard walking behind the cabin first to the right and then back to my left past my head. I heard footfalls come around to the front of the open cabin door. It was just a doorway with no door. As i looked to see who this was a big gorilla looking thing appeared at the doorway. He did not step on the porch, but was so big he filled the doorway. He was giant. There were at least 4 steps and his head was at the top of a 8 ft doorway. Not on the porch. He looked directly into the doorway. I could see he had black brown fur and a cone shaped head. His eyes reflected like a cat's eyes with like almost red and yellow mixed. It was if he could see me looking straight at him. I figured if i could see his eyes he probably could see mine. I squinted and tried to fein sleep being to frightened to move and didnot dare utter a sound or move a muscle. He stood there a good two to 5 minutes. And then he turned and headed up to the mess hall. Then i heard in the distance garbage cans being turned over. I got up the next morning asking did a gorilla excape from the zoo because i saw him last night. And it was a gorilla turning over the cans not a bear. I had never heard of bigfoot and wouldn't hear of him until some 7,8 or 9 yrs later. I being born in the ghetto had never heard of anything like that. Everybody cracked up and i being young sluffed it off. I knew what i saw and they were the dummies,not knowing that africa wasn't the only place that had gorillas.",
  "classification": "Class A",
  "county": "Westmoreland",
  "state": "Pennsylvania",
  "latitude": 40.32247,
  "longitude": -79.16817,
  "location": "-79.16817,40.32247",
  "location_details": "camp fairfield",
  "temperature_high": 77.26,
  "temperature_mid": 63.425,
  "temperature_low": 49.59,
  "dew_point": 46.36,
  "humidity": 0.6,
  "cloud_cover": 0.53,
  "moon_phase": 0.37,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1024.33,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 7.31,
  "wind_bearing": 79,
  "wind_speed": 3.89
}