{
  "id": "5770",
  "title": "Four feral dogs chase sasquatch",
  "date": "1972-08-25",
  "timestamp": 83548800,
  "observed": "This is the third in a set of chronological reports that I am submitting regarding a series of encounters I had between 1970 and 1983 in Nevada, California, and Washington States. This third encounter occurred in August 1972, when I was 12, at my home, roughly ten days after our encounter at the dry wash. I have previously described nearby Peavine Mountain and Lemmon Valley.  Our house was located on the East side of the valley.  It was in a new development at the time, tucked back in a draw among several steep hills.  The surrounding hills rose from 50 to 250 feet above our neighborhood and were primarily granite outcroppings.  The soil was coarse granite sand interspersed with boulders of various sizes.  Where there was vegetation on the hills, it was predominantly sagebrush.  In the draws, the sand was less coarse and there were a variety of grasses and other weeds. We had just moved into the newly completed house a few weeks earlier and were getting to know our neighbors, all of whom had just moved into their new homes as well.  Like many of our neighbors, we were building a fence and otherwise improving our property.  At the time, there was only one thing to detract from the new neighborhood -- the presence of a pack of feral dogs. The pack was composed of four large dogs -- two Dobermans and a couple of mixed breeds.  They were a matter of some concern because many of the new residents had small children and the pack displayed absolutely no trace of fear of people.  They would generally appear around dusk, when it began to cool, and boldly range through the neighborhood.  At night you could often hear them in the surrounding hills, barking and baying occasionally.  It didn't take long to determine that they had no owner and one of our neighbors, an animal control officer for the city of Reno, told us that he had arranged for the county to do something about them. Our home was an \"L\" shaped ranch, with two of four bedrooms in the back, at the top of the \"L\", and a garage in front, at the bottom right of the \"L\", facing the street.  We had partially constructed a cedar plank fence around the property, starting in back and working our way around the property clockwise.  We had completed the fence on the side of the property at the top of the \"L\", and had built a small section of fence connecting the back left corner of the \"L\" to the fence on that side.  This created a small cul-de-sac behind the house.  Along the side of the property to the right of the \"L\", we had set the posts and rails.  Along the front, where we intended to connect it to the garage, at the lower right corner of the \"L\", we had set the posts, but hadn't yet put in the rails.  You could, essentially, walk right into our back yard from the street side of the house, but could not leave the yard on the back side without climbing over the fence. On the night of the encounter, I had picked up all of the two-by-fours we hadn't used as rails yet and I had stacked them horizontally along the base of the fence back in the cul-de-sac.  This was a precaution since they were pilferable and we weren't the only ones building a new fence. My bedroom was at the top, right corner of the \"L\".  The ground outside my window was about a foot and a half below the floor of my room.  My mother had already planted a small flowerbed of marigolds there.  To protect it, she had me put in one of those small, white-painted, wire trellises that reminds you of a bunch of coat-hangers welded together.  To put it in I had to heavily wet down the ground, then force it in.  Once the ground dried, the powdered granite and sand set like concrete.  It was about a foot high. The incident occurred between midnight and 12:30 am.  It was late summer and I was awake late reading.  I had my window open, but the drapes were closed.  That night, the pack of feral dogs had been more noisy than usual.  Every so often, their barking would become particularly strident, drawing my attention away from my book.  I remember thinking to myself, over the course of fifteen minutes or so, that they were chasing another jackrabbit, then deciding that it must be a coyote, since they'd been going at it for longer than usual, then wondering if they might have a cougar at bay, since they were still barking and baying loudly, but seemed stationary. I was just turning back to my book, when I realized that they had started moving again, and were coming down the street in the direction of the house.  I started to sit up, intending to go to the living room window to see what they were chasing, but realized that they would be well past the house before I could get to the living room in front.  As I listened, though, the noise of the pursuit didn't decrease the way I expected it to do as they chased their quarry past the opposite side of the house.  Instead it grew louder, and I realized that, whatever they were chasing, they were chasing it into our back yard.  I also realized that they might corner it behind the house in the cul-de-sac.  Excited, I started to get up to look out the window. Before I could get up, though, their quarry rounded the back right corner of the garage heading in the direction of my bedroom at the back right corner of the house.  For just a second, I could clearly hear it running, as the sound of the dogs was still partially masked around the corner of the garage.  As it covered the twenty feet between the two corners, I heard three distinct, heavy footfalls -- one just as it rounded the garage, one midway between the garage and the corner of the house, and the third just under my window, where the wire trellis was set firmly into the ground.  This was followed by an incredible impact into the corner of the house.  The force was so great that I could hear the four-by-four upright in the wall crack and the whole room shook.  The impact and cracking sound came from a point about five and a half feet above the level of the ground outside.  Simultaneously, there was a secondary impact about seven feet above ground level across the top right corner of my window as viewed from outside.  The window rattled violently in the frame and I was sure it was cracked.  Immediately following the two simultaneous impacts, there was a forced grunt as if the wind had been knocked out of whatever it was and I could hear its body fall heavily to the ground. My first thought was, \"Oh my God!  They're chasing a man!\"  The footfalls were clearly bipedal, the height of the impacts was too high for it to be anything four-legged, and the sound of it having its wind knocked out was manlike, if somewhat heavy.  Also from the sound of its fall, it went from an erect to a prone position.  At the same time I recognized that something was strange.  The \"man\" hadn't called for help, hadn't made any vocal noises at all, in fact.  He had covered twenty feet in what was essentially two strides, and had hit the house at a point too high for all but the largest of men.  The secondary impact across the outside corner of the window was also too high for most people to reach, and the force of the impact, strong enough to make the four-by-four in the house's frame crack, indicated much more mass than any normal person would have. I didn't spend any time really thinking about this, though.  Even though I had an underlying uneasiness because the sounds indicated that the guy was huge, I was sure the dogs were chasing a man.  The dogs closed on the man, snarling and barking.  I was afraid he was lying on the ground, injured or unconscious, and I realized that I had to do something.  I immediately threw my sheet off, jumped out of bed, and reached for the drapes, intending to throw them open and yell at the dogs -- about all I could do in the situation.  In the two or three seconds it took to do this, though, it didn't sound like the dogs were mauling the man.  They were about three feet from the house, stationary, barking and growling.  It sounded as if there were only three of them, two very aggressive and ready to attack, and one that was barking the way a dog would if it were afraid of you, but ready to attack if provoked. Just as my fingertips touched the drapes, the scariest thing I have ever experienced in my life happened (believe me, this is saying a lot for someone who has spent nineteen years in the military and lived through a parachute malfunction).  Somehow the man had recovered from hitting the house, having the wind knocked out of him, and falling.  He had somehow managed to stand up and get his breath back and just as I touched the drapes, from a point immediately outside my window, level with and about two feet from my head, He Growled Back at the dogs. The growl wasn't loud.  It was only about two and a half seconds long.  But it was the meanest, deepest, and most menacing growl I have ever heard in my life (to include those of trapped brown bears at Yellowstone).  It was almost as if he was keenly aware that there were people around, that he knew precisely how long he had to growl to get his point across, and that he didn't want to make any more noise than he absolutely had to. For the next several seconds there was absolute silence.  He didn't make any more noise.  The dogs didn't even make any sounds of movement.  And I was frozen in fear and shock, praying that he wouldn't notice I was there, and afraid he would hear me if I moved at all. It was like that for several long seconds, then, all but silently, I heard him step and brush around the corner of the house. A second later the dogs were after him, but the head start was all he needed.  I heard the stack of two-by-fours tumble down and the sound of him hitting the six foot cedar fence as he went over it, followed by the dogs hitting the fence and then scratching at it and barking.  After a few moments the dogs stopped trying to get over the fence and raced back around the house clockwise. As I heard the dogs racing down the street, I relaxed slightly and gulped for breath.  I hadn't even realized I'd been holding it.  I immediately choked.  The \"Thing\" had left an incredible stench.  It was overpowering.  It smelled like a combination of wet dog, stale urine, and rancid sweat.  There was also an acrid component a little like burnt rubber.  It was so bad that I staggered away from the window. I stood there for a few moments trying to decide what to do.  The thing was gone, the dogs were gone, and all I would accomplish by waking my parents would be to anger my father.  I decided it wasn't worth it.  I thought about going outside but really didn't want to poke around out there in the dark.  I was struggling with what I had just experienced.  Whatever had been outside my window was manlike, but clearly was not a man.  I had no frame of reference to place it in.  I didn't relate the experience to my encounter at the dry wash because I had so thoroughly convinced myself that that had been a man.  I closed my window (which to my amazement was not broken), got back in bed, and tried to read to get my mind off of the incident.  Eventually I fell asleep. The next morning I woke after my father had left for work.  I looked out my window and could see that the flowerbed -- trellis and all -- had been flattened.  I got dressed and went outside.  The ground was scuffed but there were no distinctive footprints.  I choked down my apprehension and walked back into the fenced cul-de-sac behind the house.  The stack of two-by-fours was lying there toppled.  I looked at the cedar fence.  The scratch marks from the dogs' nails were clear.  Caught on the top of one of the planks was a tuft of coarse hair.  I stepped up on the lower rail of the fence and looked at it closely in the bright morning sunlight.  It was dark black with hints of brownish red highlights and about three inches long.  It had enough oil on it make it shine if you looked at it closely.  I struggled with whether it had come from the \"thing\" or one of the dogs.  After several moments of consideration I decided it was possible one of the Dobermans could have had some three inch strands of hair, that the colors were within the appropriate range, and that one of the dogs might actually have managed to make it over the fence to leave it there.  I left it where it was. I went back to the window and examined it and the siding on corner of the house closely.  I didn't see any damage from the impacts.  I decided that the thing had been running, hadn't seen the trellis, and had tried to cut around the corner of the house too closely.  The trellis, strongly embedded in the cement-like soil, tripped it and it fell, throwing its left arm(?) up in an attempt to maintain balance (or maybe grab the roof to catch itself).  The primary impact would have been from its body.  The secondary impact could have been from the left arm slapping the side of the house across the corner of the window. I went in and told my mother about the incident.  I was still very troubled and wanted to know what I had heard.  I discussed it at length with my father when he got home.  He was uncharacteristically patient and explained that it had either been a bear or a cougar.  I couldn't accept either of these explanations.  It wasn't until about a year later that I ran across a tourist pamphlet in Oregon that was about Bigfoot.  I can't express how relieved I was at the time to learn that there was a potential explanation for what I had experienced. We never saw or heard the dogs again after that night.",
  "classification": "Class B",
  "county": "Washoe",
  "state": "Nevada",
  "latitude": 39.679,
  "longitude": -119.6665,
  "location": "-119.6665,39.679",
  "location_details": "Described in context above.",
  "temperature_high": 85.33,
  "temperature_mid": 66.81,
  "temperature_low": 48.29,
  "dew_point": 31.92,
  "humidity": 0.31,
  "cloud_cover": 0,
  "moon_phase": 0.53,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1012.33,
  "summary": "Clear throughout the day.",
  "uv_index": 9,
  "visibility": 10,
  "wind_bearing": 43,
  "wind_speed": 1.54
}