{
  "reportId": "140",
  "title": "Characteristic vocalization heard by hunter on Hayden Mountain",
  "date": "1996-08-24",
  "timestamp": 840844800,
  "observed": "This incident was a scream we heard on the opening day of archery dear and elk season in Western Colorado.  My hunting partner and I had left our camp before dawn to make the final climb into Fall Creek basin from just below the mouth of the basin (approximately 300 yards)  After hunting the basin we exited out the mouth of the basin and instead of returning to our camp we headed north to the next basin over, Thistledown Creek.  From the dark timber near our camp, we were now approximately 500 yards away and a couple hundred feet higher in elevation.  An extemely loud blood curdling scream lasting several seconds boomed out from the direction of our camp.  There clearly was nothing between our position and the dark timber where our camp was located. Yet the scream was unbelievably loud.  It happened just once.  After gaining control of our senses, we concluded it must have been a mountain lion. I talked to a few hunting guides I know who specialize in hunting mountain lions.  None of them could verify the sound of the scream I described as being from a mountain lion.  I did not consider it to be a Bigfoot until I heard a recording of what was thought to be a Bigfoot on a cable TV special aired this summer in July.  Since then, I have pondered that scream I heard in 1996.  Then my brother told me about this website.",
  "classification": "Class B",
  "county": "Ouray",
  "state": "Colorado",
  "latitude": 38.48959,
  "longitude": -107.7,
  "location": "-107.7,38.48959",
  "location_details": "The incident occurred in Fall Creek Basin, on Hayden Mountain, above Camp Bird mine.  From Ouray Colorado, take the graded road to Camp Bird mine and Yankee Boy Basin.  If you have a topo map, you will see the drainage of Fall Creek out of Fall Creek Basin.",
  "temperature_high": 78.28,
  "temperature_mid": 66.065,
  "temperature_low": 53.85,
  "dew_point": 45.8,
  "humidity": 0.47,
  "moon_phase": 0.35,
  "precip_type": "rain",
  "pressure": 1017.09,
  "summary": "Clear throughout the day.",
  "visibility": 9.88,
  "wind_bearing": 134,
  "wind_speed": 1.72
}