{
  "reportId": "26377",
  "title": "Young man has a close daylight encounter while riding his bike along the Hillsborough River",
  "date": "2001-01-13",
  "timestamp": 979344000,
  "observed": "I went down to Florida with my family while my dad was working there. We didn't want to stay in a hotel because we had just bought a camper so we decided to go camping. So we stayed at the Hillsborough River State Park. One day I took my bike out around 2 in the afternoon. The camp had a few trails to ride on so I decided to take one. As I was riding my bike, I stopped and looked over the ledge at a few alligators I spotted. I heard a rustle in the trees and thought maybe it was a gator so i got steady on my bike and got ready to take off. As I was looking around I noticed a tall dark brown hairy figure just standing there looking at me. I thought my eyes were playing tricks on me so I looked harder at it and It took off running. I would also like to note that it was running on two feet, not four. I rode my bike back to my camper as fast as I could and elaborately told my mother and my sister that I just saw Bigfoot. They both claimed I was crazy and told me it was a black bear because the camp guide told us not to leave food out because they had some of them in the area. But I am most certain that this was not a bear. this \"Thing\" stood at least 7 1/2 feet tall and ran upwards on two feet. I know what I saw,and ever since then I've been fascinated with this creature. I know its out there!",
  "classification": "Class A",
  "county": "Hillsborough",
  "state": "Florida",
  "latitude": 28.14617,
  "longitude": -82.24487,
  "location": "-82.24487,28.14617",
  "location_details": "It was at the Hillsborough River State Park on one of the bike trails",
  "temperature_high": 61.53,
  "temperature_mid": 53.76,
  "temperature_low": 45.99,
  "dew_point": 46.08,
  "humidity": 0.84,
  "cloud_cover": 0.37,
  "moon_phase": 0.64,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.66,
  "summary": "Mostly cloudy until afternoon.",
  "uv_index": 3,
  "visibility": 8.84,
  "wind_bearing": 4,
  "wind_speed": 6.96
}