{
  "reportId": "502",
  "title": "Three people report screams near Foresthill",
  "date": "2000-06-17",
  "timestamp": 961200000,
  "observed": "I was camping with my father and my brother at a little spot that we had \"discovered\" last year and had camped out a few times. We had arrived early in the afternoon, set up camp, I shot a can or two with my pistol, ate dinner, and had settled in for the evening (it was about sunset), and we had heard this fairly high pitched \"moan\" or wail, that continued off and on throughout the evening. It seemed to be coming from up the hill at first, and if I had to guess, within 300 yards. Well, as time went on, we heard  the noise move down the hill and down the side of the mountain, which is extremely hard to traverse. My dad and I kept speculating as to what it was, as he had hunted bear, deer, and elk, and could not place what it was. We thought, from the tone, that it could have been a lost animal, as it had a mournful tone to it. It had a very resonant quality to it, like it was a good sized animal. Anyway, the noise seemed to move along the side of us, and then we would hear it back at its original location rather quickly. I briefly thought that it was a large bird that kept flying back and forth, but it finally dawned on my dad that there was two sounds; they seemed to be calling to each other; that unnerved me, and my father and I went to take a look with our spotlights and me with my pistol and camera (I always carry a little disposable camera in case I see a bear or deer). We walked up the hill, (on the dirt road), maybe 50 yards and saw nothing; when we got back to camp, I jumped in my truck and drove up the hill maybe 3-400 yards and saw nothing; I did not get out of my truck to look around as I was highly agitated (read:pretty dang spooked) I turned around and kept flashing my spotlight down the side of the mountain occasionally and went past camp down the hill on to Foresthill Road and drove up the road a little ways before turning around again and heading to camp. My dad and brother reported that they had heard nothing and it was quiet for awhile. I sat around the fire and watched the tv that my dad had brought with him; my brother was tired and had gone to bed fairly early. Everything seemed fairly quiet until I went to go \"number one\" by a big pine tree across the road and as I was juggling with the belt that was holding my pistol in its holster, I heard that noise behind the tree and it seemed like it was maybe 30 yards down the hill, it startled me, to say the least, and I ran back to the relative safety of the campfire holding up my pants with one hand and my pistol with the other, much to my dads amusement. Needless to say, I did not venture from camp the rest of the night. We continued to hear the noises until we went to bed, around 0330 or so, I remember hearing it around 0345 and yelling to my dad (he slept in the back of his camper, my brother and I in my tent, 15 ft away) \"there it is again!\", but he was sleepy. I finally drifted off to sleep shortly thereafter and no noise was heard again. THE \"NOISE\": Resonant. Very similar to the \"Howl\" on your website, but of a shorter duration, 2-3 seconds or so each time. A note about my father and brother: my brother was very tired from working the night before and he drank quite a bit of beer on this evening; he may have also thought that I was trying to \"spook\" him as he does not go camping much. He was disinterested and does not remember much. My fathers curiosity was piqued, but he was not agitated or spooked like I was; his philosophy is that humans are the most dangerous creatures out in the forest,and this was an animal, though he was not sure what it was and still doesnt. Also, he states that I heard brush or sticks being broken, but I cant recall stating that. I would not have even wrote this in until I had read the reports from the Tahoe area, which described such a similar noise, and is only about 60-70 miles as the crow flies from there.",
  "classification": "Class B",
  "county": "Placer",
  "state": "California",
  "latitude": 39.01917,
  "longitude": -120.8275,
  "location": "-120.8275,39.01917",
  "location_details": "From Sacramento: take I-80 East towards Reno,take the Auburn Ravine Road exit and turn right, cross the intersection and this is Foresthill Road. Follow it for about 17 miles and you'll hit Foresthill, then go approximately 20 more miles to Historic Marker 8, which is Ford Point and look to your left, there will be a dirt road going up a hill. Follow that for 1/4-1/2 mile and look for a flat area with a rock ring off the right side of the road. The dirt road continues up the hill where it gets very rugged and you need Four wheel drive to continue much farther; it will then pop you up on another dirt road, which, if you go left, will dead end to another flat spot and another \"primitive\"-type camp ground. During this camping trip we went to that higher campground and thought about camping, but changed our minds",
  "temperature_high": 86.81,
  "temperature_mid": 72.625,
  "temperature_low": 58.44,
  "dew_point": 49.79,
  "humidity": 0.46,
  "cloud_cover": 0.06,
  "moon_phase": 0.53,
  "precip_intensity": 0.0003,
  "precip_probability": 0.32,
  "precip_type": "rain",
  "pressure": 1004.48,
  "summary": "Clear throughout the day.",
  "uv_index": 12,
  "visibility": 10,
  "wind_bearing": 199,
  "wind_speed": 3.14
}