{
  "reportId": "43742",
  "title": "",
  "date": "",
  "observed": "It was late in the evening. I just let the dog outside to do her thing before bed.  She started barking constantly with alarm.  I went outside and my horses were all lined up staring down the roadway.  Then I heard this weird noise, very loud! Kind of cross between a scream and a growl.  It did it several times.  I went in the house to get my husband to come out and hear it.  He came right now but the noise had stopped. He however did see how alert and nervous the horses were and how the dog was scared and barking.  We stayed outside quite a while but heard nothing more. Several days later, also in the evening.  I took the ATV to go close my gate at the end of my driveway about 3/4 mile away.  As I went around the curve I seen a large, wide spread pair of eyes.  I slowed but did not stop.  I continued down the hill and I could feel the hair go up on the back of my neck. Of course I had to go back up. I seen nothing on the way up.  I told my husband about it.  The next day I went down to the spot where I had seen the eyes.  I saw no tracks looking over the edge of the bank but figured whatever was there had to be about 8 feet tall to put the eyes at the height they were and be standing on the ground.  There is a spring in the ditch line, the bank is very steep and I choose to not go down to investigate.  I went to your website to check if there were any reports for Iowa County WI. A that time there was 1 near Dodgeville about 30 miles away years ago.  I have thought of this several times in the past year.  I've had 2 other people that have been on my farm--in the woods that have said they heard \"something...like nothing they have ever heard before\" out there.  I did not share my story with either of them but I told them they weren't the only ones to hear something. Tonight I was watching the Bigfoot show and I thought I would get on your site and check things out again.  Guess what?  I know exactly where a witness lives and it's probably 5 miles away from me.  I never heard anything about it until I read it on your site tonight.  I probably won't call him but if I see him I'll have to share my experience with him.",
  "classification": "Class B",
  "county": "Iowa",
  "state": "Wisconsin",
  "location_details": "Dry Dog Road, Avoca, WI",
  "summary": ""
}