{
  "reportId": "531",
  "title": "Woman witnesses large, hairy man-like creature outside home",
  "date": "1994-10-15",
  "timestamp": 782179200,
  "observed": "Year: 1994 Season: Fall Weather: Cloudy with drizzle Time: Approx 4:00 PM Location: Rock Creek Rd, Portland, OR Multnomah County X-Street: Old Cornelius Pass (Skyline area) Incident: I was in the kitchen talking on the phone with my sister and looking across the street at the hillside beyond the creek through the kitchen window. The dogs were barking so I was curious to know what was going on outside. I saw the bushes moving and I saw what looked like a very tall,  broad, stout, hairy person, almost ape looking, with long dark brown hair. It was rustling through the bushes. The leaves were moving. I looked at it for about two minutes trying to see what it was. Then it disappeared. I was describing what I had just seen to my sister on the phone as it happened. I felt excited and scared. I locked the door and checked for the twelve gage (my husbands gun). I didn't see the Sasquach after that. But once in a while after that, my dogs would bark in that different wimpering way. Not their normal bark. My sister was watching a documentary about Sasquatch in the Portland, OR area on the TLC Channel (The Learning Chanel) that aired on Friday, Oct. 27th 2000. That reminded her of our conversation on the phone when I saw Sasquach that day. She called me to talk about what I had seen because she did some research and found the bfro.net web site and encouraged me to document the sighting.",
  "classification": "Class A",
  "county": "Multnomah",
  "state": "Oregon",
  "latitude": 45.63893,
  "longitude": -122.8889,
  "location": "-122.8889,45.63893",
  "location_details": "On US-26,Sunset Hwy and go West for 9.2 miles Bear right on ramp at sign reading \"Exit 64 185th Ave. to Rock Cr.\" and go Northwest for 0.3 miles Turn right on NW 185th Ave and go North for 2.7 miles Turn left on NW Germantown Rd and go West for 0.3 miles Turn right on NW Old Cornelius Pass Rd and go North for about 500 feet Turn right on NW Cornelius Pass Rd and go North for 2.2 miles Continue on NW Skyline Blvd and go Northwest for 2.4 miles Turn left on NW Rock Creek Rd and go Northwest for 0.4 miles to Nw Rock Creek Rd",
  "temperature_high": 59.3,
  "temperature_mid": 48.425,
  "temperature_low": 37.55,
  "dew_point": 43.36,
  "humidity": 0.82,
  "cloud_cover": 0.59,
  "moon_phase": 0.38,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.05,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 2,
  "visibility": 9.55,
  "wind_bearing": 285,
  "wind_speed": 1.37
}