{
  "reportId": "15885",
  "title": "Possible confrontation with hikers at night in Cuyahoga Valley National Park",
  "date": "1995-01-04",
  "timestamp": 789177600,
  "observed": "My incident occurred on the 4th of july in 1995 in the CVNRA in Boston Twp(?), Ohio. I was in the Army, home on leave at the time. Three of us(myself, cousin, and a friend) had just left the Independence fireworks and decided to go for a night hike on the railroad tracks which run paralell to Riverview Rd. near Brandywine Ski Resort. This was a hike we have made several times before in varying locations along the same road without incident. On this particular hike, we parked in a public lot on the corner of riverview and vaughn rd. and headed north on the Cuyahoga Valley Line tracks. I would say the time was around 11:30p.m. and the sky was clear with a very bright moon. We hiked approx. 1/4 mile when all of a sudden we heard a distant, high pitched scream from the west... across riverview rd. The scream sounded similar to that of a coyote or peacock...only it was raspier and lasted about 5 sec. in duration and did not waver. We shrugged it off as some sort of animal and continued on. As we hiked the tracks, we got to a clearing that has a marsh/swamp to the west between the tracks and the road and tall weeds/brush/trees to the east. As we passed through this clearing, you could see beavers swimming in the swamp and hear typical summer insects and frogs. We entered a heavilly wooded area where some railroad cars and equipment were parked, nosed around for a few minutes and decided to head back. We were talking amonst ourselves as we entered the clearing again when a second, VERY powerful, angry roar came from the middle of the swamp. Once again, it was higher in pitch than what one would normally associated a \"roar\" to sound like, only this time, it lasted much longer(about 8 to 10 sec.)and was very close(approx. 50 to 75 ft.) The three of us froze dead in our tracks an barely uttered \"what the F*** was that!?!) when a very large creature came charging through the swamp right at us. All we could see was a silhouette, but it was definitly upright on two legs, swinging its arms and a massive torso as it was running through the water. This thing was actually making waves and moving extreamly quick for being chest deep in muck, water and cattails. The three of us sprinted back towards the car, occationally looking back to see if it was following us. We could see the silhoette at the edge of the swamp, but it never left that spot or climbed up onto the tracks. This happened over eleven years ago and I remember it as though it were yesterday. I would also bet that this was no prank...given the shear size and the power at which it muscled through the water. Not to mention the scream it made. I still live in the area (Richfield) and pass through this spot on a regular basis. Although I have never seen or heard anything like this since, it still gives me goosebumps when I drive through the area... my wife thinks i'm nuts!",
  "classification": "Class A",
  "county": "Summit",
  "state": "Ohio",
  "latitude": 41.29621,
  "longitude": -81.5745,
  "location": "-81.5745,41.29621",
  "location_details": "From RT.82 in Brecksville, OH., Head south on Riverview road approx. 5 miles. Vaughn road will be on the left with a bunch of yellow houses/buildings belonging to the park service. There is a public parking lot on the NE corner.",
  "temperature_high": 13.64,
  "temperature_mid": 8.675,
  "temperature_low": 3.71,
  "dew_point": 5.1,
  "humidity": 0.72,
  "cloud_cover": 0.7,
  "moon_phase": 0.12,
  "precip_intensity": 0.0004,
  "precip_probability": 0.45,
  "precip_type": "snow",
  "pressure": 1025.55,
  "summary": "Snow (< 1 in.) overnight.",
  "uv_index": 1,
  "visibility": 6.1,
  "wind_bearing": 258,
  "wind_speed": 15.34
}