{
  "id": "80",
  "title": "Late Arriving Campers Hear Running, Stomping, Shrieking, Howling",
  "date": "1983-08-12",
  "timestamp": 429494400,
  "observed": "My veterinarian sister, former girlfriend, and myself had been on a road trip and had finished eating dinner at the Sizzler in Bend, when we headed south to find a camping spot for the night. We were heading south and then west when we stumbled onto Kitson Springs, a deserted place when we arrived.  We basically threw our sleeping bags on the ground and went to sleep.  In no more than 10 minutes we heard loud rustling by the spring about 20 yards away, then a series of loud stomping, then a blood curdling shrieking and howling that lasted nearly 20 minutes. If you are familiar with the Puyallup tape from 1974, this will give you an example of what we heard.  We could not see the creature.  I had to cover my ears and my two companions panicked, so I told them to play dead.  We were scared stiff anyway.  I whispered to my sister, the vet, if she thought it could be a cougar which she thought was ridiculous.  She suggested it sounded apelike. The \"creature\" ran at tremendous speed up the hillside screaming the whole way and we heard the shrieks in the distance for at least another 10 minutes.  We somehow fell asleep and awoke in the morning not quite sure of what had been there.  I found NO tracks, but had little time to look; since my sister threatened to drive away without me if I didn't get in the car.  How we fell asleep, I don't know.",
  "classification": "Class B",
  "county": "Lane",
  "state": "Oregon",
  "latitude": 43.69005,
  "longitude": -122.3755,
  "location": "-122.3755,43.69005",
  "location_details": "It was at Kitson Springs, near the Willamette Divide",
  "temperature_high": 83.55,
  "temperature_mid": 69.305,
  "temperature_low": 55.06,
  "dew_point": 51.86,
  "humidity": 0.62,
  "cloud_cover": 0.09,
  "moon_phase": 0.15,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.06,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 8,
  "visibility": 9.71,
  "wind_bearing": 355,
  "wind_speed": 7.11
}