{
  "reportId": "802",
  "title": "",
  "date": "",
  "observed": "I have to say, I was looking for just such a thing, being that I have an interest in the phenomenon (for lack of a better term). The ground was rather hard-packed with sand by the river-crossing areas. While passing a patch of mud from a spring I examined it and found the definite impressions of a five-toed human foot. I really couldn't believe it due to the odds of me actually wanting to see it (trying to be objective here). I checked for claw marks, such as a bear would leave, and found none. The footprint had pine needles covering most of it. Upon inspection I found the rest of the footprint was also there, down to the heel, and it measured approximately 13-15 inches in length. My brother and an Indian friend of ours, John, cleared away some of the needles to get a better look at it. (we were joking that John had some friends out there that wanted to make sure we had a fun time.) We took, I believe, two photos of this print with my hands pointing to the front and back of the track, but with the sun dirctly overhead, and not really a professional camera (although , I guess, Pentax is good enough for Steve ). I'm not quite sure how they'll make out. I was now determined to search the rest of the trail, and made sure that I went first so as to not let anyone else disturb other potential tracks. Right away in a sandy spot ahead I discovered another one, followed by more. One of the tracks was half the size of the first, and it almost appeared to be three-toed in places. We took shots of at least one more good one before heading up further to the summit. Being that there are open mines up there, I was a bit elated that we may perhaps be entering a \"hangout\" so to speak. nothing else was seen or smelt or felt (at least not at that time) apart from a set of indiscernible tracks going straight up a snow embankment on the other side of the canyon. Upon returning, after summitting and checking out mines, I lagged behind to study the ground again. I found better traces in the waning light than I did earlier, including some tracks that were better than the first set. They were very clearly humanoid and large, with at least two sets again (large and small). Unfortunately, my brother and my friend had used up all of their film (not to mention they were way down the trail yelling back at me to \"hurry up\"). Upon staying back, and realizing I was alone, I finally got the jitters. Could've been my mind and the events leading up to that, but I felt I was being watched and I felt the need to bolt down the trail. I wouldn't have reported this at all apart from the fact that I figured this may be helpful for any geographical data-basing you may be doing (migration patterns, whatever.) Also, this may or may not be related, but on a trip to Mt Lassen about a week before, my girlfriend, brother and I were the only people on the hill there (hiking up another closed-for-winter road, the loop). along the way we kept hearing a vibrating \"whoop whoop whoop\" that would seem to come from all directions. We chalked it up to being a bird, but the low vibrations could be felt. Interestingly also, the sound \"followed\" us. For whatever that's worth, perhaps there have been similar reports from the Lassen area.",
  "classification": "Class B",
  "county": "Alpine",
  "state": "California",
  "location_details": "Hwy 4 to Ebbott's Pass road was closed for winter conditions. We had mountain-biked four miles up the road, then taken a trail west up another 2000 feet to some mines. The trail is impossible to see if you are driving by fast.",
  "summary": ""
}