{
  "reportId": "24318",
  "title": "",
  "date": "",
  "observed": "To whom it may concern: I am not sure how to even go about this other than to send an email to you. Earlier today around 6:25 p.m. my brother was driving home (we live between Corbett Or, and Aims Or.) off of Gordon Creek Rd. There is a switch back with a hair pin turn that has a steep climb immediatly after the turn. As he turned the corner approximatly 20-30 yards from his vehicle in a small cluster of trees he saw a large 7-8 ft tall, hairy creature. He said it wasn't human, but resembled a human standing with his right shoulder hidden behind the last of the 3 trees in the cluster. Upon being discovered he said that he immediately turned and ran up the very steep hill with amazing speed. He said his chest was wider than his waist, hairy, with long arms (ape like) and that he saw him from just below the waste up before he turned (the creature turned to his left) and ran up hill. He couldnt believe how fast he was and that he was there for a couple seconds and then he was gone. My brother frantically called me and I told him to go back to where he saw it and mark it out so that I could meet him there with my HD camera and try to find any prints or debris that may have been left behind. Upon returning to the area my brother saw the local sheriff cars nearby. They said that some people down on the river reported a very hairy naked homeless man and they were investigating. He told them that he saw the same thing but that it wasn't a homeless man. He was very detailed in his account and they laughed it off and left. I drove straight home and met my brother at the switch backs where he sighted it. I brought my dog and my camera. I went to the exact same location as he told me and had him recount exactly what happened. I have it all on film. The area is steep and there are fallen trees and lots of shrubs, so it is a little difficult to see any exact markings other then broken branches and trampled ferns. Near the group of trees where he was standing there is a natural spring that runs down the hill. So I searched both sides to try and find any  tracks. Im not sure what to really do other than keep my eyes peeled and my camera close. If you feel my brother could be of any help or if you could help him understand what he saw Im sure he would greatly appreciate it. He is pretty shaken up, I had him write down exactly what happend and what he saw and he was a little uncomfortable doing so. I would prefer to keep this private, I am an Investment Banker and would prefer to keep a sense of trust and credibility with people I associate with and I am unsure how they would respond to this.",
  "classification": "Class A",
  "county": "Multnomah",
  "state": "Oregon",
  "location_details": "Sharp switchbacks on Gordon Creek Road between Springdale and Aims",
  "summary": ""
}