{
  "id": "5228",
  "title": "Motorist has nighttime sighting of bipedal animal at roadside",
  "date": "1997-03-14",
  "timestamp": 858297600,
  "observed": "In the spring of 1997 I had to make a trip to Jonesboro Arkansas. Since I live in Fayetteville Arkansas the best way was across Hgwy 463 across the top of the state. (I think thats the hgwy #, Its the only time i've ever been on that road) Anyway, I finished my business and was returning home that evening. It was around 9 PM when I passed thru a small town named Salem. With the town behind me I was once again the only car on the hgwy, my headlights were on brite, the windows were up cause I had the heater on and the radio was playing softly. There was a clearance of maybe 20 feet between the edge of the road and the woods when I noticed what I thought was a tree standing right beside the road. As I got closer the tree turned and took just a few steps and was at the woods. It was HUGE and had long, matted hair. Actually it looked quite nasty. It never looked directly at me. It was slipping into the woods as I passed to the point of it going out of my headlights beam. I stomped on the gas with everything I had and didn't slow down till I was safely in the lights of the next town. As I drove wildly down the highway at 90 miles an hour (Thats as fast as the car I was driving would go) I kept looking in the rear view mirror to make sure it wasn't chasing me. I know that sounds nutty but at the time it seemed like a really good idea. I was perfectly sober at the time, maybe that should be a lesson to me",
  "classification": "Class A",
  "county": "Fulton",
  "state": "Arkansas",
  "latitude": 36.37111,
  "longitude": -91.87,
  "location": "-91.87,36.37111",
  "location_details": "It was a few miles west of Salem Arkansas. Its the only time i've evered travelled that highway so thats about all I can tell you.",
  "temperature_high": 45.03,
  "temperature_mid": 36,
  "temperature_low": 26.97,
  "dew_point": 31.83,
  "humidity": 0.66,
  "cloud_cover": 0.54,
  "moon_phase": 0.21,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.06,
  "summary": "Mostly cloudy until evening and breezy until afternoon.",
  "uv_index": 5,
  "visibility": 9.09,
  "wind_bearing": 321,
  "wind_speed": 12.8
}