{
  "reportId": "34043",
  "title": "Observation by a hunter through his scope by the New River Gorge Bridge near Fayetteville",
  "date": "2007-11-28",
  "timestamp": 1196208000,
  "observed": "To keep it short..I was deer hunting in the new river gorge in Fayetteville WW and it was in 2007, the week of thanksgiving. It was evening with about two hours of daylight left and I noticed movement about 60 yards towards the gorge from my position..I raised my gun to view the movement through the scope..after holding it in position for 10 sec or so I saw a very large hand appear from the side of a large Poplar tree..it was palm against the tree and I saw fingers mostly..then to my surprise I saw a head peek from around the large tree and two LARGE eyes affixed on a head if a creature I've never seen before..and I'm a hunter..have been since I was 8..I'm now 38.. The Bigfoot blinked twice while looking at me and then stepped back behind the tree..I viewed it for about 20 seconds while it was looking at me..my mind just couldn't figure out what it was and I knew what it wasn't..I had no desire to shoot it and very well could have but my mind and body almost seemed to be in a state of shock while viewing it..I had to cross near the location on the trail out if the woods and I was F'n terrified even with a loaded deer rifle..my hair stood on end when I realized that I would have to go towards the location to get out of the woods..I called my uncle as soon as I got to my jeep and told him..he believed me..I am a VERY honest man and would never lie about this..the thing is though..I never heard it run away or move through the leaves..and you can hear movement from 200+ yards off in these woods..it's like it just disappeared..I came home very shaken from the experience and it changed my life..now I know that it is out there. It was very cool looking..about 7ft tall, it had very dark large pupils and around the pupils its eyes were almost owl like..it had brownish blond fur and it had a visible face..it almost looked like the troll faces that you used to put on your pencils as kids..really..but, it was very clean looking and not what you would expect..its fingers were long and thick with no fur and it had dark fingernails..I had my scope on 9 power and it was equivalent to being about 30 ft from me visually..it was real and I would take a polygraph and swear on my life.",
  "classification": "Class A",
  "county": "Fayette",
  "state": "West Virginia",
  "latitude": 38.0695,
  "longitude": -81.08506,
  "location": "-81.08506,38.0695",
  "location_details": "New River Gorge",
  "temperature_high": 53.47,
  "temperature_mid": 46.24,
  "temperature_low": 39.01,
  "dew_point": 25.24,
  "humidity": 0.6,
  "cloud_cover": 0.03,
  "moon_phase": 0.65,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1027.55,
  "summary": "Clear throughout the day.",
  "uv_index": 2,
  "visibility": 9.46,
  "wind_bearing": 175,
  "wind_speed": 2.01
}