{
  "reportId": "50721",
  "title": "",
  "date": "",
  "observed": "I am a BFRO investigator in the mountains of Western North Carolina. Having lived in the mountains all of my life, I have enjoyed hunting, hiking and mountain things since I was a boy. So, I am very comfortable with being in the woods and for years have taken late night drives to see wildlife. For the past few years, I have been taking late night drives to my research are on good weather nights. It was Tuesday June 23rd, 2015; the weather was good and I decided to take a late drive to my research area. I was still on the main road taking my time and within 5 miles of my destination. I was not really thinking about Sasquatch but just enjoying the late night drive and some music.  As I was rounding a slight turn on the road, I saw a coyote on the right side of the road. I slowed slightly as my eyes panned back to the road and I then saw to my left the creature just off the road and behind the guardrail. My trucks side lights hit it just briefly where I could get a good look at it. My sighting was brief but I did get a good look at it. I could not believe what I saw! I went up the road and turned around as it caught me off guard I did not think to stop.  I was trying to talk myself out of what I saw. \"Could it been something else?\" The area on the left was very green so I thought I might have seen something else, maybe. As I approached the area I stopped and searched up and down for anything looking reddish/brown in color. Since it was June in the Mtns., everything was very green but nothing was brown at all. Bringing proof to me that it was a creature I saw.  It is very hard to describe the feeling I had at the time of the sighting and after. I was feeling very strange and could not believe what had just happened. This is what I saw.  Just past the guardrail and slightly off the bank of the road (this bank is very steep) I saw a reddish/brown upright figure. It had it's back to me and I could see from the back and upper legs behind the guardrail. I am very sure it was on two legs with a most impressive width. The shoulders were very large and the head was slightly forward with a no neck type look.  The waist to shoulders made a very impressive \"V\" shape larger than any man I have ever seen. The hair was slightly long and had another color of gray/white underneath it with a main coat color of reddish/brown. Some of the back hair was shaggy looking. The left shoulder was slightly up and the arm was curled. The sighting was brief but I got a very good look at it. I could tell it was very tall. I did a sketch. After turning around and checking the sighting area from my truck, I pulled off about 150 yards below on the side of the road.  I got out of my truck to listen for about 10 minutes and then did a \"Howl Call\". I immediately got a response from a pack of coyotes. They were very close and below the road about 150 yards away. (This would be the side of the road the creature was on.) I tried driving back up the road to see anything and about 100 yards above where I saw the creature I saw a Wild Boar feeding on the side of the road. Later on I stopped at an overlook about 1/4 mile past the sighting and made another \"howl call\". I got an immediate response from an owl behind me close to the parking lot. Then just after this response I heard another owl call in the valley below me towards the sighting area. It was the loudest owl call I have ever heard! I have heard many different owl calls but this one was very strange. The volume of it was very strange and loud. I stayed in the area for 4 more hours with nothing more happening.  The next afternoon me and friend went back to the general area of the sighting and looked for tracks. We could only see disturbances as the ground was very rocky, steep and hard. I cannot fully explain my feeling after the sighting. I really noticed I was feeling strange when I had gone to get a drink a few miles away in a store. I notice I was sweating and feeling very odd. I think that I was slightly in a state of shock. I feel like this was due to me seeing something I had not seen ever before and something that was hard for me to process. I have been hunting and in the woods all of my life. I have seen every animal in our area in many situations. Trust me, I have never seen anything like this before. Important footnote:  This sighting happened just within about 6-7 miles from another reported incident that I investigated. BFRO report 49148 happened on June 29th, 2015; 6 days after the sighting I had. I feel like this is more than a coincidence.",
  "classification": "Class A",
  "county": "Macon",
  "state": "North Carolina",
  "location_details": "Please do not post",
  "summary": ""
}