{
  "reportId": "41503",
  "title": "Nighttime road crossing near Camp Blanding",
  "date": "2012-06-12",
  "timestamp": 1339459200,
  "observed": "My Fiance had an accident at work last summer where he received burns on his hand and I had to take him to the burn center in Gainesville at Shands.  I was driving home with him in the car and he was asleep from the painkillers he was on due to his burns. I had my highbeams on and was going ~45mph down SR-16 eastbound near Starke/Camp Blanding. A creature ran across the road on all fours or heavily crouched over. It did not have a tail and in the high beams it looked blueish-grey. Its rear end was pushed up high from the ground, about 4 feet or so, but when it got to the other side of the road it stood up and ran on two legs. I noticed its face was very flat, with no snout or jawline, but with hair all around it. It happened very fast, but I am sure it wasn't a bear because I couldn't see a snout, and I'm sure it was not a panther because there was not a tail. Once it stood up it looked to be about 6 foot tall. Once it crossed the road it kept on running into the woods and never slowed down. While it was running on the asphalt it looked like a lemur running on all fours, once it hit the grass it stood up and continued running bipedally without skipping a beat and made maybe three steps until it was in the woods. I turned to my Fiance and asked \"did you see that?\" but he was unconscious. I didn't mention it earlier because I never really thought twice about it, but my fiance and i were watching TV and it was a bigfoot documentary, i asked him if he remembered the event, and he said no, but then told me to go ahead and report it to the BFRO.",
  "classification": "Class A",
  "county": "Bradford",
  "state": "Florida",
  "latitude": 29.97917,
  "longitude": -81.85223,
  "location": "-81.85223,29.97917",
  "location_details": "Headed east from Gainesville on SR-16 between Starke and Camp Blanding.",
  "temperature_high": 87.78,
  "temperature_mid": 81.025,
  "temperature_low": 74.27,
  "dew_point": 71.08,
  "humidity": 0.81,
  "cloud_cover": 0.31,
  "moon_phase": 0.79,
  "precip_intensity": 0.0131,
  "precip_probability": 0.5,
  "precip_type": "rain",
  "pressure": 1017.26,
  "summary": "Heavy rain in the afternoon.",
  "uv_index": 10,
  "visibility": 9.37,
  "wind_bearing": 195,
  "wind_speed": 5.4
}