{
  "id": "12844",
  "title": "Hiker photographs track on trail in Hoh River rainforest, on the Olympic Peninsula",
  "date": "2006-02-23",
  "timestamp": 1140652800,
  "observed": "I am submitting this is response to report #12098.  In August 0f 2001, when my wife and I still lived in Florida, we made a trip out to WA and visited the Hoh rainforest.  We hiked up a well-traveled trail--possibly the Spruce Trail--and came upon a footprint of which I still have a picture.  It was a bare human-like footprint about 11-12 inches long.  Given (a) the modest size of the footprint, (b) the popular nature of the trail and (c) the fact that there were many \"hippy\" types in the area, I assumed it was just a very casual hiker.  But I took a picture anyway, with my boot for comparison. Upon seeing the picture in report #12098, I dug out my picture and was struck by the similarity.  Having lived in WA a few years now and having become better acquainted with what are purported to be genuine sasquatch footprints, I took note of the squared-off toes and the medially-leaning big toe.  In the picture, just above the toe of my right boot, one can see a print I made, which barely sunk in at all compared to the print in question (though moisture levels may have varied). I don't remember much about that day beyond the huge trees.  The rest of that film roll is my wife posing beside big, buttressed trunks.  There were other people on the trail that day, which, to me, made it unlikely that a sasquatch had been hanging out there, though I suppose the print could've been made at night.  Given the traffic on the trail, however, I would've expected it to have been obliterated already.  Perhaps other people were noticing it and stepping around it too.  If I'm not mistaken, there was another less distinct track down (or up) the trail, but I can't be certain.  I've never heard of bigfoot tracks on hiking trails, which was another reason I dismissed the track.  Another possibility is a hoaxer, though you'd think they'd go for something more dramatic and attention-grabbing, like a 16 inch print. The picture was on a normal camera, so I can't put it on the computer.  Please let me know if you'd like me to send it in.  If it is a genuine print, I'm wondering if it's the same individual from report #12098.",
  "classification": "Class B",
  "county": "Jefferson",
  "state": "Washington",
  "latitude": 47.86697,
  "longitude": -123.8796,
  "location": "-123.8796,47.86697",
  "location_details": "",
  "temperature_high": 43.61,
  "temperature_mid": 38.22,
  "temperature_low": 32.83,
  "dew_point": 35.18,
  "humidity": 0.8,
  "cloud_cover": 0.67,
  "moon_phase": 0.84,
  "precip_intensity": 0.0068,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1020.2,
  "summary": "Light rain in the morning.",
  "uv_index": 2,
  "visibility": 9.13,
  "wind_bearing": 289,
  "wind_speed": 9.46
}