{
  "reportId": "3214",
  "title": "",
  "date": "",
  "observed": "On 7 Oct 01, at approximately 6:30 pm (twilight) in the Severn Run State Park, while researching a previous sighting of an animal in this area, I spotted another animal, which had frozen in position (to avoid detection, it must have heard my car door shut), at a distance of approx 150 yards off the roadway. The temperature had dropped dramatically, causing a fog to rise over a stream between myself and the animal, partly obscuring my view. I had parked alongside the road, and was standing behind my car, looking into the woods when I spotted the animal standing in the undergrowth (growth is approximately five feet tall, and the animal was approximately three feet above that, slightly bent over). Severn Run State Park, is a state stocked trout stream, which runs from the Odenton area to the Severn River near Annapolis, the state capitol and home of the US Naval Academy. The woods here at this location are mature trees, with lots of undergrowth, no \"middle growth\" trees, so visibility is good through the growth. Lots of greenbriar and small trees approximately five feet tall. The animal was traveling towards Odenton, and was facing towards the right. Its head was lowered slightly, looking in my direction and was turned in such a way that I could only see one arm, the back, and its face. The animal was a light tan in color, approx 8-9 feet tall. It had large eyebrow ridges which cast a shadow over its eyes (didn't see eyes), a large jaw, a roundish face, MASSIVE shoulder muscles, and huge biceps. The animal had long head hair, which extended down to about the bottom of its shoulder blades. No hair hung over its face. The hair on the body of the animal appeared to be short and tight to the body, not shaggy or matted. Coloration was constant over the body and head. I yelled \"HEY!\", clapped my hands and whistled. The animal wouldn't move. After approximately 15 min I left the area.  It was too dark for any photos to turn out from my cheap camera. The exact location is currently under observation by the BFRO, and will be revealed at a later date. Thank you for your understanding.",
  "classification": "Class A",
  "county": "Anne Arundel",
  "state": "Maryland",
  "location_details": "Severn Run State Park. Area is currently under observation by the BFRO, exact  location will be revealed at a later date. Thank you for your understanding.",
  "summary": ""
}