{
  "reportId": "1454",
  "title": "Three backpackers see a large, massive upright animal running on two legs through the brush in Gallatin Nat'l Forest",
  "date": "1993-06-03",
  "timestamp": 739065600,
  "observed": "Two friends and I were backpacking in the summer of 93'. We were going to hike the Gallatin divide that summer, one weekend at a time. We started south of Bozeman and planned to finish in Yellowstone latter that summer. This was our third weekend and it being a Sunday we were hiking out to our car which was parked at the Portal Creek access. It was getting late in the day and it looked like some weather was rolling in. We were coming down the west side of windy pass so we decided to double time it so we weren't exposed in the weather. We didn't make it to the tree line before the storm hit us. The wind was howling and a nasty mix of rain/hail came down on us. When we were well enough below tree line we decided to sit out the storm by this rock out cropping. Wind whipping through the hills, especially in a rocky area like this, has a very distinct sound. It seemed like there was something else in that in that howl. Something that didn't quite sound like it was part of the wind. No one commented on it but I could tell by how Dan and Kevin were looking around that they heard it too. After about 45 minutes the wind died a bit and only a slight drizzle was falling. We started hiking back down, the clouds were clearing and it looked like we were gonna get a good view of sun setting over the Spanish peaks. We were coming through this clearing that had been cut maybe ten years ago. The sun was almost out of sight when we heard some thrashing across the clearing. It could have been almost anything but since we were in bear country Kevin took out his .357; not enough to stop a determined grizzly, but it was better than nothing. We proceeded slowly across the clearing. It was maybe a hundred yards towards to older tree line, with a lot of scrub and young pines in between. I was looking up for circling carrion when I heard this howl. It sounded like what I had heard earlier but now the wind wasn't behind it. It sent a chill up my spine. Dan, who was behind me yelled something to the effect of \"holy [#*$%]\" and pointed off to our right. Something massive and dark and clearly running on two legs ran through the brush about sixty yards away and disappeared into the forest. I don't think any of us moved or spoke for about five minutes until we heard the howl (yell?) again (this time pretty far off and in the opposite direction than we were heading) We got out of there in a hurry. We didn't tell too many people about this when we got back to town. We did return back to Portal Creek access the next weekend to start our hike again and I've been back to that area several times since hunting or just out of curiosity and I've never heard or seen anything unusual.",
  "classification": "Class A",
  "county": "Gallatin",
  "state": "Montana",
  "latitude": 45.22417,
  "longitude": -111.125,
  "location": "-111.125,45.22417",
  "location_details": "U.S.A. Gallatin National Forest, Gallatin County, Montana. ~10 miles east of US 191 ~30 miles south of Bozeman. Incident occurred in the Portal Creek area.",
  "temperature_high": 50.83,
  "temperature_mid": 45.365,
  "temperature_low": 39.9,
  "dew_point": 33.32,
  "humidity": 0.64,
  "cloud_cover": 0.92,
  "moon_phase": 0.48,
  "precip_intensity": 0.0029,
  "precip_probability": 0.69,
  "precip_type": "rain",
  "pressure": 1013.18,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 9.61,
  "wind_bearing": 46,
  "wind_speed": 4.39
}