{
  "reportId": "24648",
  "title": "Man retells his close, visual encounter at dawn on Pine Mountain as a young deer hunter",
  "date": "2008-09-14",
  "timestamp": 1221350400,
  "observed": "An unknown ape-like creature walked upright out of the thick patch of bushes and stood looking, for several seconds, up and down the fire lane.  I cocked the hammer back on the .32 caliber carbine, shouldered the weapon, and began to press the trigger.  Something in my mind ordered me to not shoot the creature!  I call it Devine intervention. I asked myself if this was a bear?  No, I instantly decided that it didn’t look like a bear because there was not a long, protruding snout jutting out from the face.  Besides, bears were not legal game in this area of California.  It certainly was not a buck, never mind the fact that if it was a deer there were no horns on this animal.  I immediately told myself it looked like a “monkey man”.  I can hear myself today saying these words out loud:  “What the hell is a monkey doing out here in the mountains”?  In the meantime, as I made the move to shoulder the carbine, and spoke those words, the big animal turned towards me from the waste up.  Looking over the sights of the little carbine, I observed this being to be about 7 or 8 feet tall, with well-muscled, long hairy arms hanging down to the waist. The hands looked almost human; I remember noticing these things as I slowly put down the gun.  This creature was completely covered in long dark, brown hair, from head to feet and appeared to have a huge, barrel chest.  Some other striking features that I noticed were a flat, square jawed face; a flat, dark looking nose; no noticeable hair on the face; and a “sloping fore head”.  I don’t remember seeing any sign of ears on the animal – too much long hair around the side of the head – and there was no discernable neck.  Since I had no idea what this creature was, I’ve always been glad to have instantly decided NOT TO SHOOT IT!  Thank God for protective Angles?  The other thing I thought about, at the time, was this could be some idiot in a “monkey suit” playing a prank on some hunter like me.  But, then, only a “village idiot” would dress up in a monkey costume and roam around the mountains during deer hunting season.  As I contemplate the incident today, I realize now that this was a Bigfoot!  And, it had both seen and heard me.  I could not tell what sex it was because of all the long, dark hair around the body.  However, now that I have seen numerous showings of the Patterson film in which “Pattie” was documented, I must guesstimate it was male in gender?  Within 10-15 seconds, as quickly as the creature had entered my field of view, it calmly made about two strides across the open fire lane, parted some tall bushes with well-muscled, uplifted hairy arms, and disappeared into the thick bushes. Right away I noticed that it was now standing inside the screen of thick brush along side of the fire land like it was watching me.  I could readily discern the huge dark shape, as it stood there for possibly a minute or so.  Apparently, it was looking at me sitting up the hill on the ground.  I didn’t know at the time whether it was going to attack me or leave.  I kept the little carbine in the “ready position” across my chest and slowly stood up to get a better look at this unknown animal. I decided at the moment when I stood up that, that if this thing would “charge” me, I was going to run back up the hill to my dad - unless it got too close to me.  Then, and only then, would I consider shooting the animal!  I admit it – I was scared fit to wet my pants.  I now recall seeing the bushes shake violently and the dark shape stepped out of sight.  I slowly sat down again and listened to its rustling footsteps as the huge “ape-man” descended down the hill away from me.  Boy was I glad it was gone.  Now the shakes started.  If I had been smoking in those days, I would have lit a cigarette and probably smoked the whole pack.  Finally, after about 15-minutes, when the stillness was broken by singing birds and scurrying chipmunks, I got up enough nerve to carefully go down to the spot where I had seen this creature.  Was I dreaming?  No, because there, in the loose dirt, I saw a couple of huge, human-like, barefooted tracks where it had crossed the fire line. Then, a raunchy odor hit my nose.  I remember thinking it smelled like a horrendous fart.  In fact, at the time, I decided to call it the “Fart Creature”.  I know, that is not a very endearing name for such a marvelous being, but that’s how my scared brain was working that fateful morning. Deciding that now would be a good time to leave the area; I quickly walked back up the hill to where I had been sitting and stood there for a few minutes.  Clearly, I had seen something unexplained.  Now I had to decide if I should tell my dad or just keep quiet.  To tell you the truth, I was afraid to tell my father because I knew he would never believe me.  I thought he would most certainly take my hunting privileges away for seeing “buggers in the hills”.  I began slowly walking back up the firebreak towards my father in the piney flats above me.  I remember now that he had asked me why I had left my deer stand so early.  I think I replied that I was hungry and bored at not seeing a buck right after daylight.  He probably chewed me out for leaving so early, but, at least, I didn’t incur his wrath for telling a “bugger” story! Honestly, for many years I forgot about this incident.  I had to go back to military school the next week and the ensuing years later my life was filled with other things.  Of course, I really never did totally forget about seeing a Sasquatch!  It was only later on in life, after getting married, serving in the military, and leaving California for Florida, that this sighting began to trouble my conscious. How I kept this a secret for this many years I will never know.  I guess I was frightened that people would think I was crazy?  Usually, I’m the blabby type, sharing plenty of secrets with almost anybody, especially family or friends.  But this deal, oh no – I kept these cards close – too close for too long, really! I swear to all persons reading this report that the facts documented here are recalled to the best of my ability after 44 years and one month in the past! ____________R.R.R._____________  Friday, September 12, 2008  p.s. The photo of a Bigfoot creature from the “Patterson film” looks very much like that being I observed in August 1964.",
  "classification": "Class A",
  "county": "Ventura",
  "state": "California",
  "latitude": 34.625,
  "longitude": -119.2916,
  "location": "-119.2916,34.625",
  "location_details": "Pine Mountain campground.",
  "temperature_high": 77.3,
  "temperature_mid": 68.6,
  "temperature_low": 59.9,
  "dew_point": 54.28,
  "humidity": 0.65,
  "cloud_cover": 0.31,
  "moon_phase": 0.48,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.58,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 8,
  "visibility": 7.63,
  "wind_bearing": 278,
  "wind_speed": 4.43
}