{
  "reportId": "1506",
  "title": "Nighttime sighting by trucker near Honobia",
  "date": "2000-01-28",
  "timestamp": 949017600,
  "observed": "In July of 1983 I worked for the timber company driving a one ton truck pulling a 12 hundred gallon tanker in the Honobia-Pickens area. On a trip back to our facility a very large hairy creature ran across the road in front of me. I came within a few feet of running over it. It did not stop it just kept on running. It was approximately seven feet tall. The upper torso of its body was a brownish color and the lower was a lighter color. One of the things I particulaily noticed was no SHOES. My first thought was someone's pulling a prank. I soon realized that couldn't be, not up here in these mountainous forest. No houses for miles. I was told by phone by a relative that three large manlike, hairy creatures were observed on a persons porch and yard. The man got his SKS and has allegedly shot at one. My relative also told me that contractors who plant young pine seedlings are refuseing to go in near Honobia and plant trees. Today Jan 28, 2000 we have had a very heavy snow and while I was home listening to the scanner I overheard a conservation between two Oklahoma game wardens talking about the incident. One told the other to be on the lookout for large manlike hairy creatures. They seemed very serious. T They were talking about the same incident that I have mentioned above. This area is called the Honobia Wildlife area and is very,very sparsly inhabited. The area of 875.000 acres is owned by a large timber company and as the loggers move in to cut there are sightings.",
  "classification": "Class A",
  "county": "Le Flore",
  "state": "Oklahoma",
  "latitude": 34.61361,
  "longitude": -94.84861,
  "location": "-94.84861,34.61361",
  "location_details": "",
  "temperature_high": 29.15,
  "temperature_mid": 26.36,
  "temperature_low": 23.57,
  "dew_point": 21.89,
  "humidity": 0.82,
  "cloud_cover": 0.98,
  "moon_phase": 0.76,
  "precip_intensity": 0.0026,
  "precip_probability": 0.55,
  "precip_type": "snow",
  "pressure": 1028.83,
  "summary": "Overcast throughout the day.",
  "uv_index": 2,
  "visibility": 8.74,
  "wind_bearing": 42,
  "wind_speed": 4.8
}