{
  "id": "3390",
  "title": "Campers are disturbed by strange vocalizations in Piney Woods of East Texas",
  "date": "2003-10-15",
  "timestamp": 1066176000,
  "observed": "Me and my wife set out to go on an overnight camping trip in the country. I go hiking and camping fairly often and my wife sometimes accompanies me on my outings. This time we went about 30 miles southeast from where we live, in Nacogdoches to some remote family-owned land. Our land is on a small blacktop county road and few people live there. Only one neighbor lives close by, an old woman across the road. The road parallels Sam Rayburn reservoir for several miles and is a short distance from it at this point. It was late afternoon when we arrived there. Wildlife are plentiful in this area, with deer, bobcat, hogs, etc. and since I occasionally would hunt deer there, I put out some corn for them to get ready for season and then we set up our camp. We have a small storage building that family and friends use to sleep in on our hunting and camping outings. After we were set up for the night, I started a fire about five yards away from the building to roast hot dogs on. It was beginning to get dark at this time. We have a camcorder that we always take on our trips and I filmed the outing. I remembered that as it had gotten dark, dogs could be heard across the nearby road, barking like crazy. Up to this point I filmed everything, but since I was getting hungry, I stopped to make me some supper. My wife was sitting down on a makeshift chair and I was at the fire. Suddenly, a loud howl, or hoot came from a nearby creekbottom, a distance of about 70 yards. The sound is best described as a \"WOO-WAAH\" sound. It was very loud and sounded almost baboon-like, but also much like a human's vocal chords. We were both shocked by the piercing sound, but before we could react, whatever it was came to within approximately 8 yards and screamed again. My wife jumped from her chair sideways and ran to the shed spraining her ankle in the process. I didn't know what the sounds were, but I am sure they were NOT deer, hogs or hoot owls, or anything else that I have EVER heard. I could not be sure if it was not some prankster, although someone would risk getting shot coming to a person's camp at night like that. I ran to the shed to get my pistol which I always carry on our outings, all the while the \"animal\" screamed the same sound in rapid succession, about 7 times in all.The sound emanated from behind a pile of tree limbs placed there on previous outings. I went to the edge of our camp and shined my flashlight into and around the pile and held my pistol ready, but no more sounds were heard. I couldn't see any eyes shining in my flashlight beam either. Even though we were a little unnerved by the event, I planned to go ahead and make our beds for the night, but my wife's ankle was beginning to swell and she was in pain, so we packed our things and went back home. I have gone back a few times since then, but have not noticed anything strange. So if it wasn't a bigfoot, fine I just don't really know what it was. All the experienced outdoorsmen I have talked to about the sounds say they have never heard anything like them either.",
  "classification": "Class B",
  "county": "Nacogdoches",
  "state": "Texas",
  "latitude": 31.33333,
  "longitude": -94.33334,
  "location": "-94.33334,31.33333",
  "location_details": "Take Hwy103E from Lufkin approximately 24 miles from the Lufkin loop.",
  "temperature_high": 75.78,
  "temperature_mid": 63.755,
  "temperature_low": 51.73,
  "dew_point": 48.07,
  "humidity": 0.66,
  "cloud_cover": 0.04,
  "moon_phase": 0.66,
  "precip_intensity": 0.0001,
  "precip_probability": 0.16,
  "precip_type": "rain",
  "pressure": 1019.4,
  "summary": "Clear throughout the day.",
  "uv_index": 6,
  "visibility": 9.73,
  "wind_bearing": 116,
  "wind_speed": 3.06
}