{
  "id": "1077",
  "title": "Motorist has a daytime sighting of bigfoot crossing a road",
  "date": "1995-04-17",
  "timestamp": 798076800,
  "observed": "I was driving home from work so it was appx. 3:00pm. It was a bright sunny day and I had just rounded a curve on a country road not far from our house. As I rounded the curve there was a long stretch of straight road ahead and appx. 200yds. up the road a large creature had just stepped into the road. I was having a hard time believing what I was seeing so I tried to look for boots on its feet or a coat. As it stepped into the road it had its head turned toward me and it hesitated slightly and then continued across the road. When it turned its head it seemed as though his whole upper body turned with it. It was standing upright and I would guess it to be 8 to 9 feet tall. It had reddish brown hair and as it crossed the road its arms were swinging in an almost exagerated motion. It took only 3 strides for it to cross the road. I made a left turn appx. 100yds from where it was crossing. My husband asked me why I didn't drive closer to get a better look and I told him it was because it scared the hell out of me. I was having a hard time believing what I was seeing so I went to a hypnotist and was able to recall some of the details. When I was done the hypnotist said she believed in what I saw. I have spent a fair amount of time in the woods hunting and hiking with my husband I have seen a lot of animals but nothing that even comes close to this. I know what I saw was a Bigfoot.",
  "classification": "Class A",
  "county": "Snohomish",
  "state": "Washington",
  "latitude": 47.8925,
  "longitude": -122.0111,
  "location": "-122.0111,47.8925",
  "location_details": "",
  "temperature_high": 51.22,
  "temperature_mid": 45.885,
  "temperature_low": 40.55,
  "dew_point": 39.22,
  "humidity": 0.74,
  "cloud_cover": 0.93,
  "moon_phase": 0.58,
  "precip_intensity": 0.0009,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1011.73,
  "summary": "Overcast throughout the day.",
  "uv_index": 3,
  "visibility": 8.2,
  "wind_bearing": 183,
  "wind_speed": 7.42
}