{
  "reportId": "28912",
  "title": "Motorist traveling near the Ohio River has bigfoot sighting outside Chesire",
  "date": "2011-02-22",
  "timestamp": 1298332800,
  "observed": "I was traveling on Little Kyger road toward Ohio state route 7 when I popped over a steep hill located one this stretch of road and as my headlights shown back down on the road as I topped the hill, along side the road there is a tree and a road sign, thats when I noticed this large very dark figure along the road with what appeared to be either very dark brown or black fur/coat?? it was a head taller than the road sign that it was walking in front(6 to 7 foot tall) of, it looked as if it was getting ready to cross the road out of a very wet swampy marsh area over into more wooded hills. As my lights hit it as with out thinking it turned back the way it had come very swiftly, but another interesting thing that i noticed was as it tuned to go back into the swampy area I could plainly see the entire bottom of its foot wich was very  very large and light in contrast to the rest of the creature and void of any fur/coat would very much put you in the mind of a humans foot only much much larger. and within just flash was gone.I did stop the following day to see if I could see any kinda of tracks and saw nothing but the composition of the ground would probably not yeild a good footprint next to the road as for the marshy area I didnt venture in..Very strange indeed.",
  "classification": "Class A",
  "county": "Gallia",
  "state": "Ohio",
  "latitude": 38.9264,
  "longitude": -82.14285,
  "location": "-82.14285,38.9264",
  "location_details": "It is about 2 miles out Little Kyger road off of Ohio state route 7 in the cheshire ohio area, over a dip in the road just past the old high school (River Valley )..",
  "temperature_high": 35.18,
  "temperature_mid": 32.01,
  "temperature_low": 28.84,
  "dew_point": 29.32,
  "humidity": 0.92,
  "cloud_cover": 0.96,
  "moon_phase": 0.66,
  "precip_intensity": 0.0006,
  "precip_probability": 0.4,
  "precip_type": "snow",
  "pressure": 1018.56,
  "summary": "Overcast throughout the day.",
  "uv_index": 2,
  "visibility": 7.86,
  "wind_bearing": 1,
  "wind_speed": 3.73
}