{
  "id": "1199",
  "title": "",
  "date": "",
  "observed": "It was in the middle of summer (apx late July, 1989) when I was hiking a well established trail on October mountain. I was approaching the top of the mountain (apx 1200 feet above sea level) when I observed a slight glimps of a moving object about 100 yards ahead of me. October mountain is a heavily wooded area and it was very difficult to see clearly because of all the low brush and scrub. At first all I could see were arms moving and an occassional glimps of a fur covered body. At first I thought I was looking at a large black bear which are not uncommon in the area. I pulled a pair of 40 power biocculars from my travel pack and attempted to focus on the object. Again it was difficult because of all the brush, at one point the animal moved into a slight clearing, it was then that I realized I was observing something very unusual! The animal was very tall (cannot accurately approximate the size) and slightly stooped. Its body was massive and covered completely with reddish hair. I noticed that the head was also very unusual in shape and size. The head was rather pointed and covered with hair or fur. The face was dark in color and had less hair than the top of the head. The neck seemed to be non-existant. At that moment it turned toward me and I was absolutely shocked, it looked very human. At this point I was so frightened, that I took measures to hide myself. After getting over my initial chill I continued to study the animal. It was still in the small clearing and seemed very occupied. It was moving stones and small peices of wood and grubbing for either roots or insects, it was simply to far away for me to see exactly what it was eating. I could see its large arm moving to its mouth every so often. What really took me by suprize was that it was stacking rocks after moving them. One on top of another. This is when I thought perhaps this animal was infact a human, why would it stack rocks in this way? At this point I wanted to get a little closer to see if it was a man in a fur coat or a monkey suit. I checked the wind and made an effort to stay down wind of the animal. I was able to get about 20 yards or so closer to the animal. I found a good observation area and studied the animal closer. At this point I could planly see that this was something very strange indeed, it was not human. The arms were to long and the face seemed very distored and elongated. The arms extended past the nee caps! The hands were very large but human in shape. The fur seemed to be tipped with a lighter color of red. I became so frightened at this point that I began to run back to the trail. I looked back at one point and noticed that the animal had its head back and was slowly moving back into the forest. I don't think it was aware of me, though I wonder how it could have missed hearing me running through the underbrush. I was frightened severly for several weeks and would not hike in that area of the mountain without a hiking partner and a rifle. I will never forget what I saw...never! No way it was a bear or any other forest animal found in this part of the country.",
  "classification": "Class A",
  "county": "Berkshire",
  "state": "Massachusetts",
  "location_details": "October Mountain State forest, Lenoxdale Massachusetts, USA",
  "summary": ""
}