{
  "reportId": "27087",
  "title": "Possible sighting at night by a family on Hwy. 140E near Bonanza",
  "date": "2009-12-10",
  "timestamp": 1260403200,
  "observed": "6:45 the night of December 10th I was driving home from bonanza high school on highway 140 east with my two duaghters and son when we drove around the last sharp curve and just past mile marker 29 when my headlights picked up a movement on the side of the rode about 50 yards a head of us. At first glance I thought it was a person because it stood upright and walked on two legs however as it stode acroos the highway its gate was slightly hurried and it only took two massive strides to reach the other side of the road. The shape was like a human however it was extreamly tall approx. 8 to eight and a half feet due to the limited light cast by my headlights I could only see a large dark shape and little or no features. I slowed my van down to see if I could spot it in the trees at the side of the road but it had disappeared. Shaken by the sight I asked everyone in the car if they had seen something in the road and one of my daughters as well as my 20 year old son described exactly what I thought I saw. It wasn't until we reached our home approx. a mile further down the road that we realized what it must have been we had no other explaination for the size, shape or huge stride of this creature.",
  "classification": "Class B",
  "county": "Klamath",
  "state": "Oregon",
  "latitude": 42.36945,
  "longitude": -121.3866,
  "location": "-121.3866,42.36945",
  "location_details": "From bonanza follow hwy 70 to bly mtn. cutoff. go through stop sign and get onto 140 east follow through s curves to mile marker 29. It is well forested area on both sides of the road not populated.",
  "temperature_high": 31.7,
  "temperature_mid": 22.825,
  "temperature_low": 13.95,
  "dew_point": 5.95,
  "humidity": 0.7,
  "cloud_cover": 0.13,
  "moon_phase": 0.81,
  "precip_intensity": 0.0005,
  "precip_probability": 0.49,
  "precip_type": "snow",
  "pressure": 1019.92,
  "summary": "Mostly cloudy overnight.",
  "uv_index": 2,
  "visibility": 9.11,
  "wind_bearing": 136,
  "wind_speed": 2.72
}