{
  "reportId": "31488",
  "title": "Woman describes possible encounter while elk hunting near Pilot Rock",
  "date": "1998-10-15",
  "timestamp": 908409600,
  "observed": "I was with a group of bow hunters in a canyon above Pilot Rock, Oregon.  My 12 year old daughter and I were sitting in the brush waiting for the rest of the party to push the elk to us.  We had been sitting in the dense trees since early in the morning (about 6 am) and it for about three hours, as my daughter wasn't keen on hiking through the canyon.  We had been bugling during the entire time.  Because it was early fall, it was quite foggy up in the high areas.  My daughter and I had been hearing what sounded like a branch thumping against the trees from down below us, but steadily approaching our hiding spot.  I thought nothing of the sound because one of the party was carrying antlers to \"rattle\" the elk.  Eventually, the two of us began to hear distinct rustling noises near us with a grunting and growling sound.  The stench was unbelievable.  It smelled like a combination of wet mop and wet dog hair that had moldered for awhile.  I have been around a bear carcass and it did not smell like this.  I was, quite frankly, spooked!  My daughter was likewise wanting to get out of the woods.  We immediately climbed up the canyon wall to where the four wheelers were.  The crashing sounds followed us.  When the rest of the party caught up with us they said that they had seen me walking along the hill.  Where they said they had spotted me was in no where close to where my daughter and I had been as it was straight down a pretty ragged elk trail that I would not have tried with my kid along.  I have never been comfortable in that area again and refuse to hunt without someone with me.  I have tried telling many people about this but even my daughter who was with me scoff and say it was a bear.",
  "classification": "Class B",
  "county": "Umatilla",
  "state": "Oregon",
  "latitude": 45.48318,
  "longitude": -118.83,
  "location": "-118.83,45.48318",
  "location_details": "This took place off of an old logging road that I had only been on the one time.  It was near the indian reservation.",
  "temperature_high": 50.98,
  "temperature_mid": 41.365,
  "temperature_low": 31.75,
  "dew_point": 35.42,
  "humidity": 0.73,
  "cloud_cover": 0.53,
  "moon_phase": 0.86,
  "precip_intensity": 0.0012,
  "precip_probability": 0.44,
  "precip_type": "rain",
  "pressure": 1015.98,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 2,
  "visibility": 9.81,
  "wind_bearing": 255,
  "wind_speed": 5.17
}