{
  "id": "28409",
  "title": "\"Chimp-like\" animal briefly seen by backcountry horseman near Winlock",
  "date": "2002-06-15",
  "timestamp": 1024099200,
  "observed": "Due to some computer problems, the witness in this case filed his report telephonically with BFRO investigator Charles Lamica.  Below is a synopsis of that interview. About eight years ago the witness and his wife lived in western Washington, near the town of Winlock.  The couple owned several horses and spent a great deal of time riding them on the trails and logging roads near their home.    One sunny afternoon in late spring or early summer they were riding on a logging road in a wooded area when the witness saw what he describes as a “chimp-like” animal cross the dirt road in front of them. According to the witness, the animal was a couple hundred yards in front of him and the sighting lasted only a couple seconds.  He described the animal as “Moving fast, using its arms to help it along, exactly like a chimpanzee does.”  He said the animal was black in color.  Due to the distance and the short duration of the sighting he didn’t get a good look at the animal’s face.  He remembered the animal’s arms were “Long and skinny,” and were much longer than its legs.  He never saw the animal stand up, but estimated that if it stood erect it would have been about five feet tall.  He said the animal moved very fast, “About the speed of a loping horse,” and disappeared into the vegetation on the other side of the road. The witness said he’s very familiar with bears and is positive the animal he saw wasn’t a bear.  He stated, “If this was a bear it was a horribly deformed bear.”  He felt that such a bear would not have been able to move as fast as the animal he saw.   He further stated that bears seen in profile tend to have a rather horizontal back, while the animal he saw had a steeply slanted back due to the arms being a lot longer than the legs.  He related that bears have a noticeable neck, but the animal he saw seemed to have little or no neck. After the brief sighting the couple rode their horses to the spot where the animal crossed the road.  At that point the horses became very frightened and hard to control.  The witness says the horses refused to go further and became so unmanageable that they eventually had to turn around and go back the way they had come.  The witness said he and his wife had ridden those horses on that same stretch of road “Hundreds of times,” and never before or after the sighting did the horses  refuse to move forward.  The witness also related that he has ridden his horses in close proximity to bears and the horses never acted as frightened and unmanageable as when they saw the “Chimp-like” animal. The area where the sighting took place was typical western Washington forest with a lot of salal bushes, large ferns, vine maples, and big fir trees.  The area is generally mountainous, although the place where the animal was seen was relatively flat.  The witness said that when he lived in that area it was not uncommon to hear very loud and unusual howls at night.",
  "classification": "Class B",
  "county": "Lewis",
  "state": "Washington",
  "latitude": 46.50835,
  "longitude": -123.0235,
  "location": "-123.0235,46.50835",
  "location_details": "",
  "temperature_high": 69.69,
  "temperature_mid": 61.155,
  "temperature_low": 52.62,
  "dew_point": 49.33,
  "humidity": 0.7,
  "cloud_cover": 0.53,
  "moon_phase": 0.17,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.94,
  "summary": "Mostly cloudy until afternoon.",
  "uv_index": 6,
  "visibility": 9.8,
  "wind_bearing": 286,
  "wind_speed": 3.63
}