{
  "reportId": "1197",
  "title": "Several sighting reports near the Racoon River within days of each other.",
  "date": "1978-11-15",
  "timestamp": 279936000,
  "observed": "Here is my written account of the four Bigfoot sightings I told you about on the phone. I will start by giving you a little background as to the year, area and season. The year is about 1978 give or take a year or so. The area is between Adel and West Des Moines Iowa, roughly following the Raccoon River. It is late fall, in November. The story starts when a girlfriend of mine told me about a neighbor of hers, a farmer, who said that early one morning about 4 am as he was making coffee he noticed a big creature standing beneath his yard light. He described it as standing about 7 feet tall and covered with black hair. He watched it for awhile until it walked away. I didn't think much about it until a few days later when I heard on the news that a truck driver on the I-80 in the vicinity of the Raccoon River saw apparently the same creature in his headlights. I was surprised when I heard this given the story from my girlfriend just a few days before. As it happened, a few days after that I was talking to a friend of mine from high school about the sightings. He began telling me that he too had seen the creature although he did not report it. He said that one evening during the same time period and in the same area he went to a small cabin he'd built in the woods near the river. As he approached the structure a tall creature with black hair jumped up and ran out the door. He assumed it had been sleeping on the floor in a pile of leaves. This building was not completed and there was no roof. It was just turning dark so he didn't get a good look at it, but because he was so close there was no mistaking it's size. He described it as about 7 feet tall and covered with black hair. It scared him so much that he ran in the opposite direction. What happened next was truly amazing to me. A few days later my brother who farms with me was driving a tractor home from the fields very late at night. It was 11:30 PM with a full moon and just a dusting of snow on the ground. He stopped in a rural portion of West Des Moines and watched as two Bigfoot creatures walked calmly by the side of the road. They were about 100 yards away and walked parallel to the road beside a fence in an open area, that has no trees. One of the creatures was taller at about 7 feet and the second was about a foot shorter. He said they had long swinging arms, a short neck, black hair from head to toe and they were not afraid of his presence, although he was some distance away. He reported to me that the next day he went back for another look and to his surprise discovered that the area where these creatures had been was covered with dense short prickly underbrush. There is no way a human could walk so freely in that area. It is just not possible. But there is more. The next night or so, as I was working in our farm shop late into the evening I heard a sound that I'll never forget. I can best describe it as a long, loud, mournful cry/wail. I suppose it lasted five to ten seconds and I heard it twice. It was NOT a dog, coyote, fox or owl. I know the sounds of these animals. I've never heard a large cat wail before, but it was a bit like that I suppose. When I first heard it I immediately noticed that our two dogs took off running for the barn. THAT I'd never seen before. Usually animal sounds are returned with loud barking. We live about three miles North of where my brother saw the two creatures. My Mother heard it too. I still find the series of events that fall to be intriguing to say the least. When I discovered the BFRO web page I just had to write a report.",
  "classification": "Class A",
  "county": "Dallas",
  "state": "Iowa",
  "latitude": 41.59377,
  "longitude": -93.974,
  "location": "-93.974,41.59377",
  "location_details": "",
  "temperature_high": 37.43,
  "temperature_mid": 34.835,
  "temperature_low": 32.24,
  "dew_point": 24.76,
  "humidity": 0.72,
  "cloud_cover": 0.89,
  "moon_phase": 0.53,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1029,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 9.33,
  "wind_bearing": 64,
  "wind_speed": 4.3
}