{
  "id": "12669",
  "title": "Possible tracks found by hunters outisde Mechanicsburg",
  "date": "1983-10-15",
  "timestamp": 435024000,
  "observed": "A couple friends and myself had gone out on a Friday night to \"run\" one's coondog. It was a warm night, and kinda still, fall was coming. We decided to head back to L's, a spot that had a couple small woods, and one large woods that ran north for over a mile. After letting the dog go through the middle and south woods, we were heading along the fence (on the west side of it) from the south woods to the big north woods. We came across a small area that had no corn growing in it. I happened to look down at the ground with my Nitelite, and low and behold, there they were - two (2) huge foot prints. I told the other guys to \"look at this\". We closely examined the prints and this \"feeling\" came over us (at least it did me!). All of a sudden, I felt scared for my life (it is still the most scared I've ever been in my life!), as I realized there was something gigantic out there somewhere that had made these tracks. We had no gun, as it wasn't huntnn season yet, but even if we had, I don't think it would've been any less fearful. We immediately decided the huntin trip was over and quickly made tracks for the truck. I told my dad about our discovery the next day, and he called one of the guys he worked with to come out and see the tracks. This guy had killed bears and about every other large animal in North America, and he said he'd never seen tracks like these. I took along two different cameras for photographic proof, and yes, I still have about 6 or 7 photos of the tracks. We only found 2 tracks about 6 foot apart, and slightly toed in. In one picture, I am standing straight above the most visible print, and you can plainly see the print is as big (if not bigger) than my size #13 Lacrosse boots. Now, we did not believe these \"tracks\" to be a hoax. The location we found the tracks was so remote, that no one would think of planting tracks here in hopes that someone would wander by and see them - no way! We later heard that a creature was spotted on this farm, and it only cemented the fact in my mind, that a Saquatch had been there. And, further supporting evidence for me was reading report #5311, which I now realize occured about 1 mile from this instance, and 6 months earlier.",
  "classification": "Class B",
  "county": "Champaign",
  "state": "Ohio",
  "latitude": 40.01979,
  "longitude": -83.56088,
  "location": "-83.56088,40.01979",
  "location_details": "Just SW of the barn at the rear of the south woods that was formerly owned my Mr. Paul L. Located about halfway between Davisson Road and the S-curves on Hunt-Clymer road.",
  "temperature_high": 67.63,
  "temperature_mid": 55.09,
  "temperature_low": 42.55,
  "dew_point": 40.76,
  "humidity": 0.68,
  "cloud_cover": 0.09,
  "moon_phase": 0.3,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1025.84,
  "summary": "Clear throughout the day.",
  "uv_index": 4,
  "visibility": 9.34,
  "wind_bearing": 142,
  "wind_speed": 3.79
}