{
  "id": "3798",
  "title": "",
  "date": "",
  "observed": "Would like to submit the following as the first two (likely Class B) findings on lower Bluff Creek, CA. resulting from three deliberate short \"expeditions\" to conduct night-surveillance and day-reconnaissance for evidence: While I was on leave from Army in July '96, my brother and I went to Bluff Creek for two nights. Our plan was to search the streambed for prints by day and listen and observe at night with 1st Gen. passive IR gear. We conducted about 6 hours surveillance per night, with nothing noted. Site #1: On second day (10? July) I was checking the north side of the streambed about 1/2 mile southeast of our campsite the (Wright Place) when I noticed a flat glade of trees on the south bank and walked across to investigate. After a few minutes in the glade I found a cedar tree with the top twisted off at the 7.5 to 8 foot level. Here the tree was about 2\" thick. Most alarming was that the break, and part of the tree where bark was stripped off, looked moist and fresh; probably occurring overnight, given the dry, and warm conditions. The top of the tree, with a few feet of stripped bark was at the tree's base. No hairs found. I took pictures and brought the top back to my brother. Later that day, at a second site (#2) about a mile northwest of our campsite, I found a 50 to70 meter, stretch with over 15 trees similarly broken off at between 4 and 8 feet off the ground. I took a few pictures of these. Over the Labor Day weekend that same year (31 August to 2 September) my wife and I returned to the area. I thoroughly photographed and cataloged the trees at site #2. We also drove a few miles north of #2, dropping down to the creek east off forest service road 13N01. There (#3) we found more tree breaks and a HUGE pile of dried feces; 2\"+ thick ropes with numerous undigested seeds and huckleberries. Most significantly it looked nothing like the abundant bear scat in the area, which was generally much less massive, purple/black and under 1\" thick. Finally, as we were driving out of our campsite en route home, on forest service road 10NO6, we noticed by the side of the road (#4) a tree that looked like it had been violently twisted years earlier at the 9 to10 foot level and it continued to grow. We took a picture. NOTE: My interest in the Sasquatch started on the 7th of December 1979. I was a 12 yr. old passenger in my parent’s car, when we saw one. (See database entries for Pierce County, Washington)",
  "classification": "Class B",
  "county": "Humboldt",
  "state": "California",
  "location_details": "Bluff Creek, 4 to 5 miles (est.) upstream from confluence with Klamath River & Hwy 96. Our July campsite was at confluence of Serpentine & Bluff Creeks, about a mile north, northwest of Fish Lake Campground.  Our September campsite was just across creek near a possible abandoned gold prospecting site. USGS or Forest Service map, that I found later, shows this area labeled {\"Wright Place (Site)\"}.  #1 Was the fresh tree break found in a glade on the south side of creek about 1/2 mile southeast of our campsite which was just at the southwest of end of an eyot in Bluff Cr. shown on detailed USGS map. #2 We found multiple old tree-breaks just south of the creek, which was about 1 mile north west of our campsite, and was just south of an intermittent stream. #3 Over the Labor Day weekend, we found more tree breaks and a suspected Sasquatch feces pile which was found a few miles north, northwest of #2 and near a forest service access road just west of the creek. #4 A few miles south of a paved forest service road 11N05,on a gravel forest service road 10N06, was a meadow on the west side of the road, and there was a good view of Bluff Creek valley. Delorme Atlas p. 33 B6 Photocopied detailed strip-map from small-scale USGS map with good estimates of all pinpoint location available to be mailed, along w/ photos.",
  "summary": ""
}