{
  "reportId": "7159",
  "title": "",
  "date": "",
  "observed": "UT Vet: Primate Not Killing Cats As WVLT VOLUNTEER TV News first reported last week, there is some monkey business going on in Campbell County. Some people there said they have seen a primate terrorizing residents and pets. Campbell County's 911 center has been receiving calls about the creature for weeks. \"They're saying it's a chimpanzee, a large chimpanzee,\" said 911 dispatcher Kamille Barnes. \"It's killing their cats.\" Barnes lives in the College Hill community, which is where the creature has been sighted. She believes it came into her house. \"My basement door was left open, and something came in and scattered all the clothes and stuff stored in the basement,\" she said. UT Veterinary School primate expert Dr. Edward Ramsey said the creature that is making its presence known in Campbell County is likely not a chimpanzee like those found at the Knoxville Zoo. \"Chimps are really rare as private pets, so chances that this is a chimp are pretty remote,\" he said. He did say it may very well be some type of monkey. \"There are unfortunately still a fair number of monkeys still in private hands,\" he said. \"We've had one or two times [that] an animal escaped from a private zoo in Pigeon Forge.\" Ramsey said that whatever kind of primate it may be, he does not believe it's responsible for the recent pet deaths in the area. \"Odds are, if it killed anything, I don't think it would kill many and it wouldn't kill repeatedly. Virtually every primate is herbivorous.\" He said that if a monkey is on the loose, it's a perfect example of why most exotic animals don't make good pets. \"We don't think it's appropriate for people to keep -- specifically -- macaques as pets because of the ability to carry fatal disease,\" he said. \"They're not trainable in the traditional animal sense of the term.\" LaFollette animal control is investigating the situation. Knoxville Zoo officials said if the animal is caught, the zoo likely would not be able to take it, and it may have to be euthanized. - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - October 20, 2003 By VINCE LENNON 6 News Reporter JACKSBORO (WATE) -- Animal control officers in Campbell County are searching for a primate, perhaps weighing 400 pounds, that's on the loose. And nearly 100 pets are missing. \"I didn't really get a good look at his face because he didn't hang around all that long,\" Donna Keathley said about when she saw an ape-like creature last week in LaFollette. \"But he's big and he's got a really bad stinkful odor to him.\" LaFollette Animal Control Officer George Moses said, \"I believe that the people believe that they see it. I don't have any reason to doubt them, that they're mistaken.\" Moses said he hasn't seen the animal but he's certainly heard of it. He started getting calls about it three weeks ago. All the alleged sightings center on the College Hill community, just outside the LaFollette city limits. Coinciding with the sightings are numerous reports of missing cats and kittens. \"All told, over 100\" are missing, Moses said. According to Donna Keathley, when she startled the animal, \"This kitten he threw at me, no one knows where it come from.\" One College Hill man, who declined to be identified, claims the primate is an orangutan. He said he saw it Tuesday morning leaving stool samples on his property. Many College Hill residents believe the animal escaped a circus that performed at the nearby National Guard armory a few months back. But the LaFollette Police Department and the Campbell County Sheriff's Department didn't take any reports of a missing animal. Donna Keathley said her neighbors are ready to shoot the animal. \"If I had a gun, I would've shot it.\" Several people told 6 News Monday that they want the animal caught or killed before Halloween so it can't attack a child or another pet. Campbell County officers warn anyone who sees the animal not to attempt capturing it. It's considered dangerous. Instead, any sighting should be reported immediately to LaFollette Animal Control at (423)-566-1383  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - Is a Skunk Ape Loose in Campbell County? MORE ON WATE.com Campbell Co. Sheriff's Dept. Opens Investigation of Possible Primate October 22, 2003 By VINCE LENNON 6 News Reporter CAMPBELL COUNTY (WATE) -- A new theory emerged Wednesday as a crypto- zoologist weighed in on sightings of a possible primate in Campbell County. A Crypto-zoologist, someone who studies uncataloged animals such as skunk apes, accompanied a 6 News crew in Campbell County Wednesday. Myakka \"skunk apes\" have been spotted in the southeastern United States since the 1940's. Local crypto-zoologist Chris Dotson contacted 6 News after seeing the stories on Campbell County primate sightings. \"The animal people reported seeing is not a pet.\" Dotson took the skunk ape photographs Wednesday to people who've claimed to have seen the primate in the LaFollette area. Dotson's convinced that what people are seeing is a skunk ape. \"We need to capture this thing the best we can,\" Dotson said. \"People need to stay away from it, allow experts to come in who have some knowledge of large primates like this and trap this animal.\" Monkey owner Jerome Love answered a summons at the Campbell County Sheriff's Department with his Macaque monkey \"Mugway.\" Love wanted to prove it's not his animal that's loose. \"If it's a monkey that's killing these cats, it's not this one and I'm tired of it.\" 6 News is hearing more accounts from Campbell County residents who say they've seen the creature. Some date back 35 years. However, many people are hesitant to talk, for fear of being labeled as crazy. In all, six cats and one dog have been killed in the last three days. And there have been a number of sightings within the last 48 hours. The warning still stands though for people not to try approaching the animal, but to report it to local authorities. Crypto-zoologists believe there could be hundreds of skunk apes across the Southeast.",
  "classification": "Class B",
  "county": "Campbell",
  "state": "Tennessee",
  "location_details": "N/A  at this time, check newspaper updates.",
  "summary": ""
}