{
  "id": "18823",
  "title": "Young Man Has Surprise Encounter at High School Graduation Party",
  "date": "1982-06-04",
  "timestamp": 391996800,
  "observed": "On the night I graduated (Elma High School, 1982), my friend Greg and I had talked a large portion of our classmates into camping in a large field in which Greg and I, while \"predator hunting\" with a predator call, had had some very unusual experiences the year or two prior. To liven things up a bit, and perhaps scare a few people, he and I had decided that I would sneak to the field on foot, unbeknownst to our classmates, and give a few blows on the call, which mimics a dying rabbit, while he would tell \"sasquatch\" stories. After sneaking into position, it was dark and about 10:00pm, I hid along the edge of the field and blew the call as loud as I could.  After a few attempts at attracting attention and realizing that nobody could hear me over the loud music blasting, I was ready to go out and join the party when I heard a branch snap right directly behind me.  Armed only with a flashlight, I turned around and shined it right directly into the face of a male sasquatch standing about 10 feet away!  This creature did not act threateningly in any way, unless you count the fact that I could clearly see his teeth, I specifically remember the breadth of his chest, the smooth down, shorter, not longer hair, the funny shaped lump on top of his head (like a gorilla) and his arms/hands, which were holding some brush out of his way to see me.  We stood there for perhaps five seconds before I decided to turn the flashlight off (not wanting to continue to shine it in his face and \"upset\" him)  A moment after turning off the light I heard a noise, turned the light on and he was gone.",
  "classification": "Class A",
  "county": "Grays Harbor",
  "state": "Washington",
  "latitude": 47.00625,
  "longitude": -123.2902,
  "location": "-123.2902,47.00625",
  "location_details": "Now called Gravatt Road, off of the Mox-Chehalis Road.  At the time there was an empty field surrounded by a maturing second growth forest.  The field was about a 1/3 mile off of the Mox-Chehalis, on the left side after the first hill climb.",
  "temperature_high": 61.2,
  "temperature_mid": 55.62,
  "temperature_low": 50.04,
  "dew_point": 43.66,
  "humidity": 0.7,
  "cloud_cover": 0.72,
  "moon_phase": 0.44,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.52,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 9.62,
  "wind_bearing": 240,
  "wind_speed": 3.54
}