{
  "id": "5703",
  "title": "",
  "date": "",
  "observed": "Hi, It was october about 1030pm I was comeing home with a friend from work. you see we run a camp ground in the summer in bear mountian state park in NY. But we stay thier all year round,i love it. in the summer thier is lots of noise. We have as much as 300 kids at a time, overnite for 3 months. In late august every thing winds down. while the kids are thier you dont see much wild life. Even the deer, which we have a lot of,seem to find some where else to live. guess they dont like kids. It takes about a month for the woods to come back to life. this is the best time of the year because it is so quit. During the winters i do other work out side the camp to make money. this night I wasnt driving so i like to watch what the head lights find. the road are windy so the light ofen pan the sides where you might see a racoon or a bear. well driving in to our camp thier is a few s turns. when i saw some thing siting on a boulder about 30 to 40 yards up on the hill. I freaked, I asked my friend if he hsd seen that and he said what. I said back up and he did. when the lights hit it I said stop! wow It was brown hairy but you still saw some skin. It wasnt sitting it was crouching on all 4s. it ha dbeen stairing at my friends cabin, where his wife was alone. i was stairing right at it and i was close. when the head light hit it it sat for 3-4 sec stairing, before it leaped from a crouched position about 9 feet to anouther rock. It stud up and began to run away on two legs. I saw it run for about 15 to 20 feet before i couldnt see it any more. it was running down the other side of the hill. my friend still didnt see it. I asked him to drive up this little acsess road to get more close. but it was gone.",
  "classification": "Class B",
  "county": "Rockland",
  "state": "New York",
  "location_details": "i87 to exit 15a 14 miles north to harriman state park\\bear mountian, arden vally road. 3 mile up on the right, first camp. camp sunrise 1\\4 mile up drive way on the right.",
  "summary": ""
}