{
  "id": "6232",
  "title": "Nighttime sighting by motorist on KM Hill near Skamokawa",
  "date": "2003-04-24",
  "timestamp": 1051142400,
  "observed": "On 4-24-03, my friend was driving home from work from Naselle, WA to Puget Island, WA around 12:30 a.m. on Highway 4 (Wahkiakum County, WA).  He observed a large bipedal animal (approx. 6 to 8 feet tall) broad shouldered with dark bluish/grey hair walking down a steep slope on the other side of the guardrail at the top of KM Hill.  He reported seeing a large set of shoulders but didn't see the head due to catching a glimpse of the animal as he was driving by.  It appeared the animal was walking down the slope.   He reports that a bear (even a large bear on it's hind legs) would not demonstrate the shoulder width that this animal did. He said there are elk there all the time when he drives home but due to the size of the shoulders and color of the hair it was not an elk.  The weather was good although the light conditions were low being that it was past midnight.  He didn't hear anything or get out of the car to check for footprints.  He kept driving because he wasn't packing heat.",
  "classification": "Class A",
  "county": "Wahkiakum",
  "state": "Washington",
  "latitude": 46.33425,
  "longitude": -123.5439,
  "location": "-123.5439,46.33425",
  "location_details": "This sighting took place at the top of KM Hill on Highway 4 traveling from Naselle, WA towards (eastbound) Cathlamet, WA.  The location is between the beginning of the slide area to the end of the slide area traveling eastbound.  The slide area was fixed a few years ago and is marked by the hydroseeded grassed area.",
  "temperature_high": 52.42,
  "temperature_mid": 45.195,
  "temperature_low": 37.97,
  "dew_point": 40.05,
  "humidity": 0.81,
  "cloud_cover": 0.73,
  "moon_phase": 0.79,
  "precip_intensity": 0.0117,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1008.63,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 9.51,
  "wind_bearing": 183,
  "wind_speed": 3.45
}