{
  "reportId": "26076",
  "title": "Woman recalls watching a bigfoot cross the road while riding with her mother near Rocky Mount",
  "date": "1979-07-18",
  "timestamp": 301104000,
  "observed": "I was about ten or eleven years old. I was traveling with my mom and younger brother in a car on a rural road near Rocky Mount, N.C. in 1979. It was at night. We spotted a tall hairy figure crossing the road ahead of us. It was close enough to see in the headlights. (I am remembering all of this through a child's eyes but my mom remembers the same accounts). We slowed down, almost to a complete stop because the figure stopped right in the middle of the road. It turned and looked at us with it's body still facing in the direction it was originally headed. It was extremely tall, had hair all over it's body and it's arms were really long. It suddenly ran with super fast speed and jumped the ditch and was gone. It was like nother I had ever seen before or have seen since. I have been an avid outdoorsman...I hunt and fish and camp all over NC, SC & VA. I have seen bears in their natural invironments. I have seen them stand to look at me and then run away, but they always go back down to all fours to do that. I am convinced that what I saw as a child was in fact, a Bigfoot or sasquatch. Not only that, but a cousin of mine was driving near the same area in which we saw the Bigfoot about ten years ago. Which would be about twenty years after our sighting. I had never told him of our encounter. He was driving alone and at night and had almost the same sighting that we had had years earlier. He was terrified and when he got home told his mom about it while almost being in tears. She reluctantly told me about it after it happened a few days later, thinking I would laugh at was he had told her. I told her that I completely believed what he had seen!",
  "classification": "Class A",
  "county": "Nash",
  "state": "North Carolina",
  "latitude": 36.0089,
  "longitude": -77.90525,
  "location": "-77.90525,36.0089",
  "location_details": "Near Hwy 43 on Hunter Hill Rd and Old Carriage Rd. in Rocky Mount, N.C. Both incidents were in this area - twenty years apart.",
  "temperature_high": 82.11,
  "temperature_mid": 76.575,
  "temperature_low": 71.04,
  "dew_point": 71.35,
  "humidity": 0.86,
  "cloud_cover": 0.87,
  "moon_phase": 0.82,
  "precip_intensity": 0.08,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1017.53,
  "summary": "Heavy rain in the morning and afternoon.",
  "uv_index": 6,
  "visibility": 2.98,
  "wind_bearing": 172,
  "wind_speed": 0.69
}