{
  "reportId": "21894",
  "title": "Large creature on all-fours seen crossing US-50 near Burlington",
  "date": "2003-11-27",
  "timestamp": 1069891200,
  "observed": "It was Thanksgiving night of 2003 at around 11:30pm. I had taken a friend of mine home and was driving back on route 50 near Burlington, WV (that's in Mineral Co.) I came around a turn and slammed on my brakes to avoid hitting what I thought might be a very large dog. I barely missed hitting it and as soon as I stopped I realized that this was definitely not a dog. It was too big. It was on the right side of the road, crossing to the left. It was black and walking on all fours, its front legs were longer than the back legs. I was petrified. I had no idea what it was. When it got to the left side of the road it turned and looked at me, its eyes were glowing orange in my headlight. I couldn't even scream. I had chills all over and tears were rolling out of my eyes. I sped home which was about 4 miles away and ran into my house. I was hysterical and crying and I woke up my mother and told her about it. She believed me. Other people didn't believe me and I was made fun of. I referred to it as a \"black demon\" basically because I didn't know what it was. I can't drive by that place in the dark to this day without thinking of that creature and praying that I never see it again and if I do that someone will be with me. Seeing a picture of the Jacob's Creature on MSNBC tonight prompted me to check out your website. It looks exactly like what I saw that night",
  "classification": "Class A",
  "county": "Mineral",
  "state": "West Virginia",
  "latitude": 39.335,
  "longitude": -78.94501,
  "location": "-78.94501,39.335",
  "location_details": "It was in front of a business selling storage buildings.",
  "temperature_high": 55.55,
  "temperature_mid": 47.255,
  "temperature_low": 38.96,
  "dew_point": 37.71,
  "humidity": 0.76,
  "cloud_cover": 0.43,
  "moon_phase": 0.14,
  "precip_intensity": 0.0021,
  "precip_probability": 0.66,
  "precip_type": "rain",
  "pressure": 1018.91,
  "summary": "Mostly cloudy starting in the afternoon.",
  "uv_index": 2,
  "visibility": 9.31,
  "wind_bearing": 164,
  "wind_speed": 3.25
}