{
  "id": "742",
  "title": "Boys have early morning encounter at watermelon patch off road",
  "date": "1992-06-17",
  "timestamp": 708739200,
  "observed": "A friend and I were standing alongside a country road. My friend's cousin who was with us had walked up the street to a friend's to get him to join us. We also had several dogs with us in the road. I remember that one or two of the dogs were hunting/tracking dogs. As my friend and I waited in the road we started get the feeling that we were being watched. We noticed a melon patch across the road. We both remarked that it was kind of spooky looking and I made a bet for him to walk across the road and go into the melon patch by himself. He laughed and said forget it. As we stood there I noticed something that seemed to be standing behind a large tree that was by the melon field. I thought it looked like a man as it was standing up erect. I pointed at it to my friend and he saw it also. The dogs we had with us were going crazy by this point. They were barking and running around in the road. Just then I heard what was probably the scariest sound I've ever heard and will ever hear in my life. The sound came from the melon field and was enough to make my skin crawl. The sound was a very deep growl. Very similiar to a bear growl only deeper and more focused. I mean that it was a constant low pitched yet resonating growl. It seemed to be a warning growl for us to stay away I guess. As I looked at my friend we both had the look of total fear on our faces. We took off as fast as we could. We totally forgot about my friends cousin who seemed confused when he finally caught up with us. After we told him what we saw and heard he knew what we were talking about since he lived there and was familiar with the stories. We were too scared to walk all the way back to his house so we stopped off at one of their uncle's house and he took us home by car. He recounted his stories to us, he believed in the thing as well. After the event, we could hear strange sounds coming from the woods for quite a while. They sounded like whistles and howling. After a bit they died off and we finally got to sleep at about 5 or six in the morning.",
  "classification": "Class A",
  "county": "Atoka",
  "state": "Oklahoma",
  "latitude": 34.29861,
  "longitude": -96.30222,
  "location": "-96.30222,34.29861",
  "location_details": "Atoka area. The largest river in the area is the boggy river or boggy depot. The animal is called the boggy river or boggy depot monster by people living there. The animal supposedly is seen fairly often along the riverbanks and creeks in the Atoka area.",
  "temperature_high": 91.36,
  "temperature_mid": 84.035,
  "temperature_low": 76.71,
  "dew_point": 71.04,
  "humidity": 0.67,
  "cloud_cover": 0.42,
  "moon_phase": 0.58,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1009.51,
  "summary": "Breezy in the morning and partly cloudy throughout the day.",
  "uv_index": 10,
  "visibility": 9.55,
  "wind_bearing": 183,
  "wind_speed": 13.66
}