{
  "reportId": "27075",
  "title": "",
  "date": "",
  "observed": "Monday August 31 2009 was the 3rd day of Colorado’s archery elk season.  The day before I was hunting a familiar ridge and noticed a remote looking hanging valley across from the ridge I was hunting and decided that if I didn’t get into any elk that afternoon I would try to get into the hanging valley early the next morning. Monday morning I started out before light. By 6:30 I was climbing up a steep elk trail through a patch of very thick forest. I remember thinking that I had never been in this area before despite the fact that I had hunted this unit for over a decade and that this patch of forest was as close to “old growth” as I had ever seen in central Colorado. I climbed onto a flat swampy and very lush area filled with thickets of brush. I started to feel the hair stand up on the back of my neck and I was sure that I had found the spot where I would have an opportunity at a bull. I could see a fairly large clearing just past the brush with a large wallow in the middle. I set up behind a thicket with a clear shot into the clearing, knocked an arrow set down the bow and blew on the hyper hot cow call 3 times. Immediately I heard him coming in from about 100 yards away but not from the direction I expected. He was coming in from just to the left of where I had just walked through. I was surprised he wasn’t catching my scent. I could here him coming in very quickly through some very thick timber just past the clearing. I had my bow ready and I could see shadows move as he approached but I couldn’t make out an elk. He stopped in the timber just outside the clearing at 30 yards and then it got super quiet. I didn’t want to move a muscle so I just sat there motionless for 5 minutes and then blew the cow call again, nothing but silence. I waited another 5 minutes and decided he had blown my cover and left silently. I noticed it was 7:15. I got up and walked over to the wallow and I remember thinking that I had never seen an elk wallow look anything like this before. It looked like a tub made by man. It was perfectly rectangular, about 10 feet long and 4 feet wide and about a foot deep and appeared that the mud had been scooped out by hand. The water was perfectly clear so I knew nothing had used it recently. I admired it for a minute and then started hunting up through this hanging valley. I hunted all day up through the valley and to the top of the mountain without seeing any elk or much fresh sign. I started down the mountain thinking I really wanted to find that wallow again not so much to hunt today but to have a better sense of how to find it in the future.  At about 4:00 I knew I was getting close but I was exhausted from battling the timber all day. Then I stumbled upon another wallow that was also very strange. This one was round and about 7-8 feet in diameter, quite deep with the mud walls scooped up like a mini volcano cone. I remember getting a very weird feeling while looking at this wallow. How could an elk roll in the mud and create this perfectly round hole in the ground? This one had been used very recently because the water was very muddy and there was fresh mud all over the surrounding brush and trees. I started waking down the hill towards the first wallow and realized I was on a heavily traveled game trail, I followed it down the hill about 300 yards and it dropped me into the clearing from the morning. I walked over to the first wallow once again admiring how handmade it looked. I took one step away from the wallow towards the direction that I had entered the area that morning and started to hear a knocking sound. At first I really didn’t pay attention but then I realized that it wasn’t timed with the breeze and not consistent. I stopped the sound stopped. I took a step and knock, knock. I took a couple more steps and knock, knock, and knock much louder. Ok now the hairs are standing up on my neck as I realize the knocking is directly timed with my movements. The sound is coming from inside the swampy thicket area about 60 yards from the edge of the clearing. I get to the edge and stop the sound stops. I take a step to the right and knock, knock. A few steps to the left and knock, knock ,knock very loud this time. So know I think there must be a bow hunter in a tree stand in there who is messing with me and I’m starting to get mad. I decide to take off my backpack and sneak in there where the knocks are coming from as quietly as a seasoned bow hunter can. I notice that as soon as I enter the brush I no longer hear any knocking. I keep sneaking in and finally get to where the sound was coming from and nothing. I search the area high and low looking in every tree for a tree stand and nothing. Now I’m really mad and go crashing out of there the way I came in. I get back to the clearing and swing my pack onto my back and knock, knock, knock, knock very hard coming from right where I was just standing a couple of minutes ago. Now I’m totally freaked out. I grab my binoculars and start glassing through the brush and timber looking for a window that I could see through. I take a couple steps to my right while looking through the binoculars and I see a log swing through the air and hit a dead tree, Knock. I quickly try to focus on the spot when it comes into focus in a small sight window through the brush. I can see a large grayish black hairy figure, I see its torso, arm, shoulder, elbow and hand clutching a log about 4” in diameter and smacking it against a dead tree, knock, knock. I move to try and get a better look but it moves from the window but as it does I distinctly see its movement. It was a very human like move as it turned I could see it turn at the hips while its arm swung in time with the movement just like a person would look while walking and turning 90 degrees. Realize I am looking through binoculars at 60 yards so all of this is crystal clear. It was totally covered with hair about 3 to 4 inches long and appeared to be matted with mud. I judge that its elbow was at least 5 feet off the ground. Almost going into complete panic now I start running the other way. I only take a few steps and force myself to calm down. I tell myself that if that animal wanted to harm me it would have already done it. So I start walking diagonally away from it in a direction that will get me off of this shelf. The knocking continues intermittently as I put yards between us, when I get about 150 yards away I hear what I can only describe as the sound of a log flying through the air crashing through the brush and hitting the ground with a thud at about 50 yards from me. I never heard any more sound but as I worked my way down through the dark timber I found myself on a heavy game trail and I came on a switch back where a tree had fallen or been pushed over. As I approached I could see and smell this rancid black liquid on the ground where the tree used to stand. I can only describe it as a huge puddle of pitch black diarrhea buzzing with flies. There did not appear to be anything in it like chokecherry seeds or hair or bone that you would associate with bear shit. I see lots of bear sign and this certainly didn’t appear to be bear. I got off of that slope as quickly as possible without further incident. It was an hour and a half back to camp. I arrived in camp disappointed to find that all 3 of my hunting partners had already left. It was a long semi sleepless night in the tent with my pistol by my side but uneventful. (Edited only to add a few paragraph breaks for ease of reading.)",
  "classification": "Class A",
  "county": "Eagle",
  "state": "Colorado",
  "location_details": "(Edited at witness's request)",
  "summary": ""
}