{
  "reportId": "26905",
  "title": "Fisherman has closeup encounter with a juvenile near Kankakee",
  "date": "1973-05-13",
  "timestamp": 106099200,
  "observed": "As a fifty-six year-old man, I am sincerely bewildered when harkening back to my youth and pondering my former naivety. The saying goes, “I may be dumb, but I’m not stupid”. What concerns me is that I was stupid...and probably still am. I suppose an explanation is in order. Something that interests me now, didn’t significantly arouse my curiosity thirty-five years ago. Along with several other hobbies, pastimes, and the like...I used to fish. I spent a good deal of money on equipment, as is my nature. When involved in an activity, I immerse myself in it before I move on. I never purchased waders, though, because I have a quadruple E width shoe size. None of the waders fit me properly because the shoe part was always too tight. I had worn my friends waders on occasion, and when standing in water the pressure would build on my feet and the pain would become unbearable. I, along with two friends, fished Williams Bay in Lake Geneva, Wisconsin, and the Rock Creek Canyon of the Kankakee River in Illinois. The hunt was for smallmouth bass. While fishing could very well be a solitary endeavor, with this, I was a follower and not a leader as with other things I’ve known to appreciate. Consequently, I was always in the company of the same two friends, and there were a variety of other locations we visited, scouted out by someone other than myself. One morning it was determined that we would go to what was described to me as the backwaters of the Kankakee River. We drove south from Chicago on I-57 to get to our destination, which was utterly rural. Upon arrival I observed water that wasn’t a running river, but more of a small lake with calm water. My friends donned their waders and headed straight-forward, while I traversed the shoreline in a semicircle, rod and spinning reel in hand. Back from the edge of the water was a very high hedge row spanning the full distance around the lake. On the other side of the hedge was a wide grassy lane, and on the other side of that was dense forest. I managed to walk a good distance while close to the shore, then circled back in the direction from whence I came casting my lure as parallel to the shore as possible, while at the same time achieving some outward distance. I retrieved my bait with a good enough lure presentation, to conclude I wasn’t going to get any hits. Before reaching my exact starting point, I felt it was time to leave this area and rejoin my friends. The thickness of the hedge behind me necessitated that I back through it from a semi crouched or bent over position. I tucked my elbows into my sides and pointed my rod tip down while trudging slowly backwards forcing myself through the brush. As I exited onto the grassy lane, I pulled my fishing rod completely through the hedge, and pivoted to my left while rising from my crouch. And positioned directly in front of me...face to face, within the distance of an outstretched fishing rod (even though I hadn’t extended it) was some sort of mammal. I had the feeling, or perhaps a peripheral view that it had also pivoted or turned to accidently and unknowingly face me. The surprise confrontation shocked me as we looked directly at each other. It was shorter than me (about 62 inches in height), and I was for a moment - frozen in time - before I went to flee to my right. This was conveniently in the direction of my starting point, and my friends. I was young, I was fast, and I was scared. It was a “feet don’t fail me now” moment. Yet in that frozen moment in time, as I attempted to bolt, the creature quickly turned then raced in the opposite direction down the grassy lane. He or she had an unforgettable gait. It could accurately be described as similar to actor Sherman Hemsley who starred as George Jefferson in the All In The Family television sitcom spinoff entitled, The Jeffersons. Hemsley would, at times, display a comedic, distinctly caricaturesque, arm flailing jog. (i.e. I actually witnessed this in person, when awaiting the arrival of my then employer, as I was parked outside the Ambassador East Hotel. Hemsley exited a limousine and cantered across the street toward the hotel. His mannerisms were unmistakeable). Which is to say that the creature’s arms were elongated...and it did not drop to all fours to run, it remained upright. I realized that it was equally fearful of me, as I was of it. The entirety of the being was covered in brown hair, similar to that of a brown bear, and it was not unkempt. It’s eyes were dark brown with no white, and they gave a dog-like friendly impression. It did was not reminiscent of any type of monkey, ape or gorilla, as it’s face was also completely covered in hair. It could best be described as almost having the appearance of an Ewok character from the movie Star Wars. It made no noise, and I don’t recollect having noticed any odor. The similarity with all babies in the animal kingdom is that you can tell they’re a baby. This wasn’t a baby, but it wasn’t an adult either. In full flight I approached my two friends and one said, “What happened”? before I even had a chance to speak. It was obvious to them that I was unnerved.  All I could tell them was that I was confronted by some type of “little bear”, but that it was not a bear. Let’s get back to the part about me being stupid. Even though I sometimes wondered what this was as years passed, I just thought it had to be something in nature, and never really delved into the significance of this experience as having stumbled across some undiscovered species. A few years ago my employment enabled me to spend the winter months in Florida. My wife and I went with a good friend and his family to his aunt’s house for dinner, and we were also joined by some other couples. For some reason after dinner, I began to tell this story (something that I hadn’t previously done), I guess I just felt in comfortable surroundings. At the end of the story I asked the question, “what do you think that was”? They just looked at each other without knowing what to say. After an awkward pause, a couple of flippant jokes followed, like “those drugs must have been pretty good”. Maybe a year or so ago I was watching television, the Travel Channel to be specific. The host of Treasure Hunter, Kristen Gum, was explaining how to search and dig for old bottles, which could be quite valuable. As I lay in bed watching this and thinking it was quite interesting, at the end of the show I must have switched to the History Channel. They were broadcasting an episode of Monster Quest (not my usual fare), and they were in search of Bigfoot. Well, if anyone were to have asked me if I believed in that kind of thing, my response would have been a resounding, no. I’m too logical a person. The people in these telecasts are not to be taken seriously. When the eyewitness accounts are: “...sure I’ve seen Bigfoot, one knocked on my door and asked to borrow a cup of sugar”, it just doesn’t lend itself to anything credible. Additionally, many of the self proclaimed Cryptozoologists and researchers on these shows seem more or-less uneducated. It’s a difficult pill to swallow. Yet the psychologists interviewed on these programs, who come up with their own explanations as to how the large number of eyewitness accounts evolved, and exactly how and why these take place, seem legitimate. These are the people with whom I can more readily identify. After all, logic tells me people claim to have seen these creatures yet there is absolutely no tangible evidence. Show me one...living or dead. The people that go to elaborate means by which to create a hoax, such as footprints, etc., are clearly seriously disturbed. Give me DNA evidence, a preeminent scientist...something coherent. It’s all ridiculous. But on that episode of Monster Quest the “in search of Bigfoot” crew were being told by the landowner (an area on the Texas-Louisiana borders) that there have been many sightings on his property. He went on to say that while he hasn’t seen them himself he does have a photograph that he took of his dog in the back of his pickup truck. Showing this photo, he pointed out two silhouettes behind the brush in the background, one much taller than the other. That’s when it hit me. Thirty-five years after I had a personal encounter, it dawned on me. The smaller shape was redolent with what I had seen. Now I knew what I had only casually wondered about over the course of time. What had always been “no big deal” was suddenly extraordinary. The following day I telephoned one of the acquaintances that I had told my story to, and went on to explain that I now know the answer. I told him of the photograph I had seen on television, and how that triggered my memory to be curious again about my experience. To me it seemed like some revelation, finding an answer to something I really wasn’t fully searching for, yet he was very nonchalant about it, feeling that it was entirely plausible. He went on to say that there was a recent report in Canada of a camper that claimed a juvenile Bigfoot entered his tent. Of course, of this I may be skeptical, but I  now know with assuredness that it could have happened. What seems incredible is that the seemingly intelligent people on these television shows who adopt the posture of debunking the Bigfoot legend, are the people that are just plain wrong. Who knew! The phrase “seeing is believing”, was aptly coined. I recently watched the PBS broadcast of a Nova series call Becoming Human which examines the evolution of Homo sapiens. It has been determined Bipedal homonids existed over six million years ago with the 2001 discovery of the Toumai skull in Western Chad, Africa known as the species Sahelanthropus Tchadenis. Millions of years later, our ancestors, Homo Erectus had shed it’s hair and became well adapted to endurance running as a means to hunt and capture prey. As few as fifty thousand years ago we (later to become modern day humans) were still competing with other bipeds for domination of the planet. It’s no wonder that Bigfoot creatures would attempt to evade any humans and avoid discovery. We ultimately already outdistanced any competition in our rise to the top of the food chain. Why wouldn’t they be acutely aware of how threatening we humans would be, and have been. What I witnessed had not evolved to the point where it shed it’s hair, but yet displayed bipedalism, and did not have ape-like features. Is it possible that my Bigfoot is simply an example of the early evolution of some mammal (a bear perhaps) destined to fail in it’s survival like that of our many humanoid predecessors? After all, it has been surmised that ninety-nine percent of all species that at one time populated this earth, have become extinct. There was a CNN news report about a year ago that hunters, equipped with night vision photographic equipment, in Pennsylvania took pictures of an unidentified biped covered in hair in a half bent over position with it’s back to the camera. I viewed these photos on the internet. The news report attributed one expert as stipulating that this was most likely a black bear with mange. The hunters did also have photographs of small black bears when the movement sensors tripped the camera. The biped was distinctly different in appearance to that of the other black bears pictured, mange or not.  The bent over position of the mammal in this picture (as if it’s picking something up from the ground) is consistent with my assertion that I felt as I pivoted and uplifted, it did the same. In light of this recent discovery, and to think of what I myself discovered so long ago, I am entirely confused as to why no one yet has made the “without a shadow of a doubt” discovery. I’m hopeful and fairly certain that day is rapidly approaching.",
  "classification": "Class A",
  "county": "Kankakee",
  "state": "Illinois",
  "latitude": 41.16124,
  "longitude": -87.58124,
  "location": "-87.58124,41.16124",
  "location_details": "",
  "temperature_high": 56.74,
  "temperature_mid": 49.485,
  "temperature_low": 42.23,
  "dew_point": 40.88,
  "humidity": 0.66,
  "cloud_cover": 0.79,
  "moon_phase": 0.39,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.85,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 9.88,
  "wind_bearing": 10,
  "wind_speed": 3.6
}