{
  "id": "27966",
  "title": "Possible howl heard by three family members while on vacation at June Lake",
  "date": "2010-07-31",
  "timestamp": 1280534400,
  "observed": "A week ago my family and I went on a vacation to the Double Eagle Resort and Spa in June Lake, California. We stayed at one of the furthest cabins at the resort, which backed up to a forest at the bottom of granite rock formations. These rock formations separated the Inyo National Forest from the town of June Lake. The first night we stayed at the resort, June 30, 2010, my brother, my father and I were watching TV in the front of the cabin and at around 11:30pm we went out on our deck to look out at the amazing view we had. Within five minutes the silence was broken when we heard a howl in the distance, which sounded like it was coming from the granite formations, which over looked the resort. All of us froze. The sound scared us because we had never heard a sound like that before. The vocalization lasted under a minute. We waited for another 10-15 minutes out on the deck to see if whatever made the howl would howl again. But it did not howl again so we went back inside and I took a shower. While I was showering my brother and father continued to watch TV, but this time they opened up all the windows in the cabin to see if they could hear the howling again. When I got out of the shower ten minutes later, my brother and father told me they heard the same sound again when I was in the shower and this time my mother who was in bed with her window open heard the howling too. This time there were three howls, which were all shorter than the first howl we heard on the deck and there was only about 20 seconds in between each howl. My family and I stayed there another night but did not hear any more howls.",
  "classification": "Class B",
  "county": "Mono",
  "state": "California",
  "latitude": 37.79337,
  "longitude": -119.118,
  "location": "-119.118,37.79337",
  "location_details": "The location of the howl was near the Double Eagle Resort and Spa located South of Lee Vining and Mono Lake off HWY 158, which is a two-lane road, which makes a C connecting back to HWY 395.",
  "temperature_high": 87.89,
  "temperature_mid": 68.99,
  "temperature_low": 50.09,
  "dew_point": 40.3,
  "humidity": 0.36,
  "cloud_cover": 0.01,
  "moon_phase": 0.68,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1010.29,
  "summary": "Clear throughout the day.",
  "uv_index": 13,
  "visibility": 9.96,
  "wind_bearing": 289,
  "wind_speed": 3.76
}