{
  "reportId": "33322",
  "title": "Nighttime sighting while leaving Lake Barkley State Park",
  "date": "2010-08-15",
  "timestamp": 1281830400,
  "observed": "My encounter took place while leaving the Lake Barkley Resort.  My family and I were driving back toward the main road that leads to Cadiz, KY.  I was going about 50 miles per hour when I saw a deer run across the road. I thought I saw a tree next to the road but it was running.  It was taller then the top of my mini van and looked right at me,  we passed it in about 3 seconds.  I was not really sure what I saw so I turned around to see if it might have been a tree or something but there was nothing there.  I remember afterwards that it was a large creature, with tanish/brown fur around 7 feet tall with an almost Neanderthal brow and flatish nose.  It was hard to tell what color the fur was exactly since my headlights are tinted yellow. My son who was in the back seat also saw it and commented on it. The animal was running upright along the edge of the road. it seemed to be chasing a deer that had run in front of our van literally seconds before. It kept pace with me for about 3 steps then dropped back. When I looked in the rear view mirror, it had run off.",
  "classification": "Class A",
  "county": "Trigg",
  "state": "Kentucky",
  "latitude": 36.8216,
  "longitude": -87.93167,
  "location": "-87.93167,36.8216",
  "location_details": "From Cadiz, KY - follow 68 West heading towards Land Between the Lakes. Turn right on1489 to the Lake Barkley Resort and Marina. The incident took place about 2 miles up the KY-1489 road from the KY - 68",
  "temperature_high": 92.76,
  "temperature_mid": 82.17,
  "temperature_low": 71.58,
  "dew_point": 72.55,
  "humidity": 0.74,
  "cloud_cover": 0.28,
  "moon_phase": 0.21,
  "precip_intensity": 0.0026,
  "precip_probability": 0.56,
  "precip_type": "rain",
  "pressure": 1013.11,
  "summary": "Humid throughout the day and partly cloudy until afternoon.",
  "uv_index": 8,
  "visibility": 9.47,
  "wind_bearing": 288,
  "wind_speed": 1.44
}