{
  "id": "883",
  "title": "",
  "date": "",
  "observed": "In the spring of 1974 my girlfriend and I were returning from a motorcycle rally at Laconia NH.It was late at night and we decided to camp out.I found a small gravel road and we found a remote place to set up my small 2 man tent.This area is referred to as the pine barrens in the Kennebunk area of Maine.It has very thick scrub pine growth. About an hour or so after camping I could hear movement near the tent but was not too concerned because there is a lot of wildlife in the barrens.The movement got closer and there was this really pungent order.I thought \"uh-oh it's a bear\"but was still not concerned as black bears are mostly just curious and usually will not bother you. I should add here that I have spent a lot of time in the woods as my mother and father were both Maine guides and the woods was my life.I have heard all the noises that wildlife makes in different seasons.I consider myself a good tracker and know the habits etc. of most animals. Then it happened:Whatever it was let out a scream that made every hair on my body stand striaght out and nearly gave me a heart attack.I am saying to myself\"this is no bear.\"Now the girlfriend is awake and in hysterics.I am trying to quiet her so I can keep track of whatever it is.It moved close enough to the tent so I could actually feel it's movement through the ground and hear it breathing.This activity went on for about 20 minutes and it went away. After a sleeplees night and at first light I crawled out to investigate.I looked for tracks.There were no clear imprints,only impessions in the grass and some broken ferns etc.The impessions were about half again as big as my own.I wear a size 11.I followed the tracks and they ended at a cliff that was about 30 feet high.I wanted to investigate further but the girlfriend was haveing none of it and wanted to leave.I went back a couple of times by myself to that area but never found any further signs in the area. This all would have been disturbing enough but that year I was liesurly sipping a beer an watching a documentry on bigfoot with my girlfriend when they played a recording that was supposed to be a bigfoot scream.YOu guessed it...Hair straight out and and an exclamation from both of us of \"Oh sh--!\"If that was bigfoot then we have been very close to him.",
  "classification": "Class B",
  "county": "York",
  "state": "Maine",
  "location_details": "I do not know if I could find it again.I only know that I took side roads off route 1 generally going west into the area known as the Barrens",
  "summary": ""
}