{
  "id": "26554",
  "title": "Man has nighttime sighting of two bipedal creatures behind his home near Mannford",
  "date": "2009-09-08",
  "timestamp": 1252368000,
  "observed": "I live outside of Mannford Okla. in Creek county.6 miles south on Highway 48. By 87th place. I was outside about midnight September 8th 2009. I was talking on my cell phone out in the driveway of Our house. There are a few trailers around Us and the one directly behind Us keep their porch light on most nights. The moon was very bright and there were clouds but mostly a clear sky. I was chatting on the phone when I noticed movement that was shaped like a man walking across the field in front of some medium sized trees...The head was about halfway up to the top of the trees, which would have made them about 7-8 feet tall. I told the persons that I was on the phone with and then preceeded in telling someone in the house to turn Our back lights on...I saw the being being followed by a smaller or a hunched over second being. They crouched into the tall grass and then I lost sight of them until they walked off into the darkness and more trees...all I could see was a dark outline and the gait was very apelike..arms swinging at the sides...Their body seemed to turn at the waist to look my way... There have been an abundance of Bigfoot sightings in this area the 2 years We have lived here. We often hear screaming in the woods. The last incident was last Summer for about a week.",
  "classification": "Class A",
  "county": "Creek",
  "state": "Oklahoma",
  "latitude": 36.03501,
  "longitude": -96.36707,
  "location": "-96.36707,36.03501",
  "location_details": "Off highway 51 that heads out of Tulsa okla., You head west through Mannford and turn south onto highway 48 and go about 6 miles to 87th.",
  "temperature_high": 89.63,
  "temperature_mid": 80.505,
  "temperature_low": 71.38,
  "dew_point": 67.52,
  "humidity": 0.72,
  "cloud_cover": 0.21,
  "moon_phase": 0.63,
  "precip_intensity": 0.0103,
  "precip_probability": 0.51,
  "precip_type": "rain",
  "pressure": 1012.96,
  "summary": "Light rain starting in the evening.",
  "uv_index": 7,
  "visibility": 9.03,
  "wind_bearing": 149,
  "wind_speed": 5.85
}