{
  "reportId": "9121",
  "title": "Outdoorsman hears vocalizations near Tinkham Campground",
  "date": "2004-07-22",
  "timestamp": 1090454400,
  "observed": "I had gone up to Tinkham for a solo camp before spending 5 days in Utah visiting my father.  I've given these whistling sounds alot of thought, as two of the three sounded entirely not like any bird I've ever heard - more like a person would whistle, really, only pretty loud, but flat and smooth. The third sounded more like a bird, but the last of its three notes would reverberate all over itself - a piercing note that echoed fairly intensely after termination. (Maybe two weeks earlier, I heard the same sound in the Upper Cle Elum River valley, up on a slope going east away from Tucquala Meadows, coming from several individuals, which I assumed were some kind of bird I'd never heard before.  But, then again, I've heard WHOOPING in the same approximate location before, only to write those off, too, as some kind of bird I've never heard before.)  The first two, flat-toned, human-like whistles (but with more \"air\" behind them - far \"richer\") were to my northeast and east.  The northeast whistle was noticeably stronger and sounded like it was getting closer.  The east whistle sounded like it moved a little closer and towards the road (south), when the third whistle began.  For about maybe 15 seconds it sounded like they were going back and forth.  Then it just stopped, and all went absolutely quiet again, save for a ground-branch snap to the east immediately after it ended. I tried to ignore the nature of the whistles as best as I could but an occasional branch being crunched on the ground kept me on edge for about the next hour.  I didn't feel alone, but didn't feel threatened either.  I even slept in the back of my truck, under the trees. The whistling described in report #1674 spurned me to share this.  Because \"trying to sound like birds\" crossed my mind while hearing the first two whistlings, and I've heard none of these \"bird sounds\" before. What gets me is that on the Upper Cle Elum I was whistling back and forth with a single because I thought the way it ended was extremely impressive (piercing).  I was fascinated by how far and fast the end-note was pushed through the air by its maker.  Then a couple more joined in, with one sounding to be a good couple-hundred yards in the woods, and a couple hundred feet up the slope, but it was still plenty loud. Hell, maybe they were birds, and maybe the last one to join in at Tinkham was a bird, too, but the other two in no way sounded like a bird, hawk, eagle, owl or anything.  This leads me to believe these all weren't bird sounds. In fact, I had no inclination to try whistling back at Tinkham whatsoever.  The first two whistles had me very much \"on alert\".",
  "classification": "Class B",
  "county": "King",
  "state": "Washington",
  "latitude": 47.40245,
  "longitude": -121.5633,
  "location": "-121.5633,47.40245",
  "location_details": "Approximately 1.5 miles east of Tinkham Campground, but still west of Hansen Creek.  Also, Tucquala Lake, SE end.",
  "temperature_high": 89.31,
  "temperature_mid": 77.02,
  "temperature_low": 64.73,
  "dew_point": 53.15,
  "humidity": 0.53,
  "cloud_cover": 0.02,
  "moon_phase": 0.17,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.8,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 9.68,
  "wind_bearing": 8,
  "wind_speed": 6.15
}