{
  "reportId": "31302",
  "title": "Avid hiker recalls years of experience living in an area with what local people called the \"Shadow People\" near Montague",
  "date": "1979-07-15",
  "timestamp": 300844800,
  "observed": "I grew up in lower MI, right on the border of Muskegon and Oceana counties about one mile off the lake. I believed there was a bigfoot in that area. I saw on one walk an animal of tall stature, peaking out from underbrush, the head between five and six feet in height from the ground and the body was hidden. On the property were many \"bear dens\" and other areas that could provide shelter. I also saw deer carcasses cached high in trees. I saw as well, bone pillars. Piles of bones stacked two and three feet high in a very dense area of the wood. I have heard sounds, hard breathing, but not like a buck or deer, or bear. Certainly of a large animal. During a walk after dark I was chase by an enormous creature which ran on two feet and was most definately not human. Frequently, there was a feeling of being watched.....Also during this time period there were a lot of deer kills being attributed to wild dogs, I had no encounters with wild dogs in that area or their tracks or sign. Any time it felt like the creature was near there was a distinctive musk odor. Also some odd calls were let out before the chase in the dark....like nothing I had ever heard. This is in White River Township.  I will tell you, there is more than one type of \"bigfoot\" living out there, the larger more reported, and a smaller not so reported. The smaller has closer to humanlike features, and resides in upper Michigan. It has the appearance of an early ape-man on the evolutionary track....I can't think of which one. This one runs...it has not got the aggresive nature of the larger, This is the one frequently confused as a human spirit in native mythology.",
  "classification": "Class B",
  "county": "Muskegon",
  "state": "Michigan",
  "latitude": 43.4245,
  "longitude": -86.353,
  "location": "-86.353,43.4245",
  "location_details": "(Omitted upon the witness' request)",
  "temperature_high": 85.28,
  "temperature_mid": 74.86,
  "temperature_low": 64.44,
  "dew_point": 63.2,
  "humidity": 0.71,
  "cloud_cover": 0.44,
  "moon_phase": 0.72,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.2,
  "summary": "Partly cloudy until evening.",
  "uv_index": 7,
  "visibility": 8.11,
  "wind_bearing": 236,
  "wind_speed": 4.94
}