{
  "reportId": "26279",
  "title": "Logging reveals a brief sighting of a bipedal creature near Pennsboro",
  "date": "2002-08-13",
  "timestamp": 1029196800,
  "observed": "This took place in the late summer of 2002. I was walking the property next to mine as logging interested me in how it worked and how the land looked afterward. I'd go onto the place after the workers left for the day at 3PM. It was rather hot and plain nasty so I usually headed out after 4 -5 PM. This day they were at the far end of the valley (or \"holler\" as the locals call it-I'm from CA originally). I was armed as there are wild dogs, bears, and a black panther running round back here.  Walking to the far end there are two smaller branches off to your right, the first is shallow and only extends a few yards. Every time I walked to base of the hill before, I felt like I just didn't want to venture into the woods. I had found another way onto the ridge above on the right a few months before-but I also got pretty badly spooked and kind of stayed away. I had trails and just went wherever-until the loggers hit this patch. The past few weeks before this I had roamed all over the logging trails and as soon as they got back there I began to feel very uneasy. Walking alone, I decided to keep looking around staying extra cautious. This day I went left and followed a trail that took me to the ridge top which is dead center of the valley. I also had a very \"something is watching me\" feeling so I wasn't what you would call happy, just taking note of where things were and enjoying the view. The trail followed along this ridge and would take me near where I had all the strange feelings. I stopped as the feeling of being watched was getting a bit too much when I heard a tree fall, just on the other side of the ridge not more than about maybe seventy yards away. I was wondered just why in the hell would a tree fall but something told me not to investigate and to get off that hill. I decided to turn around to call it a day. I walked maybe ten yards when something loped between two trees on the ridge to my right. My first thought was some loggers or forestry guys were still on the property. It looked to be wearing Carhart brown clothes. I went maybe twenty more yards and then it hit me: I had been on that ridge a few days before, I knew where those trees were and if, IF it was a man he had to be around seven to eight feet tall. A day or two later I went back to the ridge where I saw the thing and took a good look. I never felt any real strangeness on this side and didn't then, but I did confirm that whatever I saw was very big. I also could swear I saw the right arm and leg but not the head, thinking back it was kind of leaning forward as it walked along so the head was behind the tree when I noticed it.",
  "classification": "Class B",
  "county": "Ritchie",
  "state": "West Virginia",
  "latitude": 39.355,
  "longitude": -80.915,
  "location": "-80.915,39.355",
  "location_details": "At Pennsboro, WV follow 74 North for approximately 4 miles.",
  "temperature_high": 91.09,
  "temperature_mid": 79.335,
  "temperature_low": 67.58,
  "dew_point": 65.26,
  "humidity": 0.72,
  "cloud_cover": 0.21,
  "moon_phase": 0.18,
  "precip_intensity": 0.0019,
  "precip_probability": 0.33,
  "precip_type": "rain",
  "pressure": 1018.51,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 8,
  "visibility": 5.43,
  "wind_bearing": 166,
  "wind_speed": 5.02
}