{
  "reportId": "412",
  "title": "Cousins followed for a quarter mile",
  "date": "1995-07-05",
  "timestamp": 804902400,
  "observed": "My cousin Jay and I were out driving my BMW in the forest near Lava Butte. We just wanted to get out of town for a while and away from people,have a few beers etc. I had not seen him for some time as he lived in another town. We drove to What the locals call \"the foundation\", a concrete fire pit on the south side of Green Butte,then decided to drive around to the other side of the butte to watch the sunset out across the lava flow. This road is narrow, sandy, and winds out through the 10' tall manzanita brush. We wen't as far as we could in the \"Bummer\",and finally could go no further as the road turned into nothing more than A trail. I found A place to turn around, and backed the car as far down in as it would go and parked. We decided to walk down the trail a bit to get a better view of the mountains and lava flow and were only about 5 min. into the hike when I started hearing things. (At this point I would like to state that I was raised in central Oregon, and have spent a lot of time in the woods alone, hiking, hunting logging for five years, much of which was walking units looking for boundry markers etc. I AM NOT PARANOID OR A FRAIDY CAT IN ANY WAY).",
  "classification": "Class B",
  "county": "Deschutes",
  "state": "Oregon",
  "latitude": 43.94225,
  "longitude": -121.3815,
  "location": "-121.3815,43.94225",
  "location_details": "Just north of lava butte there are a few forest roads that turn west off Hy.97, The area is crisscrossed with logging roads, however this is not a large piece of forest, as it is bourderd by the Hy. on the east, the lava flow on the south and west and Deschutes River woods on the north. This was on the west side of green Butte. This is A small hill easy to find on the maps.",
  "temperature_high": 82.51,
  "temperature_mid": 67.395,
  "temperature_low": 52.28,
  "dew_point": 48.71,
  "humidity": 0.55,
  "cloud_cover": 0.7,
  "moon_phase": 0.25,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.55,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 10,
  "wind_bearing": 325,
  "wind_speed": 4.59
}