{
  "id": "11702",
  "title": "Campers hear scream and witness rock throwing at Twin Sister Lakes",
  "date": "2005-07-08",
  "timestamp": 1120780800,
  "observed": "First off I am not a true beliver in BigFoot.  I was messing around on the internet and stumbled apon your site.  I thought it would be funny to see what sightings have happend around my home city of Yakima Washington.  When I clicked on the report form of the July 2000 (class B) hearing sound around bumping lake, I got the chills.  Let me start from the begining.  Myself and a couple of buddies of mine took off from Yakima really late with the intent of climbing the trail and spending 3 days of camping at Twin Sisters. We were going to stay at the first lake (Or First Sister).  The lake is about 8 or 9 miles past bumping lake and you have to hike in about 1-1.25 miles straight up. When we arrived at the lake after taking way to long to climb the trail (Over confident and over packed) we set up came and got the fire going by 12:30am-1:00am.  We were exhausted and really didn't feel like drinking or anything else but eating and going to bed.  About two hours after going to bed I was awoken by some little grunting sounds.  I woke up kind of starteld but then realized they were basically a quarter the way around the lake so I just sat and listened.  All of a sudden they turned from little gruntings to a grunt/scream.  I quietly called out my friends Shawns name and he had been woken up and was listening to.  I asked him what the hell that was and after talking about it we both convinced ourselves that it was an elk or something.  I am not an animal call expert by any means but to this day when I think about that trip one of the first things I think about is how weird that sounded.  I have heard elk and deer grunts before but this sounded different. As Ron White would say \"I told you that story so I could tell you this one.\" On the last night I slow cooked some stakes over the fire coals for about.  When they were done my friends and I were enjoying them when were heard something about 60 or 70 yards out from camp.  We were camped out below the rocky base of the mountain top.  Its like the dirt stops and the rocks go up the rest of the way.  The sound was coming from the rocky area but we all thought it was a cat or bear so we got up grabbed the guns and an axe and started out with a lantern to go see what the hell was out there.  The sound was like what a rock being thrown and hitting the other rocks and then coming to rest.  It didn't sound like a little rock slide and it happen several times until we got closer, infact we had barehanded our stakes and finished them while we were away from camp as close to the sounds as we could get without climbing the rocky face, they completely stopped.  At no time did we every think it was bigfoot but we couldn't figure out what would make a sound like that?  It didn't sound like an animal that was mearly passing by, it moved to quick and to speratic(as if someone was throwing at different targets.  The only reason I look back on it now is that I was watching a bigfoot special today on the history channel and they had a gentlemen on there saying bigfoot was throwing rocks at him.  And now looking back I could definatley see how someone or something throwing a rock down twords us could make that sound.  Were the activity was would be the exact place I would be if I wanted to mess with my buddies back at camp.  We always talk about those noises and never ever gave bigfoot a chance of being the sorce of the sounds and now I just don't know.  After all this time of not even considering it now that I think of that as a possiblity it makes more and more sence even though I don't truely believe in Bigfoot.",
  "classification": "Class B",
  "county": "Yakima",
  "state": "Washington",
  "latitude": 46.74778,
  "longitude": -121.3603,
  "location": "-121.3603,46.74778",
  "location_details": "Go past bumping road and head up the dirt trail, anytime the road forks go right.  The trail will dead head and park you car.  Get out find the trail sign that says Twin Sister and follow it.  I can't remember how far it is exactly but it is between 1 and 1.25 miles in, very steep climb.",
  "temperature_high": 68.83,
  "temperature_mid": 60.395,
  "temperature_low": 51.96,
  "dew_point": 52.5,
  "humidity": 0.74,
  "cloud_cover": 0.63,
  "moon_phase": 0.07,
  "precip_intensity": 0.0094,
  "precip_probability": 0.62,
  "precip_type": "rain",
  "pressure": 1011.87,
  "summary": "Light rain in the morning.",
  "uv_index": 6,
  "visibility": 8.12,
  "wind_bearing": 215,
  "wind_speed": 4.36
}