{
  "reportId": "3381",
  "title": "A group of canoers see a large, black creature along the river bank",
  "date": "1997-07-03",
  "timestamp": 867888000,
  "observed": "I was on a canoe trip with a bunch of friends from school. There were five canoes, each with two people in them. We had canoed about a mile, when we came to fork in the river. According to the map, the two eventually link up about 1 to 1.5 miles later. So we decided to race. Three canoes went down the fork on the left hand side, that had the road next to it. My canoe and another went down the fork that was in the woods. Upon entering the fork, we became aware of a very pungent smell of decaying materials. Soon we were in the middle and the trees all but blocked out the sky. We stopped for a bathroom break along the river, and on the opposite side noticed a shadow in the trees. We passed it off as a deer. When we continued our trip, we noticed that the smell had gotten closer, and when a female companion glanced toward the smell she silently froze. She said she saw a black 6 1/2 to 7 foot creature observing us. We doubled our paddle speed and noticed that it was following us behind the tree line. Soon, we noticed a bend in the river. That is when the creature took off and ran towards the bend. We idled in the river waiting and then heard a big splash. We began to paddle towards the bend and noticed just in time to see it coming up onto the opposite bank of the river. It had to cover over 200 yards in 30 seconds. We thought our encounter was over but later saw it crossing an open clearing casually.",
  "classification": "Class A",
  "county": "Holmes",
  "state": "Ohio",
  "latitude": 40.59935,
  "longitude": -82.23988,
  "location": "-82.23988,40.59935",
  "location_details": "Along a branch of the Mohican river while canoeing outside the town of Loudonville. Nearest major road is State Route 3.",
  "temperature_high": 77.61,
  "temperature_mid": 70.275,
  "temperature_low": 62.94,
  "dew_point": 62.02,
  "humidity": 0.72,
  "cloud_cover": 0.38,
  "moon_phase": 0.96,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1006.02,
  "summary": "Partly cloudy throughout the day and breezy starting in the afternoon, continuing until evening.",
  "uv_index": 8,
  "visibility": 9.69,
  "wind_bearing": 261,
  "wind_speed": 11.82
}