{
  "reportId": "36567",
  "title": "Possible nighttime sighting while driving in Orient",
  "date": "2009-08-06",
  "timestamp": 1249516800,
  "observed": "I used to live in a rural town called Orient Illinois. There is only about 240 people living in the town. I was driving up Chicago Avenue to get to my house, Its a rural road that is paved and has a few homes on it but for the most part any area in Orient is the country. The neighbor boy was seated in the front seat with me and my 2 daughters were in the back seat. My daughters said they had seen it also but I don't know for sure because we were on a hill going upwards and they were pretty small in height, so I will tell you for sure the boy and I have seen it. We were going really slow because of deer at night, so while me and the boy we conversing on and off there from my side of the road comes a maybe 7 foot creature with the most beautiful chestnut long hair that covered all of its body just jogging across the front of my car crossing over the headlights. It used no effort to cross but it sure did cover allot of land in a very short time. Me and the boy watched it cross the car and go into the woods: then we looked at each other and kinda screamed, shouted to each other: Did you just see that? We answered each other at the same time and then I told the boy lets drive down the way and see if we can catch up to it, so we did, but to no avail. He had disappeared. He and I told each other that we will take it to the grave and forever it's our memory! I am a firm believer in Bigfoot!",
  "classification": "Class B",
  "county": "Franklin",
  "state": "Illinois",
  "latitude": 37.92017,
  "longitude": -88.98228,
  "location": "-88.98228,37.92017",
  "location_details": "It happen in Orient Illinois on Chicago Avenue close to the city hall storage.",
  "temperature_high": 83.36,
  "temperature_mid": 73.55,
  "temperature_low": 63.74,
  "dew_point": 64.73,
  "humidity": 0.73,
  "cloud_cover": 0.12,
  "moon_phase": 0.52,
  "precip_intensity": 0.0003,
  "precip_probability": 0.63,
  "precip_type": "rain",
  "pressure": 1018.1,
  "summary": "Clear throughout the day.",
  "uv_index": 9,
  "visibility": 8.02,
  "wind_bearing": 31,
  "wind_speed": 3
}