{
  "reportId": "19015",
  "title": "Possible vocalization and approach to tents reported by campers on private land near Pilot Mountain",
  "date": "2007-05-10",
  "timestamp": 1178755200,
  "observed": "It was in January 2006 when a good friend, my 26-year-old nephew and I went camping on some private land in Stokes County near Pilot Mountain. This private land operates as a summer camp during the summer and hosts small retreat groups during the fall, winter and spring months. I attended this summer camp for many years as a youth and then lived and worked there during the off-season as an adult. In addition, I have been camping at this very spot a dozen times within the past few years. In the summertime, the woods at night are alive with the sounds of nocturnal animals, crickets and frogs. During the winter months when all of the leaves have fallen off of the trees, the woods are dead silent at night. The only sounds you can hear are the wind and the occasional dog barking in the distance. So after we set up camp, we ate dinner and sat around the campfire for a while. We climbed into the tent and went to sleep around midnight. I drifted off to sleep and was awakened at about 2:30am by my nephew tossing and turning. He told me that he had indigestion from the dinner we ate and he asked if I had any antacids. He asked my friend too and we both indicated that we didn’t pack any. He then said that he needed to get up and walk it off. My nephew then proceeded to unzip the tent flap and go outside by the campfire. By then the fire had died out and I could hear him scratching around in the ashes looking for hot embers and cracking small sticks to build the fire again. Soon, I could see the light of the fire flickering against the side of the tent and hear the crackle and pop of burning wood. It was at this time that the most unusual sound pierced the silence. The sound came from the woods immediately surrounding our campsite and it could only be described as a loud yelp.  In all my years spent camping on this land, some in this very spot, I have never heard a sound like this one. The souund was very similar to the yelp recorded on your website except that it was slightly higher pitch and was much closer. There wasn't any echo. Immediately after hearing this sound my eyes shot open and my nephew who was still cracking sticks around the fire froze in silence. My mind was racing to think of what could have made this sound when I heard the tent flap quickly unzip, my nephew tumble inside and then quickly zip the flap back-up again. The three of us immediately whispered to each other and then lay silent. The next morning and every time we’ve been camping since we’ve always had a good laugh at my nephew’s expense. After listening to your sound recordings, I’m just in total shock at what it could have been.",
  "classification": "Class B",
  "county": "Stokes",
  "state": "North Carolina",
  "latitude": 36.48615,
  "longitude": -80.375,
  "location": "-80.375,36.48615",
  "location_details": "None.",
  "temperature_high": 79.54,
  "temperature_mid": 70.095,
  "temperature_low": 60.65,
  "dew_point": 59.06,
  "humidity": 0.74,
  "cloud_cover": 0.5,
  "moon_phase": 0.77,
  "precip_intensity": 0.0089,
  "precip_probability": 0.15,
  "precip_type": "rain",
  "pressure": 1014.83,
  "summary": "Mostly cloudy until afternoon.",
  "uv_index": 9,
  "visibility": 9.12,
  "wind_bearing": 133,
  "wind_speed": 1.31
}