{
  "id": "15102",
  "title": "Daylight sighting by hunter near the Alabama / Mississippi border",
  "date": "2006-07-06",
  "timestamp": 1152144000,
  "observed": "Either December 25 or 26, 2002. Franklin County Alabama Pine Forest/Hardwood Forest/Open field Between 4:00 and 5:00pm. I was hunting along a fenceline late that afternoon when some deer came running out of a pine thicket, down the netwire fence row, and jumped over to where I was.  I was roughly 75ft from the fence when this occurred.  My jack russell dog saw them and took aften them. He often follows me hunting as this place is next to my house.  After chasing them for about 10 mins he comes back towards me when he suddenly stops, looks towards the pine thicket, lets out a weird yelp and takes off towards the house visibly something wrong.  I stood there and heard a noise and the deer that had ran by came back by as if something had spooked them again.  As they came back up the hill I heard what appeared to be a large animal coming from the thicket.  I thought it was another deer that had separated from the herd and was coming back to join up.  As I watched something on two legs appeared roughly 100ft from my position from out of the thicket.  It came down the fence line and went over the fence in the direction of the deer.  I could clearly see that it was on two feet and did not pay me any attention.  I watched it for less than a minute before it disappeared down the hill from me. Numerous hunters have reported seeing something of this nature around here before.  I sent in a follow up the other day to tack on to this story but was notified that you never received this story.  My other account happened last week.  It goes as follows. July 1, 2006 that around the hours of 11pm to 12am I walked out on my front porch to encounter weird noises that closely resemble those on your website.  The sounds came from directly in front of my house down in a hollow on my neighbors land.  They lasted for roughly 3 or 4 minutes. My three dogs became agitated and seemed quite frightened when the noise started.  I myself became somewhat afraid and proceeded back inside. I would also like to inform you on a change in email addresses.  As you can see my address now is [removed by editor].  Thank you for your time.",
  "classification": "Class A",
  "county": "Franklin",
  "state": "Alabama",
  "latitude": 31.00002,
  "longitude": -86.99782,
  "location": "-86.99782,31.00002",
  "location_details": "Northwest Alabama on Mississippi state line.",
  "temperature_high": 83.5,
  "temperature_mid": 78.725,
  "temperature_low": 73.95,
  "dew_point": 72.24,
  "humidity": 0.79,
  "cloud_cover": 0.5,
  "moon_phase": 0.35,
  "precip_intensity": 0.009,
  "precip_probability": 0.36,
  "precip_type": "rain",
  "pressure": 1015.71,
  "summary": "Light rain until afternoon.",
  "uv_index": 8,
  "visibility": 8.37,
  "wind_bearing": 293,
  "wind_speed": 0.79
}