{
  "reportId": "10284",
  "title": "Vocalizations heard and rocks thrown at fisherman and family on Blue River",
  "date": "2004-06-12",
  "timestamp": 1086998400,
  "observed": "I am a 40 year old engineer and have been passively interested in Bigfoot since I was a kid.  I never gave it much serious thought until two or three years ago a strange animal was sighted near Bloomfield, IN were my Sister lives.  This event re-ignited my interest and I began doing a little research on the subject and ran across your website. Since then a co-worker John (not his real name) told me about an experience he and his wife and son had last summer on a 600 acre farm along Blue River in southern Indiana near Fredericksburg. The farm belongs to the C.E.O. of our company. He uses it for recreation only.  There is a house on the property but no one lives there. Over the past few years he has some problems with the folks who used to own the property and one of the neighbors stealing things and tearing stuff up. My friend/co-worker is not at all interested in cryptozology or Bigfoot and would not take the time to write this report, therefore, with his permission I am submitting this report to you on his behalf. By June, we were all stressed out trying to finish our project on time. John (my co-worker) said he took his wife and 12 year old son out on 4 wheelers, to the boss's farm for some fishing and stress relief.  I ask him how the fishing was and he said \"We didn't catch a thing, but I think that crazy drug fiend was back their messing with us\"! \"What do you mean\", I ask. \"We were fishing in the river and right after it got dark somebody kept throwing BIG rocks or something in the water where we were fishing trying to scare us off. I think it was that nut that used to live on the property or the crazy neighbor\" he continued, \"I just couldn't get a look at him\".  He was adamant about how big of a splash it was making and went on and on. I was intrigued and said, \"Tell me the whole story from the beginning\". This is how he related the facts to me about what happened to him, his wife and son. They drove the truck to the back of the property, unloaded the 4 wheelers and drove down the hill into the dry stream bed and followed it to where it intersects with Blue River. They arrived about 8:00 p.m. They were set up in the mouth of the dry stream bed where it dumps into Blue River. They had a lit a Coleman lantern as it became dark about 8:50 p.m. It had been dark for almost an hour when they heard a huge splash in the water about 150-200 feet up stream (to their left). His son asked \"What was that?\" It was a big splash. He explained to his son that it was probably just a limb broke off and fell in the water.  They continued fishing, talking, and relaxing.  After a minuet or so there was another big splash in the water.  This time it was a little bit closer. He described the sound of what ever was hitting the water as large enough to make a huge splash and then rain water droplets for two or three seconds afterward. It was loud enough to be heard over a 100 feet away in a running stream of water. He said it sounded like something the size of a bowling ball, or a heavy log; say 8 inches in diameter and 20 inches long, or a similar large heavy object hitting the water with great downward force. So by now he's kind of wondering what's going on here? He can't see anything beyond the circle of light projected from the lantern so he goes to the 4-wheeler to retrieve an ultra high intensity portable search light. Just then splash! A third time still closer, he shines the light around and doesn't see anything. The brush around the creek bank is pretty dense. They are standing a dry feeder stream basin about eye level to the ground on the surrounding banks so it is extremely difficult to see very far.  His son is kind of scared now.  John starts talking out loud \"Alright, I guess I'm going to have to get my gun out now\", as he rattles around in the tackle box. Splash! Just then a fourth object hits the water yet closer to them, still upstream a little. Again all of these objects, though never seen, are appearently 10-20 lb. hitting the surface displacing a large spray of water. My friend is mad now. He's shining the light around, turning it off and on trying to pick up any movement, looking for any anything that will indicate who is doing this and where they are.  He shouts out loud, \"Come on out where I can see to shoot\".  All of this is a bluff of course, as he doesn' t really have a gun at all.  So then he turns the light off and listens. A minuet or two passes then Splash! This time he is ready with the light and sees the spray of water from the impact about 30-40 feet away. At this point his son is pretty scared and ready to leave. He keeps trying to determine where the objects are coming from.  He can not tell if whoever is throwing them is on the opposite bank or on his side further upstream to the left. He said he feels like they were coming from the opposite bank, but he never saw anything to confirm or deny this notion. The opposite bank is a steep hillside that goes up a hundred feet or more at an angle of about 80 degrees. Their side is relatively flat with an open meadow and tree line along the bank to their left and dense woods to the right. By now his son was very scared and they have decided to pack up and leave. As they gathered their gear, Splash! something hits the water again about 20 feet away! Finally just as everything was ready to go, Splash! something big hit the water so close the water spray hit the bank where they had been standing a few seconds earlier. John said this time he saw the column of water spray shoot up into the air about 20 feet. He indicated there did not seem to be a forward or directional component to the objects path. He said it looked like something had dropped straight down out of the sky into the river.  At that point they climbed on their 4-wheelers and rode back to the truck. The whole time he was telling me this story he became more agitated over who ever it was messing with them and spoiling their fun.  The thought of a creature doing this never crossed his mind.  Of course I was trying not to jump headlong to that conclusion, but I was very intrigued to say the least. John said he checked his watch and all seven objects had hit the water within 12 to 15 minuets at approximately 1.5 to 2 minuet intervals.  (F.Y.I.  Blue River is about 30 to 40 feet across at the point where they were fishing). I ask him, & \"Did you hear anything?\" \"No, nothing\" he replied \"I kept listening to try to get a fix on where they were but I could never hear them moving around\". \"How do you pick up something that big and hurl it into the water seven times without making some noise on the ground?\" I ask him. \"The lantern and the stream made some noise, we were talking off and on, I don't know.\"  he replied. \"Did you smell anything\"? I ask. \"No.\" He replied. \"Did notice if the nature sounds had ceased?\" I asked. \"I didn't notice the nature sounds one way or another\". He stated. \"Did you have any foreboding or erie feelings?\" I probed. \"Not really, I was more aggravated than anything else.  I was obviously worried and concerned for my family' s safety and tried to maintain my composure throughout the whole ordeal, but when that last object hit the water so close, with such force, it really did scare me a little. I didn' t experience any creepy feelings until we were on our way back to the truck and loading the 4 wheelers.  At that point I did feel the hair on the back of my neck stand on end. It felt as is we were being watched, that if I turned around suddenly someone would be there looking at me\". John replied. \"Did you hear any unusual animal noises at all?\" I continued to inquire. His face changed a little and said, \"Yes, we did hear something, now that you mention it.  We did hear a strange scream once about 15 minuets after dark, way off in the distance, like a half mile away, upstream. Then again 20 to 30 minuets later, real loud, much closer maybe 200 yards upstream about 10 min. before all of the rock throwing business started\". He described the screams as high pitched and approximately 4 to 5 seconds in duration. He could not determine what they were. At that point I was very interested and determined to go out there the next day and have a look around. It rained heavy that night and the next several days and flooded that whole area.  I went out there about two weeks later to look for any sign and came up empty. I'm sure he and/or his wife would talk to you about their experience. I can put you in touch with them if you like. He just don't care enough about what happened it to report it.  I wanted to go ahead and document it just in case someone else might have seen or heard something.",
  "classification": "Class B",
  "county": "Crawford",
  "state": "Indiana",
  "latitude": 38.4191,
  "longitude": -86.23506,
  "location": "-86.23506,38.4191",
  "location_details": "South of Hwy 150, on Blue River a few miles west of Fredricksburg, IN off of S. Sheppard road. I can drive there but I don't think I could give you adequate directions.",
  "temperature_high": 78.34,
  "temperature_mid": 72.935,
  "temperature_low": 67.53,
  "dew_point": 71.16,
  "humidity": 0.89,
  "cloud_cover": 0.44,
  "moon_phase": 0.84,
  "precip_intensity": 0.0219,
  "precip_probability": 0.91,
  "precip_type": "rain",
  "pressure": 1013.57,
  "summary": "Rain until evening.",
  "uv_index": 8,
  "visibility": 8.64,
  "wind_bearing": 187,
  "wind_speed": 4.17
}