{
  "id": "8597",
  "title": "Bigfoot crosses road in front of two teens going to school",
  "date": "2004-07-03",
  "timestamp": 1088812800,
  "observed": "My niece was living with us at the time of the sighting.  She was a senior in high school.  Our house is about 6 miles out of town and in 1987 when the incident occurred, it was very rural, though now it has become quite developed.  The school buses didn't go down the side roads so kids would have to walk to the closest main road.  We live not too far off the bus route.  The neighbor girl drove to school and she would often stop and give my niece a ride as she was walking to the bus stop.  On this particular morning she had just gotten in the neighbor's car when about 50 yards ahead, this creature came out of the swamp area on the right side of the road, paused in a crouching position, started crossing, then dashed very quickly across the road and into the woods.  She said she turned to the neighbor girl and said, \"What the hell was that?\"  To which the girl answered \"I don't know!\"  She says it was about the size of a bear, brown in color, but was definitely not a bear.  It started crossing the road walking like a gorilla (she even wondered if it could have been an orangutan or some kind of ape), then it ran the rest of the way very fast on all fours.  The whole incident happened so fast that she was not able to see much of the hands or feet.  She described it to me as being like an ape, but also sloth-like.  I said unless there had been an escaped primate from a traveling circus, we just don't have them in Washington.  She said it had hair covering its entire body and she noticed hair hanging from its arms.  She also heard from the swamp a whoop-whoop-whoop sound.  Thinking back she realizes that she had heard that sound coming from the swamp before, but thought it was some kind of bird.  It ran into an area of hundreds of wooded acres which eventually dip into the valley beyond (we are up on a plateau).  There is a ravine in the middle of this area.  To the right, past the swamp and as the crow flies there is Woods Creek about a mile or more away.  The deer pass by this area headed toward water at Woods Creek.  My niece said that she and the neighbor girl didn't say a word all the way to school and when they arrived she said again \"What WAS that?\" They both were dumbfounded.  She said it gave her the creeps and she felt scared.  We have talked about it on and off for years trying to think what it could have been.  A couple of weeks ago we sat down and I made a sketch while she guided me.  Actually she had to modify and finish it because I just could not figure out what she meant about how the head, chest and face looked.  When I saw her alterations I thought no wonder she was scared. ",
  "classification": "Class A",
  "county": "Snohomish",
  "state": "Washington",
  "latitude": 47.87725,
  "longitude": -121.8943,
  "location": "-121.8943,47.87725",
  "location_details": "off SR2 in Monroe,",
  "temperature_high": 67.52,
  "temperature_mid": 61.13,
  "temperature_low": 54.74,
  "dew_point": 53.76,
  "humidity": 0.8,
  "cloud_cover": 0.75,
  "moon_phase": 0.55,
  "precip_intensity": 0.0009,
  "precip_probability": 0.3,
  "precip_type": "rain",
  "pressure": 1018.77,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 8.35,
  "wind_bearing": 289,
  "wind_speed": 3.49
}