{
  "id": "10266",
  "title": "Witness sees unknown animal cross dirt road near New Mexico State Route 264",
  "date": "2002-09-17",
  "timestamp": 1032220800,
  "observed": "I work for (removed at request of witness). The headquarters dispatcher reported some customers were without water in the Rocksprings community. I responded and went up to the storage tank site which is located approximately 1 1/2 miles Northwest of the Sagebrush Bar. I checked the tank level and found them to be empty so I proceeded back towards Highway 264, the road to the tanksite is a dirt road. I was about 150 yards from the highway, the only light was from my unit's headlights shining straight down the road. My mind was traveling around the water system thinking about the scenarios that would be causing this water outage.About 20 yards from the truck I saw something walk out from behind a Juniper tree that is located on the west side of the dirt road. Right when it stepped out into the lights of the truck, it hesitated and it looked towards me,I stopped the truck at that moment. It then started to walk faster, picked up it's stride a little more. It took about 4 steps walking across that road, it did not cross the road in a straight manner, it crossed at an angle on the road and walked behind another Juniper tree that is located on the East side of the dirt road. I had stopped the truck as soon as it had stepped out onto the road, my visual contact time with what I now refer to as \"the Creature\" was about 15 seconds. I waited there to see if it would come back out or if I could see any type of movement, I did not see any. I sat there for awhile thinking,what did I just see ? My mind went through an elimination process, I thought, that was not a horse, a cow, a deer or an elk, 4 of the large animals that are prevalent in this area. The creature had a shiny brown hairy coat, it was approximately 7 feet tall, it's face was like a monkey's and the eyes were big and black, like a big teardrop shape. it's head was small and it came to a long point towards the back. The torso was skinny, narrow shoulders, the arms and legs were about 3to 4 inches in diameter, it had elbows and knees but I did not see any hands, fingers or a type of foot or toe structure. The hand and foot area were just rounded off, like nubbed. The only closest description would be like the way an amputee's arm or leg might look, rounded off.It took about 4 steps for it to cross the road,it's gait was long. I sat there about 30 seconds wondering if I should start driving forward towards the highway or turn around and use the other turnoff further west. Also at that time, a chill came over me and I hurriedly locked both doors, I did not even want to look out towared my side window because a fear had come aver me at that point. I just revved the engine and drove fast towards the highway. I drove fast down to the pumphouse and found the problem, it was a power outage to the wellsite. I had to go back to Ft. Defiance to pick up some fuses, I did not want to go back out to the area alone, so I had the dispatcher contact the Electric Line standby and I went back to the well along with him and  I got the well back in service. The next day, my co-worker and I went back to the site and found the footprints, he had a digital camera and he took some photos of the footprints. The footprints were about 4 to 5 ft apart, we tracked it to the East into the brush area. That night I went home and drew what I had seen and told my children of the incident.",
  "classification": "Class A",
  "county": "McKinley",
  "state": "New Mexico",
  "latitude": 35.63736,
  "longitude": -108.8676,
  "location": "-108.8676,35.63736",
  "location_details": "",
  "temperature_high": 76.09,
  "temperature_mid": 66.55,
  "temperature_low": 57.01,
  "dew_point": 39.83,
  "humidity": 0.43,
  "cloud_cover": 0.35,
  "moon_phase": 0.38,
  "precip_intensity": 0.0005,
  "precip_probability": 0.49,
  "precip_type": "rain",
  "pressure": 1006.58,
  "summary": "Partly cloudy in the morning and breezy until evening.",
  "uv_index": 8,
  "visibility": 9.85,
  "wind_bearing": 233,
  "wind_speed": 11.31
}