{
  "id": "28005",
  "title": "Two witnesses recount a close daytime encounter with a very curious creature near Lebanon",
  "date": "2010-07-16",
  "timestamp": 1279238400,
  "observed": "Yesterday,I ,my dad,my son,and his Friend, went up to our farm in Wilson County to do some bush hogging and prepare our deer stands for the up coming season..The kids asked if they could walk the logging road to see if they could see any deer or turkeys while me and my dad bush hogged the fields. About 20 minutes went by and I see my son and his friend running towards the tractor out of breath..\"Dad,i don't care if you believe me or not but what we just saw...I never want to see again!\"..His friend said she saw it first. This is the story they have repeatedly told me all afternoon yesterday and this morning- They were walking the logging Rd,and my son started hearing these loud crashes in front of them to the right coming towards them,He said he stopped and felt \"Very uneasy\" about going any further,to which he told his friend \"he wasn't going any farther and she could if she wanted\"..She walked around the bend of the road,come walking fast back to him  and says \"There was this thing looking at me behind a tree,swaying left to right,as if to see what she was..It leaned as if to be curious..So, She,not wanting to show it any harm by running or sudden  movement,afraid it would chase her,just turned and walked fast back to my son,and told him \"There is something huge and black standing around the corner\"...My son started walking with her and turned back to see if he could see anything and it had came around the corner and was staring at them..He said it was between 7-8ft tall,had blackish/brown,almost like a turkeys feather color when the sun is not shining on its feathers, and had HUGE muscles showing through the fur,he especially notice how broad the shoulders were and how muscular the arms were.At that time they started running as fast as they could until they got to the field i was cutting.. I eventually got in my truck and drove to the spot/area they said this all happened..The woods were a \"dead quiet\"..No Tracks were found,i did not smell any foul odor,as i have heard this animal has, plus a storm was approaching so i had to get back and put the tractor up. My son,who is sitting beside me as i type this,says \"I just don't feel it meant any harm,it was puzzled as why we were there.\" There were men cutting hay on the next farm over which had not been done in quite a while.There is no hunting,no more cattle,that place is not disturbed at all,so maybe it came from there?? What makes me believe even more is that my son LOVES hunting and that farm,but now says he is not coming up unless he has protection(Gun)and will not walk the place alone.Whatever this was or whatever happened to them has changed them.The friend,which said she doesn't believe in Bigfoot,now is a firm believer. My son's words-\"It wasn't scared of us,but we sure were of it!\"",
  "classification": "Class A",
  "county": "Wilson",
  "state": "Tennessee",
  "latitude": 36.25466,
  "longitude": -86.15759,
  "location": "-86.15759,36.25466",
  "location_details": "Rural Wilson County Tennessee",
  "temperature_high": 91.45,
  "temperature_mid": 82.19,
  "temperature_low": 72.93,
  "dew_point": 72.08,
  "humidity": 0.75,
  "cloud_cover": 0.27,
  "moon_phase": 0.18,
  "precip_intensity": 0.01,
  "precip_probability": 0.44,
  "precip_type": "rain",
  "pressure": 1015.57,
  "summary": "Rain in the evening.",
  "uv_index": 9,
  "visibility": 9.51,
  "wind_bearing": 206,
  "wind_speed": 2.47
}