{
  "reportId": "9568",
  "title": "Teen hears extremely loud vocalization along path near home",
  "date": "1982-09-15",
  "timestamp": 400896000,
  "observed": "I have always wondered about an encounter that I had when I was in eighth grade.  I just recently found your site and for the first time listened to some of the screams you have posted.  For the first time since that night I feel like I heard something similar to what happend that night. I had been out with friends.  We were out running around playing ding dong ditch and had finished with our mischief for the night.  It was probably around 10 or 10:30 and I needed to get home.  I had lived in the area for eight years or so and was very familiar with all of the back trails and ways to get around off of the main, albeit dirt, roads. The area I lived in was a resort carved out of a group of swampy lakes by a developer about twenty years before. It was fairly built up, but with large swaths of forest between many of the homes.  In addition, since many of the homes were used as weekend and summer cottages, the area was sparsly populated from the early fall until the spring. I walked home alone that night and at one point had to make a decision about whether or not to follow the road or go up a path that would cut about ten minutes off of my walk time.  I knew I was running late and cerfew was coming up soon, so I chose to go up the path which ran along a ridge to a low hill about two hundred yards from a swampy lagoon off of one of the main lakes.  I was pretty familiar with this pathway (now a full road ) because I would take it in the daytime with my bike and occasionally stop to pick wild strawberries that grew there in abundance. I vivdly remember stopping at the trailhead trying to see into the woods.  There was no moon and since this area was well away from any light source, it was pitch black.  For some reason I was a little jumpy about walking down the path tonight. I even remember walking about ten yards down the trail and walking back out for some reason.  I figured it wasa just bacuase it was so dark.  I figured I was just being jumpy unnecessarily and walked in. The path was about a quarter of a mile long and at the end ran down a steep hill.  My house was about two hundred yards from the end of the trail and just on the other side of the finger of the lagoon off of the lake.  About three quarters of the way into the trail I walked up on something, I am still not sure what since I could not see anything.  About twenty or thirty feet directly in front of me there was a very loud and piercing scream that made me jump completly out of my skin.  The scream was followed by a loud crashing as whatever it was ran down the hill through the woods towards the lake.  whatever it was covered the distance through the woods in only a couple of seconds and in a very few bounds.  Needless to say I did not stick around and tore off down the trail, down the hill and to my house as fast as I could. I to this day do not know what I encountered.  I still remember the scream and it sound very similar to the sound of a woman's scream.  It was very high piched and ver loud. I have told myself time and time againg that I just walked up on a deer, but the scream did not seem like anything that would have come from a deer.  I'd love your opinion on what it is I ran across.  I don't know what happend that night.",
  "classification": "Class B",
  "county": "Mecosta",
  "state": "Michigan",
  "latitude": 43.60667,
  "longitude": -85.27652,
  "location": "-85.27652,43.60667",
  "location_details": "If I had a map of the area I could show you exactly.  However, the area has changed dramatically since this happened and looks very little like the terrain I grew up around at the time.",
  "temperature_high": 61.18,
  "temperature_mid": 55.865,
  "temperature_low": 50.55,
  "dew_point": 55.33,
  "humidity": 0.91,
  "cloud_cover": 0.96,
  "moon_phase": 0.93,
  "precip_intensity": 0.0058,
  "precip_probability": 0.59,
  "precip_type": "rain",
  "pressure": 1019.03,
  "summary": "Light rain in the morning.",
  "uv_index": 3,
  "visibility": 6.13,
  "wind_bearing": 44,
  "wind_speed": 4.28
}