{
  "reportId": "23530",
  "title": "Man recalls childhood incident near Grayling",
  "date": "1973-05-01",
  "timestamp": 105062400,
  "observed": "The creature was not tall by any means probably in the low 6 foot range, I would compare to my current height of 6'1\".  The hair/fur was a rather rusty brown and wavy or matted. It didn’t look like a recently cleaned coat if you were to compare it to cleaning your dogs coat etc. It looked like it was unkept and even sort of dread-locked appearance hair. I do recall that some of the hair on the body was rather long about 10 inches and I could see it move as the creature walked away. It looked a lot like of the reggae/rhasta type hair styles but not completely covering the body but just various strands of it throughout (maybe shedding from winter??).  The creature had a rather glum face or expression, like a lonely old man who didn’t have any friends. I do recall its eyes sort of reminding my like that of an orangutang and sunken in.  It by far didn’t look evil, or mad in any way even though we were terrified. I think we may have woken it up and it was surprised and maybe a little irritated that it had to leave its comfortable seat next to the creek.  The hair around its head sort of drooped down on the sides. There didn’t seem to be much hair on its face but it did have some. The nose may have been flat. I don’t recall any details about the mouth or ears etc. Its possible it had a slight cone shape to its head but not drastic.  I don’t recall any smells or odors associated with it.  There really wasn’t a neck and when it moved its legs just seemed to float forward without any obvious effort. The animal appeared confident, agile and very graceful.  Once it disappeared into where-ever, I don’t have clear details into the rest of the moment.  I know we walked over to the site and I felt the tree where it was sitting and recall it was warm to the touch.  I think we looked around for tracks and there may have been some but it was so mucky and swampy it wasn’t clear, but I’m fairly certain we could at least see that the ground and brush was a little disturbed etc.  There was not a lot of vegetation between me and the creature as far as having part of my vision blocked. I could see the entire creature for the most part except for minor sticks and things in the way as it moved.  We more than likely hung out at the spot for sometime recalling what we saw as young kids do. I think back now though, that I don’t recall each of us sharing exactly what the other one saw because I think we each thought that we saw the same thing.  As far as arm size or length I don’t recall a big size comparison but I think they were a little longer than a humans. It seemed to walk with its arms to its side with maybe the forearms slightly facing out/forward like a jogger but its arms didn’t swing at all to my recall. I was totally aware of such a creature as Bigfoot back then, even through I don’t recall us saying it was “bigfoot”. I think I believed in this creature the moment I had seen the Patterson film in the early 70's maybe a few years before my sighting.  It just seemed real even through what I saw didn’t resemble that one very much. Its possible what I saw was rather old. It just had the sense that it was wise and old.  I don’t feel that my prior belief or viewing of the Patterson film caused in anyway to make up what I saw in any way or influence/convince me in seeing what I saw, since they were slightly different in appearance etc. There were other reports in and around N. Michigan the entire time I grew up there. In fact a year or two after my sighting there had been accounts in the local newspaper (Crawford Co. Avalanche) of strange sighting and incidents by members of the National Guard. I heard that about 40 people watched a creature on the artillery range with binoculars for awhile and that something was jumping on a tank and banging on the outside while there were soldiers inside.  They did not see what it was because it was nighttime but the story’s I remember is that it was being called the “tank-banger”.  There have been many numerous sighting in and around the Grayling area through the 70's. I had briefly mentioned my story to the other friend who was with me about a year ago just to see if he remembered it.  I think he was surprised that I did too and seemed to not have as vivid of a recall as I feel I have.  In fact he was unsure of what he saw and sort of felt it was a human. Anything is possible and I respect what he claims to have seen, but I have no doubt that what I saw was how I described it above.  I never felt at the time it was a human or a bear, it felt like something unknown to my mind and creepy. Since we never talked about details after our sighting, I just assumed they saw exactly what I saw and they felt the same about me, unfortunately we didn’t compare our stories the moment it happened. I don’t recall who my third friend was but I’m certain there was one other with us. Some of the minor details have faded since this is about 35 years ago but the appearance of the animal has always been clear to me.",
  "classification": "Class A",
  "county": "Crawford",
  "state": "Michigan",
  "latitude": 44.7,
  "longitude": -84.71,
  "location": "-84.71,44.7",
  "location_details": "You can reach the location by traveling N. from Main Street In Grayling, going past the hospitol and elementary school and proceeding north down Roberts Road. Just past West Dr. about a 150 yards, turn west (left) into swampy cedar swamp. There is a small creek crossing the road, follow this creek upstream approx. 150 yards or about 5 minute walk.",
  "temperature_high": 56.34,
  "temperature_mid": 52.975,
  "temperature_low": 49.61,
  "dew_point": 46.84,
  "humidity": 0.9,
  "cloud_cover": 0.96,
  "moon_phase": 0.95,
  "precip_intensity": 0.0177,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1011.94,
  "summary": "Rain in the morning and afternoon.",
  "uv_index": 5,
  "visibility": 3.64,
  "wind_bearing": 121,
  "wind_speed": 5.11
}