{
  "reportId": "179",
  "title": "Man and witnesses have two seperate sighting, 1st while fishing, 2nd while driving",
  "date": "1981-09-15",
  "timestamp": 369360000,
  "observed": "1981--My first encounter (Sept.): My girlfriend, her father and I were parked on the bank of the Chattahoochee river.  My girlfriend's father was sitting on the hood of the car with his fishing pole in front of him.  He was night cat-fishing.  While we sat there, with the car lights shining across the river, my girlfriend and I were sitting in the front seat just making small-talk (honest), when all of a sudden I heard the most horribly incredible scream coming from my right side.  To set the scene:  Our car was parked about two feet from the water, on the bank.  Off to my right about 60 feet was where the foliage began. Very swampy, very thick, and very hard to walk through.  About 40 feet further up the bank (which can't be seen from our car because of the foliage) is a huge oak tree.  I'd have to guess that the tree had about a 15 foot circumference - massive!  About 10 feet up the tree is a huge branch that went about 20 feet out over the river.  My friends and I would climb the tree and jump/dive into the river at least once every couple of weeks or so.  During one occasion, there were about 9 of us standing on this branch attempting to make it move - we barely made it do anything, let alone shake! Anyway, back to the car. As I heard the scream, my body instantly went into what I think was shock.  As I turned to my right s.l.o.w.l.y.. with all my hair standing straight-up, we heard the next sound~~~>  a chuuu..chuuu..chuuu..chuuuuuuu... (my feeble attempt to describe the sound of that huge branch I mentioned earlier that was shaking due to something GIGANTIC jumping off it into the water.  The splash that came next was equally as horrific.  All we did was just sit there in shock...waiting (I don't know why), staring at this point - straight ahead at the water.  My guess is that we were waiting for the thing to float into our headlights. We waited and waited and waited and all of a sudden an object - black - long - I would guess at least 9-10 feet, floated into our headlights and stopped. Please keep in mind that this action was deliberate, because it was floating downstream.  We stared at it forever it seemed.until it opened it's eyes - two huge balls of red (reflecting off the headlights of our car I imagine) light and looked at us.  My girlfriend's father at this point put the car into reverse, and we sped off.. extremely terrified. 1982--My second encounter (April): My girfriend and I were driving back from our senior prom (Georgia - chattahoochee river border area).  Our high school was 37 miles down-river \"way-out\" in the boon docks.   Anyway, as we were driving back home, we came to a flat 2-mile section of road that had a \"slippery-when-wet\" sign. Because we were tired, \"sober\", with road-hypnosis, the sign reflection caught our attention (she told me after).   As we came closer to the sign, something moved or reflected as we came closer - getting our attention. About 100 feet away, with our car lights fully shining on the it, we saw this massive, black creature leaning on the sign.  The top of the sign I guessed to be about 10 feet.  Whatever this creature was, all we could see was the top of the chest and down (about 10' of the creature!) we couldn't see the head.  It just stood there - we could see the massive muscles - most in rippling detail, shiny-black fur, standing with intelligence if you can understand that term, etc.  We sped-up all the while screaming at each other - scared to death.  A mile down the road, my left-rear tire blew out.  I drove 7 miles to the first house with a light and called my father to come out and help us.  While at this home, we talked with a few of the people that were there (they were having a party).  We were told a couple of stories about a missing hunter, animals found gutted or with their head missing.  A lot of strange screams in the night, etc.  First, I must say beyond a shadow of any doubt that this was no hoax - the costume alone would have cost thousands and thousands of dollars to create.  Second, the people that live in the area are extremely poor.  As a matter of fact, the home that we drove-up to after our tire blew, had light seeping through the cracks in the siding of the house, while it sat on cinder blocks - very poor people!",
  "classification": "Class A",
  "county": "Russell",
  "state": "Alabama",
  "latitude": 32.31435,
  "longitude": -85.16235,
  "location": "-85.16235,32.31435",
  "location_details": "1981--Bank of the Chattahoochee River 1982--Highway 431N.  Roughly, the sighting occurred at Michael Tigner Dr., about 3-4 miles North of Seale, AL.  Shouldn't be too hard to find, since it was the only \"yield\" or \"slippery when wet\" sign on the right-hand side (heading North)",
  "temperature_high": 87.17,
  "temperature_mid": 78.66,
  "temperature_low": 70.15,
  "dew_point": 70.72,
  "humidity": 0.89,
  "cloud_cover": 0.72,
  "moon_phase": 0.55,
  "precip_intensity": 0.0341,
  "precip_probability": 0.79,
  "precip_type": "rain",
  "pressure": 1013.79,
  "summary": "Heavy rain in the afternoon.",
  "uv_index": 6,
  "visibility": 5.63,
  "wind_bearing": 214,
  "wind_speed": 2.73
}