{
  "reportId": "17458",
  "title": "Hikers describe possible stalking and vocalizations the John Muir Wilderness",
  "date": "2006-07-14",
  "timestamp": 1152835200,
  "observed": "I would like to start with my background as a backpacker and hunter.  I go to the Sierra Nevada Mountains about 1 and a half hours outside of Fresno, California.  Last summer around the time of the sighting, I made about 11 trips to numerous places. This is what I do.  I feel I have a good knowledge of the outdoors, and I have becomes quite at home in the wilderness. On Friday, July 14, 2006 my friends, Jason and one other person who has asked me to exclude his name from this report, started out on a backpacking trip to Hobler Lake in the John Muir Wilderness. We started off our hike a little late in the day, about 5:00 pm, on the Maxsom trailhead, just on the east side of Courtright Reservoir. We were hiking for about an hour, this being about 6:00 pm in the day.  It was dusk when we noticed something moving parallel to us in the woods.  It was hard to make out what it was because of the terrain consisting of dense wooded areas with evergreen trees.  It had a reddish brown color, and in the distance you could tell it was much bigger than a person was.  We assumed it was a black bear so we moved on. Whatever it was seemed quite interested in us.  Every time we stopped, it would stop moving as well.  This continued for about an hour until it got too dark to see clearly without a flashlight. We continued hiking to our destination for a while when I started hearing a crackling of branches to my left about 50 feet behind me, maybe less.  When I turned around, I saw a black outline of something looking at me from behind a tree.  I froze for a second because I was in such shock over what I was seeing.  Out of all the animals I’ve seen at night in the mountains, this had no resemblance.  It was standing on two legs, was about 7 and one half feet tall, and was 4 feet wide at the shoulders.  It had hardly no neck, and very long arms that hung down by its mid legs.  It also had a fluffy appearance like it had a thick long coat of fur. Then I whispered to my friend Jason to shine a flashlight on it.  As I said that, this thing must have heard me, because it turned around and started walking off somewhat fast.  At this time we decided to load our firearms, which weren’t much because all we had was a 40 caliber pistol and a 22 pistol.  For a time, whatever it was seemed to have left the area. We arrived at Hobler Lake around 10:00 pm.  We set up our camp, cooked some food, and rested for a bit.  I finally fell asleep about 11:30 pm, but Jason and my other friend stayed up. When I awoke in the morning, Jason told me that he and bob were by the lake having a cigarette when they heard large objects crashing in the water about 100 yards from them.  He described it a like something very large was jumping and thrashing in the water. The next day we were staying close to camp because of all that went on.  We walked about away from camp to explore the area when we heard noise from camp like the clinking of pots and stuff.  We ran back to camp to find nothing out of place, but when looked closer some things were slightly moved, but not very far away from where we left them.",
  "classification": "Class B",
  "county": "Fresno",
  "state": "California",
  "latitude": 37.1303,
  "longitude": -118.9386,
  "location": "-118.9386,37.1303",
  "location_details": "You take Highway 168 east out of Fresno to Shaver Lake.  In Shaver Lake, make a right on Dinkey Creek Road and follow the signs to the Courtright Reservoir.  Go across the dam to the camping area.  That’s where the 4x4 trail begins.  Take the 4x4 trail for like half a mile until you reach the trailhead on the right.  That will lead you to Hobler Lake.",
  "temperature_high": 100.34,
  "temperature_mid": 83.42,
  "temperature_low": 66.5,
  "dew_point": 51.19,
  "humidity": 0.36,
  "cloud_cover": 0.01,
  "moon_phase": 0.63,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1012.64,
  "summary": "Clear throughout the day.",
  "uv_index": 15,
  "visibility": 9.48,
  "wind_bearing": 288,
  "wind_speed": 2.22
}