{
  "reportId": "596",
  "title": "",
  "date": "",
  "observed": "On Thursday, 10-30-98, at about 1230 hours, I arrived at the Yolla Bolla District Ranger Office of the Trinity National Forest.  I had planned a solo five-day backpacking trip to the area of  Post Mountain and Mud Springs (40 DEG 20' 00\" North 123 DEG 13'  00\"; West) within the Trinity National Forest. I had just relocated to California from Hawaii and was eager to get back into the forest.  I had seen a sensationalized Bigfoot story on a local Sacramento TV station, about a group of hunters that had an encounter within the Trinity National Forest, near a landmark called Mud Springs.  I grew up in Northern California and the Pacific Northwest, so I knew of Sasquatch while growing up, and was always interested in the phenomenon. I planned my trip carefully: because of the time of year (Fall), my relative unfamiliarity with the region, and because I was making the trip solo.  Solo backpacking trips need to have a carefully laid itinerary in case of problems: so rescuers have a means of finding you. ARRIVAL AT RANGER STATION When I arrived at the ranger station, I was pleasantly greeted by the staff, signed into the visitors log and provided them with a copy of itinerary and emergency contact information.  Being a former police officer, the conversation between the rangers and I was very relaxed - we talked shop for a while.  When they noted my destination on the itinerary, the rangers asked if I was going into the area in response to the Bigfoot sighting.  I told them I was interested in what was seen, and asked for their opinion of the sighting.  All four of the rangers stated that Bigfoot was just as real as the bears, deer and cougar within the park.  Two of the rangers said they had been up to the location and found a set of tracks.  They also stated that finding tracks, is not all that uncommon, and that there have been casts of the tracks made in the past. CHANGE OF PLANS & WRONG MUD SPRINGS I then learned that many there are two locations within the park called Mud Springs, and that my itinerary was for the wrong location!  The rangers told me that many visitors were going to the wrong location, and that they had not corrected them. I laid down my map, and the rangers helped me plan a new itinerary for my trip.  To the correct Mud Springs (40 DEG 21' 30\" North / 123 DEG 08' 30\"; West) on South Dubakella Mountain. The plan was now to spend the night in the hunter's camp, and leave my vehicle there.  The next day I would set out on foot.  It was already too late in the day to set out.  I would never make it to the second camp, before nightfall, and trying to find a safe place to camp in the dark is not smart. ARRIVAL AT MUD SPRINGS I arrived at the Mud Springs campsite, on 10-30-1998, at about 1400 hours.  The site had obviously been used by hunters.  There was a 4\"diameter wood pole lashed between two trees at a height of about 7-8'.  It was obviously used to suspend the deer for gutting and skinning.  There was a large fire ring that had recently been used, and the normal debris that idiots leave at campsites: burnt tin cans, nylon cord, etc.. THE SPRING After setting up my tent, and gathering wood for a fire, I walked over to the spring that was about 30-40 yards away.  I was very impressed by the amount of water that was trickling from the spring, and by the abundance of animal prints, droppings and scat.  This is obviously the main watering hole in the area. Early autumn is typically the driest time of year.  Streams, creeks, rivers and lakes are at their lowest levels.  The water from this spring only flows down from it's source about 50 yards before disappearing into dry sand and rocks. My impression was that if all the other animals come here to drink so does Biggie.  And with the hunter's campsite so close to the spring, that may be why Biggie was displaying such aggressiveness.  That spring might serve as both his hunting ground and his water supply.  Both of which are valuable to a nomadic creature. THE ENVIRONMENT The whole area was extremely quiet, even in late afternoon/dusk when many animals begin to venture out.  I saw only two ravens and a couple blue jays, the entire time I was there.  No squirrels, no deer, and no noise. As many of you know, the forest has solitude but is far from silent. BEDTIME I had made a small fire that evening.  I do not normally make a fire when backpacking, but because I had a fire ring available, a plentiful supply of deadwood and it had been years since my last trip, I decide to enjoy one. I turned in at about 2150 hours, and was asleep within minutes. AWAKENED BY SNAPPING BRANCH At about 2230 hours/10-30-1998, I was awakened by the sound of a large snapping branch.  It was not a branch falling, and the branch gave a cracking noise that made it sound like it was a thick branch.  Even though my eyes snapped open with the sound, I just laid in my sleeping bag listening.  I didn't move. Then with my head close to the ground resting on my ground pad, I heard it.  Not the clop of hooves or the padding of paws, but the dull, vibrating thud of footsteps!  I nearly defecated in my sleeping bag.  I was keenly aware of what I was hearing, and I could feel the adrenaline in my veins. The footsteps where to the northeast of my tent, when first detected.  My hearing was trained in that direction because that is the same direction I heard the branch snap too.  I estimated them to be 10 to twenty feet away, judging from the vibration and sound.  Two more steps and the thing making them, was in front of my tent, about 5-10 feet away. Then the footsteps faded to the southwest with two more footsteps. I was laying there scared to death, thinking about what I was going to do, when all of a sudden, my pots down at the kitchen moved and clanged together!  I was not imagining anything now, and knew it was not a dream!  I grabbed my headlamp and illuminated my tent, trying to drive off my visitor. After I waited about two minutes, I looked out my tent and saw nothing.  I pulled on my boots and walked to my kitchen area.  There I found my nested cookware pots unnested, and spread out.  What ever unnested those pots had thumbs! GONE WITH THE WIND That was all the evidence needed to convince a former policeman and combat hardened Marine that he was out of his element at the moment.  I had only been chased out of a campsite once before, and that was by a mama grizzly and her cubs in the Silver Skagit Valley of Washington State.  This was far more terrifying. A HAIR IS FOUND The pots and pans were sitting next to my backpack.  I left it outside the tent near the kitchen, and bear-bagged my food in a tree about 50 yards away to prevent bears from coming into my camp.  The backpack was brand new, and did not have any food odor in it.  And since there were no squirrels or evidence of rodents, I just left it on the ground propped against a log in the kitchen area.  The pots were about 2 feet away from the backpack. After dropping my tent, and rolling up my sleeping bag, I went to put them in the lower portion of my backpack.  When I reached for the Velcro closure there was a big hair stuck to the Velcro! The hair, which is in my hands now, as I write this, is approximately 5.5 inches long, from root to tip and dark brown in color.  As you get closer to the tip of the hair, the color changes to reddish/orange.  It is somewhat course in appearance, about 3 times the diameter of a human hair. I collected the hair and placed it in a Ziploc bag. HEADED BACK TO RED BLUFF I threw everything in my Ford Explorer and drove all the way to Red Bluff, before I finally calmed down.  It is not something I will ever forget.",
  "classification": "Class B",
  "county": "Trinity",
  "state": "California",
  "location_details": "Mud Springs: a hunters campsite with a freshwater spring, near the intersections of USFS roads 29N73 and 29N32 and 29N48 (they all meet)... (40 DEG 21' 30\" North / 123 DEG 08' 30\" West) on South Dubakella Mountain.",
  "summary": ""
}