{
  "id": "3467",
  "title": "Witnesses describe 'huge' black creature that throws dirt at them near Chittyville.",
  "date": "1968-08-15",
  "timestamp": -43545600,
  "observed": "(#1) late July - early August 1968 (#2) 11 August 1968, 8:30 P.M. (#3) 12 - 18 August 1968 (#1) Residents in the area reported dogs barking louding and \"carrying on\" at night. (#2) Tim Bullock, 22, of West Frankfort, and his girlfriend, Barbara Smith, 17, of Carterville, sighted a \"creature\" while riding northeast of Chittyville.  Bullock reported the creature threw dirt at them through the window.  Smith saw it and started screaming.  She described it as \"huge\" -  about 10 feet tall, with a head as large as a steering wheel.  It appeared to be black, with a round \"hairy\" face.  They left the area and reported the incident to police.  Bullock returned the next day and found a depression in the grass, as if a large animal had rested or slept there. (#3) Bullock said a carhop at a Herrin drive-in restaurant told him that someone came into the drive-in \"hysterical\" and said they had seen the creature.  One other person reported they saw \"it\" near Rt. 148.",
  "classification": "Class C",
  "county": "Williamson",
  "state": "Illinois",
  "latitude": 37.846,
  "longitude": -89.0111,
  "location": "-89.0111,37.846",
  "location_details": "Williamson County, Illinois.  Woods northeast of Chittyville, Illinois, which itself is an unincorporated area north of Herrin.  One sighting in the area specifically mentioned \"near\" Route 148 which runs due north from Herrin to Chittyville, and then off to the northwest from Chittyville.",
  "temperature_high": 85.24,
  "temperature_mid": 79.12,
  "temperature_low": 73,
  "dew_point": 73.02,
  "humidity": 0.86,
  "cloud_cover": 0.73,
  "moon_phase": 0.74,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.35,
  "summary": "Humid and mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 6.48,
  "wind_bearing": 190,
  "wind_speed": 7.19
}