{
  "reportId": "1090",
  "title": "Girl has daytime sighting near Twain Harte",
  "date": "1978-08-01",
  "timestamp": 270777600,
  "observed": "Around the age of 12 or 13 (I'm 34 now) I went with my parents to Sugerpine Campground in the Sonora/Twain Harte area in California.  We were there for two weeks in our 21' travel trailer, and I was completely bored out of my mind!  I also had just started menstruating for the first time while we were in the middle of our trip  (mentioning this seems weird, but will make sense later). At the campground I met a little girl, a few years younger.  She had been living there with her parents who were without a home.  She showed me a trail that went way out into the woods where there was a small stream (only a few feet wide) with a big rock.  If you climbed up on top of the big rock, there was a tree branch that you could grab onto and swing over the stream.  We played there for a good while and returned to the campground when it started getting dark.  The next day I looked for my friend, but she had apparently moved on with her family - her campsite was empty.  I figured I'd go back out to the stream and play for awhile since I had nothing better to do.  The stream and rock area was a little further than a city block out into the dense forest.  The whole trail was shaded since the pines were so thick.  I merrily went out into the woods, with absolutely no hesitation, looking forward to some fun.  When I got within about 5' to 6' from the big rock I had the strange feeling someone was watching me. The hair on the back of my neck stood up a bit. I still was not afraid and began looking around me (thinking maybe my friend was out there playing somewhere close by and hadn't left as I had thought).  I looked in front of me and slowly turned counter-clockwise peering into the dense woods.  I continued turning until I was looking directly down the small footpath I just walked to the rock.  As I looked at the pathway, I noticed a very large pine tree that was edging the path had a funny looking \"arm thing\" wrapped around it's middle.  I looked - still not afraid - and was trying to figure out what the heck it was; I could make out long fingers and very dark furry brown hair covering the entire \"arm\".  I thought to myself \"that's not a branch, and it's not a bear's paw, it sure looks like a HAND!\"  Now, this tree was approximately 15' from where I was standing, and DIRECTLY next to the pathway I had just come from.  As I continued to look at the \"arm\" - still not afraid since in my own mind I kept thinking it couldn't POSSIBLY be an arm even though it sure looked exactly like one...I saw a face peek out from the opposite side of the tree and look at me.  It was a very flat face, very dark brown - couldn't make out any features except the eyes, which were looking right at me!  Let me tell you, I was never very athletic, but as soon as we made eye contact I don't think my feet touched the ground!  Worse yet, I had to run right BY IT to get the heck outta there!  I FLEW back to camp and ran into the trailer.  I didn't tell my mom or dad about it since I thought they'd think I was crazy.  Needless to say, I stayed in that trailer for the rest of our vacation at Sugarpine. When I mention I started my period for the first time, I believe animals have an uncanny ability to sense and smell those types of things, maybe it caught wind of me and decided to follow and check me out.  The creature was hunched over a bit, so it's hard to tell exactly how tall it was, or if it was a juvenile.  I do know that the pine tree it had it's arm wrapped around was around 4' wide in circumference - which makes it a pretty long arm!  Another thing to mention is that I don't remember smelling anything.",
  "classification": "Class A",
  "county": "Tuolumne",
  "state": "California",
  "latitude": 38.06615,
  "longitude": -120.1877,
  "location": "-120.1877,38.06615",
  "location_details": "The campground has grown quite a bit since 1978-79.  I went back to check out the area a few months ago and was surprised to see how much it had changed.  It is now more like a mobile home park towards the back where we had camped.  The homes are very close together and I could not see a way without trespassing to get back to the area where I had entered the forest.",
  "temperature_high": 95.49,
  "temperature_mid": 77.735,
  "temperature_low": 59.98,
  "dew_point": 53.96,
  "humidity": 0.42,
  "cloud_cover": 0.02,
  "moon_phase": 0.93,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1008.71,
  "summary": "Clear throughout the day.",
  "uv_index": 12,
  "visibility": 9.81,
  "wind_bearing": 235,
  "wind_speed": 4.11
}