{
  "id": "23822",
  "title": "ATV riders descibe dusk encounter in the Monte Cristo Range",
  "date": "1999-09-20",
  "timestamp": 937785600,
  "observed": "It was late September 1999, my seven year old son and I were working in the mountains above Huntsville Utah. We were working on a cabin site doing the excavation. We were camping on site so we would not have to commute for two hours each way. We camped there for seven days. On the fifth day we finished working and decided to go for a ride on the four wheeler. It was about an hour before sunset as we began our journey. We rode for a while until we decided to start our way back to camp.  We turned around in what seemed to be an old camp site just off of the road. The sun had fallen out of site behind the mountains as the shadows blended together. It was turning to dusk. We made the turn and started to move back onto the road when my son tapped me on the shoulder and told me to go faster. I turned to look at what he saw and could not believe my eyes. There about fifty feet or so away was a large upright creature casually strolling in a parallel line with us. He was about seven or eight feet tall with a stride that I cannot forget. He moved smoothly along an old fence line where he turned into the woods and disappeared. He was dark in color and didn't seem to be coming after us. My biggest regret is that out of panic I took off as fast as I could and didnt turn towards him for a better look. We got back to camp about five miles down the mountain where we built a large fire and spent a sleepless night thinking about our encounter.",
  "classification": "Class A",
  "county": "Cache",
  "state": "Utah",
  "latitude": 41.5343,
  "longitude": -111.5281,
  "location": "-111.5281,41.5343",
  "location_details": "",
  "temperature_high": 73.61,
  "temperature_mid": 58.165,
  "temperature_low": 42.72,
  "dew_point": 41.73,
  "humidity": 0.62,
  "cloud_cover": 0.22,
  "moon_phase": 0.34,
  "precip_intensity": 0.0058,
  "precip_probability": 0.61,
  "precip_type": "rain",
  "pressure": 1019.85,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 6,
  "visibility": 9.43,
  "wind_bearing": 117,
  "wind_speed": 2.77
}