{
  "reportId": "26577",
  "title": "Brief daylight sighting of a small primate type creature in a pine forest near Jacksonville",
  "date": "2009-06-18",
  "timestamp": 1245283200,
  "observed": "Right on the northwest corner of New World Ave. and Normandy Blvd. FSCJ owns approx. 135 acres. When things are slow I take our electric golf cart thru the woods just to look around and maybe spot wildlife as I go. Between the college and the city pool which is west of the college are numerous ponds, wetlands, and pine tree flats on forestry land. There are also alot of training areas left over from the Navy days and a few old roads that are similiar to power line right aways running mostly north and south. Now to the day in question: We were allowing a contractor to drive thru our property to gain access to the forestry land and I went to talk to them to get an update on the project. It turned out they were not working that day so I was riding around just looking for wildlife. I came up to one of the old roads and when I looked north on the road there was something in the road sitting on it's hunches and it appeared to have one arm in the air and the other was scratching it's side. I was traveling kind of fast and could not stop until I was about 10 feet past the road. I put the cart in reverse to back up and it was not in the road any longer. I looked just past the spot where it was in the road and it was on the side of the road and was bending down a limb from a 4 or 5 foot pine tree peering out at me. This lasted for maybe 3 or 4 seconds and it ran in from what I could tell was an upright position. The small pines hindered my view when it was running but I am fairly positive it was running up right. What ever it was, was about 2 maybe 3 foot tall judging by the trees and was very black and resembled a primate. I worked at the Jax Zoo in maintenance for a few years and one of the exhibits I was responsible for was the Great Apes so I am very familiar with several different primates and it reminded me very much of a bonobo. I was fairly shaken up and I did not go look for tracks, signs, or anything. Now to present, a few weeks ago forestry had a timber company thinning the pines in the same area, I went back there to talk to the job foreman as they were using our property to gain access. They were two or three hundred yards back in the woods and I did not want to drive my cart back there because of the road. I got maybe thirty yards off the road down the skidder trail and I am not sure what it was but the hair on my neck stood straight. I had a strong sense something was out there watching me. It may have been my imagination but I really believe I was being watched.",
  "classification": "Class B",
  "county": "Duval",
  "state": "Florida",
  "latitude": 30.25389,
  "longitude": -81.8992,
  "location": "-81.8992,30.25389",
  "location_details": "This is a close military base in an area rumored to have held nuclear arms.",
  "temperature_high": 84.01,
  "temperature_mid": 78.09,
  "temperature_low": 72.17,
  "dew_point": 73.68,
  "humidity": 0.87,
  "cloud_cover": 0.38,
  "moon_phase": 0.85,
  "precip_intensity": 0.0106,
  "precip_probability": 0.72,
  "precip_type": "rain",
  "pressure": 1016.38,
  "summary": "Rain until afternoon.",
  "uv_index": 8,
  "visibility": 6.72,
  "wind_bearing": 230,
  "wind_speed": 2.33
}