{
  "reportId": "8183",
  "title": "",
  "date": "",
  "observed": "I grew up on the mountain along the Eel river (Kings Range) I can not tell you the exact year that I had this sighting not sure if I was 11 or 12. That would of put it at 62 thru 64. I was below our house and used to go down to the spring and just hang out out. I got halfway down and looked across and there was this big ape in my mind looking at me. It is still so clear that moment. I do know that I left first and I never said a word to anyone what I saw. Our house burned down in 67 or 68 and we moved to Eureka. When my sister and I became adults I told her what I saw that day and she started crying she had experined the same thing only she was down at the spring and he was above her on the log. I moved back to the home place the spring of 1972 and everything was fine. I lived there with my son and at that time whoever needed a place. That Fall everyone pretty much left and as the nightly custom I would build a fire and my son and I would sit around it and eat. We had no electricity or anything. That hillside always rang with birdsong  never a quiet moment. That night there was silence and a wierd feeling came over me like eyes were watching . I grabbed my son and a few clothes and we hiked down to the nearest house. I never went back there to live it scared me that bad. There is alot more stories I could tell you about this mountain but I will leave that for later. I know what I saw that day and I know the feelings that I had years later. I would like to say that this was 40 acres that I grew up on and always felt safe after that night I left I never got that feeling back again something changed. The birds never sang like before either.  I would like to say I sent this account to Bobbie Short 2 years ago but asked not to have it published . The only reason I'm writting it now is because of the 2 other accounts that I read.",
  "classification": "Class A",
  "county": "Humboldt",
  "state": "California",
  "location_details": "First Salmon Creek turnoff coming from Myers Flat. Go down Salmon Creek Rd. First dirt rd. going up the hill to the right is where I grew up . Stay on the county rd. and you will come to a real tight curve. at that curve there is a spring coming off the hill. If you hiked up that hill not far you would come to a burnt out Redwood laying across bank to bank. Looking up the hill to your left there would be a big stump and at one time my brothers playhouse. That is where I had my sighting. I never knew until my sister and I were both adults that she had aa sighting in the exact location only he was standing on the log.",
  "summary": ""
}