{
  "id": "15767",
  "title": "Possible vocalizations and stalking south of Bardstown.",
  "date": "2006-07-12",
  "timestamp": 1152662400,
  "observed": "It was in July 2006.  Not sure what day.  About 9:30PM.  I was walking from my garage to the house when I heard a terrible screaming in the holler at the back of our property.  I heard it again about 30 seconds later.  I have heard coyotes several times but this sound was like nothing I've ever heard.  It sent chills down my spine.  I mentioned it to my son a few days ago and he said \"you've heard that too?\"  I asked him when he heard it and he said about 3 weeks ago.  He too was walking from the garage to the house around 9:30 or 10 at night and heard a terrible screaming from the same location.  He's a very skepticle person and never thought to mention it until I did.  I remember being at the back of my property in this location in the winter of 1989 burning some brush.  I sat down and then heard a loud grunting sound about 20 feet behind me.  I thought it was probably a buck but I never saw anything and nothing ran away like a deer would have.  Also in the summer of 1988 my wife and I went to the back of the property at night just to do a little exploring.  We had just moved there and were curious what it would look like at night.  We heard something moving in the cedar trees.  It spooked us and we went back to the house.  What ever it was followed us parallel on the path in the cedars.  We never actually saw what it was.",
  "classification": "Class B",
  "county": "Nelson",
  "state": "Kentucky",
  "latitude": 37.689,
  "longitude": -85.359,
  "location": "-85.359,37.689",
  "location_details": "[Location details removed from submission at the request of the witness.]",
  "temperature_high": 80.41,
  "temperature_mid": 76.575,
  "temperature_low": 72.74,
  "dew_point": 70.84,
  "humidity": 0.82,
  "cloud_cover": 0.55,
  "moon_phase": 0.55,
  "precip_intensity": 0.0144,
  "precip_probability": 0.57,
  "precip_type": "rain",
  "pressure": 1016.89,
  "summary": "Rain starting in the afternoon, continuing until evening.",
  "uv_index": 7,
  "visibility": 7.03,
  "wind_bearing": 210,
  "wind_speed": 5.9
}