{
  "reportId": "7439",
  "title": "Fisherman observes large rock flung into Hamma Hamma River",
  "date": "1978-07-15",
  "timestamp": 269308800,
  "observed": "The following incident may be of limited if any value because of the length of time that has elapsed since it occurred.  At the time I was about 32 years of age and had heard of sasquatch or bigfoot but had never had any thoughts about them. A co-worker (Don W.) and myself had been performing some work for the National Park Service in the State of Washington during the summer of 1978 or 1979.  We had made other trips to the region prior this this trip, but this trip will always stand out in my mind. On a weekend outing Don and I had decided to do some trout fishing on the Olympic Peninsula.  A Seattle motel owner suggested we try fishing the Hamma Hamma River as it did not get the fishing pressure or the commercial gill netting pressures more common on the famous streams that empty on the west side of the pennsula.  Following his suggestion, we came to a tiny picnic area and unloaded our gear.  Don went downstream and I headed upstream.  By mid-afternoon I was perhaps a mile upstream and had caught several trout.  I was totally alone and concentrating on fishing when out of the corner of my right eye I noticed movement about 10 feet in the air, followed by a tremendous splash about 30 feet to my right in the stream.  Shocked, I found myself looking at very large boulder close to 3 feet long and maybe 2.5 feet thick that wasn't there a few moments before.  I turned around thinking it had rolled off a steep bank, but I was nowhere near anything it could have rolled off of, as I was fishing in a meadow-like area.  At that moment I had a very uneasy feeling come over me, and a feeling that I was not alone.  About 30 feet behind me quantities of tall dead grass filled the bank, and I remember not wanting to look to closely.  I grabbed my fish and headed back to the car at a pretty quick pace. I did not see anything, nor did I smell anything.  I distinctly remember not wanting to see anything that could throw a 300 pound rock over 30 feet. When I arrived back at the car, Don had already arrived ahead of me and I told him what happened.  He laughed and made a wise crack about it, and said let's eat some of these fish.  We made a fire in the stove provided at the campsite, ate our fish and left.  That's about all there is to say concerning the incident.  Over the years, I've often thought about what happened and I still can't come up with any possible way that boulder could have landed where it did, without someone or something throwing it.  I've never seen anyone powerful enough to pickup a boulder that size let alone throw it a considerable distance.  I also regret not having the nerve to investigate the area a little more, but I felt very vulnerable at that moment in time.",
  "classification": "Class B",
  "county": "Mason",
  "state": "Washington",
  "latitude": 47.5958,
  "longitude": -123.1208,
  "location": "-123.1208,47.5958",
  "location_details": "The incident occurred so many years ago, I'm sorry but I just can't remember the exact path of travel we used to get there.  I recall a simple unimproved road to the campsite where we unloaded the vehicle.  Where the incident actually happened should not be too difficult to locate however, as it was along the Hamma Hamma River, which is not very long.",
  "temperature_high": 66.87,
  "temperature_mid": 61.1,
  "temperature_low": 55.33,
  "dew_point": 55.12,
  "humidity": 0.76,
  "cloud_cover": 0.68,
  "moon_phase": 0.34,
  "precip_intensity": 0.0029,
  "precip_probability": 0.47,
  "precip_type": "rain",
  "pressure": 1016.47,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 9.19,
  "wind_bearing": 244,
  "wind_speed": 3.21
}