{
  "reportId": "77",
  "title": "Couple hear vocalizations while camping at Milk Lake",
  "date": "1983-09-01",
  "timestamp": 431222400,
  "observed": "We had driven into Milk pond, up Chinook pass, about 30 miles from Yakima, Washington. We were headed to Milk Lake, thats up about 5-7 miles above the pond, we got into the spot late, so we just drove past the pond and found a small area we could part our truck and cabover camper. We ate a quick dinner, and went to bed, we never walked around or made any noise, so I don't think they evey knew we were there. You couldn't see our truck from the pond. In the middle of the night, The frogs from the pond stopped croking, and this loud whistling and clicking noise started, I asked my Husband what it was, and he said he thought it was a Bigfoot. It went on for about 15 min. Then stopped. The next morning I walk all around the pound, hope to see a foot print but didn't. We then went up the hill to the lake. No other people were aound, and while we were fishing we heard the strangest thing, it sounded like someone picked up a 55 gallon metel drum and threw it on the ground, I went in the direction of the noise, but could see or hear anything, but we had thet feeling of being watched. very creapy. So we left. Keep up the good work, i think they are very interesting, would like to meet one, and give them a bag to carry thing in, I think they would like that. Dyann",
  "classification": "Class B",
  "county": "Kittitas",
  "state": "Washington",
  "latitude": 46.98333,
  "longitude": -121.0922,
  "location": "-121.0922,46.98333",
  "location_details": "I haven't been there in years, but an area map would have Milk Lake on it, and the pond is on the way up to it, they clear cut the area, about the time we stopped going there, wasn't as pretty any more.",
  "temperature_high": 66.06,
  "temperature_mid": 59.62,
  "temperature_low": 53.18,
  "dew_point": 52.76,
  "humidity": 0.76,
  "cloud_cover": 0.83,
  "moon_phase": 0.8,
  "precip_intensity": 0.0291,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1013.12,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 8.09,
  "wind_bearing": 223,
  "wind_speed": 7.51
}