{
  "reportId": "2431",
  "title": "",
  "date": "",
  "observed": "My incident was not a sighting of an actual Big Foot creature, but of footprints. My father and I were camping at Kennedy Meadows Campground on the South Fork of the Kern River in California. On April 24, 2001 - we had cross the stream to do some hiking, but could not cross back the same we had came. We decided to go upstream to see if there were any better crossing points, or cross the bridge which was much further upstream. About 2 miles upstream from the campgrounds we found a suitable place to swim across, then we proceeded uphill to look for the Pacific Crest Trail which leads back to the campground. We figured we were probably within a quarter of a mile from the trail which runs parallel to the river. While walking through the forest looking for the trail, I happened to look down and noticed some unusual tracks. I called my father over to look at them as well, and to provide confirmation that I was not just \"seeing things\". What we saw were footprints which looked approximately 12 inches long and probably 5 or 6 inches wide in the shape of a human foot. The print had 5 toes - with the big toe having the most prominent print. The foot did not seem to have the concave pattern on the inside which would indicate an arch - it seemed almost square in shape. I considered the possibility that these prints could be a hoax, however, at that point, we had not yet found the trail and it turned out that we were still about 100 feet from it. The prints we saw were in the forest between the river and the PC trail and actually looked as though they could have been travelling parallel to the trail. We could not determine the age of the print. It had rained probably 5 days earlier and the print had been made after the rain, but did not look much older than a day or two. This is all the information I can remember at this point, but I am anxious to go back to see if I can find more footprints.",
  "classification": "Class A",
  "county": "Tulare",
  "state": "California",
  "location_details": "Take the Kennedy Meadows exit from Highway 395 (I don't remember the road name or number) and drive about 22 miles up into the mountains. The Pacific Crest Trail is on the far side of the campground.",
  "summary": ""
}