{
  "reportId": "23615",
  "title": "",
  "date": "",
  "observed": "The only thing about my sighting I’m not 100% sure of is the month. and distances and Heights but I feel I’m pretty close. On or around July or August of 1992 I was working at a Chinese Restaurant in town. I was supposed to be heading for work, but had made my mind up earlier that I was going to layout. So that I   wouldn’t be caught by my Grandparents and or Father for being a slacker I needed a place to hide/something to do. Well not having any money I chose a place that A. gave me cover and B. gave me a place to kick around and explore. Near where we use to live (and still near today) near the Yadkin River they use to hold Tractor pulls, singings (John Anderson sang there once before he made it big) etc. It had gone out of business quite a few years back but there were still some dilapidated buildings still standing and some bleachers. I parked my car underneath the bridges that the interstate ran across and hopped over the DO NOT ENTER signed cable barrier. I followed the dirt path that led to the remains of what was once called ‘The River Run. The path ran parallel to the river, but turned away from it roughly two hundred yards from where I hopped the cable. I reached the Remains and kicked around, I looked in the old Bathrooms (basically a Pee stall) checked under the bleachers for change or dollar bills that may still be there, of course there wasn’t any. And little did I know before I got there that a crane they had recently (couple months) been using to dig out sand from the river (for what I do not know) was still there. I of course looked it over, crawled in the cab, looked for keys etc. Well, not only was I getting BORED quickly, it was getting hot. It was a hot summer and having been indoors WORKING, like a good boy the whole summer until then, I hadn’t realized how hot it got at around 11:00 am. So I decide that there had to be a better place to chill. I headed back down dirt path. The areas that the Buildings were located were Roughly one hundred and fifty yards away from the river. As I was heading back I noticed something that appeared to be sitting on the riverbank; I first assumed it was a dog. I whistled, yelled here Boy and all that and it didn’t respond. As I got closer I realized it wasn’t a dog and felt stupid, cause there were weeds and such growing at the bank and I just figured I was Whistling for WEEDS to come to me. As I got closer and closer it appeared to be a very Unkempt, long haired hippy of a man. But the Funny thing was I could only see the Bust of him (chest to top of head) so then I just assumed it was a Bum standing on a ledge in the river looking over the bank watching me. So I kept walking, actually strutting to let this Bum know if he tried to mess with me, he was going to get his ars whipped, but good. As I kept walking and not paying any attention to the Bum a strange sensation came over me (to this day I can’t explain it) I looked up and that’s when I realized it wasn’t a bum, it was something else, what, I do not know but it wasn’t human. At this point I was roughly 50 yards away, my mind was racing and my heart was beating, here I was almost face to face with a Big foot? So I did the only rational thing I could think of at the time, I ran towards. I know that, that doesn’t seem to be the brightest thing to have done BUT in my mind and with the MILLION things running through it the one thing that didn’t go through my mind was fear, NOT one ounce. Until…I was, at this point, roughly forty yards away and the closer I got, the doubts, if any that this THING was not human was completely gone. At about some thirty yards away I took my eye of it for just and I mean JUST a split second and it was gone and that is when fear struck me. I halted quickly. I dare say now I was 25 yards away from where IT was. I was petrified, I stood there for what seemed like hours, while I was standing there it was the first time that I really had the chance to reflect on what I just saw, and all I can remember thinking was. A. Why did it look like Chewbacca from Star Wars minus the black nose? B. Why did it have very light fur almost dirty strawberry blonde? C. Why no smell, don’t they always stink? D.Why did I wuss out and get scared? I finally Talked myself out of being a big wimp and decided that if it was what I think it was I need proof. I BABY stepped looking left and right as quickly as my neck could turn the whole time I was walking to the river bank. I reached the River bank and scanned the River and River bank like my life depended on it. I roughly stood there for 15 minutes looking at the Highest point to where IT could have been standing looking over the River bank at me. I looked for tracks but all I found was sand slid into the river, I looked for hair and nothing. I even sniffed around and couldn’t smell anything but what smelt like fish. I then jumped to the highest point  to try a gauge how tall IT was. I’m 6’2 and have a reach of 7’6 and I had to bounce a little (not a hard jump) but bounce nonetheless for the tips of my fingers to be even with the River bank from the highest point IT could have possibly be standing.  I know I had to bounce at least 6 inches(any more and I’m sure I would have slid into the water, so that puts the river bank height roughly 8 feet  and I was seeing IT”S Bust so IT was (and it’s a guess) roughly 9’3 –9’5 or more . I finally climbed out of the riverbank, walked to my car peering and alert to anything jumping out, but nothing eventful happened. Got in my car drove home, no one ever asked me if I laid out of work cause no one EVEN NOTICED!!! Needless to say I never laid out of work again., well not  without a good reason.",
  "classification": "Class A",
  "county": "Iredell",
  "state": "North Carolina",
  "location_details": "40 east  ext 163 Cool spring exit. left on hwy 64 go under 40 and first rd on left. go roughly 1 mile or mile and 1/4 . pass over yadkin river immediate right under bridges that 40 runs over. Very near Davie/Iredell line",
  "summary": ""
}