{
  "reportId": "11016",
  "title": "Young witness has encounter during thunderstorm near Cave Junction.",
  "date": "1976-09-01",
  "timestamp": 210384000,
  "observed": "At the time of my sighting I was about 14 years old. My family and I lived ten miles or so from the Oregon Caves. I rode my horses around the area for several years.The night that I seen what ever it was, we had a thunder storm and being the horse freak  I am, I thought that my ponies were going to get hurt.  I had heard a report of a mans Arabians being struck by lightning. So I went out to check on them. I would take a lie detector test to this. On the right hand side of our pasture the river ran along side of it and the hot wire was to the chest of a fifteen hand horse this thing came out of the bottom of the river bed stepped over our hot wire fence and the only way I can describe the walk was like a swinging run because its arms and lags twisted with the run or walk or swing. I cant tell you how tall it was , I got the profile and it was big. very big.! Dark colored. I think it was around late summer or fall. I do have pictures of the house and cabins. The whole incident only took maybe a few seconds. It was fast. I never told any one about it until we had moved.I think we lived there up to 1978 then we moved to Montana ,I told my sister about it then. till this day she is the only one that I have told till now.I know it was Cave Junction , Josephine county, We lived right along side highway 46. The thing stepped over our fences like it was nothing then went across the road and up the embankment on the other side of highway 46.",
  "classification": "Class A",
  "county": "Josephine",
  "state": "Oregon",
  "latitude": 42.1533,
  "longitude": -123.5381,
  "location": "-123.5381,42.1533",
  "location_details": "I think the cabins and old house were around ten miles from the caves. There is or was a forest service park about a half mile from the houses. The river or creek runs along the far side of the property. it was kind of marshy on the lower part of the pasture . the cabins were a dirty yellow. also we had a problem with bats in the big house so the University came out and netted some of them and marked there wings to see if they would come back to the same place after removing them.There were three cabins and one big house on the property I wish I had something with the address but its been so many years. I don't even know why I am telling you.",
  "temperature_high": 78.74,
  "temperature_mid": 64.43,
  "temperature_low": 50.12,
  "dew_point": 51.61,
  "humidity": 0.63,
  "cloud_cover": 0.17,
  "moon_phase": 0.27,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.12,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 6,
  "visibility": 8.02,
  "wind_bearing": 2,
  "wind_speed": 6.01
}