{
  "reportId": "18902",
  "title": "Possible evening sighting by pedestrian on the outskirts of Little River and N. Myrtle Beach",
  "date": "2007-04-14",
  "timestamp": 1176508800,
  "observed": "I recently told a story of an encounter that happened to me when I was 11 in cortland NY. I am now 30 and live in little river SC. About 2 weeks ago I was walking on highway 17 at about 9:00pm to the nearest store. along the way there is a small creek thats surrounded by wooods that appear to go several miles west of the area. as I approached this section of woods I heard this scattering in the brush. I figured it was a deer or even a wild dog. I went to the store which is about a 5 to 10 minute walk further down the road. as I was walking back which was probably 10 to 15 minutes later the traffic was bothering me so when i approached the same section of woods to get away from the highway I heard an even louder scatter in the bushes about 10 to 20 feet in the woods. I paniced and quickly ran back closer to the edge of the highway. there was no traffic now and I could hear everything clearly. I was too afraid to run so I walked quickly. I could hear this creature stomping through the brush real fast. I would stop for a second to look to see what was following me and it stopped too. I started off agian and I could hear another couple of footsteps that sounded as if it was the size of a bear. I stopped again and it stopped with me. as I approached an area that was partially lit by a company that had an outside light on i could see at the edge of the woods a creature that apeared to be squating down with its long arms in front of it. the hair looked to be about maybe 5 inches long and a light redish color. it looked more ape like than my fist encounter which leads me to believe that it might have been a skunk ape. I still cant say for sure what it was. I do know that if it was a bear, dear or wild dog it would have fleed when I walked by it the first time. instead it stayed",
  "classification": "Class B",
  "county": "Horry",
  "state": "South Carolina",
  "latitude": 33.5155,
  "longitude": -78.3829,
  "location": "-78.3829,33.5155",
  "location_details": "Highway 17 S from Little River, SC  to  junction of Eagle's Nest Road & Hwy 17S",
  "temperature_high": 68.08,
  "temperature_mid": 63.53,
  "temperature_low": 58.98,
  "dew_point": 50.5,
  "humidity": 0.71,
  "cloud_cover": 0.14,
  "moon_phase": 0.9,
  "precip_intensity": 0.0002,
  "precip_probability": 0.52,
  "precip_type": "rain",
  "pressure": 1015.92,
  "summary": "Mostly cloudy starting in the evening.",
  "uv_index": 10,
  "visibility": 8.9,
  "wind_bearing": 125,
  "wind_speed": 4.67
}