{
  "reportId": "35456",
  "title": "Possible knocks, vocalizations and footprints found outside a home near Leitchfield",
  "date": "2012-04-05",
  "timestamp": 1333584000,
  "observed": "About a month ago around 9:30pm cst, I was going out to feed my dogs after working outside with the kids all day, when I heard 3 SOLID wood knocks. The series was immediately followed by a horrific cry like I've never heard before (or since until I watched the show you did in Indiana) - the series of Knocks done in Morgan forest sounded more hollow than the knocks I heard at my house - the call or scream was dead on - except the one I heard lasted longer). After dropping the bag and running in, I gained my composure and attempted to feed my dogs again about 1/2 hr later and the same thing happened again! I freaked out and woke up my husband which I had never done before over a sound (and we've lived here secluded on the banks of rough river since 1994 - so I'm used to bobcats, coyotes and various other creatures. This was not like any I had heard except for the show. Anyway, I just mustered up the courage to go where I thought the sound came from and there were foot prints - very large and they looked like they had two big toes. Also, I have trained SAR tracking and AKC certified tracking bloodhounds and scented them from the track. They work the track for about twenty minutes and came up on a track and stopped dead in their tracks and refused to go any further (which they have NEVER done before). Anyway, I saw you show yesterday on iTunes and it hit me that I had to go look.",
  "classification": "Class B",
  "county": "Grayson",
  "state": "Kentucky",
  "latitude": 37.55379,
  "longitude": -86.35931,
  "location": "-86.35931,37.55379",
  "location_details": "We are on the banks of rough river. Our home is located between the river and 1000's of acres of forest and cornfields.",
  "temperature_high": 60.16,
  "temperature_mid": 49.785,
  "temperature_low": 39.41,
  "dew_point": 46.47,
  "humidity": 0.7,
  "cloud_cover": 0.72,
  "moon_phase": 0.46,
  "precip_intensity": 0.004,
  "precip_probability": 0.49,
  "precip_type": "rain",
  "pressure": 1009.09,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 5,
  "visibility": 9.06,
  "wind_bearing": 48,
  "wind_speed": 8.76
}