{
  "id": "5463",
  "title": "",
  "date": "",
  "observed": "This report describes a sighting of a large biped primate at Fort Hunter Liggett on the evening of Saturday, February 16, 2002.  I left my home in Manhattan Beach, California about 8:00 AM on the morning of February 16th after one last unsuccessful attempt to persuade my son to join me for a long weekend of wild pig hunting.  Monday was President’s Day, my son was off school, and the Fort was open for hunting.  But 16-year old boys have other interests.  I arrived at the Fort about 12:30 PM alone, checked into Training Area 10/13 to hunt, and stopped at the Hacienda for lunch and to claim my room for the weekend.  After changing to camouflage clothing and hunting boots I headed up Sulfur Springs Road to where Training Area 10/13 begins. About 4:30 PM I stopped to look at a creek that crosses under Sulfur Spring Road near Lyons Pond in Area 7 as I drove Northeast.  I learned of the creek that is often used as a wallowing spot, on a guided hunt in 1999.  From the road I could see much recent activity.  It appeared as though quite a few pigs had been wallowing in the small creek the night before.  I drove on about 150 yards and parked my Bronco along Sulfur Spring Road. I climbed down the 20-foot high embankment to the creek to check the area more carefully.  There were very fresh wallows all along the creek with many fresh droppings in addition. I walked on to Lyons Pond, which was dry, and returned to Sulfur Springs Road.  All of the fresh sign was in Area 7 at the edge of the road, but I was registered to hunt in Area 10/13—on the other side of the road.  This is an important distinction at Hunter Liggett.  If you are caught with a loaded gun in an Area you are not registered to hunt, you are banned from the Fort—forever. I solved this conflict by noticing that the pigs appeared to be using a large culvert to cross under the road from Area 10/13 to Area 7.  I decided that I would wait for their return on the 10/13 side of the road.  I positioned myself about 10 yards off, and 20 feet below the road.  My hope was that the pigs would be traveling up the creek through Area 10/13 to Area 7 just after the sun set.  It was about 5:00 PM when I took my position with determination to not move until 30 minutes after sunset. The first hour of waiting was pretty boring.  Nothing was moving and the forest was eerily quite.  About an hour before sunset the woods began to show signs of life.  A few Blue Jays and Woodpeckers flew by and a few frog croaks resonated from the small creek I was watching.  Closer to sunset I noticed two does moving through the woods and squirrels scampering about.  I knew that if the pigs returned to the creek it would be in those magical 30 minutes after sunset and that time was just arriving! Much to my disappointment, a blue Ford Ranger also arrived as the sunset.  Two hunters climbed out, grabbed their rifles and walked down a small, grassy road that entered the woods about 75 feet from where I was sitting.  I watched them pass and disappear on the road that was slightly above my hidden sitting position.  My hopes of a pig encounter of the close kind were dashed.  I was certain these hunters would either intercept my prey or scare them away with their movement and noise. I was heartened a few minutes latter as I saw both hunters returning along the road to their truck.  I watched them carefully with my new Swarovski binocular.  It was about 10 minutes after sunset and without the binocular they appeared as shadows in the darkening forest.  With my Swarovski binocular I could see details of the weaving in the plaid hunting jacket one was wearing and the rifles they were carrying.  They climbed into their truck and drove off—leaving me with 15 more minutes of wild pig hope. These minutes passed slowly as I glassed the forest in search of movement.  The frogs in the creek began a loud chorus that added to the excitement.  There was lots of movement but no signs of pigs.  Chipmunks and squirrels were scampering about and I saw a coyote moving in the distance.  Drizzle started to fall, along with my hopes, as the last few minutes of hunting time expired.  I resolved to return to the same spot in the morning as I put the lens covers on my binocular and gather up my backpack and rifle. But before I could stand up I saw a flash of light color a few 100 yards back into the forest.  I had no idea what I had seen out of the corner of my eye.  The color was white or silver-gray, not a color that I would expect to see on a wild pig.  I looked off into that direction for a few seconds before seeing another brief flash of the same light colored object.  Both confused and intrigued I watched as repeated flashes of white or silver-gray coloring appeared in the forest.  Whatever it was appeared to be moving and after about 20 seconds of watching I realized that it was moving in my direction along the same road the two hunters had walked earlier. I believed I watched this creature move through the forest for about two or three minutes before I finally got a clear, unobstructed view of it against a light sky background.  My attitude was relaxed but attentive as I tried to figure out what I was seeing.  Patches of silver-gray flashed through openings in the forest, sometimes high, sometimes low!  My attitude changed to surprise and fright as I saw it take 4 or 5 full steps in a 30-foot clearing along the raised road, 75 feet from where I was sitting.  I was wide-awake, completely sober, free from any medications, and completely focused on this approaching object.  I was alone, watching with my naked eyes, and heavily armed.  I had a Model 70 in 300 Winchester magnum in my hands and was carrying a Tarus Raging Bull in 454 Casual on my belt. What the hell was it? I don’t know! It was walking completely upright on two legs. It was very large.  I estimate that it was 8 feet tall and weighed 800 lbs.  Not 30 minutes before I had watched two hunters cross the same 30-foot opening and had thought how small they looked.  In contrast, I was surprised at how big this creature was. It was covered with silver-gray hair from its very pointed head to its feet.  The only difference in coloration was a dark facial mask and similar colored palms—brown or black. I saw this creature in side profile and could make out few facial features.  What I could see appeared very flat, with little nose or chin protruding.  The silver-gray hair on the head rose about 8” from the top of the facial mask to a pronounced point at the top of the skull.  The head blended into the body without any visible neck in between. The silver-gray hair on the arms was about 4 inches long.  I could see this clearly as these very long, heavily muscled arms swung in cadence with its fast, uninterrupted, strides.  Bulging back and shoulder muscles flexed visibly under the hair as it strode along the road. It was not carrying nor wearing anything.  Both hands were empty.  There were no shoes, belt, pack or anything else that would suggest cultural development or advanced intelligence. Four long, powerful strides in a clear opening against the still light Western sky and it was gone! I was dumbfounded!  What the hell had I just seen?  It took me about 10 seconds to grab my backpack and start running up the 10’ grade to Sulfur Spring Road to get another look.  I slipped to one knee as I scrambled up the hill and pulled my Raging Bull out of its holster as I reached the road.  My heart was racing and my hands were trembling but it wasn’t from the running—I was pretty damn scared! It was 40 minutes past sunset, but I was looking West toward an open field on the other side of the road, the direction in which this creature was headed.  There was nothing moving—I couldn’t see or hear any sign of what I had just seen.  I walked slowly down the center of the Sulfur Spring Road toward the point where the other road connected.  I called out a number of times to see if anyone or anything would respond.  Nothing did.  After a few minutes I slowly walked backward down the center of Sulfur Spring Road toward my Bronco that was parked about 200 yards East of where I had been hunting. I jumped in and locked the doors!  I turned it around and slowly drove back toward the Hacienda with the bright lights searching for any signs of movement along the road.  The drizzle turned to serious rain as I reached the Hacienda.  I went directly to the restaurant for dinner and a few glasses of wine.  I chatted with two other hunters seated at the same table.  We exchanged stories of seeing deer and fresh pig sign in the areas we had hunted.  They told me of seeing a flock of wild turkeys run across their path in Area 7, not far from the Hacienda.  I didn’t say a word about what I had just seen.  I was sure they would think I was “nuts.”   I was sure because I was beginning to wonder myself! I rained hard all night. A heavy rain continued until about 11:00 AM Sunday morning. I left the Hacienda an hour before sunrise on February 17th headed back to the spot where I had seen this unbelievable creature.  I parked in the same spot as the day before, and loaded my rifle and pistol before I unlocked the door as the sky began to gray in the East.  I watched the creek for pigs until about 30 minutes after sunrise, then began looking for footprints along the small road where I had seen what appeared to be a silver-gray Sasquatch. The road was covered with grass and extended only about 200 yards from Sulfur Spring Road to where it dead-ended at a small ravine. There were few patches of bare dirt and no tracks.  Either the grassy road didn’t show tracks or the rain had washed them away. Or, perhaps, there had been nothing to leave tracks in the first place—only an over active imagination! From the end of the road I slowly still-hunted toward an adjacent ridge.  It was a few hundred feet above the surrounding ground and offered a good vantage point to glass for movement.  While I kept my eyes open for pigs, I was really looking for something silver-gray.  I saw neither.  At noon, I returned to Sulfur Spring Road and walked back into Area 7.  Lyon’s pond had little new water in it despite the heavy rain over the last 18 hours.  There were few pig and deer tracks on the bare dirt as the heavy rain had washed most of the tracks away.  I saw no sign of any tracks that might have been left by the beast I saw the night before.",
  "classification": "Class A",
  "county": "Monterey",
  "state": "California",
  "location_details": "A short logging road that enters Training Area 10/13 about half way between the Hacienda and Jolon Rd on Sulphur Spring Rd.  Lyons Pond is directly across in Training Area 7.  A small creek crosses under Sulphur Spring Rd about 100 yards Northeast of the logging road.",
  "summary": ""
}