{
  "reportId": "8042",
  "title": "Bowhunter turns around to see a creature staring at him almost motionless.",
  "date": "1996-10-25",
  "timestamp": 846201600,
  "observed": "Just past dusk while with my hunting partner we were camped up on the hill above the ravine we bow hunt every year. I went to take a leak on the port potty we had set up 100 feet from the campsite. While sitting there with the glare of the campfire in sight I noticed a really stinky smell coming from behind me. I stood up and turned around to see this animal standing there a short distance away starring at me. I looked at this thing in amazement. It was leaning on one foot just looking right at me. I was totally terrified. It was white in color, had dark brown skin, an apparent round head, and real deep sunk eyes. Although it was about my height (6 foot 2) it was very wide at the shoulders. I would have to say it was three and a half to four feet wide, which made its waist look thin in comparison. Since I had a shovel to bury my waist I screamed at the creature and waved the shovel in the air. Once I did this it sprinted into the woods down into the ravine at an alarming pace. I could hear it busting branches as it left the area. My friend came running over wondering what was wrong. I told him what had just happened but he just couldn't believe me. That was until the next day when we went right to the location and found the large tracks going towards the ravine. I think after him seeing them he was somewhat convinced I had seen something very unusual. The other thing I noticed was its hair coloring looked dirtier below the waist.",
  "classification": "Class A",
  "county": "Guernsey",
  "state": "Ohio",
  "latitude": 40.08946,
  "longitude": -81.69818,
  "location": "-81.69818,40.08946",
  "location_details": "On private property located near State Route 662 and State Route 209 near the Indian Camp Road area.",
  "temperature_high": 62.85,
  "temperature_mid": 56.72,
  "temperature_low": 50.59,
  "dew_point": 39.8,
  "humidity": 0.7,
  "cloud_cover": 0.48,
  "moon_phase": 0.47,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.2,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 9.64,
  "wind_bearing": 164,
  "wind_speed": 5.6
}