{
  "id": "41395",
  "title": "Daylight sighting outside Grain Valley near the Monkey Mountain Park Reserve",
  "date": "2013-06-07",
  "timestamp": 1370563200,
  "observed": "On the 7th of June 2013 a friend of mine and I decided to visit the Monkey Mountain Nature Reserve in Grain Valley as she believed  we might catch sight of a  Sasquatch, since there had been documented sightings  in that area and she knew that I was very interested in the Sasquatch legend. As we traveled down E RD Mize Road towards the parking lot area, we were startled when a large creature on all fours crossed the road less than a hundred feet in front of us.  My friend stopped the car and we watched it cross the road from North to South.  It appeared it had come from a field to the right of us. It was covered in dark hair and very muscular. The back was arched and its head was tucked. I didn’t see a tail of any kind. I did however, notice the hair on its back was considerably shorter than it was on the rest of its body. It seemed to just glide across the road which I though was strange since it was very large. I’m guessing it weighed at least five hundred pounds or more. I reached for my camera which was in my lap but the creature had already disappeared. We continued down the road and reached the parking lot where I asked my friend to go back so that we could look for prints, but she refused. I told her I thought we’d just seen a Sasquatch and she told me it must have been a large dog possibly a Newfoundland because they are large black dogs.  I told her that we had a better chance of seeing a Sasquatch in that particular area than a Newfoundland. It was then she told me that she was going to keep quiet about what we had seen and that I should do the same, which obviously I didn’t do. I know what I saw and it wasn’t a dog, a deer or anything I had ever seen before.",
  "classification": "Class A",
  "county": "Jackson",
  "state": "Missouri",
  "latitude": 38.5992,
  "longitude": -94.1057,
  "location": "-94.1057,38.5992",
  "location_details": "Monkey Mountain is an 855 acre nature preserve in Eastern Jackson County, halfway in-between Grain Valley and Oak Grove.",
  "temperature_high": 73.4,
  "temperature_mid": 63.74,
  "temperature_low": 54.08,
  "dew_point": 52.76,
  "humidity": 0.68,
  "cloud_cover": 0.13,
  "moon_phase": 0.97,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.42,
  "summary": "Partly cloudy until evening.",
  "uv_index": 9,
  "visibility": 9.93,
  "wind_bearing": 351,
  "wind_speed": 4.36
}