{
  "id": "10874",
  "title": "Teenager observes animal hiding behind trees and finds footprint in the Clay Hills near Hoboken.",
  "date": "1986-10-11",
  "timestamp": 529372800,
  "observed": "I was down at a place we call the Clay Hills outside of a town called Hoboken. I herd a noise that sounded like foot steps in the woods. I didn't think mutch of it at first but I kept hearing it so I looked up an it was looking at me. I moved the shovel I was digging with an it turned an ran back in the woods. Then a few minutes later I had a weired feeling something was behind me. Then I heared movement I turned an looked it was behind me an getting closer. I have lived in the swamps all my life. I'm not scared of mutch but I admit I was nervous. It watched me for a while then walked into the swamp an disapered. Both times was close to fruit during the fall when the plumbs an pears were the sweetest. The second time was one night I was coming home from my girl friends. I passed the corn feild on my left. A little further up there is another feild that was grown up with briers so thick a man could not go threw with 4 pair of pants on but something stood up and ran threw them like they werent there. The next day I went back looking for prints I found one print. It was about 6 in longer than mine an I wear a size 12.",
  "classification": "Class A",
  "county": "Brantley",
  "state": "Georgia",
  "latitude": 31.2439,
  "longitude": -82.1341,
  "location": "-82.1341,31.2439",
  "location_details": "When you get into town comming off hyw 95 onto 82 west turn left at first caution light. Go 3 miles out of town take left on dirt road. Go to cross road turn right follow dirt road straight you cant miss it first. Big Clay Hill on road.",
  "temperature_high": 73.14,
  "temperature_mid": 69.325,
  "temperature_low": 65.51,
  "dew_point": 65.99,
  "humidity": 0.84,
  "cloud_cover": 0.84,
  "moon_phase": 0.29,
  "precip_intensity": 0.0062,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1018.11,
  "summary": "Rain in the evening.",
  "uv_index": 4,
  "visibility": 5.58,
  "wind_bearing": 25,
  "wind_speed": 8.36
}