{
  "reportId": "3585",
  "title": "Hikers find nest-like structure in dense forest north of Monroe",
  "date": "2001-08-01",
  "timestamp": 996624000,
  "observed": "A dear friend bought several hundred acres of land in Washington State, near Monroe in the mountains. While building a road and house over the last eight years, he has had many strange occurrences, too many to discuss here. This is second growth forest and is virtually un-touched. I have always been a believer in Bigfoot, and a fellow Bf'er and I went up there this past August to check it out. To make a long story short, while hiking in a very dense gorge between two mountains, we came across a nest. If you have never been to the wilderness of the Pacific Northwest, let me tell you - it is DENSE! I mean, there could be a hundred Bigfoots within twenty yards of you and you wouldn't see them. Ferns and other under growth are growing anywhere from waist to shoulder length, with absolutely towering trees every few feet - truely amazing. The nest was completely conceiled, and if I hadn't walked directly in front of the opening, I never would have even noticed it. The construction was unbelievable; the under growth was woven to form a about a seven foot tunnel leading to a larger doomed inner room, about the size of a mid-sized car. The tunnel leading to the room was perfectly round and had another bush pulled towards it to conceal the entrance. We went inside to look for evidence or smell, but could find neither. While investigating inside we both looked at each other, for no reason, and both of us suddenly became very spooked. We didn't see or hear anything, just knew we had to get the hell out of there and did. We were going to go back later, but the weather went to hell and was pouring down rain. We had been trying to find some caves that are down in the gorge but never found them. I am going back in the spring to this same place where we found the nest and camp for a couple of days. My buddy who owns the place, knows an Indian who lives nearby and he can take us to the caves, even though he won't go near them, he will point us in the right direction.",
  "classification": "Class B",
  "county": "Snohomish",
  "state": "Washington",
  "latitude": 47.85556,
  "longitude": -121.9697,
  "location": "-121.9697,47.85556",
  "location_details": "I would rather not say online, my friend is a very private person. I would discuss the location by phone however.",
  "temperature_high": 69.27,
  "temperature_mid": 64.19,
  "temperature_low": 59.11,
  "dew_point": 51.12,
  "humidity": 0.75,
  "cloud_cover": 0.56,
  "moon_phase": 0.43,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.49,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 9.49,
  "wind_bearing": 189,
  "wind_speed": 3.56
}