{
  "id": "2216",
  "title": "Driver sees bipedal creature in headlights near Yellowstone hot spot",
  "date": "2000-07-20",
  "timestamp": 964051200,
  "observed": "Leaving the east gate of Yellowstone near sundown. Somewhere between there and Cody...maybe halfway...and after dark. I saw a dark, bipedal motion moving out of the tunnel of light provided by my van. It was very brief. When I got back to Florida at some point I received a field & stream and read about the skookum cast. After reading it I went to your site and found the \" Wyoming Hotspot\" and it all came back. I'm a cautious observer and realize how your eyes can play tricks. I asked my wife...prior to telling her about the skookum cast article or the information on your site... about whether she remembered me saying anything on the way to Cody when we left Yellowstone during our trip there. She said all she remembered was me joking about seeing Bigfoot. I wanted to be sure it wasn't a \"manufactured memory\" because sometime had passed. It was a long day...we had seen lots of wildlife and finished with a nursing grizzly with 2 cubs just before leaving the park. What I saw reminded me of a moose in color. I've always described moose as being difficult to see at night by saying it's the black that moves at the outer limits of your lights. Often you don't get a clear outline of the animal but know by the way it moves. I don't know if that makes sense but it's 2:30 am now so I'm a bit groggy. I was planning a trip back this summer to take a better look around. I was finishing a Masters last summer at Colorado State and had a week between classes so we headed to Yellowstone in the hopes of seeing Grizzly....and the Park. Had I been in Washington I probably would have been looking for Gigantipithicus. Many years ago I talked to Dr. Krantz and Peter Byrne while working on a project for an Animal Behavior class at the University of Florida. When I called them they seemed credible and were helpful. My memory is from a second or 2. Two strides that took it from the middle of the eastbound lane, to the middle of the westbound lane, to the gravel on the side of the road...dark...large. Half laughing I told my wife I saw a sasquatch...she said so did she...we both laughed and said we must be tired...she said turn around, which made me laugh even more...We're just tired. She pointed out we didn't know when we'd ever get back. I didn't think anymore about it till I went to your site. I'll be going back this summer...probably June...depending on the cost of gas...it's getting crazy again.",
  "classification": "Class B",
  "county": "Park",
  "state": "Wyoming",
  "latitude": 44.49817,
  "longitude": -109.6429,
  "location": "-109.6429,44.49817",
  "location_details": "Maybe 20-30 minutes east of the Park",
  "temperature_high": 81.5,
  "temperature_mid": 65.82,
  "temperature_low": 50.14,
  "dew_point": 45.11,
  "humidity": 0.5,
  "cloud_cover": 0.19,
  "moon_phase": 0.63,
  "precip_intensity": 0.0047,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1019.16,
  "summary": "Partly cloudy starting in the evening.",
  "uv_index": 10,
  "visibility": 9.99,
  "wind_bearing": 5,
  "wind_speed": 2.91
}