{
  "id": "43193",
  "title": "Homeowner reports possible interactions that include his hunting dogs near Pax",
  "date": "2013-11-30",
  "timestamp": 1385769600,
  "observed": "About a week ago my dog was making a strange noise like he was playing around 12 at night. I called my friend who lives on the property to meet me outside. We went up the hill to my dog pen and he was acting as if he was playing, all happy running around and looking behind him. We shined our lights up the hill and saw a rather large figure about seven to eight feet tall and rather thick, step back into the darkness and disappear. It scared us and we ran. We have been hearing sounds every night. Last night we went out around 1:00 AM to do knocks and yells. Something growled back, not like a bear, and was very close and kept following us. My dog is still doing the same thing every night and my cats refuse to stay out at night. Before this started they wouldn't come in. We are on the side of a mountain with about two thousand hunting lease acres behind us. Neighbors about a third a mile away. We are on a dead end road with lots of animals and very secluded. Deer walk around in our yard most days before this started and we regularly see four bears here. It is very thick here and could hide lots of other animals.",
  "classification": "Class B",
  "county": "Fayette",
  "state": "West Virginia",
  "latitude": 37.603,
  "longitude": -81.2625,
  "location": "-81.2625,37.603",
  "location_details": "Near Pax, WV, off of I-77 between Charleston and Beckley, WV. Paint Creek runs through my property and there are caves on the back property.",
  "temperature_high": 42.57,
  "temperature_mid": 34.755,
  "temperature_low": 26.94,
  "dew_point": 22.51,
  "humidity": 0.68,
  "cloud_cover": 0.01,
  "moon_phase": 0.91,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1031.95,
  "summary": "Clear throughout the day.",
  "uv_index": 2,
  "visibility": 9.99,
  "wind_bearing": 126,
  "wind_speed": 5.15
}