{
  "reportId": "31166",
  "title": "Husband and wife experience an up-close daylight sighting on Hwy. 7 north of Bovey",
  "date": "2009-08-16",
  "timestamp": 1250380800,
  "observed": "My wife and I were traveling south on Scenic Highway 7 north of Bovey, MN.  It was a Sunday 2 weeks before Labor Day 2009.  We had been swimming at our lakeshore property and my wife offered to drive home.  I was in the passenger seat and noticed what I thought was a man in the ditch ahead of us.  We were about 200-300 yards from this person when I noticed an animal type movement of its upper body.  I have hunted in northern MN my entire life and thought this was really strange that this person could react with such speed.  I then focused on this person - it then made a movement to the woods but just as fast decided to cross the road.  I alerted my wife to slow down to not hit this person.  As she slowed this creature crossed less than 20 paces in front of us.  It was covered in dark brown fur was 6-7 ft tall.  It had a broad nose with little hair on its forehead or cheeks.  Its feet were covered with long hair like a clydsdale horse that trailed on the pavement as it crossed.  Its chest had welts that I reasoned were from insect bites.  It had long muscular arms and when it reached the other side of the road swung his arms and leaped the entire ditchway.  My wife asked it it was a werewolf. I am very well trained when it comes to wildlife and would never have believed what I saw - seeing is believing.  Also, its gait was unusual - it was no human in a suit.  bigfoot does exist..",
  "classification": "Class A",
  "county": "Itasca",
  "state": "Minnesota",
  "latitude": 47.5,
  "longitude": -93,
  "location": "-93,47.5",
  "location_details": "call me if you wish",
  "temperature_high": 74.25,
  "temperature_mid": 63.24,
  "temperature_low": 52.23,
  "dew_point": 62.68,
  "humidity": 0.87,
  "cloud_cover": 0.79,
  "moon_phase": 0.86,
  "precip_intensity": 0.018,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1006.58,
  "summary": "Rain until afternoon.",
  "uv_index": 4,
  "visibility": 7.25,
  "wind_bearing": 204,
  "wind_speed": 4.9
}