{
  "reportId": "3337",
  "title": "Woman witnesses a 7 foot tall, silver-black sasquatch while driving",
  "date": "1994-11-30",
  "timestamp": 786153600,
  "observed": "While driving down the road about 10:30 pm I saw something standing on the left side of the road where the road curves to the right.  I threw my headlights on bright and turned the wheel to the left and drove streight to it. I was sideways in  the road. As I neared it I stopped and I had a clear view of it.  It was so tall that I had to lean closer to the steering wheel to look up into its face.  I could see him (clearly a male) from just above his knees to the top of his head.  I looked streight into his eyes.  He seemed to be comunicating with me though his eyes.  He let me get a good look at him and then he gave a nod and I knew I was to go. He was at least 7ft tall or more with silver and black hair some of it at least 4 to 5 inches long and dark outdoors type skin (where it was exposed. His eyes resembled that of a dogs and were the color of a alaskain husky and wide flat nose and a wide thin mouth like a mans. He never opend his mouth. Just stood there and looked at me and blinked some and make jesters with his head and eyes. When he knodded at me I knew it was time to leave so I turned the steering wheel very slowly ( I felt dazed) and drove on down the road.  I estimated the time I set there about 15 to 20 mnutes.  I went home about 1/4 miles up the road.Then I trembled  was so excited I could hardly walk.  I never was afraid.",
  "classification": "Class A",
  "county": "Stanly",
  "state": "North Carolina",
  "latitude": 35.2256,
  "longitude": -80.26915,
  "location": "-80.26915,35.2256",
  "location_details": "United States, state of North Carolina in Stanly County between the towns of Oakboro and Aquadale.  On Old School Road off Hwy 138",
  "temperature_high": 57.12,
  "temperature_mid": 46.495,
  "temperature_low": 35.87,
  "dew_point": 35.05,
  "humidity": 0.68,
  "cloud_cover": 0.56,
  "moon_phase": 0.91,
  "precip_intensity": 0.0003,
  "precip_probability": 0.62,
  "precip_type": "rain",
  "pressure": 1023.79,
  "summary": "Partly cloudy until evening.",
  "uv_index": 2,
  "visibility": 7.96,
  "wind_bearing": 322,
  "wind_speed": 4.56
}