{
  "reportId": "4795",
  "title": "While riding horse, young teen has day time sighting not far from Palatka",
  "date": "1947-07-01",
  "timestamp": -710208000,
  "observed": "This incident happened around 1947/48.  I was about 12/13 years of age.  I have held this incident in my mind's eye all these years and have tried to figure out what I had seen.  After reading sightings and descriptions on your website, I beleive what I saw could well have been a sasquatch. It was summer time and I was riding my horse, Jenny.  We were going to visit a neighbor.  I was on my regular path through the woods when I saw a lone, large, dark figure.  At first I thought it was a man making \"cat faces\" on the pine trees.  There were a lot of trees in that area  that were being used to collect resin.  It looked as if the man had on a raincoat.  That seemed very strange to me as it was a clear and hot day.  And then when I looked closer, it looked like a fur coat and that really made no sense because it was summer and very warm.  The \"person\" was a distance from me and I hesitate to even try and say how far.  As I was scrutinizing this \"person\", Jenny suddenly stopped and threw her ears forward and raised her head.  She, too, had seen the \"man\".  I urged her to go forward by kicking her in her sides, but she refused to move.  I decided to turn her around and go another direction in order to make her think we were not interested in the \"man\".  She gladly went in the oposite direction.  When I saw she would go in another direction, I turned her around and again proceeded toward the \"man\".  Because Jenny sensed a danger, I was uneasy at this point.  She continued to carry me in the direction of the furry man until we approached to spot she had stopped at before.  She again pointed her ears forward, raised her head, smelled the air and refused to move another step. I watched the creature for awhile as I felt I was at a safe distance.  It was at a large pine tree.  It was making up and down motions (like it could have been scratching its back).  The arms seemed to be raised in the air as it made these undulating motions.  I sat there on Jenny trying to figure out if the creature had on a fur coat or a rain coat and if so, what for?  As I mentioned, I have pondered this for years and it finally makes sense to me in the context of a sasquatch sighting. This took place in Putnam County about 5 miles northe of US 17 in the deep pine forest near my home.  Rice Creek is about 1 mile further north on US 17.  The nearest town is Palatka, Florida - about 5 miles. My mother used to tell me of hearing screams like a woman screaming.  Of course, that could have been a panther.  I never heard any of these sounds.",
  "classification": "Class A",
  "county": "Putnam",
  "state": "Florida",
  "latitude": 29.77295,
  "longitude": -81.68295,
  "location": "-81.68295,29.77295",
  "location_details": "The open pine woods of north Florida.",
  "temperature_high": 85.98,
  "temperature_mid": 77.5,
  "temperature_low": 69.02,
  "dew_point": 72.16,
  "humidity": 0.84,
  "cloud_cover": 0.93,
  "moon_phase": 0.44,
  "precip_type": "rain",
  "pressure": 1015.45,
  "summary": "Humid and mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 7.56,
  "wind_bearing": 237,
  "wind_speed": 5.04
}