{
  "reportId": "4359",
  "title": "Motorists spot sasquatch and give chase near Mt. St. Helens",
  "date": "2002-05-18",
  "timestamp": 1021680000,
  "observed": "We were driving down the highway away from Mt.St. Helens and saw a hairy being, a sasquatch,  alongside the road. It was seen by all in the car, my wife, my child and myself. It looked to covered in black hair all over it's body and was moving quickly from one group of trees across a meadow to another group of trees. It moved in a quick loping fashion with it's arms extended downward and swinging at it's side. In it's right hand it carried a club like item. We backed up and went down a side gravel road and went up it looking for the sasquatch. After a few hundred yards we turned around and went down and tried another area but still saw nothing. We then went back to the meadow area and drove slowly up the slope of the meadow. The meadow was surrounded by trees and was about a football field in length. We were at one end and all again saw the sasquatch at the other end of the meadow. It was turned away from us looking in the direction we had just been in and appeared to be looking to see where we had gone. I got out of the car and started approaching it quietly from behind. I got within 30 yards of it when my wife called out to me and it turned it's head.",
  "classification": "Class A",
  "county": "Cowlitz",
  "state": "Washington",
  "latitude": 46.3758,
  "longitude": -122.5855,
  "location": "-122.5855,46.3758",
  "location_details": "It was on the right hand side of the highway when you are going down the mountain away from Mt. St. Helens",
  "temperature_high": 63.99,
  "temperature_mid": 56.715,
  "temperature_low": 49.44,
  "dew_point": 44.82,
  "humidity": 0.69,
  "cloud_cover": 0.42,
  "moon_phase": 0.22,
  "precip_intensity": 0.0004,
  "precip_probability": 0.55,
  "precip_type": "rain",
  "pressure": 1011.75,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 9.75,
  "wind_bearing": 324,
  "wind_speed": 2.54
}