{
  "reportId": "3820",
  "title": "Sasquatch evidence near Mount McLoughlin",
  "date": "1979-10-01",
  "timestamp": 307584000,
  "observed": "My Big Foot Sightings over the years. My first introduction to Big Foot was about 1965.  A series of articles appeared in the Portland Oregonian, the Salem-Statesman Journal, the San Francisco Chronical, and at least one other. I saved these articles in a folder as sort of a Jr. High science project.  We even talked about it in class a couple of times with much scoffing by the teacher even though he did say there are many things which science does not understand, or has even discovered. One of the articles from the Chronical stated that a young bigfoot had been captured in the late 1880's and put in a freak-side show. According to the article could break a stout hard wood stick about 3 - 6 inches in diameter like a matchstick.  For some reason or other it died and the body disposed of.  How it was disposed of or where, was unknown.  Apparently the animal was in the sideshow in a steel barred cage for a few years.  Just how many years that few was is also unknown. An artists drawing was also printed and supposedly dated back to the time this thing was caged.  According to the newspapers these articles were dated back to the 1880's. There was also a story from the Oregonian that a well known scientist from the University of Oregon had announced he was going to attempt contact with these beings by parachuting into the wilderness somewhere between Grants Pass and the Kalmiopsis Wilderness area..  I believe that in the late 1970s or early 1980s, an expedition was formed to go out and look for the scientist. I remember reading that remnants of his tent and a very old campsite were found, but there was no sign of the scientist himself.  Who knows! There were also stories about mysterious attacks that occurred during the construction of Interstate 5 near the top of Mount Ashland.  In 1964-65, Workers found several earth movers with the tires and wheels completely ripped off the machines.  HUBS and all.  A man who had been a close friend of my familys' in Klamath Falls before we moved to Ashland, worked at Pape Cat in Medford.  They had the contract to repair and maintain the equipment used for construction on the road.  He told us that (this was confidential) something had ripped the wheels off, AND 55 gallon drums had holes punched in them like a big fist.  He said the state police were investigating vandalism, but since it would have been very hard for any humans to get to the equipment and no human had that kind of strength or ability, they were not sure what they were dealing with.  The investigation died for lack of evidence and construction continued.  It was not an isolated case.  That same kind of incident happened three or four times.  Then, AFTER the highway was completed into California, the story was told of a man  traveling North in a blinding snow storm over the top of the Siskiyou Pass or summit.  He claims he was headed down the mountain towards Ashland when suddenly something landed on the hood of his car.  The snow was more like a blizzard and the headlights were reflected back at him.  He saw a shape like a human, and a face looking at him through the windshield.  He thought he had hit someone.  After a second or two, the thing rolled over and off the hood disappearing into the snow and the night.  When the man got to the South Ashland Exit, he went into a gas station.  He told the attendant to fill it up while he got a cup of coffee.  He was really rattled, and did not tell anyone he had probably killed a person.  When he came back with coffee, the attendant asked how the hood on the car had gotten such a huge dent right in the middle and he wondered what all the hair around the edge of the hood was.  At least, to the attendant, it looked like hair.  Those, such as they are, were the stories reported in the newspapers in 1965 and 1966.  Check the Ashland Daily Tidings.  My first experience with bigfoot came in early 1966.  A friend and I, both 15, decided to hike up the old Ashland Mine Road.  We had a Boy Scout camp coming up in April or May of that year and wanted to prepare for a 5 mile hike we knew was coming.  My mother drove us to the top of Mountain Street where the Ashland Watershed is.  We found fresh snow on the ground about 3 or 4 inches deep.  There were other people sledding.  My friend and I began hiking.   The snow was fresh and there were NO TRACKS IN THE SNOW AHEAD OF US.  Remember that.  NO TRACKS ....PERIOD! We hiked up the road with many twists and turns as it climbs up the mountain side. Near the end of the second mile, we came to a climbing right hand 90 degree turn.  As the road leveled out we came upon some tracks.  BIG tracks.  My friend and I stopped and looked around thinking perhaps some other human was in the area.  But as we compared our prints side-by-side with those we found, we realized these were not human.  There was about a 3-4 inch difference in foot size. I wore an 11 size boot.  In other words, these tracks were HUGE in  comparison. They were not bear tracks.  And the strides were not human either.  From the tip of the toes to the heel of the footprint ahead, was about 9 - 10 feet.  It was hard to measure since we were not carrying a measuring tape NOR were we expecting anything like THIS!  When we put the heel of our boots next to the toe of the footprint; and stepped off the distance between THE PRINTS it was nearly three paces, or 9 feet .   We tried to stretch our steps to match, but there was no way we could reach that far in one single step. We observed what appeared to be three pads at the front of the print, sort of like pads a dog has under its claws.  One was kind of shaped like a peanut, but I can not remember which side of the foot the pad was.  Either the right front quadrant or the left front.  Anyway, we began to get frightened.  The hair on our necks was standing up and we both got the creeps.  My friend looked at me and said I will bet these are big foot tracks;  I said it could not be, not this close to civilization, especially since down the hill to our left about three quarters of a mile were some secluded homes on the Southern edge of Ashland.   My friend looked at me and said the area where we were standing was considered rugged mountains and bigfoot lives in areas like that.  That did not help my frame of mind any. We observed  the animal had come down a 10 - 12 foot embankment, about a 15 degree incline.  We both began to suspicion someone was playing tricks on us, but we could not figure out who since no one except our parents knew we were out there.  We plucked up our courage and continued on up the road following the foot prints.  We followed the tracks about another two miles.  As we came up around another climbing 90 degree turn to the right we observed the tracks had stopped and the animal appeared to be looking back down the road towards us.  We then observed little clumps of snow rolling down the 8 foot embankment to our right.  And the bushes at the top were wiggling.  The brush at the top of the embankment was pretty thick and this thing could be hiding behind the brush up there.  We took one look at the tracks, the snow coming down embankment and the moving brush, AND realized that what ever it was had JUST JUMPED UP the hill.  There were no tracks from the side of the road to the top of the embankment.  We decided to,  as they say in the Army, UnA- - the area.  We departed in haste, over the highside; to our left and down the hill as far and as fast as we could go.   We decided not to mention this to anyone because they would not believe us.  My next encounter came a few months later.  As my friend and I prepared to go on this Boy Scout outing we pledged to keep our silence about the previous experience.  In late March or early April of 1966 we went with our Boy Scout leaders, one of whom worked for the U.S. Forest Service.  We went out into the woods behind Talent Oregon.  It was somewhere around 30 miles or so into the brush; as we liked to call it.  Out there is an old trapper's cabin that the Forest service used as a shelter or a campsite when doing surveying work.  The building itself was said to be historic but usable.  We set up our tents within 20 - 30 yards of the cabin, but my friend and I got into an argument with the leadership and decided to put our tent on the far side of the cabin by ourselves.  We had a meeting around a big campfire when it got dark, we ate dinner and then the leaders decided to take us on a snip hunt;.  After about an hour or so, of wandering around in the brush for several hundred yards, much shouting and yelling, we headed back to the camp. My friend and I built a campfire outside our tent and roasted some marshmallows.  The leader came by and told us to get to bed as we needed some sleep for the 5 mile hike the next day.  As we got into our sleeping bags, my friend made the remark that he hoped no bigfoot(s) would bother us.  That got my attention.  About 30 minutes later we were snuggling into our bags when this big shadow went between the fire and our tent.  We both saw what appeared to be a shaggy-somewhat stooped over figure walk between the fire and the tent.  At that point we got very acquainted with the bottom of our sleeping bags.  We laid there wide awake and SCARED to death.  At one point I noticed that my sleeping bag was under the tent, OUTSIDE of the tent.  I scooted back up as far as I could go to get back inside when my air mattress scraped across a nail sticking out of the back pack and POW; the mattress exploded.  It scared the .... out of us both and my friend nearly killed me.  It is funny now and you can laugh at is now, but then it was terrifying.  I was afraid this Thing; outside was waiting to get me.  As I look back on it now, I realized that IF it was a bigfoot, its curiosity was simply that....curiosity.  IF indeed it was a bigfoot, it simply went between the fire and the tent on its way to somewhere else. Very early in the morning, near daylight, we heard a banging in the stable attached to the Trapper Cabin.  We thought it might be one of the other boys looking for a place to go to the bathroom.  When we got up, we looked out and saw nothing, so we checked the fire.  Sure enough there were several big prints in the soft earth about 5 feet from the fire.  We tried to tell our Boy Scout leader what we found, but he laughed and said he had been over there.  We asked when, he said about an hour AFTER we went to bed and AFTER when we had seen the shadow.  His prints were closer to the tent than the prints of the shadow.  That was in the Spring of 1966. My next encounter came in 1970.  I was working for the Forest Service as a lookout on Mount Emily, just outside Brookings Oregon.  You can look up at Mount Emily from Brookings. It was only about 10 miles in a straight line, as the crow flies, but by road, it is about 60 miles.  I had a black lab I called Bucky.  He lived with me on the tower.  This was a 25 foot tower from the ground to the catwalk.  One evening in July, I had to go down the mountain because I had a Doctor appointment and I needed to get some groceries.  I locked Bucky on the tower with the intention of being back on the mountain early the next morning.  Buck did not like being alone, and he apparently jumped OFF the tower.  When I got back the next morning, Bucky was gone.  I called and called, looking for his tracks but I found nothing.  It got lonely up there for the next two weeks.  I presumed Buck was badly injured in his jump and had crawled off somewhere and died.  I gave up hope.  About 10 days later, I heard a noise in the late evening sunset down off the hill I was on, and sure enough I saw Bucky.  He was very tired and worn out.  He was panting so hard I thought he was gonna die.  I carried him up the tower and into the chart room and laid him on the bed.  After about an hour he got up and went to drink.  He drank three full bowls of water before he was done.  He crawled back up on the bed and went to sleep.  Now, Buck never and I mean NEVER barked or growled.  He just did not.  He was so mild and good natured he just did not carry on like most dogs.  That is why he was such a great companion. After that incident, he NEVER left my side.  He stuck to me like glue.  He did not want to be left alone.  If I had to go to the outhouse, he would sit outside the door and whine until I was done.  He was scared, very scared.  He took to sleeping UNDER my bunk.  He never did that before. He would also take to barking in the early and late evenings.  He would stand there on the catwalk looking down at the mountain to the Southwest and bark and bark and bark.  He had never done that before either.  About 2 weeks later, in the early evening, I was scanning the woods with my binoculars when I heard a ripping, tearing sound.  The kind of sound a dead tree makes.  It was not a widow maker falling because it was not a thump.  It sounded more like the sound you would hear ripping up a dead rotting tree.  I knew it was not a bear opening up a dead tree looking for grubs, because there are NO BEARS on that mountain.  The Indians used to bury their dead up there and called it the mountain of the GODS because it seemed to be always enshrouded in fog or clouds.  In fact, the only animals I ever saw up there in the two years I spent on the mountain as a look out were a few rats, a couple of chipmunks and me.  Occasionally I would have a human visitor but most  of the time, I was totally and completely alone.  I went down the tower and walked in the direction of the sound.  I searched for quite some time, while Bucky stayed on the tower and barked.  He was really frightened.  I had my rifle with me, but I never found where the sound came from, nor did I see any sign of what made the sound. Several days later, late in the evening, about 10:30 or so, we were both trying to sleep.  The full moon was setting on the horizon and the whole tower was lit up.  It was very warm, the temperature had been in the high 90's for several days.  I opened the windows to let whatever breeze there was flow through the windows and out the door.  As I laid on the bunk, there was a huge boom; and the whole tower Shook. It felt like a car had run into the tower or perhaps a sonic boom.  But the tower shook FIRST.  Something had hit the tower.  My first reaction was to grab my gun, because several of the other lookouts in the district around Grants Pass and Cave Junction had been getting potshots by environmentalists and pot growers.  Word and been quietly spread by forest service officials that while it was NOT an official order, we could if we were so inclined, arm ourselves for protection.  Since we were so far out in the boonies, it would take hours for anyone to come to our aid, even if we did call in by radio for help. I crawled out the window to the catwalk and belly crawled around the tower looking to see if anyone might be down below. Bucky was under the bed with every hair on his body standing straight up and growling so deep in his throat, I thought he was going to bleed.  I have never in my life had seen an animal so scared.  He actually evacuated poop, and urine right there on the floor under the bed.  His eyes were actually drained of all color, much like those of a husky.  The iris was actually white.  He was scared to death.  It took me hours to coax him from under the bed, and he hardly recognized me.  I remember I had NOT seen any car lights approaching the mountain, and since the last 2 miles of the road could only be traveled by foot, four wheel drive or mountain bike, I knew that few, if anybody, would be nuts enough to make that climb in the dark, let alone during daylight.  Those boulders were big enough to rip wheels off, or oil pans out of a vehicle unless great care and skill were used to get up that road during the day, let alone at night.  Whatever it was had slammed the tower and disappeared.   Now, let me say this: the lookout tower, which is gone now, stood at the top of the mountain and had a good 360 degree view of the ranger district in all directions.  As you look due West, the mountain goes out about 50 - 60 yards and begins to drop off to the Chetco river below.  To the North and a bit east, there is a sheer drop off to where Anaconda Mining used to have their mine site.  To the Southwest the mountain slopes off and down and is covered not only by large river rock or perhaps tailings, but also by dense, thick hairy manzanita.  This stuff will rip the clothes off your back in nothing flat.  The only way to get through it is with a bulldozer or what we used to call tin Pants, heavy canvas clothing.  To the East is the road up the mountain and more thick underbrush.  The sparsely located trees on this mountain were, at that time, not much over 16 - 18 feet tall.  The brush, manzanita, was anywhere from 2 - 6 foot high, and very densely packed. The rocks covering the site of the tower ranged from a few centimeters to up to 10 inches long.  They were from a few inches to about 8 or 9 inches thick.  In other words these rocks were not 5 or 6 foot in diameter boulders.  When I went down the tower the next morning about 6:45 to get water, I checked the Southwest leg of the tower, where the slamming had come from.  The only tracks; I found were not tracks per se as you would find in dirt or mud. Rather they were imprints of something big shoving off, like the type you find in gravel.  What ever it was, it had hit the tower, with its arms, hands, body...but no implements like a log, or a rock, since there were no indents in the wooded leg of the tower.  Then after slamming the tower, it had shoved off in hast to depart the area.  AND .... IT had gone off the southwest side of the mountain through the densest part of the Hairy Manzanita.  I remember looking for any kind of evidence that a human might have left but saw nothing, not even hair or other bits of debris.  It was spooky, like a ghost had attacked and left. My experiences with bigfoot were put on hold for several years after that since I went to college and joined the Army in 1971.  It was not until I got out of the Army in 1977 and returned to Oregon that my destiny seemed to bring bigfoot back into my life.  I had forgotten all about bigfoot by this time.  Oh sure, I remembered the incident(s); as I called them, but they were not something I dwelled on. Its now deer hunting  season, 1978.  I am living in Klamath Falls, and decide to go hunting to put meat on the table.  I drove to the base of Mt. McLoughlin, (Mt. Pitt) parked at the trailhead, got my weapon and my gear and started up the slope.  Several hundred yards up the hill there is a saddle the trail goes through as you head in a southwesterly direction.  Off to the right is a small pond or lake.  Being behind the mountain away from the sun, it was sort of dark, more like twilight.  I stood at the edge of the lake wondering if there were any fish in it.  I looked around and realized I was in sort of bowl shaped area.  Off to my left was what appeared to be a dead-burned out snag about 8 or 10 feet tall.  It was all black and just There.  Across the lake from me, the embankment rose up about 10 feet with slick leaf brush all over it.  I tried to figure out how to get around this obsticle without making too much noise and headed off to go up the hillside to find a stand.  I figured the deer might head this way to get to water and perhaps I might get a shot.  After about 15 minutes, I began to realize that daylight was going fast and I could not see well enough.  So I gave up and headed back to the car and try it again another day. A bit earlier next time.  As I approached the lake I thought I heard something and stopped to see if there were any deer lurking about.  That is when I noticed that the dead-burned out snag that HAD been standing up the little embankment on the south side of the lake was now GONE!  I got a good case of the heeby-jeebys and fled the area.  I thought about it later and discussed this with a friend of mine.  He suggested I had seen a bigfoot.  I said he was nuts.  Big foot lives in the Siskiyous, not the Cascades.  He laughed and told me I was an ignorant bas----.  He said bigfoot lives all over the mountains in Oregon and was not just confined to one or two areas. I thought about that and it made sense. A few days later, this guy and I both decided to go hunting up near Cherry Peak, to the North of Mt. Pitt.  We hunted all over the top of Cherry Peak, especially in the saddle between the peak and a ridge to the West.  We found a herd of Elk about half way down a valley that becomes a draw, and we hunted to the head waters of Cherry Creek.  We only saw the Elk, but no deer and NOTHING ELSE!  We drove back down Cherry Peak road, up the main highway toward Ft. Klamath, till we got to Cherry Creek road.  We drove up this road as far as we could.  It was getting dark by then so we turned around and decided to stop and relieve ourselves.  While we were standing there enjoying the evening, I felt we were being watched.  He looked up at me suddenly, and his eyes asked the same thing I was feeling.  Do you feel that?  We both turned around and began scanning the underbrush close by the road where we were parked.  I did a dumb thing, but it was the only way to resolve this feeling.  I took my .44 out of its holster and fired a round into the creek bout 20 yards up the road.  Within 10 seconds the sound of the blast died away, as did the feeling we were being watched.  We both realized the hair on our necks were standing up and our skin was crawling.  We did NOT have the same reaction to the Elk.  Nor did we ever have that same reaction to other animals in the woods.  We both looked at each other, knew what the other was thinking....BIG FOOT!  We quickly and quietly got back in the car and got out of Dodge.   In 1983 while at the doctor's office one day for an upper respiratory infection and while my wife got her pregnancy checked, I spied an OLD Indian.  I waited a few minutes, and when my curiosity got the better of me, I said excuse me, are you of the Klamath Tribe.  He looked at me and said yes.  I then explained my curiosity about big foot.  He smiled and said, oh yes, there is such an animal and it lives all over the area.  I said are you sure? It is being so elusive and all...  He said he had seen bigfoot several times and began going on about how the Indian believes it is a spirit and such.  He then told me a story, about a big foot that allegedly lives up near Scott Mountain, or Mt Scott.  He said he and his father, brothers, and uncles were in that area hunting and on a vision quest; one time when he was younger.  This old gentleman said that one evening while they were all sitting around a BIG campfire talking, that a doe suddenly came running, not bounding, or bouncing, but RUNNING THROUGH the camp fire.  It was running to get away from something.  That it was something; was about 3 yards behind the doe and swinging a big club trying to KILL the deer.  This gentle old Indian man said that the sight came as such a surprise that all the men went over backwards on the logs they were sitting on, as this bigfoot came hard charging after the deer, right through the fire, swinging this club at the deer, totally ignoring the Indians sitting there. He kinda laughed and said it is true.  He left then as his turn came to go in to see the doctor.  He also left me with many unanswered questions. Over the years since then, I have found out that I can sense the presence of many types of animals while I am out in the woods.  I can sense when a man is near, a deer, an elk, a bear....and a big foot. Now, while this may seem like fiction or a flight of fancy, let me assure you that after nearly 40 years in the radio and television news industry, I have never sought to have myself noticed.  Just being on the microphone does that enough.  I do not go around talking about these incidents unless the person I am speaking with has either brought up the issue, or the subject has come up WITHOUT me starting the conversation.  As a newsman, I MUST deal in facts to maintain any credibility for the news I report on to be truth.  I MUST deal in truth. True, some of these incidents happened a long time ago, but the reality of these incidents is as clear as though it happened yesterday.  They were so unusual, so out of the ordinary, that it would be hard to make up this kind of story.  I have heard many others speak of these beings in events which happened on farms and ranches, or to hunters in the mountains and wilderness of the southern Oregon and northern California areas.  They are so numerous and cover such a time span that one would be hard pressed to ignore the evidence from these people's lips or the fact that these events DID happen.  Do I believe in bigfoot....HELL YES!  Do I understand what they are or where they came from, NOT HARDLY!.  All I and many others who have lived here all our lives KNOW is that they are there, they are not necessarily violent, nor are they a danger to anyone but the occasional odd deer or other wildlife they chase or hunt for food.  Are they ignorant?  To our way of life yes, but to their way of living they are very intelligent and they do survive.",
  "classification": "Class B",
  "county": "Jackson",
  "state": "Oregon",
  "latitude": 42.4356,
  "longitude": -122.2328,
  "location": {
    "longitude": -122.2328,
    "latitude": 42.4356
  },
  "location_details": "Lower elevation area lakes and valleys near Mount McLoughlin",
  "temperature": {
    "high": 79.32,
    "mid": 64.18,
    "low": 49.04
  },
  "dew_point": 42.37,
  "humidity": 0.48,
  "cloud_cover": 0.3,
  "moon_phase": 0.35,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.87,
  "summary": "Partly cloudy until evening.",
  "uv_index": 3,
  "visibility": 9.45,
  "wind_bearing": 348,
  "wind_speed": 5.54
}