{
  "id": "13038",
  "title": "Snowmobiler has encounter in deep snow near Potter, AK",
  "date": "2004-02-15",
  "timestamp": 1076803200,
  "observed": "I and two of my friends were bored one night so we decided to do a little snowmachining. Though it was illegal to snowmachine in Anchorage, there were some good trails to ride on a little north of my house. We took off at probably 11 pm, rode up the road about a quarter mile, and cut off on the trails. It had snowed about 10 inches a few days before so there was fresh snow, with no tracks. I was leading the way for about a half hour, then we stopped and talked for a little bit.  We took off again and kept cruising on some sort of game trail that led to an opening in the woods.  I rode off into the opening with my friends following about fifty yards behind me. I came over this little mound and saw strange tracks leading to this spot in the snow where it looked like something had pushed aside some snow and layed down.  I figured it was just a moose or something.  But I followed the tracks over the next small hill and as I came down the far side my headlight pointed right on the back of a bigfoot. It was only about 10 to 12 feet in front of me.  It was running in the opposite direction.  I slammed on the brakes because I was scared out of my mind.  It continued to run away, jumped over a dead log covered in snow and disappeared into a group of trees and into the darkness. I was so surprised and scared I quickly turned around and rode back toward my friends. I met them back by the first mound and said \"We need to get out of here,\"  and rode back towards my house.  When I told them about it back near my house, they laughed and told me it was probably a bear or someone in the woods.  But I was 100% positive that is was not a bear or anything else. The way it was running through the deep snow made me sure that it wasn't anything human.  For a long time I was made fun of and everyone told me I was crazy so I didn't like talking about it.",
  "classification": "Class A",
  "county": "Anchorage",
  "state": "Alaska",
  "latitude": 61.0595,
  "longitude": -149.7853,
  "location": "-149.7853,61.0595",
  "location_details": "Up near powerline clearings east of Potter Marsh in Anchorage.",
  "temperature_high": 30.56,
  "temperature_mid": 20.855,
  "temperature_low": 11.15,
  "dew_point": 18.61,
  "humidity": 0.84,
  "cloud_cover": 0.17,
  "moon_phase": 0.84,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1009.02,
  "summary": "Clear throughout the day.",
  "uv_index": 1,
  "visibility": 9.25,
  "wind_bearing": 26,
  "wind_speed": 2.7
}