{
  "id": "30896",
  "title": "Second nighttime sighting by motorcyclist north of Marseilles",
  "date": "2011-10-20",
  "timestamp": 1319068800,
  "observed": "Earlier this year I had a sighting near Marseilles, Just this past week I had another sighting in the same area, just a bit further down the road. Again I was coming home from work on the motorcycle, it was about 2:30 a.m. I made my left turn onto Marseilles Blacktop off Route 71. Since my last sighting I take those curves much more slowly, and keep a good watch on the fields. I was coming around the second curve and I noticed a strange eye shine about 100ft ahead of me to my left (east side of the road). What caught my attention was the size, color, and height of the eyes. They were quite large, much larger than a deer, and yellow. There is a small hunting area on that side of the road that borders the corn. These eyes were right on the edge of the corn and the hunting field. This time I slowed down. As I got closer I could make out a large human like figure, about a foot taller than the corn. It began walking slowly away from the road and turned its head and looked east. As I got even closer it looked back at me, then walked into the corn. This time around it did not make any sounds, nor did it seem too concerned about me.",
  "classification": "Class A",
  "county": "La Salle",
  "state": "Illinois",
  "latitude": 41.4209,
  "longitude": -88.706,
  "location": "-88.706,41.4209",
  "location_details": "South of Route 71 on Marseilles Blacktop (County Hwy 15) just past the second curve heading south.",
  "temperature_high": 47.99,
  "temperature_mid": 40.23,
  "temperature_low": 32.47,
  "dew_point": 35.31,
  "humidity": 0.7,
  "cloud_cover": 0.89,
  "moon_phase": 0.77,
  "precip_intensity": 0.0029,
  "precip_probability": 0.69,
  "precip_type": "rain",
  "pressure": 1005.42,
  "summary": "Breezy in the morning and overcast throughout the day.",
  "uv_index": 2,
  "visibility": 9.95,
  "wind_bearing": 315,
  "wind_speed": 13.53
}