{
  "id": "5702",
  "title": "New Year's Eve, two cousins observe creature watching them",
  "date": "2001-12-31",
  "timestamp": 1009756800,
  "observed": "This sighting report was originally submitted by the witness' mother. I contacted the witness and spoke with her about her sighting. She told me that on New Year's Eve, she and her family were at her uncle's house shooting fireworks. She and her cousin were playing with cap guns and had wandered towards a wooded area on the back of her uncle's property. The witness stated that when she looked back into the trees, she could see something very large, standing half behind a tree looking at her and her cousin. She described it as being \"furry\" with red eyes. Her cousin also saw the creature. They both turned to run back to their parents and the witness said when she turned back the creature was walking away on two legs. She further stated that it was walking funny and appeared to have a limp. When I asked her what she meant by walking \"funny\" she told me that it walked somewhat like an ape would walk. She and her cousin both ran back to their parents and began telling them about what they'd seen but she said her uncle started making fun of them seeing a \"bogeyman\". A few minutes later she and her cousin, using a flashlight, went back to see if they could spot the creature again. She said that upon their return, it had apparently left because they didn't see it.",
  "classification": "Class A",
  "county": "Leon",
  "state": "Florida",
  "latitude": 30.4836,
  "longitude": -84.20835,
  "location": "-84.20835,30.4836",
  "location_details": "East side of Tallahassee. North of Mahan Drive.",
  "temperature_high": 50.55,
  "temperature_mid": 41.265,
  "temperature_low": 31.98,
  "dew_point": 23.82,
  "humidity": 0.52,
  "cloud_cover": 0.46,
  "moon_phase": 0.54,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.98,
  "summary": "Partly cloudy until evening.",
  "uv_index": 2,
  "visibility": 9.81,
  "wind_bearing": 359,
  "wind_speed": 5.29
}