{
  "id": "1109",
  "title": "Campers hear vocalizations near Clear Lake",
  "date": "2000-07-15",
  "timestamp": 963619200,
  "observed": "It may seem a little bit late to be reporting this, but it just recently occurred to me that it may be of some help to those who are tracking bigfoot. I was camping with a friend of mine. I'm not quite sure how far up we were, although I know we had just followed logging roads up to a spot near \"Clear Lake\". We were awakened early in the morning (approximately 5am) by howling and screaming all across the forest - we assumed several beings were trying to communicate with one another. I have spent most of my life living at the edge of a national forest and have spent much time hiking in the wilderness. I am familiar with the many strange mating sounds of deer, elk, bear and other creatures - and the sound we heard that morning absolutely wasn't recognizable to me until I listened to some sound bites of bigfoot howls online. This next detail may or may not be relevant since it is quite inconclusive, but I'll mention it nevertheless. As we began to stir around 7:30am and decided to continue with our plan to take a hike through the woods, a large, dark, agile creature ran crashing into the forest as we approached. I cannot in that case be wholly certain that it wasn't simply a bear that had simply come a little too close for its own comfort. We were the only campers in that particular area that night, although I'm sure there were others within a one or two mile radius of us, since a dog barked incessantly during the howling earlier that morning.",
  "classification": "Class B",
  "county": "Chelan",
  "state": "Washington",
  "latitude": 47.29833,
  "longitude": -120.3,
  "location": "-120.3,47.29833",
  "location_details": "I don't know many street names because I'm a local, so directions would be difficult to follow and riddled with landmarks. The area is quite easy to find on a map of this region. Clear Lake is a well known spot and can be reached either by going in back of Stemilt Hill via Malaga or behind Wenatchee Heights - both of which I think take you to Stemilt Loop Road. You must turn off the main road and drive on windy/poorly maintained forest service roads for a few miles.",
  "temperature_high": 81.38,
  "temperature_mid": 66.87,
  "temperature_low": 52.36,
  "dew_point": 42.31,
  "humidity": 0.45,
  "cloud_cover": 0.04,
  "moon_phase": 0.48,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.62,
  "summary": "Clear throughout the day.",
  "uv_index": 9,
  "visibility": 9.96,
  "wind_bearing": 322,
  "wind_speed": 4.53
}