{
  "id": "912",
  "title": "While observing a footprint,  youth looks off the path to see shiny haired creature looking at him",
  "date": "1978-08-15",
  "timestamp": 271987200,
  "observed": "The year was 1978 when my family and I took a summer camping trip to the Natural Bridge State Park. The park is located deep in the Daniel Boone National forest, about 52 miles southeast of Lexington, and about 2 miles east of  the town of Slade. I was only 10 years old at the time and was totally oblivious to the word, bigfoot. We drove to the park from the city of Frankfort, the passengers (in 2 separate cars)  included my Mother, step dad, younger sister, Aunt, Uncle, and a family friend.  We arrived at the park a couple of hours before dusk and proceeded to secure a camping lot. After setting up the 2 tents we had brought, everyone became thirsty. Upon searching for the drinks we'd brought along, my uncle discovered that one of the coolers was almost out of ice. It was the month of august and the humidity was very high, so we needed the ice.  I was the one chosen to get ice at the community lodge, about a half of a mile away from our campsite. It was just about dusk when I set out on the muddy road by myself to get the ice. I remember walking from a left to right direction, the road had a steep hill on the left hand side and a small stream paralleled it's right side, though it was lower than the road and resided in a ravine. About halfway to the lodge, the first thing I can remember was the awful smell. I had smelled dead animals before and figured that's what was causing the odor. I knew that whatever was responsible for the odor, it  had to be very close, because my eyes were beginning to tear up. It was at that time that I stopped dead in my tracks, because right in front of me was the biggest foot print I'd ever seen. It was so big that there was only one of them, directly in the center of the soft muddy road. It was a bare footprint, complete with the impression of 5 toes. Whoever made this footprint had come down from the steep slope on the left and gone down a shallow embankment on the right and into the stream. I leaned over and began studying the print and it's enormity. It was nearly as big as I was, or so it seemed at the time. That's when I remember having this alarming feeling that someone was watching me, I kept studying the print and trying to find a matching print somewhere, but couldn't. I couldn't figure how someone could only leave one footprint and why they weren't wearing shoes. Upon following the path this person must have taken, my eyes made contact with a dark figure from between 50 to 80 yards away from me on the other side of the stream. What I first thought was a tree, suddenly moved. I honestly couldn't say how tall it was, because it was standing in a ravine and was some distance from me, not to mention that it was starting to get dark, I was only ten years old, and it was 22 years ago. Evidently, it had been standing there for the minute or so  I studied the footprint, and had been watching me. It only moved when It noticed me looking at it, and it very quickly disappeared into the tree line it was standing next to. My visual observation of this creature lasted about 3 seconds at the most. All I can say is that it was covered with dark hair all over. It was kind of shiny, like greasy hair, at least it appeared that way in what light was left. It walked on two legs, and very well I might add, it seemed very graceful. It had long arms that appeared to hang as far down as it's knees, and they swung as it walked. As far as height, I can say that it was as tall as a few of the smaller trees it stood next to, but I don't know how tall they were either. While observing the creature, I don't remember feeling threatened in any way, it was only afterward, when I had time to think about the experience, that I felt afraid.  After observing the creature disappear into the woods, I immediately turned back toward the campsite and ran all the way while yelling for my Step Dad and uncle. They thought that I'd made the whole thing up, that I had concocted the story as an excuse for not wanting to get the ice. Laughing all the way, they offered to escort me to the lodge. Half the way there, they were silenced by the discovery of the footprint, but their silence was only short lived. My uncle was the first to crack a joke, \"they sure do grown them big around these parts.\" They were forced to admit that it was an extremely large footprint, in fact, it easily doubled my step dad's size 10 1/2 foot.  Since it was now dark, we hurried along to the lodge and back to the campsite with our flashlights. My Uncle convinced me that I had seen a black bear. I had never seen a bear in person before so I didn't know the difference at the time. I've now seen many black bears, in the wild and at zoos, but I have yet to see a black bear walk as swiftly or as gracefully on two legs as the creature I saw that august night of 1978. In fact, I have yet to see a black bear walk on two legs at all, I've seen them stand up, but not walk. The arms on the creature I saw were definitely longer than those of any bear.",
  "classification": "Class A",
  "county": "Powell",
  "state": "Kentucky",
  "latitude": 37.7764,
  "longitude": -83.67952,
  "location": "-83.67952,37.7764",
  "location_details": "From Lexinton, take I-64 east until you reach the Mountain Parkway, from there just follow the signs to Slade. At Slade take Ky highway 11 2 miles to the park.",
  "temperature_high": 87.24,
  "temperature_mid": 79.85,
  "temperature_low": 72.46,
  "dew_point": 69.95,
  "humidity": 0.79,
  "cloud_cover": 0.34,
  "moon_phase": 0.4,
  "precip_intensity": 0.0002,
  "precip_probability": 0.15,
  "precip_type": "rain",
  "pressure": 1018.07,
  "summary": "Humid throughout the day and partly cloudy starting in the afternoon.",
  "uv_index": 7,
  "visibility": 5.84,
  "wind_bearing": 174,
  "wind_speed": 4.36
}