{
  "id": "41350",
  "title": "Campers on Mount Graham experience possible intimidation behavior",
  "date": "2013-05-26",
  "timestamp": 1369526400,
  "observed": "Memorial Day weekend 2013.  Arrived with my husband and two kids to Cunningham site Mt Graham on May 25 2013.  Two relatives campers were already at the site set up.  We only had a 5 person tent and a car.  May 25 was uneventful we camped, ate walked two dogs had birthday party at night with son.  May 26, got up early spent time in camp having coffee, did normal camping activities, except around 1030 am went for hike with my husband, daughter(12), son(11).  Our campsite was in front of the restrooms at Cunningham site and we hiked the trail behind the restroom on the right. Walked to trail for less than a block and stopped in front of wild raspberry bushes.  My husband commented on how he used to go eat these when he was a kid camping in the Graham's.  Started walking again, went up a hill, my daughter hit her walking stick on a tree. Seconds later, a large tree is heard falling up in the forest nearby at top of hill above us.  We walked a short way and then decided that it was too steep and turned around.  Went back to raspberry bush and took pictures for a few moments.  Went back to site as we were walking back I was in the back of the group and heard a twig snap behind me as if someone was there.  I turned around to watch but nothing was seen.  This occurred twice.  Went to camp had uneventful day.  Went to bed in our tent around 9 pm.  One camper that was behind our tent (we had our tent on the corner of the road by the bathrooms.) went home in the early afternoon.  With one camper left to our left, we were close to the forest by the bathroom.  We went to bed, opening of tent was to the forest.   Slept on the left side on a cot.  Dogs and kids went to bed quickly.  I finally nodded off to sleep.  Around 1 or 2 am my husband woke up and needed air.  He stepped outside the tent with his flashlight and was there for about 2 minutes.  As he came into the tent his flashlight was shining around the tent. Seconds later a person's figure was seen walking quickly in front where my husband was just standing.  My daughter and I were both awake and said \"someone is outside\". She heard slipper feet nearby the tent on the road. We went back to sleep.  I awoke later do not know what time to hear someone behind the tent eating. There is no vegetation just trees.  It was chewing and lip smacking loudly, like someone with no manners.  our tent has side panels which are open but with a tarp on top of our tent because the night before was very cold.  I could tell that it was tall because it was above me, and tried to listen to identify it. No bear, no deer not footstep sound.  About 15 minutes later, a sound was heard down the road.  The chewing stopped.  Resumed chewing a minute later. This went on for awhile, no other animal sounds, no birds even though a mexican whippoorwill was singing all night the night before.  I turned toward the sound and smelled out the netting and it smelled like an animal.  Later, a sound was heard in the distance like someone was out of there camper door.  The chewing stopped, the thing was gone without a sound, no footsteps.  I went back to sleep. My family talked about it the next day, but went on with our activities and left that day. I had no knowledge of bigfoot in southern Arizona prior to looking it up a few days after getting home.  My friend joked when I got home that if was Bigfoot.  I went on line to look up Mr. Graham bigfoot. What a surprise I got.  My husband does not believe in any of this, no bigfoot, ghosts, see contact info below.",
  "classification": "Class B",
  "county": "Graham",
  "state": "Arizona",
  "latitude": 32.70631,
  "longitude": -109.9134,
  "location": "-109.9134,32.70631",
  "location_details": "Cunnigham site, in front of restrooms on corner",
  "temperature_high": 91.49,
  "temperature_mid": 74.23,
  "temperature_low": 56.97,
  "dew_point": 11.44,
  "humidity": 0.1,
  "cloud_cover": 0,
  "moon_phase": 0.56,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1010.23,
  "summary": "Clear throughout the day.",
  "uv_index": 16,
  "visibility": 10,
  "wind_bearing": 252,
  "wind_speed": 5.82
}