{
  "id": "1345",
  "title": "creature leaned on the hood of a car.",
  "date": "1997-10-16",
  "timestamp": 876960000,
  "observed": "Panola,Co. near the town of Batesville,Miss.A big foot was spotted on a country road on Oct. 16th about 12:30 A.M.1997. Approximately a week later foot prints were found near Tupelo, Miss. and reported on the Tupelo News . There was a close encounter with this creature for about 5 mins.The creature proceeded to cross the country road and came to a halt in front of my car.I viewed the creature for a moment trying to identify what I was viewing , I then brighten my lights and this appeared to anger the creature.Then it proceeded towards me quickly to my car and bumped in to the car causing the car to move backwards and was leaning on my hood screaming a very high pitched sound.I was so terrified I was finally able to get my car in reverse,and get around him , which was obvious it was a male. the creature seemed to be about eight feet tall and may have weighed 400 Lbs.This creature had black hair all over about 2 or 3 inches long.the face and chest area were bare.The skin seemed to be a grayish tone . It had a greenish yellow eye  glow. The face was wrinkled with a broad nose.The head was pointed and appeared to have almost no neck.Very broad shoulders and large muscle.As I managed to get around the creature I could still hear it screaming in the distance.This is an event that will be with me the rest of my life.",
  "classification": "Class A",
  "county": "Panola",
  "state": "Mississippi",
  "latitude": 34.31605,
  "longitude": -89.845,
  "location": "-89.845,34.31605",
  "location_details": "",
  "temperature_high": 66.68,
  "temperature_mid": 54.77,
  "temperature_low": 42.86,
  "dew_point": 40.54,
  "humidity": 0.63,
  "cloud_cover": 0.1,
  "moon_phase": 0.52,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1023.59,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.68,
  "wind_bearing": 10,
  "wind_speed": 8.77
}