{
  "id": "5720",
  "title": "Night time rabbit hunters spotlight 7' tall biped leaping over 4' sagebrush as it escapes from view",
  "date": "1963-06-15",
  "timestamp": -206668800,
  "observed": "Myself and five members of my family witnessed a strange event while we were out rabbit hunting after dark on a warm and clear night in the spring of 1963.  It has been so long ago but I do remember that we had not been drinking. The hunt had started out earlier in the day about 35-40 miles west in Canyon County.  We were having so much fun that we continued to headlight and spotlight hunt on into the night.  I'm not sure if we had one or two vehicles.  We eventually pulled off Mud Flat Rd onto a small dirt road to take a break and to stretch.  We had passed through some flat farm land and we were now in large and heavy growth sagebrush country a few miles from the base of the Owyhee Mountains. I continued to use the spotlight while we were stopped.  I pointed it in a south easterly direction; first close in and then moved it higher to look for rabbits or coyotes.  It was then that I saw this large upright \"thing\".  It was running away from us at a distance.  I called everyones attention to it and we watched as it leaped over sagebrush and other large obstructions.  It ran like a man and it never hesitated or looked around and finally disappeared into a gully.  We all tried to ascertain what it was we saw. Our total conclusion was that it was like no other wild or range animal we had ever seen.  We did not drive over to look for any footprints as the car was usable on roads only. Chasing after it with flashlights was never mentioned or considered as we would not have felt comfortable approaching it with a minimal light source in the dark. We felt more than a little anxiety over that prospect. We ended the hunt and on our way back home, we were all very quiet and lost in our own thoughts.",
  "classification": "Class A",
  "county": "Owyhee",
  "state": "Idaho",
  "latitude": 42.79166,
  "longitude": -116.25,
  "location": "-116.25,42.79166",
  "location_details": "South on Mudflat to the aprox end of the farming and look SE toward some small hills and chalk bluffs.",
  "temperature_high": 82,
  "temperature_mid": 71.825,
  "temperature_low": 61.65,
  "dew_point": 54.88,
  "humidity": 0.64,
  "cloud_cover": 0.81,
  "moon_phase": 0.79,
  "precip_intensity": 0.0008,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1018.25,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 9.7,
  "wind_bearing": 33,
  "wind_speed": 0.73
}