{
  "id": "42596",
  "title": "Possible daybreak sighting by a motorist in farm country north of Badger",
  "date": "2013-04-09",
  "timestamp": 1365465600,
  "observed": "I was driving on my way to school at 6:30am.  I'd just left my house and was only about 2 miles from home.  To my right was a large pig farm, and about a quarter mile ahead and on my left, was just a small farm.  I wasn't even driving the speed limit because the road was very icy.  I'd just come up to the driveway of the pig farm when I saw in my headlights what I initially thought to be a snowmobile pulling up out of the ditch right next to the mailbox.  It stopped and appeared that what I thought to be the operator of the snowmobile was standing and leaning down to reach the handlebars.  I instantly thought it was strange that they didn't have their headlights on.  At that moment, the figure bolted across the road.  The way I can describe it best is that it ran the way a young child would racing against friends.  The differences were, that the size made me believe that there was no way it was a child, it ran so fast and disappeared into the woods behind the house of the small farm and the amount of steps it took were so few that it couldn't have been any person that I knew.  I called my husband right away and asked about the owner of the home and if they were strange or different and if he would have any explanation as to why they would be out so early in the morning checking their mailbox.  I was trying to rationalize the situation.  He said that the owner of the property was \"normal\" as far as he  knew, but they had moved out months ago and nobody had been there since.  I wasn't able to make out too much detail as the sun hadn't quite come up over the horizon, but I could tell that it was tall and bulky with long arms and a very long stride.  This would explain why I thought the shadowed outline was a snowmobiler standing up and holding onto the handlebars.  An average person would appear taller, would look large in width because they most likely would have plenty of warm clothing and a helmet on and would appear to have longer arms down by their knees if they were reaching for the handlebars.  This residence is about 3 miles from the Roseau River and just a couple more miles from the wildlife refuge.",
  "classification": "Class B",
  "county": "Roseau",
  "state": "Minnesota",
  "latitude": 48.8572,
  "longitude": -96.0073,
  "location": "-96.0073,48.8572",
  "location_details": "North of Badger, MN approximately 5 miles on County Road 3.",
  "temperature_high": 30.06,
  "temperature_mid": 23.02,
  "temperature_low": 15.98,
  "dew_point": 8.92,
  "humidity": 0.62,
  "cloud_cover": 0.07,
  "moon_phase": 0.98,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1028.03,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 5,
  "visibility": 10,
  "wind_bearing": 340,
  "wind_speed": 9.33
}