{
  "id": "3483",
  "title": "Nighttime sighting outside farm house, west of Prairie Home (the town) near Pisgah Creek",
  "date": "1975-10-15",
  "timestamp": 182563200,
  "observed": "I was up getting a glass of water at about 11 PM. My folks were getting ready for bed, and that is what woke me up. We lived on a farm in rural Missouri, not far from the town of Prairie Home. We had a kitchen door that had a window in it that faced out to our carport. Beyond the carport was a two-acre field with trees at the far end. I got a glass of water---my back to the door---when I felt a presence. Well our nearest neighbor was over a 1/4 mile away, and I thought that maybe our cattle had strayed from our bigger parcel into the small 2-acre field. I moved my stool over to the door and got up on it. I cupped one of my hands to cut the glare from the kitchen light on the window. It was pitch black out. I turned on the carport light, and put my face back up to the window---it was still dark for a second or two when something stepped back from the door to allow the carport light to illuminate the situation. The thing that stepped back from the window was very tall---much taller than the standard height of a door---it had been so close to the door that it was blocking all the light from the carport. I screamed, and dropped the water that I had in one hand. The thing outside my door looked right, then left, stepped back a couple of steps---then turned and ran across the carport---and through the field into the woods that bordered it. It was a couple hundred feet from the carport to the tree line, and I saw exactly where it entered the trees. It did not take long for it to reach the trees. Before it ran---it was definitely looking right at me. It had very dark brown, and/or black hair. I could see the reflection of the light from the kitchen in its eyes. I do not remember seeing any white in the eyes. The face had some areas that showed dark skin, with tufts of hair sticking out or surrounding the face and head. I never saw any teeth. Its arms were much longer in proportion to humans. They seemed to hang to the knees. There was long hair at the wrists that seemed to hang down over the hands. When I saw a grizzly bear run later on in life---I thought that the way its hair “flopped” up and down was the way it did on the Mo Mo that I saw.",
  "classification": "Class A",
  "county": "Cooper",
  "state": "Missouri",
  "latitude": 38.81124,
  "longitude": -92.59781,
  "location": "-92.59781,38.81124",
  "location_details": "west of Prairie Home on Highway J. Not far after crossing Pisgah creek. Old farm house with separate yard from pasture.",
  "temperature_high": 60.41,
  "temperature_mid": 50.5,
  "temperature_low": 40.59,
  "dew_point": 48.71,
  "humidity": 0.72,
  "cloud_cover": 0.78,
  "moon_phase": 0.36,
  "precip_intensity": 0.0108,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1017.32,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 8.46,
  "wind_bearing": 290,
  "wind_speed": 6.2
}