{
  "id": "49906",
  "title": "Morning hiker hears possible knocks and strange vocals in the Uwharrie National Forest",
  "date": "2015-09-24",
  "timestamp": 1443052800,
  "observed": "I wasn't going to share this until i saw a similar experience in the same area of the Uwharrie forest. I was at the trailhead of Dutchmans Creek at 9 in the morning during a week day about two weeks ago. Mine was the only car at the trailhead until after 10:30 with only logging trucks passing through every 30-45 minutes. I was walking down Dutchmans Creek, enjoying the solitude and quiet of the forest when I turned a bend and heard a loud wood knock at my two o'clock and was answered by another at my 10  o'clock within one second of the first. It threw me off because it sounded like an answering reply. I walked back up the trail and hung out for about thirty minutes just listening relaxing before I choose to head back down the trail. As i approached the same bend in the trail I again heard a wood knock at my 10 o'clock and then a second at my 5 o'clock. Extremely weird I thought, and again within one second of each other. I decided to walk back up the trail towards the second knock. There's an atv trail near the trailhead I walked up until I heard another wood knock around the same area I would have estimated the second at my 5 o'clock would have been. I waited for about fifteen minutes without hearing or seeing anything else. I decided to walk back to the base of the trail head and within twenty foot steps back down the trail I heard something huff at me from over my left shoulder. It came from inside a deep ditch but I didn't see anything there. I've had deer huff at me before when I've gotten close and they spotted me, I'm sure bear huff as well to threaten/challenge something but what got me was that I heard and saw no movement at all throughout this entire time. I walked back to the trailhead, waited 15-20 min and then snook back towards the same spot. I was completely quiet; no rustling from my clothes, boots didn't rustle plants and no crunch from dried leaves or twigs. As I approached I heard what sounded like a guttural baby moan or call. This occurred in high brush on the other side of the ditch to my right. The sound occurred every hand full of minutes and I would creep closer to see if I could spot it. Though the sound would change the direction it was facing there was never any movement in the brush and though I always carry when I'm in the woods I dared not enter into the thick brush, especially since I couldn't identify the animal that had huffed at me nor what type of animal was making the cries from in the brush. I didn't feel spooked until after the event when I thought over what had happened. I enjoy the woods, tracking and following game trails and though most of my experience is in Florida swamps with hogs or deer I couldn't identify the guttural moaning or see the thing that huffed at me.",
  "classification": "Class B",
  "county": "Montgomery",
  "state": "North Carolina",
  "latitude": 35.31331,
  "longitude": -80.00272,
  "location": "-80.00272,35.31331",
  "location_details": "Woodrun Dutchmans creek trailhead, sparsely used atv trail conjoined there. I walked around near where the worn down \"town\" was and heard the knocks toward the left but the cry came from around the back side of the building.",
  "temperature_high": 71.72,
  "temperature_mid": 67.405,
  "temperature_low": 63.09,
  "dew_point": 58.18,
  "humidity": 0.76,
  "cloud_cover": 0.18,
  "moon_phase": 0.37,
  "precip_intensity": 0.0053,
  "precip_probability": 0.64,
  "precip_type": "rain",
  "pressure": 1019.8,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 6,
  "visibility": 9.49,
  "wind_bearing": 31,
  "wind_speed": 8.25
}