{
  "id": "1241",
  "title": "Two gov't geologists witness hominoid creature cross road about 30 min. east of Yellowstone Park's East Gate",
  "date": "1978-05-15",
  "timestamp": 264038400,
  "observed": "The siting was witnessed by my friend and myself, both Geologists, while driving into Yellowstone from Cody for employment at the Park for the summer. My friend was taking his turn at driving and I was soaking up as much as I could see as well as providing a running commentary to keep my friend alert during our long drive. As we came around a curve in the road our high beams illuminated a large dark shaggy figure coming up out of the ditch on the left side (south)of the road at a distance of about 200 -250 ft. As we approached the figure at a speed of about 45 miles per hour, it looked first at the vehicle (we noticed the yellow reflection from it's eyes that is seen in a dog's eye when light catches it at night) then deliberately turned it's head away from the lights. That motion was non-human or bearlike, in that the the shoulders, chest and head moved simultaneously as it caught site of our vehicle and then turned it's face away from the headlights. We slowed (OK , we slammed on the brakes), stunned at what we were seeing and trying to rationalize we were looking at. A hominid creature, perhaps 7 to 7.5 ft in height (we have a 7 foot friend as a reference), massing perhaps 600 to 800 pounds without obvious signs of obesity, standing completely and comfortably upright, came up out of the ditch from the left side of the road right at the edge of the metal barrier above the culvert. It took 3 extrodinarily long and fluid strides across the highway (22 ft) and another 3 of 4 shorter strides down the other side of the road actually appearing to catch hold of the metal barrier/railing with one long fingered hairy hand and swinging down under the road into the box culvert or channel bottom completely out of our line of site. We stopped the vehicle within 25 feet of the culvert and watched the final decent of the creature into the darkness of the channel. At this point we speed on toward the east gate of YNP hoping to find a ranger to report the siting to and perhaps to go back and take another look. There was no one at the gate due to the late hour and we didn't see any lights on anywhere, so we continued on to our destination and went to bed deciding not to contaminate each others observations with discussions until morning. In the morning we both independently described graphically and in writing as much of what we had seen 6 hours earlier. This is a synopsis of our findings. There were virtually identical down to the movment of which leg moved first as the creature crossed the road. The head appeared to merge into the neck and there was no snout or protrusion from the face as would be commonly seen in a bear (I've seen hundreds, up close and in person) The face was not clearly visible and was only glimpsed for a moment. We both got an impression of long hair covering some of it. The nostrils were large and open, but neither of us were able to describe mouth or teeth. The eyes weren't exceptional, just the reflection of gold, like a dog's. What each of us can still describe with great clarity in the size, shape and unique fluid movment of the creature. It was big, 7-7.5 ft ish, but not much bigger than that. It was heavy and powerful looking. In shape, it possessed a rather blocky, yet elongated head,slightly domed on top of the cranium, thick short neck, broad shoulders, full chest. It was square and longer through the torso and hips than a human. As it walked across the road in front of us, the buttocks were clearly seen as muscular masses moving under heavy shaggy hair, they obviously attached to long powerful, muscular thighs longer in proportion to a human, big knees that functioned as a human knee, thick mulcular calves and feet in proportion to the rest of the oversized body. The soles of the feet appeared to be hairless or less covered in hair and very dark in color. The arms hung from heavily muscled shoulders and were longer than a human reaching to knee length and extending fully and almost a horizontal positon to the front and rear of the body as it moved. The elbows were perhaps a little further down the arm that on a human - or the unusual length of the arm made it appear so. The hands were large and long fingered, neither of us could later describe the palms, nails, or other than the backs of the hands which were covered in the same long shaggy dark brown hair as the rest of the creature. The creature made no sound nor gesture throughout the siting. It appeared a little startled at our vehicle appearing out of the night, but in no other way frightened or threatening. Starled the heck out of the two of us, though!",
  "classification": "Class A",
  "county": "Park",
  "state": "Wyoming",
  "latitude": 44.49817,
  "longitude": -109.6824,
  "location": "-109.6824,44.49817",
  "location_details": "We were on a widing reach of highway with dense frest cover on either side. At the precise location of the siting we identified a standard under-road box culvert with a secondary channel flowing through. There were standard metal barrier s on either side of the road protecting the culvert and vehicles. We had seen no homes or lights for perhaps 30 minutes and it was another 30 minutes before we reached the park gates - where there were no rangers available to report the siting to.",
  "temperature_high": 83.97,
  "temperature_mid": 63.6,
  "temperature_low": 43.23,
  "dew_point": 34.31,
  "humidity": 0.32,
  "cloud_cover": 0.35,
  "moon_phase": 0.26,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 997.94,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 10,
  "visibility": 10,
  "wind_bearing": 199,
  "wind_speed": 6.41
}