{
  "id": "38797",
  "title": "Woman recalls childhood experience of a terrifying night-time encounter while camping near Kennecott Copper mine",
  "date": "1970-07-17",
  "timestamp": 17020800,
  "observed": "When I was a child before bigfoot was known to me, we went on a family camping trip in Butterfield Canyon in the Oquirrh mountains below Kennecott Copper Mine. There were six people there. Two adults and four children. The tent was pitched by the creek next to a trail. Tent was tall enough to give the adults a couple feet of head room. When we were in the tent getting ready to make our beds (it was thundering with alot of lightning) we smelled the worse smell. It made our eyes water and our noses run, it was that bad. Next we could hear a large animal coming up to the tent. It was screaming and yelling. When it got to the tent it stood over the top of the tent. Our bodies were vibrating from the screams, our noses and eyes were running from the smell. When the lightning would go off we could see the shadow of long hair hanging down from massive arms. This thing towered over the tent as we were all ready to die from the fear. The adult male that was with us went out of the tent to do something. We had never heard of Bigfoot and he wanted to protect us. When he came back in the tent (after we heard scuffling and growling outside) he sat down with his back on the tent's zipper. His face was white and his eyes were huge with fear. First bit of daylight he had us packed and out of there. Years later he told my granddaughter that he confronted Bigfoot that night and could never get over it. He would never tell us that was there, what he saw. We knew it had to be nine feet tall at least to hover over the tent. There are three witness left that cant get over it.",
  "classification": "Class B",
  "county": "Salt Lake",
  "state": "Utah",
  "latitude": 40.4871,
  "longitude": -112.1402,
  "location": "-112.1402,40.4871",
  "location_details": "Butterfield Canyon Road below Kennicott Copper Mine",
  "temperature_high": 96.01,
  "temperature_mid": 81.165,
  "temperature_low": 66.32,
  "dew_point": 49.2,
  "humidity": 0.34,
  "cloud_cover": 0.51,
  "moon_phase": 0.45,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1011.37,
  "summary": "Mostly cloudy starting in the afternoon and breezy starting in the evening.",
  "uv_index": 11,
  "visibility": 10,
  "wind_bearing": 141,
  "wind_speed": 2.17
}