{
  "id": "2363",
  "title": "Late night sighting by motorists along Highway 121",
  "date": "1993-01-20",
  "timestamp": 727488000,
  "observed": "My sister and I, while traveling home through Wickliffe bottoms in Kentucky at night (apx. 2:30 am), observed a large object on the side of the road.  As the headlights shined on the object and it became closer, we were both stunned at what we saw before us.  My sister was driving and I was in the passenger seat. The creature was on my side and as the car passed it, I couldn't have been more than 2 to 3 feet from it's body. There was a large manlike creature with long, shiny dark hair covering it's entire body. With very distinctive muscle tone definition in it's legs and arms, this thing looked very strong.  It's face was what startled me the most because it had human like features especially the eyes..not like any animals' eyes i'd ever seen before (and I've been a hunter all of my life).  It was at least 8 foot tall because as we passed it, it's upper torso towered well above the top of the vechicle which was a Ford Escort.  The creature was standing half in the ditch and half on the road as if it was trying to cross.  And when it looked at us, it's eyes followed us as we passed.  At this point, my sister and I remained silent for at least 3 to 4 minutes after we first laid eyes upon it, as if we were seeing something we shouldn't be seeing. Then I looked at my sister and she looked at me, simutaneously we said \"What the hell was that?\".  As we got home, we spoke about it for the next 15 or 20 miles and decided how rediculous this must sound but we had thought we had just witnessed the wolfman.  But make no mistake, it had the face of a man covered with hair, not the snout of a wolf.  It was a frightening experience, yet an intriguing one that my sister and I will never forget and still talk about to this day.",
  "classification": "Class A",
  "county": "Ballard",
  "state": "Kentucky",
  "latitude": 36.9372,
  "longitude": -88.9949,
  "location": "-88.9949,36.9372",
  "location_details": "Hwy. 121 heading toward Mayfield KY. Coming out of Wickliffe KY. What they call the Bottoms area in Ballard Co. Kentucky, approx. 20 miles distance to either Mayfield, or Wickliffe Ky.",
  "temperature_high": 47.93,
  "temperature_mid": 47.18,
  "temperature_low": 46.43,
  "dew_point": 40.8,
  "humidity": 0.87,
  "cloud_cover": 1,
  "moon_phase": 0.94,
  "precip_intensity": 0.0192,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1022.97,
  "summary": "Heavy rain starting in the evening.",
  "uv_index": 1,
  "visibility": 4.66,
  "wind_bearing": 119,
  "wind_speed": 9.88
}