{
  "id": "14383",
  "title": "Possible vocalizations heard near Pigeon Forge",
  "date": "2006-04-11",
  "timestamp": 1144713600,
  "observed": "My husband and i were staying in a mountain cabin in the Pigeon Forge area of Tennessee this past week, and heard what we believe was the \"call\" of a sasquatch.  it was around 8:30-9:00 pm (EDT) on Tuesday, April 11, 2006.  we were sitting on the back porch relaxing, and enjoying the quietitude of the evening.  the air was somewhat smokey, although clearing, as there had been some sort of fire/brush burn-off on another, near-by mountain, and the wind was blowing the smoke in our direction (mild breeze to the SSE).  it was not quite totally dark yet, but was past \"dusk\", and the moon was visible, though hazy, in sky.  the frogs were croaking, the birds were quiet, the squirrels were down for the night....no vehicles or people within earshot, we seemed to be the only cabin inhabited at that time---the weekenders had left, and no one had arrived to take their places yet.  anyway, all of a sudden, we heard this sound that i can only explain as a cross between a howl and a yell.  it was a vocalization without any real structure (no \"words\" or progression of sounds that could be construed as any sort of \"language\").  it was definitely a mammal, and just as definitely not any canine, feline, bear, raccoon, or any other sort of animal one would expect to hear in the woods.  also obviously not any sort of livestock.  the sound seemed like it must have come from an animal at least man-sized/bear-sized, and sounded like an animal \"calling\", rather than making a warning sound or an identifying sound.  it carried what seemed to be a long way--sounded as if it came from the SSE, at least from the other side of the mountain next to us......would place it in the mountainy areas just west of Pigeon Forge, around the Walden's Creek area.  the calling went on for 2-3 minutes.  it was a long, drawn-out sound, both nasal and \"from the chest\" (don't know how to describe that).  if a human made the sound, it would definitely have to be a male, as it was too deep for a female human to do.  it would also have to be a person with a great deal of lung capacity, as each call went on for 10-15 seconds, and as noted before, came from a distance of at least a couple of miles.  the sound itself, best as i can describe would be vocalized thusly:  \"hhhnnnnnnnnnnnnnnnnnnnnuh\".  and would go from a higher (baritone) note down to a deeper note at the end.  anyway, this went on for a few minutes, then all was quiet again (except for the \"normal\" woodsy noises).  there was no other recurrance that night or any other night that we heard, and we never saw anything.  we did, however hear some other noises which may or may not apply---a short time after the calls (15 minutes, or so), we heard what sounded like something either throwing or pushing some VERY large rocks onto other rocks (heard rocks crashing onto each other).  This came from the same general direction, although seemed closer to us (on \"our\" side of the mountain).  This went on for a good 10 minutes, or so, then things got quiet again, and stayed quiet for the rest of the night.  The next night, there were some sounds like large fallen trees were \"thumping\" around in the woods, but there were other people in the area by then, too, so that could have been some idiots trying to go hiking at night and/or fooling around in the woods. FYI:  my husband and i both have a good deal of knowledge of the sorts of wildlife found in the woods and mountains, as we both spent much of our childhoods in such places, and learned first-hand the calls and vocalizations of such animals.  this did not sound like anything either of has heard---including anything i've heard on any wildlife show on tv.  ; )  it did, however, sound a lot like some of the purported sasquatch/bigfoot vocalizations i've heard on some websites i've checked out.",
  "classification": "Class B",
  "county": "Sevier",
  "state": "Tennessee",
  "latitude": 35.46865,
  "longitude": -83.3626,
  "location": "-83.3626,35.46865",
  "location_details": "Can only say that it was in the Bluff Mountain area between Townsend and Pigeon Forge, as sounds are difficult to pinpoint.",
  "temperature_high": 73.44,
  "temperature_mid": 59.425,
  "temperature_low": 45.41,
  "dew_point": 36.41,
  "humidity": 0.51,
  "cloud_cover": 0.01,
  "moon_phase": 0.44,
  "precip_intensity": 0.0001,
  "precip_probability": 0.13,
  "precip_type": "rain",
  "pressure": 1025.69,
  "summary": "Clear throughout the day.",
  "uv_index": 10,
  "visibility": 9.75,
  "wind_bearing": 182,
  "wind_speed": 2.25
}