{
  "id": "24877",
  "title": "Deer hunter comes across possible sasquatch tracks (w/ cell phone photo of one track)",
  "date": "2008-10-17",
  "timestamp": 1224201600,
  "observed": "September 29, 2008 I’m in the mountains above Kernville for opening weekend deer hunting season. I decided to spend the evening on a high mountain ridge so I would not have to climb the mountain in the dark the next morning. I hiked in the afternoon before and pitched my tent just before dark. I pitched my tent on a ridge just down from a high mountain pass. Just before going to sleep I was standing outside my tent and I heard a loud noise behind me. The noise was within forty feet of my position, and I would describe it as a single pop sound. I’ll try to spell out the sound, but there is no way I can reproduce the sound! “Pooeekk”. It could have been a branch being broken off of a tree but it would have had to come off at the base of the branch where it meets the tree trunk. The tree would have to be slightly hollow to get the sound. There was no noise after the initial sound and nothing ever hit the ground. My first impression of the sound was that it was a warning and I thought it was more of an animal sound, because it had a hollow guttural tone to the pop sound. I dismissed the occurrence and had no other problems through the night. The next morning I got up before sun up and started stocking along the tree line heading toward the mountain pass. After about 75 yards I moved into the trees and sat for some time looking over a meadow. Once I finished my time there I walked in the trees for twenty feet and then I moved out of the trees and back in the open. Just as I stepped out of the trees I spotted a large foot print. It was very large and I could make out two toes at the top left of the print. At this point I took out my cell phone and snapped a picture of the foot print. The foot print was as long as my boot, 13” long plus the toes and 2” wider than my boot on the side. I could make out a ridge in the dirt where the ball of the heal and the middle of the foot come together. After taking the picture I resumed my hunting and I moved along the tree line following the foot prints. They were made by a man like biped creature, the stride was longer than mine are, but I could stretch my stride to match the stride. I followed the prints for about another 75 yards they went right through the middle of the saddle between the two mountains.  At that point I resumed my hunting for deer and dismissed the Bigfoot. The only thing I would add about the prints they were all the same, but I could only see the toes on the first print because that print went slightly into the side of the mound. I will send a copy of the picture once you make contact with me. Both the toes and skin fold mound can be seen in the digital picture.",
  "classification": "Class B",
  "county": "Tulare",
  "state": "California",
  "latitude": 35.95835,
  "longitude": -118.375,
  "location": "-118.375,35.95835",
  "location_details": "The area is located south of the Sherman Pass Road about a one hour drive out of Kernville. The track area is located approximately 6 miles south of Sherman Peak.",
  "temperature_high": 87.22,
  "temperature_mid": 70.59,
  "temperature_low": 53.96,
  "dew_point": 29.89,
  "humidity": 0.28,
  "cloud_cover": 0.07,
  "moon_phase": 0.61,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.04,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9,
  "wind_bearing": 103,
  "wind_speed": 0.97
}