{
  "id": "24620",
  "title": "Man recalls family experiencing possible intimidation near Ann Arbor",
  "date": "1974-07-30",
  "timestamp": 144374400,
  "observed": "In late July of 1974, my father, mother, and I decided to take our German Shepherd on an early evening nature walk in the woods by our house. This area is southeast of the intersection of Packard and Carpenter Roads in Pittsfield Township. It was during this trek into the wilderness that I firmly believe that I encountered a Sasquatch, or family of them. Moreover, in retrospect, I have to firmly believe that I had unknowingly come across a nest where the creature was residing at a year earlier. Today this area is heavily developed with condominiums and housing subdivisions, but 34 years ago, this was a different story, as the area had an abundance of deer and other small game. I can remember my neighbor hunting rabbits, and telling me that he saw eight deer standing together in an open field. Likewise, there were wetlands nearby in the area, where we would catch frogs at. The year before, my friends Cooper, Jeff and I had explored the open area, which had a winding path that lead from Packard Road to Montibeller Park, just off Ellsworth Road 1.6 kilometers to the south. We decided to venture further south than usual that afternoon, walking past the New York Central Railroad’s Ypsilanti Branch Line that ran from its namesake city, southwest to Saline, and on into Hillsdale. While walking south into the heavily wooded area from the open field along the trail, we found a very interesting area that we concluded was some sort of a fort. We decided to go into the small area that was two meters inside the tree line, and roughly six meters in diameter. Upon entering, I noticed a rather pungent odor that smelled like a wet dog. What we found was rather amazing. There was a structure made from tree limbs that were pulled down and covered with fresh tree branches. My friend Cooper noticed that the branches had been broken and twisted off, rather than being cut with a saw. Moreover, there were three logs set up as a tripod on the inside of this area, which was covered with some fresh grass that had been torn out from someplace, maybe in the field just south of the old railroad bed. Also, there was a shirt, completely flattened Coca-Cola can, and some aluminum foil on the floor of this fort. It was like being inside an area that was designed to keep the rain off of whoever was staying there. We also noticed that some of the small trees had been snapped off, or bent over in the field just across from this area. I compared them to my arm and noticed that the trees were roughly anywhere from 5 to 18 centimeters in size. We concluded that it must have been from a recent storm, as no person we knew, was that strong to twist a tree of that size. After examining the area for about another 30 minutes, we all decided to head back home, since it was it was getting late and dinnertime was fast approaching. Nearly another year would go by before I would get a chance to back into this wooded area again. I remembering two days after summer vacation started in June, 1974, my friend Jeff asked me to walk down to Montibeller Park with him, as his cousins were having a cookout. We followed the trail and as we approached the area where the makeshift fort was located at, we both had the feeling that we were being watched. I quickly looked inside for a few minutes, and everything was still there. However, we kept going, passing over the large drainage culvert towards the park. After the picnic was over, Jeff’s cousin drove us back home, and I was thankful for the ride, as I was not comfortable walking back through the woods that evening, as it was getting dark. Likewise, the mosquitoes were out in full force in the park, I could just imagine what they would have been like in the woods and wetlands. I would have been their prime menu selection for the night. During the last week of July, 1974, both of my parents were laid off. Feeling rather bored, we decided to take our German Shepherd out for a walk on the trail by where lived at. He had a very outgoing personality, and was never afraid of anyone or anything. Nonetheless, it was about 1900 hours, and overcast that day as we set off on our nature walk. I would have to estimate the temperature was around 26 Celsius. Everything started out just fine, as my parents were talking about my recently departed uncle’s two antique automobiles. Just after we crossed over the now abandoned Ypsilanti Branch Line, heading south towards the thick woods, our dog started to act more conservative and was lagging behind my father. Usually, he led the way, pulling us along for the ride. However, I didn’t give it much thought at first. As we walked along the trail, I heard a very loud “crack” like a large tree branch had snapped around 10-15 meters inside the treeline. Then around a minute later, another loud “pop” from the woods, and our German Shepherd was behaving strangely, growling and looking towards the woods. This is when my father took a hold of his collar as we continued to walk along. Moreover, I had the uncanny feeling that I was being watched, and had an urge to leave the area, but we continued southbound rather slowly. It was at this time I started to smell something terrible, like rotten garbage. My father also commented on the foul odor, hoping there wasn’t a skunk in the area. Likewise, the snapping sounds in the woods seemed to move along with us as we walked. Whatever was in the woods, seemed to walk along with us, and make an occasional loud pop, but then we would hear a much louder snap. Conversely, when we stopped moving, it did the same. I entered area where the man-made fort was located at, and the foul smell was much stronger. Also, our German Shepherd had his tale between his hind legs, and was whining like he was scared. I had never seen him behave like this before. Nevertheless, I noticed a tripod made of sticks to the right side of the trail, not far from where the earlier twisted trees were lying bent over. Just seconds after I had left the man-made fort and turned to walk south, we all heard a tree snap and crash like it had been deliberately broken and fallen down. I would estimate it came from 15 meters inside the woods. While I faced the woods, this sound had come from my right, and there was something stirring to my left. I can remember our dog turning and heading back in the direction we came. This sound convinced my father that a deer must be in the woods, and he didn’t want a “wild buck” to run out and have our dog chase after it. We turned and heading back northbound and the sounds of branches snapping seemed to follow us until we got to the clearing. However, I really felt like I was being watched as we left the area, and it made me feel scared to say the least. In retrospect and after seeing a Bigfoot creature in 2001, and reading numerous reports on the Web, I am thoroughly convinced that I had an earlier encounter with one or more of these creatures in 1974. It’s an event that I will remember until the end of my life.",
  "classification": "Class B",
  "county": "Washtenaw",
  "state": "Michigan",
  "latitude": 42.2375,
  "longitude": -83.67,
  "location": "-83.67,42.2375",
  "location_details": "From Google Earth: 42°14'20.36\"N 83°40'10.55\"W",
  "temperature_high": 78.64,
  "temperature_mid": 67.7,
  "temperature_low": 56.76,
  "dew_point": 53.09,
  "humidity": 0.59,
  "cloud_cover": 0.48,
  "moon_phase": 0.39,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1011.39,
  "summary": "Partly cloudy throughout the day and breezy starting in the afternoon, continuing until evening.",
  "uv_index": 6,
  "visibility": 10,
  "wind_bearing": 269,
  "wind_speed": 11.17
}