{
  "id": "7097",
  "title": "Campers hear late night vocalizations at Carlon Station",
  "date": "1977-01-10",
  "timestamp": 221702400,
  "observed": "It was January 1977, and Little Ruben Rios and Danny Mirales had talked Ruben Hernandez, my husband, into taking them snow camping. Ruben had the experience and the equipment, but was reluctant, because neither Rios nor Danny had much camping experience, and had never camped in the snow.  But winter camping prevailed, and they ended up on the boarder of Stanislaus National Forest and the west side of Yosemite National Park... a place that was called Carl's Inn, then later renamed Carlon. It is located on the South Fork of the Tuolumne River on Evergreen Road.  The road was open in winter possibly due to the fact that it's on the way to Hetch Hetchy Reservoir. It's not too far, on the map, from Highway 120 and Yosemite's Big Oak Flat Entrance Station.  It is about 4575 feet elevation. Camping is not allowed there anymore, but we still fish there in the spring and summer. Carlon is in a narrow valley, with ridges on both sides, and the road drops quite a bit between the highway and the stream.  The men had gotten off to a late start because of work, so whatever they could pile into Ruben's Jeep in a few minutes is what they took.  After awhile, tt was getting dark and Highway 120 was deserted, they hadn't even seen another car since Buck Meadows. The temperature had dropped and all three agreed to pull over and set up camp at the next level spot, which happened to be an old logging camp road next to a bridge. That's how they found Carlon, it was not their original destination, just a convenient place off the road. Night had come and it was pitch black by the time they parked. They left the Jeep on a 45 degree up-hill angle on the logging road and blocked it's tires with the biggest rocks they could lift. There were no signs that anyone had been there for a long time, no garbage in the empty can or even footprints in the snow. When they realized they had forgotten their firewood they had no choice but to try to find some in the forest. This was no easy task, because snow was on the ground and everything was either wet or frozen. So they ended up “pruning” the trees in the national forest... the point being that these three guys were making a lot of noise, tromping around and using their ax, going up the mountain to the top of the ridge, chopping and then dragging tree branches down the mountainside by lantern light. The fire was made in the campsite fire ring with much effort, after siphoning some gas out of the Jeep. They had a good fire going and dinner was ready to be prepared.  Mostly canned foods, like Vienna sausages and Dinty Moore stew set directly into the fire.  Unfortunately, the Dinty Moore stew can exploded and sprayed food all over them and a 13-foot diameter circle around the fire (this is important to what happened later). After eating what was left of dinner, the three fell asleep inside their tent. At about 2:30 or 3:00 a.m., the three campers suddenly awoke to the sound of the crunch-crunch of footsteps (BIG footsteps) in the snow and brush.  Then they heard puffing and snorting and grunting from a creature that sounded like a cross between a gorilla and a pig, and then the blood curdling screams, like “er er er AAH-AAAAAAAAAAAAH!!!” It was coming from the ridge above the campground!  Then more CRUNCH-CRUNCH, CRUNCH-CRUNCH... PUFF, SNORT, GRUNT... “ER ER ERRR AAH-AAAAAAAAAAAAH!!!!!!!”  It was walking around the camp along the ridge where they had been earlier that evening getting their illegal wood. The three men froze with fear, the thing was coming closer! They could hear the thing encircling their campsite!!! They knew they were in big trouble! Ruben recalls that it was such a horrible sounding scream it gave him goose bumps all over, but he needed to keep his wits together because the other two where looking to him for answers. He never let on that he was just as scared as they were of whatever it was that was looming over their camp. He also remembers as all this was happening, his mind was racing with the thoughts “My God, this thing is going to kill us right here, right now! This is how I am going to die!  When the spring thaw comes someone is going to find the remains of what was left of our camp, shreds of tent material, ripped-up sleeping bags, dented pots and pans, busted-up camping supplies and the dead remains of whatever is left of us.” Ruben tried to get the other two to be quiet and calm down. He remembered telling them “Whatever it is out there can hear every sound we are making! Shut up!!!” One just broke down and cried hysterically, repeating over and over “We're going to die! We are going to die! That thing is going to kill us! We're going to die!!” The other was asking in a freaked-out voice “What is it, Ruben?!?! Let's get out of here! Let’s go get in the Jeep and get out of here!” Ruben told them there was no way they'd be able to get the rocks away from the tires fast enough, the thing was so close! And even if they could, driving backwards on black ice could roll the Jeep. Ruben told them they would be better off in the tent and remain quiet and wait to see what would happen next. It screamed that way four separate times, about five to ten minutes in between each scream and was in the campground for about an hour. Ruben had his .22 cal. revolver, but no one would move to see what was out there. They were just waiting for whatever it was to attack their tent. The moon had risen, and they could see the shadows of swaying tree branches through the nylon of the tent. The gun was pointed in the direction of the sounds. Ruben swore that whatever it was out there was going to cast it's shadow down on them with its hairy arms out-stretched, swoop down and yank them out of the tent, tearing everything into shreds! Ruben knew what all the usual forest animals sounded like.  He had been a Boy Scout and a hunter and fisherman for years. He had seen and heard bobcat and cougar and even chased an angry bear, but he had never experienced anything like this before. He just knew that it was heavy and loud and was walking around on two feet!  The crunching and crashing sound was moving along the ridge now, just grunting as it slowly walked away, without screaming anymore. Then it seemed to cross over to the other side of the ridge, very slowly with an occasional fading gorilla-like grunt. The camp was quiet again. The rest of the night the three men took turns staying up, holding the gun and keeping watch inside the tent while the other two tried to sleep. When the sky was just beginning to show signs of daylight, the three grabbed all their gear, threw it into the Jeep and left without breakfast. They didn't see any animal tracks around their camp... and definitely didn't want to go towards the ridge to look for any, either. They were in too much of a hurry to get out of there. They didn't talk about it much on the way home, and they didn't tell anyone why they were home so early that morning. It's been over twenty-six years since it happened, and one of the two guys will not talk about it. He claims that Ruben is crazy and made up the whole story. Ruben says that guy doesn't want to talk about it because he does not want the story getting out that he panicked and was hysterically crying. The other guy still calls Ruben every other Christmas to wish him a good holiday and always ends his conversation with “Ruben, do you think that the thing we heard when we went camping was a Bigfoot?” Ruben always replies, “I don't know, we never saw it. It could have been.” But in my husband's mind and heart he knows it was.",
  "classification": "Class B",
  "county": "Tuolumne",
  "state": "California",
  "latitude": 37.81269,
  "longitude": -119.8609,
  "location": "-119.8609,37.81269",
  "location_details": "Take Highway 120 to Evergreen Road to Carlon Station, now a day-use area.",
  "temperature_high": 46.84,
  "temperature_mid": 39.575,
  "temperature_low": 32.31,
  "dew_point": 32.01,
  "humidity": 0.83,
  "cloud_cover": 0.57,
  "moon_phase": 0.68,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1023.61,
  "summary": "Foggy in the morning.",
  "uv_index": 2,
  "visibility": 2.8,
  "wind_bearing": 324,
  "wind_speed": 0.42
}