{
  "id": "2183",
  "title": "",
  "date": "",
  "observed": "My brother and I were on backpacking trip in sometime in the mid 1980's. 1987, if my memory serves me correctly. We were hiking the High Sierra Trail from Bearpaw Meadow over the summit into the Kern River valley. We had made quite a distance the third day out (about 18 miles) and were exhausted when we stopped at a small lake called Morraine Lake high above the Kern River valley. We had seen no other hikers the entire day. As we were sitting in camp at dusk, the quiet was pierced by an unearthly screaming howl of immense volume, emanating from some distance away from us, but carrying quite clearly in the still air. It sounded as if it came from some animal with huge lung capacity, and could not be confused with human, a bear, or any other sound I had ever heard. The outburst only happened once and trailed off rather than stopping abruptly. Although clearly not human, it somehow seemed sad in tone rather than fierce or threatening. \"Did you hear that?!\" my brother asked. \"I sure did,\" I replied. \"What do you think it was?\" he then asked. \"I have no idea,\" was my response. We were so tired that we just climbed in the tent and took our chances with whatever was out there. By morning we had forgotten about it. It remained forgotten for days until we got back to civilization and were having a meal of \"real food\" at a local diner. The newspaper I was reading carried a story about three men who were repairing a footbridge in the Golden Trout wilderness area of the Kern River for the U.S. Forest service. They were experienced woodsmen, one was a 60-year-old Mono Indian. They were frightened severely at dusk one evening by what they described as a nine-foot-tall hairy beast coming down a hillside at them screaming loudly. It was a classic Bigfoot sighting, except it was way out of the normal geographic range for sightings, since the Sierra Mountain range was not believed to be a typical Bigfoot area. They fired a shot over its head with a 30.06 rifle, and were so upset that they packed out to a Ranger Station that night and made a report to the ranger. The ranger scoffed at them, and surmised that they had seen a bear or cougar. They replied that they knew what bear and cougars looked and sounded like, and that THIS creature was different. Way different! The ranger accompanied them the next morning to the sight and saw some large footprints in gravel, but nothing like a cast could be made from. I checked the day and place that these men said this happened and you guessed it, it was the same day that my brother and I heard this weird screaming howl, perhaps 5-8 miles away. I never reported this to anyone, but you can have this for your files and maybe if you piece enough of these small events together you can come up with a bigger picture. Good Luck!",
  "classification": "Class A",
  "county": "Tulare",
  "state": "California",
  "location_details": "Bearpaw Meadow, California High Sierra Trail",
  "summary": ""
}