{
  "id": "10114",
  "title": "A few witnesses see something reach through an open window in Mescalero N.M.",
  "date": "2004-07-26",
  "timestamp": 1090800000,
  "observed": " Around 11:00p.m. my sister in-law ran in to my mother in-law's house from outside and said that she seen something very tall walking on the trail below the house. She said it was walking back and fourth on the trail below before it came up to the house and stood at the corner looking at them sitting there. That's when her and her friends ran inside and told me. We checked outside around the front but saw nothing. So they went in her room after that.  Me and my girlfriend stayed in the living room and watched TV. When we heard some noise in the dinning room I said,\"what was that?\".  She said I dont know so I jumped up to see. Some of the girls came out to see what the noise was. It was like somebody throwing stuff around in the room.  When I got to the dining room I saw a large hand reaching in the window. It reached across a table by the window and pulled out a bowl that had some food in it. We all got scared and I called the conservation office. Nothing else happened after that. This thing has been hanging around this town [Mescalero] for about 2-3 years now. About 2 years before that, a bigfoot followed my brother in-law home from a friends house about 12:00am He saw it down the road, about 150 yards away. He got scared and ran home.  When he got to the door he started pounding on it. He didn't know it had followed him, but when he looked behind him he saw that the bigfoot was standing there looking at him, about 10 feet away. When they opened the door my brother ran inside. He said the thing left after about 5 minutes. Another sighting was about a year ago at the same house. My mother in-law went out to get her clothes off the line. There was snow on the ground. It was about 8:00am. She saw two sets of tracks, a very large set and a smaller set, like it had a smaller one with it. The tracks went between the house and the clothes line. Some of her clothes were on the ground.  The tracks went down to the trees below her house. Now I live in a trailer home up the highway. The closest house is a mile away. One time I could hear loud screams one canyon over from where I live. One night me and my girlfriend were here without any power and no dogs. We were going to bed and we heard a sound like a rumble on the side of our room.  It was like somebody bumped our trailer with a car. It happened just once. I figured it was a bigfoot because we've heard it around here.",
  "classification": "Class A",
  "county": "Otero",
  "state": "New Mexico",
  "latitude": 33.15405,
  "longitude": -105.7947,
  "location": "-105.7947,33.15405",
  "location_details": "all of this happened over different seasons and times. And the locations were brushy and have alot of trees around.",
  "temperature_high": 73.95,
  "temperature_mid": 67.325,
  "temperature_low": 60.7,
  "dew_point": 59.41,
  "humidity": 0.77,
  "cloud_cover": 0.62,
  "moon_phase": 0.31,
  "precip_intensity": 0.01,
  "precip_probability": 0.36,
  "precip_type": "rain",
  "pressure": 1018.51,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 10,
  "visibility": 8.77,
  "wind_bearing": 129,
  "wind_speed": 4.6
}