{
  "id": "29357",
  "title": "Husband and wife riding ATV's along the Payette River see a Bigfoot",
  "date": "2009-06-13",
  "timestamp": 1244851200,
  "observed": "June 2009 above Crouch, Idaho.  It was mid afternoon, and my husband and I were riding our ATV and dirt bike.  Dave was about 200 yards ahead of me, and we didnt have sight of each other.  We were on the main forest road that leads up the mountain, past the turn off to Silver Plunge.  The road gets a bit windy up there, and so we didn't see each other. I was coming up to a curve in the road where to my left is the embankment down to the river about 40 feet, and a cliff to my right.  The only flat part was the road.  It happened so fast.  I came around a bend and saw a huge dark figure on two legs, upright bounding right up the mountain side to my right. The sound of the branches snapping were louder than my motor.  I kept driving about another 100 yards, around another bend trying to catch up to Dave, who was sitting on a quiet bike with his helmet in his hand wearing a puzzled look. \" Did you see that?\", I yelled struggling to get my helmet off. He said,\" yeah...it was huge, hairy and fast!\". We drove back to see where we both saw it separately, and there was evidence of something climbing up the steep mountain.  Dave saw it bound up the river side embankment, and crossed the road  as soon as he passed it.  I saw it when it was going up the mountain side. We both know what we saw...big foot.",
  "classification": "Class A",
  "county": "Boise",
  "state": "Idaho",
  "latitude": 44.28265,
  "longitude": -115.8714,
  "location": "-115.8714,44.28265",
  "location_details": "Approx. 3 or 4 miles north of the Silver Creek Plunge turnoff on the forest road.",
  "temperature_high": 62.76,
  "temperature_mid": 57.3,
  "temperature_low": 51.84,
  "dew_point": 47.39,
  "humidity": 0.74,
  "cloud_cover": 0.59,
  "moon_phase": 0.68,
  "precip_intensity": 0.0048,
  "precip_probability": 0.55,
  "precip_type": "rain",
  "pressure": 1011.16,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 9.86,
  "wind_bearing": 130,
  "wind_speed": 2.42
}