{
  "id": "23768",
  "title": "Brief, blurry video footage of a possible sasquatch at Mono Lake",
  "date": "2008-07-09",
  "timestamp": 1215561600,
  "observed": "On May 18, 1991, while on vacation in the Mammoth Lakes area in Northern California, my family took a short day hike to Mono Lake to do some sightseeing. It was overcast and very cold with a strong wind blowing. There was still snow on the surrounding peaks. Mono Lake is at the base of the Sierra Nevada mountains. I do not recall the location at which we parked the car to begin our hike, but I do remember that ours was the only car in the parking area and that the spot was quite desolate. It was a cold Saturday morning and the area was deserted. At 9:17AM I began shooting VHS video footage of our trek, and after a short period of time we finally decided to leave because of the wind and cold. We went back to our hotel in June Lake, enjoyed the rest of the weekend and went home. The trip was quite uneventful (or so we assumed). The tape went into our family home video collection and for 17 years, from 1991 to 2008, it has been watched countless times by family and friends. So much so that my kids have the dialog on much of the tape collection memorized. On April 19, 2008 my daughter (6 years old in the video and now 22) was watching the tape in the downstairs family room when she suddenly screamed out and began yelling for me to come downstairs. I thought something bad had happened and after racing down the staircase, found my daughter and my ex sitting in front of the television telling me to watch a segment from the tape. What I saw when we played it back made the hair stand up on the back of my neck. And it was something none of us had ever noticed in almost 17 years of watching this tape, In the final few seconds of the Mono Lake segment just before I turned the camera off I caught something very large and black moving between two rock formations a short distance from where we had been hiking. It was completely black with no differentiation in color or texture and walked upright like a human but with a gate more like a primate. At first I thought it was a bear, but after going over the video many times and finally digitizing and sharpening it I am now unsure what to think. From examination of the footage of my family whose distance from the camera was comparable to that of the creature it is easy to see the distinct details and variation in clothing, hair, face and hands. In contrast, the creature caught on tape exhibits none of those distinctions.The shape of the body does not resemble a human. The head is too large and the arms are too long. And although it does resemble a bear at one particular angle in the clip, the stance and gate don't add up. It is an intriguing mystery. That we were able to go for 17 years without noticing this event on the tape seems unbelievable, but in retrospect it actually makes some sense. The segment lasts for only a couple of seconds and the focus is on the lake and mountains which is what I must have been filming at the time. I didn't see it when I shot the tape and it has since gone unnoticed because one must really be looking for it to see it. I am not a person who is prone to believing in conspiracy theories, alien abductions and bizarre events such as a purported Bigfoot sighting. I've seen various footage and photographs of Bigfoot/Sasquatch sightings over the years and have always been extremely skeptical of their authenticity. As an engineer who now teaches high school physics, I am highly educated and very level headed. If I see something I don't understand my natural reaction is to analyze it rationally using the scientific method. I do not jump to conclusions based on faulty hypotheses. So in this case, I will suspend judgment pursuant to further investigation. But having shown this video to family and friends whose opinions I trust, the overall reaction seems to be a unanimous \"Bigfoot!!\" Wishful thinking? Maybe. Maybe not. Either way it is very intriguing and definitely warrants further investigation. Your opinion and assistance in this matter would be appreciated.",
  "classification": "Class A",
  "county": "Mono",
  "state": "California",
  "latitude": 37.9333,
  "longitude": -119,
  "location": "-119,37.9333",
  "location_details": "Maybe 20 yards from the waters edge on a section of beach at Mono Lake. Unclear on the exact location; however, that should be easy to ascertain from the terrain captured on the video tape.",
  "temperature_high": 98.97,
  "temperature_mid": 84.11,
  "temperature_low": 69.25,
  "dew_point": 46.66,
  "humidity": 0.3,
  "cloud_cover": 0.13,
  "moon_phase": 0.24,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1008.26,
  "summary": "Clear throughout the day.",
  "uv_index": 13,
  "visibility": 7.44,
  "wind_bearing": 317,
  "wind_speed": 4.93
}