{
  "id": "8790",
  "title": "Man sees an upright creature jump across wooded trail",
  "date": "2004-06-03",
  "timestamp": 1086220800,
  "observed": "My wife and I were crossing the Trinity River on Highway 105 just before sunset on May 29, 2004 after having been to a Cardinals-Astros baseball game. The west bank of the Trinity was a long sand bar, and there were a few people (ten - fifteen) spread out along the sandbar doing various things. There were a few kids and a dad camping, two guys sitting on a tailgate, there was a couple farther down fishing, and there was another truck backed up to the sandbar with its stereo playing. My wife and and I drove down to the sandbar, had to engage the four-wheel drive to avoid getting stuck and turned around to go back to the highway (Hwy 105). We got back out on the highway and my wife asked me to drive on across the bridge to the other side. I did so. My wife saw what she called \"a waterfall\" off the left side of the bridge (actually it was just water running over rocks in a small creek off the Trinity). We turned off on a dirt road just past the bridge, drove over a small wooden bridge over my wife's \"waterfall\" and came to a gate that was locked with two padlocks. Keep in mind that the area is very heavily wooded, swampy and marshy in areas and highly inhospitable, once you step foot into the woods. At the gate, we got out of my truck. We climbed the gate just to look around the area. We could hear the music and the kids playing across the river (probably 1/4 of a mile back across the bridge). On the other side of the gate, the road turned into a two-track trail. There had been vehicles down there probably within the last month. We walked down the trail. The sun was setting and it was starting to get dark. This was very impromptu and we had not planned for this jaunt at all. My wife had heels on! I walked on ahead, probably thirty feet ahead of my wife. There was a sign that indicated that the area was a private hunting club area. We were very quiet and made very little sound. It was then that I saw it - about forty yards down the trail, where the trail turned sharply to the left. \"It\" leapt across the trail much like a long-jumper, landed on the right side of the trail and leapt again into the woods - quickly, quietly, in the blink of an eye. It was a rusty-red color, about six feet tall, and was extremely, extremely fast. In an instant, my mind tried to ascertain what it was I saw. I kept telling myself, \"No way. No way.\" But - my data banks could not process it or link it to any other creature that I had ever seen. I saw no face, and do not remember seeing arms or feet - but I did see an upright something about six feet tall leap ten feet across the trail and spring into the woods. I turned to whisper loudly to my wife, \"DID YOU SEE THAT!?\" No. She was busy dealing with a slimey, slithery something that slithered across her foot. She was quite distraught, and her encounter happened at exactly the second that mine occurred. When she realized what had happened, she quickly jogged up to me and we jogged to spot of the crossing. When we arrived at the crossing area, we could hear the animal still running through the woods, sending birds to flight near its path. It was then that I smelled a musky smell, much like a horse actually. We looked for tracks of any nature and found absolutely nothing. The creature cleared the road and the road was the only place that tracks would have been made. We turned to look to the left, and there in the woods was a clump of uprooted trees with fresh sod still on the roots, as though they had recently been put there. I am sorry, but I can't say with certainty that what I saw was a bigfoot, but I can say with certainty that what I saw was: 1. Rusty-red (orangutanish); 2. Approximately six feet in height; 3. Incredibly fast; 4. Appeared bipedal and upright; 5. Not a deer, coyote, cat, horse, human, fox, bear, wolf, hog, dog or any other indigenous animal that I have seen in Texas. (I was raised in the backwoods of East and Central Texas). We had no cameras with us, but even if we had, the creature was way out of sight before I could have drawn any camera. And he was way too fast for any hope of pursuit. We surmised that perhaps he had been watching the people across the river from a very safe and secure position - until he saw us coming up the road, at which time he fled in a panic. He probably saw us long before we saw him. When I first saw him, he was in mid-air leaping across the road. He touched down and sprung up and into the woods. We heard him for a few seconds after we arrived at the crossing area and then it went silent, save for the people noises from across the river. We thought that he may have stopped and surveilled us from a hidden position in the woods. We looked around for just a few minutes and had to return to the truck - it was getting dark in a hurry and we were largely unequipped.",
  "classification": "Class A",
  "county": "Liberty",
  "state": "Texas",
  "latitude": 30.26861,
  "longitude": -94.79333,
  "location": "-94.79333,30.26861",
  "location_details": "",
  "temperature_high": 88.33,
  "temperature_mid": 81.025,
  "temperature_low": 73.72,
  "dew_point": 69.91,
  "humidity": 0.79,
  "cloud_cover": 0.4,
  "moon_phase": 0.52,
  "precip_intensity": 0.0108,
  "precip_probability": 0.61,
  "precip_type": "rain",
  "pressure": 1019.25,
  "summary": "Rain in the morning and evening.",
  "uv_index": 11,
  "visibility": 9.47,
  "wind_bearing": 55,
  "wind_speed": 2.19
}