{
  "id": "6394",
  "title": "Possible tracks found in snow near Albia, Iowa",
  "date": "1976-01-14",
  "timestamp": 190425600,
  "observed": "The incident I'm going to describe took place back in January of 1976.  It was on a Tuesday afternoon.  It's stuck with me and has bothered me since then (I'm now 36 y/o).  I've never discussed it with anyone since I never felt comfortable relating the story, but after finding your website, I decided that I'm not the only one who has had an experience they can't explain.  This occured on a January afternoon in 1976.  It was after school (approximately 4:00 p.m.) and the weather was sunny and somewhat mild for an Iowa winter(temps approximately in the upper 20's/low 30's).  I took my sled and headed to the country club after school, which was approximately a mile and a half from my house as the crow flies.  I was alone since all my friends had went sledding over the weekend and no one else wanted to go.  In order to get to the country club by foot there are two sets of railroad tracks seperated by approximately 150-yards that you need to cross.  One is a main line that runs North to South (the Burlington Northern) and the other is a feeder line running from town out to the East/West (a B.N. line as well) main line North of town.  The area in between the tracks is covered with various trees, trails, bushes and weeds.  Since we lived on the East end of town, I'd walk down the feeder line and follow a trail (I'd always thought of it as a small game trail)to the mainline which I'd cross over to the country club.  The country club was built around an old pond which had been used by the old steam engines to add water to their boilers.  The area around the country club is of rolling hills, fairways, greens, trees, bushes, and weeds.  The hill I was going to sled down was to the South of where I came across the mainline (it was also about a 1/4 of a mile south from the clubhouse).  I walked across  the mainline, down the hill, and up the hill I was going to sled on.  As I got to the top of the hill, I noticed footprints (not bootprints) in the snow going across the crest running North to South.  At first I found it funny that someone was running around in the cold and snow without shoes or boots.  The snow depth at that time was approximately 5-inches where it had been undisturbed.  The snow at the top of the hill where I found the tracks was packed (approximately 3-inches in depth) but the tracks went in almost completely to the ground!  I stepped off between the tracks, and it took me three full strides to go from one track to another!  You could see perfectly the outline of the foot, the toes, and the heel.  When I put my boot into the footprint it wouldn't touch the outline of the footprint!  The hill I was on had a gentle slope to the South where it finally turned into trees, bushes, and weeds.  The footsteps ran into the trees.  I remember being curious at first as to why these tracks are here, then I became very uneasy because, even though I was only 11-y/o, this didn't seem normal (a normal man has a much shorter stride).  I then remember thinking I came here to do some sledding, so I'll sled.  I went down the hill once and remember getting very scared at the bottom of the hill.  I didn't want to look over toward the trees to my left (the South), so I decided to call it a day and head back home.  As I was walking between the mainline and the feeder line (I followed the trail), I felt as though I was being watched.  When I got to the feeder line, I picked up my pace (that's tough to do when you've got snowpants on and boots).  It took about 20-minutes to get back home.  I had always played on the feeder line tracks since they were rarely used and had hunted birds with my B.B. gun in the area between the feeder line and the mainline.  I never had that feeling before when I'd been out playing or sledding.  I've never had it since.  On a side note:  Later that spring, late at night, I got up to go get a drink of water (my bedroom was in the Southeast corner of the house at the end of the hall.  My parents had the bedroom at the Northeast corner with two windows, one facing East, one facing North).  As I was coming back from the kitchen, I looked through their bedroom door and saw a figure looking through the East Window.  It was backlit by the streetlight.  My hair stood up on the back of my neck and I made a bee-line for my bed, where I covered up from head to toe.  The next morning, I told my mom and dad what I saw (leaving out that its head appeared to be pointed and was darn near touching the top of the window).  My dad dismissed my story as that of having an over-active imagination and that no one could look into their bedroom as the window was too high off of the ground (approximately 7-ft.).  The person would need a step ladder to see in.  However, about this time in the neighborhood, the police were getting reports of a \"Peeping Tom\" but to my knowledge, no one was ever caught and the incidences stopped shortly thereafter. I know that this doesn't sound like much, but it made a deep impression on me.  As time has passed, I've learned what affect the sun can have on snow and how it can distort tracks in the snow.  However, this still doesn't explain to me how or why there were bare footprints with such a long stride in the snow.  Even if the sun had distorted them, it couldn't distort the stride or the depth.  I know what I saw and it wasn't normal.",
  "classification": "Class B",
  "county": "Monroe",
  "state": "Iowa",
  "latitude": 41.02174,
  "longitude": -92.73979,
  "location": "-92.73979,41.02174",
  "location_details": "Go East on Benton Ave. East to before it turns into old highway 34.  Take a left on the Country Club Road (you'll be heading North).  Go approximately 3/4 of a mile where you'll see an entrance to a field.  You'll have to walk in from there.",
  "temperature_high": 32.03,
  "temperature_mid": 25.445,
  "temperature_low": 18.86,
  "dew_point": 11.81,
  "humidity": 0.7,
  "cloud_cover": 0.02,
  "moon_phase": 0.41,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1029.1,
  "summary": "Partly cloudy overnight.",
  "uv_index": 2,
  "visibility": 9.92,
  "wind_bearing": 246,
  "wind_speed": 8.89
}