{
  "id": "24089",
  "title": "Witness hears loud screams and foot steps while camping near Laporte",
  "date": "2008-06-21",
  "timestamp": 1214006400,
  "observed": "We went on an all girls camping trip June 20 - 22 of 2008.  We were up having a fire, making smores and having a few drinks.  There was a total of 6 girls on the trip.  Everything was fine until we went to bed at around 3:45 in the morning.  4 girls slept in one tent while my best friend and I slept in another tent.  About 15 minutes after we finally got settled in we heard some loud screaming/grunting.  I knew that I had never heard anything like that before.  My friend and I were totally silent and listened again.  We heard it again but it was moving fast thru the forest.  We agreed that after that we would not be able to sleep by ourselves.  We left our tent, grabbed the hatchets from our campsite and slept in the tent with the other girls.  I did not sleep at all that night until after sunrise.  I was scared out of my mind!  I stayed awake with the hatchet in my hand for the rest of the night and the following night.  Later on that same evening/morning I heard something walk thru our campsite but I didn't even move.  I was too scared.  In the morning I thought I heard our cooler open but I was much too tired and thought it was one of the girls.  When I got up all of our water was gone out of our cooler, but the beer and food was left.  We never woke the other girls up that night and we didn't tell them until morning.  I was on high alert the second night but didn't hear anything except what might have been a small raccoon or something rustling around in the brush.  I know what we heard was not any normal animal.  I was really scared and I will never forget it.",
  "classification": "Class B",
  "county": "Hubbard",
  "state": "Minnesota",
  "latitude": 47.1589,
  "longitude": -94.83755,
  "location": "-94.83755,47.1589",
  "location_details": "We were camping in Gulch Lake Campground in Paul Bunyan State Forest.",
  "temperature_high": 74.81,
  "temperature_mid": 63.75,
  "temperature_low": 52.69,
  "dew_point": 48.97,
  "humidity": 0.6,
  "cloud_cover": 0.12,
  "moon_phase": 0.59,
  "precip_intensity": 0.0022,
  "precip_probability": 0.75,
  "precip_type": "rain",
  "pressure": 1016.69,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 7,
  "visibility": 9.83,
  "wind_bearing": 312,
  "wind_speed": 7.6
}