{
  "id": "7558",
  "title": "Military police find tracks at Ft.Leavenworth",
  "date": "2005-01-08",
  "timestamp": 1105142400,
  "observed": "I was stationed at Ft. Leavenworth in 1976, I was assigned to the 205th Military Police Unit. One of our duties was to guard the CAC building at the fort. This is the most important building on base. It is what we called the Comand Staff War School. It was guarded 24/7 everyone in had to sign in and out. NO EXCEPTIONS this was a very serious detail. Personally I hated it. I found myself on duty at the CAC with another MP we called JJ he told me about how an MP Officer had seen some big hairy thing along the river banks just a few days earlier, The officer was scared spitless according to JJ's story. He went on to say that this thing had been seen several times over the last few years and it's got everybody pretty spooked. The Officer in Question made a formal report about his experiance. His career was over shortly after that, The military keeps records on everthing including this one. The river runs along the entire east side of this installation and it is really thick flooded timber and lowlands. You could hide a herd of elephants in there for years and no one would ever know. I never saw this thing but we did see foot prints one evening down along the river. I was impressed with the size of these things, They were 14-16 long but it was the width that was really shocking, 6-7in. wide. It was almost like a snow shoe at the ball of the foot, It was in fresh snow and back in the heavy stuff where no one would have gone to play games. We were sent there to search for a runaway dependent. (Some Officers daughter that had gone to Kansas City with her boy friend as it turned out.) Like I said these prints were big. It was never officially reported because of the recent short term career matter mentioned earlier. If you see one of these things and report it you are history, Period. Check it out you will find several old by now I'm sure reports of strange beings around Ft.Leavenworth. Good luck in finding this thing, It does exist. NO DOUBT!",
  "classification": "Class B",
  "county": "Leavenworth",
  "state": "Kansas",
  "latitude": 39.3716,
  "longitude": -94.9,
  "location": "-94.9,39.3716",
  "location_details": "The tracks were found in the refuge area along the river. The sighting was along the river near the building (cac).",
  "temperature_high": 34.09,
  "temperature_mid": 30.945,
  "temperature_low": 27.8,
  "dew_point": 21.28,
  "humidity": 0.9,
  "cloud_cover": 0.81,
  "moon_phase": 0.93,
  "precip_intensity": 0.0001,
  "precip_probability": 0.06,
  "precip_type": "snow",
  "pressure": 1024.77,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 6.62,
  "wind_bearing": 159,
  "wind_speed": 2.43
}