{
  "id": "45215",
  "title": "Series of Bigfoot sightings at a cabin outside of Bethesda",
  "date": "2014-05-23",
  "timestamp": 1400803200,
  "observed": "We live in a cabin just outside of town with a swampy bottom that contains lots of trees and deer. In 2010 was when I had my first experience with something very large. Unfortunately, I couldn't make out what it was, but it had chased me several feet before I got into the cabin. In 2011, I had my first sighting of a creature that was about 8 or 9 feet tall, with brownish black hair that contained some grey and red streaks. It had been raining earlier that day and it appeared to have long stringy hair, deep set eyes, and very broad shoulders. Then in 2012, when my daughter was painting the benches at the fire pit in the far corner of our property she came running onto the porch white as a ghost. My husband asked her if she saw a snake and she replied she thinks she seen what I had seen a year earlier. She explained it as a reddish color beast of some sort. On May 23, 2014, our four year old grandson was spending the night. We were outside earlier letting the grand kids light their sparklers when the four year old said he seen something. We went back into the cabin and started watching television. A little later he said to his pap and then myself while we were watching television, \"did you hear that growl?\" ...we replied no and he ran to the back of the couch to look outside our large picture window. A few moments later he replied there's a gorilla outside and then started describing the same thing I had seen. His mother and I have never mentioned anything about our experience in front of the children before because we didn't want to scare them. His older brother was so afraid of his description that he made us close all the blinds and lock all the doors. The next day, we asked him if he remembered anything from the night before and he replied, \"you mean the gorilla.\" We asked him to show us where he had seen it. Once he showed us the spot, fear instantly came over me to know it was just a few feet from the window. I called my parents because they are the property owners and they went out and bought two game cameras to put on the trees.  Since then, a three to four feet section of our firewood that is stacked around the fire pit was pushed inward. Considering it was pushed from the woods inward and there's about a four foot drop behind the woodpile it was quite concerning to us. Finally, on May 25th, our granddaughter went out with us to sit on the porch and cried out dog... dog and looked overcome with fear. My husband grabbed the flashlight and saw something take off running. He then ran around the cabin to see what it was and it had already crossed over the bank at the property line. All he could see was two red glowing eyes.",
  "classification": "Class A",
  "county": "Belmont",
  "state": "Ohio",
  "latitude": 40.01983,
  "longitude": -81.07013,
  "location": "-81.07013,40.01983",
  "location_details": "The northern edge of Bethesda off of State Route 147.",
  "temperature_high": 64.86,
  "temperature_mid": 56.14,
  "temperature_low": 47.42,
  "dew_point": 46.23,
  "humidity": 0.66,
  "cloud_cover": 0.2,
  "moon_phase": 0.83,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.06,
  "summary": "Partly cloudy until evening.",
  "uv_index": 9,
  "visibility": 9.65,
  "wind_bearing": 323,
  "wind_speed": 6.53
}