{
  "id": "3185",
  "title": "Co-workers stunned by giant hairy \"man-thing\" walking down town street",
  "date": "1987-10-26",
  "timestamp": 562204800,
  "observed": "A co-worker and I  were finishing up our shift at a donut shop when the incident occurred. At about 2:45 am, I had stepped outside after seeing a speeding car go by. When I did, I heard dogs barking and howling like they were barking AT something. But it was the howling that gave me the creeps. Otherwise I would have passed it off as a cat tormenting a dog.  I went back inside and said something about the incident to my co-worker, and we kind of laughed it off and finished up for the night. About 20-25 minutes later I was in the kitchen area when my co-worker screamed \"GET OUT HERE QUICK.\" So I headed to the front just in time to see a very large hairy looking thing just walking down the street right under a light as casual as could be. We both kind of stared at each other for a few seconds and then I opened the front door to get a better look at this thing walking across the street. What happened next is still very vivid in my mind: My co-worker said \"do something\" so I yelled \"HEY!\" It never broke stride but it turned its head and looked right at me. Then it walked a few more feet and turned next to a fence and walked past a car wash and storage unit and out of sight. One odd thing I noticed about this \"thing\" was it had long reddish brown hair from head to toe and it didn't seem to have a neck. It was like its head was just sitting on top of the shoulders and it was very very large in size. It walked next to a chain link fence aproximately 6-7 feet in height topped by  three strands of barbed wire and this thing's shoulders were even with the top of this fence. I personally didn't see exactly where this thing came from but I suspect that it came out of the Sand Creek ditch which runs right through the middle of town. It's a large ditch that allows water runoff from the mountains a few miles away. Several minutes later the guy who delivered our paper drove up. I had noticed him coming from the exact area where we had lost sight of this thing, so I asked him if he had seen anything back there. He said no but he heard something in an old abandoned building he used to store his extra papers and it scared the hell out of him so he left rather quickly. Just a few minutes later a police officer pulled in on the parking lot. Still feeling shocked and a little scared about what we'd seen I asked him to drive his cruiser back in the area past the storage units and see if he noticed anything out of the ordinary. We watched him drive back shining his spotlight back and forth and as he turned past the storage units we lost sight of him. Several minutes later he returned quite shaken and started asking me what I'd seen. I was rather evasive about my answers (he asked me several times what I had seenbut I never did say.) He then asked me if I'd seen a bear and I replied no it wasn't a bear. Seeing him slop his coffee all over the table made me ask him what he'd seen and his answer was \"I didn't see nothin'. Nothin' at all.\" None of us ever mentioned it again afterwards and I never really spoke of the incident again until I ran across your web site.",
  "classification": "Class A",
  "county": "Fremont",
  "state": "Colorado",
  "latitude": 38.4,
  "longitude": -105.1167,
  "location": "-105.1167,38.4",
  "location_details": "The sighting occurred on Highway 115, the main street through Florence, CO. The setting was a commercial area with a nearby car wash, storage unit and donut shop with a nearby irrigation ditch. The town is just east of the Wet Mountains and the San Isabel National Forest.",
  "temperature_high": 66.01,
  "temperature_mid": 48.84,
  "temperature_low": 31.67,
  "dew_point": 28.13,
  "humidity": 0.42,
  "cloud_cover": 0.24,
  "moon_phase": 0.14,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.08,
  "summary": "Partly cloudy until evening.",
  "uv_index": 3,
  "visibility": 9.86,
  "wind_bearing": 119,
  "wind_speed": 1.35
}