{
  "id": "3559",
  "title": "",
  "date": "",
  "observed": "My friend John and a buddy had gone out drinking, but he said they were not drunk. He was driving his friend home, and in his words, his friend lived \"way out on a ridge in the middle of nowhere.\" Apparently they had to drive for a ways down lonely dirt roads with pretty thick forest on either side. It was mid-November and quite cold-- in the 30's-- and they were driving down such a road when they came around a bend in the road, which straightened out for a way, and were astonished to see what appeared to be a naked man, jogging along the road on the passenger side, going in the same direction as their car. He was approximately 100 yards ahead, jogging slightly hunched, and they noticed his arms seemed unusually long for his height. They looked at each other and thought he might have been the victim of some accident or crime, because, in their opinion, no one in their right mind would be out jogging naked in the Pennsylvania woods in the middle of November. So they approached the \"man\", and slowed down, and John's friend rolled down his window, and yelled out, \"Hey, man, you need some help?\" To his surprise they guy didn't slow down, but just kept jogging, so John pulled the car up level with him, and just as his friend was about to ask again if he needed any help, he looked in the window. At this point my John got a real funny look on his face-- I could see him visualizing what he had seen. I asked: \"Well, did he answer?\" And John said: \"He didn't have a face!\" When I asked him what he meant by that he said: \"Well, he HAD a face, but it was real flat, and he had eyes, but his nose was real small and so was his mouth.\" He also mentioned that the \"creature\" never stopped jogging while it was looking in the window, nor did it make any noise. He said it was covered with \"light brown or beige hair all over, about an inch or two long.\" The guys screamed and John's foot put the pedal to the metal. He said he looked in the rearview mirror as they left precipitously, and the creature was still loping along by the side of the road. Needless to say, he stayed at his friend's place that night because, he said: \"I couldn't imagine driving back down that road again by myself that night!\" I submit this somewhat inexact story for your database, hoping that it will help you \"track\" patterns of sightings over time, so that Sasquatch will ultimately be identified and protected.",
  "classification": "Class B",
  "county": "Crawford",
  "state": "Pennsylvania",
  "location_details": "Pennsylvania, 40 miles SE of Erie, in Crawford County, near Warren County. Not sure of the road or exact location, since this story was related to me by a friend in 1974. The incident occurred several years before, around 1971 or so.",
  "summary": ""
}