{
  "id": "51739",
  "title": "Memory told of seeing the neighbor's dog going after a hairy biped while squirrel hunting near Greenup",
  "date": "1990-09-09",
  "timestamp": 652838400,
  "observed": "When I was 14, I had gotten up early one Saturday morning to go squirrel hunting on a small piece of property by my parents house. This stretch of woods is located in Greenup County Kentucky in Northeastern KY. The property is bordered by a small creek \"Raccoon Creek\", and a river, the \"Little Sandy\". I hunted this area on a daily basis when I was younger and had never seen anything unusual. On this particular day in early September, there was a heavy dew on the trees so it was easy to hear anything moving as the dew would fall and make a very distinct noise. I was walking down the ridge top overlooking Raccoon creek and had not made any noise since arriving way before daylight. As often happened, my neighbors dog followed me that day and I thought I had ran him off a couple of hours earlier. Everything was completely still with almost no wind that morning. I started to hear the dog, \"Gruffy, start barking and growling in a way that I had never heard before. At first I tried to ignore the noise but after a few minutes I decided to go run him off again as he was destroying my hunt. As I quietly eased down the ridge about 50 yards, I saw what I thought to be a young bear through the trees. The animal was standing on it's back legs and was only around 6' tall. I noticed that as Gruffy would lunge at the animal it would knock him back with its hands. He would let out a yelp and then go back after the animal. I eased closer being as quiet as possible planning to shoot near the animal to keep it from killing the dog. As I got directly above the animal it noticed me and turned to look directly at me. This is when I noticed that it was not a bear. I did not immediately distinguish the animal as a Sasquatch but was very confused as to what I was looking at. The animal growled visciously which scared me more than I have ever been scared. When Gruffy noticed me he ran to me and kept barking at the animal. I thought about shooting the animal but decided that with a 20 gauge shotgun at this distance with #6 shot that I would just tick it off. I started to walk backward slowly. After 3-4 steps the animal let out a blood curdling growl. I literally threw my shotgun down and ran home. When I got home, I told my father about what had happened. After he got over the fact that my gun was still in the woods, he decided to grab his rifle and take me back to get the gun. He would not accept that this was anything other than a bear. I have never spoken of this encounter because if my father would not believe me then who would? Although black bears are in the area, I have only seen one in the wild in the area. I have been an avid hunter my entire life and hunt everything from Ginseng and Yellow Root to big game. I still am not entirely sure of what I saw that day but I know it was not a bear and it was not a human. A human couldn't possibly make the sounds that this animal made at the volume it made them.",
  "classification": "Class A",
  "county": "Greenup",
  "state": "Kentucky",
  "latitude": 38.31738,
  "longitude": -82.51773,
  "location": "-82.51773,38.31738",
  "location_details": "",
  "temperature_high": 81.68,
  "temperature_mid": 73.765,
  "temperature_low": 65.85,
  "dew_point": 67.98,
  "humidity": 0.86,
  "cloud_cover": 0.85,
  "moon_phase": 0.66,
  "precip_intensity": 0.0572,
  "precip_probability": 0.93,
  "precip_type": "rain",
  "pressure": 1015.33,
  "summary": "Foggy overnight.",
  "uv_index": 4,
  "visibility": 5.03,
  "wind_bearing": 210,
  "wind_speed": 3.7
}