{
  "id": "11632",
  "title": "4' - 5.5' upright animal seen crossing dead-end road.",
  "date": "2005-05-07",
  "timestamp": 1115424000,
  "observed": "My friend and I were on a vacant road (Victory Dumas)directly off of Calion Road in El Dorado, AR.  We were sitting on the tailgate of my truck just hanging out.  I got up to go get my cell phone from the passenger's seat and was about to open the door when I glanced up.  I saw a creature, about 15 yards away, standing upright about 4 to 5 feet tall on the left side of the road.  With great speed, it ran across the narrow road, and paused when it got to the other side without looking at me.  It took off into the woods.  When it did so, my friend jumped off of my tailgate, not seeing (only hearing it) and asked \"What was that?\"  I said \"I have no idea\" and then I told her to get in the truck.  When we got in, I told her that I saw \"something that didn't appear to be human but was running upright.\"  It appeared to be dark brown or black in color and looked to be covered in hair.  It was hunched over, yet very quick.  I can honestly say I have never seen anything like that.  We sat in the truck for 5 minutes out of fear.  I gassed it and left the road quickly.   Do you think this may be a young sasquatch?  After all it was only 4-5 ft. tall.",
  "classification": "Class A",
  "county": "Union",
  "state": "Arkansas",
  "latitude": 33.26462,
  "longitude": -92.64066,
  "location": "-92.64066,33.26462",
  "location_details": "A quarter mile before reaching 167 North, on Calion Road, turn right onto Victory Dumas and drive 500 yds to the dead end.",
  "temperature_high": 83.03,
  "temperature_mid": 72.18,
  "temperature_low": 61.33,
  "dew_point": 51.52,
  "humidity": 0.6,
  "cloud_cover": 0.07,
  "moon_phase": 0.98,
  "precip_intensity": 0.0001,
  "precip_probability": 0.11,
  "precip_type": "rain",
  "pressure": 1017.49,
  "summary": "Clear throughout the day.",
  "uv_index": 11,
  "visibility": 9.61,
  "wind_bearing": 153,
  "wind_speed": 5.61
}