{
  "id": "29360",
  "title": "",
  "date": "",
  "observed": "My fiance and I were visiting my family for a week from New York.  We went outside for a smoke, while the rest of my family was in bed asleep.  We stood under a tree in the yard, talking quietly for a bit. We then heard a long, low sound that scared me quite badly.  It sounded like a cross between a human moan and an animal cry, in long howls.  I had lived in the country, on that piece of property in Illinois, for more than 20 years, but had never heard anything like this.  I've heard deer, coyotes, foxes, cows, horses, even peacocks.  It also seemed to last much longer than a human's lung capacity would allow.  I was frightened, and grabbed my fiance, listening with him.  I remember telling them that we had to get inside and began to run towards the house.  When I reached the driveway, I stopped and turned back to find that my fiance was still at the bottom of the hill.  I called to him to get into the house. I noticed that the moaning sounds were still continuing.  I wasn't sure whether they had continued or not until that moment, because I was making a good deal of noise running through the leaves. I ran to the door, and waited for him to catch up. Once we were inside, I could no longer hear the noises.  I would estimate that the sounds lasted at least two minutes before we got inside, and sounded as though they were coming from behind the neighbor's house. Two nights later, we were outside under the same tree smoking again, when we hear something crashing through the woods.  The property isn't huge, but whatever this thing was, it covered three sides of the property in a matter of seconds.  We heard large branches snapping, tree limbs smacking.  Again, I have never heard an animal make noises like this in the woods, and the speed was beyond human. Deer are the largest animals around there, but they don't make that kind of noise running through the woods.  It didn't seem possible to either of us that a deer or any other animal indigenous to the area could move though around the property so quickly.  I was again quite scared, and hightailed it to the house before whatever it was could decide to head our way.",
  "classification": "Class B",
  "county": "White",
  "state": "Illinois",
  "location_details": "My family's rural property.",
  "summary": ""
}