{
  "id": "6639",
  "title": "Couple have night sighting near Lake Tahoe",
  "date": "2003-07-20",
  "timestamp": 1058659200,
  "observed": "My wife, my two children, and I were driving on Hwy 50, west bound, leaving South Lake Tahoe at 9:55 PM.  We just passed the agriculture inspection station in the town of Meyers, CA, when both my wife and I saw simultaneously a large animal crossing the road about 100 yards in front of us.  I thought it was a bear but wasn't sure.  So I asked my wife.  Her response was most unusual. She said that she saw it walking on two legs and that it looked like a monkey, about 5 1/2 feet tall, with light brown fur.  She has better eye sight than me so I questioned her further.  \"What else did you notice,\" I asked, very curious.  She said that it had walked rather slowly, across the road, and that it was definately an animal, like a monkey, and walked like a monkey would walk. It disappeared into the trees, before we could get close enough for a better look.  I wanted to turn around and look some more but my wife didn't want to.  So we kept driving.  That's when I had a chance to question her more. My wife has had Laser surgery on her eyes, and I wear corrective lenses, which, most unfortunately I wasn't wearing at that moment.  This is why she was able to see better than me.",
  "classification": "Class A",
  "county": "El Dorado",
  "state": "California",
  "latitude": 38.85556,
  "longitude": -120.0133,
  "location": "-120.0133,38.85556",
  "location_details": "\"It\" crossed Hwy 50 close to Upper Truckee River.  I can pinpoint the location because Hwy 50 crosses Upper Truckee River.  I know the area  well, I want very much to look for tracks in this area. But I live in Sacramento and I'm too busy right now.",
  "temperature_high": 89.73,
  "temperature_mid": 74.07,
  "temperature_low": 58.41,
  "dew_point": 38.97,
  "humidity": 0.3,
  "cloud_cover": 0.1,
  "moon_phase": 0.73,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.85,
  "summary": "Clear throughout the day.",
  "uv_index": 11,
  "visibility": 10,
  "wind_bearing": 184,
  "wind_speed": 0.9
}