{
  "id": "1944",
  "title": "Family has multiple encounters with white bigfoot creature",
  "date": "1969-08-16",
  "timestamp": -11923200,
  "observed": "Back in 1969 when I was twelve years old my mother and oldest brother saw a creature while we were camping that changed our whole outlook concerning Bigfoot. This is our story' It was friday afternoon and my family was all excited about going on a weekend camping trip. My dad got off work a little early and we my mother,five brothers and my sister had the truck packed so there was no delay in leaving when dad got home. AS we were heading down our street,My great Aunt stepped out to the curb in front of her house and waved us down. She found out where we were going from my mother earlier that day,Instead of telling us to have a good time she warned us not to go. She said a few weeks earlier she and my uncle had gone to the same place we were going,and were fishing on the river when suddenly she saw a hairy face peering at her threw the bushes as she fished. It scared her and she began calling for my uncle It must have scared the creature because it ran away very fast.When she told my uncle what she saw,He just called her a crazy old woman.But took her home anyway. Well upon hearing what she just said,my dad laugh and told her we would keep an eye out for her booger. We arrived on the river in plenty of time to set-up the camp and have supper before it got dark. Soon it was dark and my brothers were across the road from the camp about 50 yards away fishing for catfish,they were my three older brothers. The rest of us sat around the camp fire planing the next days activities. my dad was listening to the radio and my mother,sister and two younger brothers was going to bed in our tent,the family dog was with us and acting kind of strange all evening. I was not ready for bed yet so i took a little walk down the dirt road about 100 yards or so from the camp. the moon was out but with all the heavy trees near both sides of the road it was to dark to see more than twenty feet infront of me ,when suddenly my hair stood up all over me,I turned around fast and ran back to the camp. Thinking my aunt might be right about what she saw I decited to go to bed,laying there for a while before falling to sleep. The next morning I got up from bed feeling great and along with my family we had a wonderful day fishing,swimming and just enjoying the great out-doors. Soon it was saturday night and my brothers was back fishing for them catfish across from the camp. My dad was listening to country music on the radio and my mother and the rest of family was heading to bed.I was very tired from the activities of the day and decited to go to bed as well it was around 9:00 pm. A half hour had pasted and the dog was acting scared about something and to my suprise he unzipped the bottom section of the tent and climbed in with us. So we let him stay in the tent to settle him down,my mother went out side the tent behind the truck to take a leek,suddenly she began screeming I jumped up to look out the window to see my mother running to my dad around the truck saying it was watching me over and over agan. AS we all ran to my parents,my brothers fishing on the river also came running. My dad told everyone to start packing up'we are breaking camp. My oldest brother stood guard with a pump-shotgun while we made record time loading the truck,then my brother started shooting at something and yelling the dam thing is circling the camp. As we all were loading into the truck my dad and older brothers found strange footprints near the truck where my mother saw the creature standing. The footprints was 14 inches long and 8 inches wide and had onley three toes on each foot. WE were all so scared and went home right then. The next morning my aunt came up to our house to check on us' when she saw our still scared faces she knew we also had a run in with that creature. she and my mother got together and along with my brother they compared what each other had seen, it was white in color red glowing eyes and had a pointed head. about 6 to 7 feet tall and had long arms. needless to say we are a little picky about were we go camping anymore.",
  "classification": "Class A",
  "county": "Little River",
  "state": "Arkansas",
  "latitude": 33.76986,
  "longitude": -94.3643,
  "location": "-94.3643,33.76986",
  "location_details": "Take hwy 71 to hwy 32 go west to Aleen cross over railroad tracks keep on 32 for 3 to 5 miles find the road to the right that leads to the river. the place is called cottonwood shouls.",
  "temperature_high": 97,
  "temperature_mid": 85.13,
  "temperature_low": 73.26,
  "dew_point": 69.25,
  "humidity": 0.64,
  "cloud_cover": 0.42,
  "moon_phase": 0.11,
  "precip_intensity": 0.0366,
  "precip_probability": 0.47,
  "precip_type": "rain",
  "pressure": 1007.91,
  "summary": "Humid and partly cloudy throughout the day.",
  "uv_index": 8,
  "visibility": 7.18,
  "wind_bearing": 201,
  "wind_speed": 7.64
}