{
  "id": "992",
  "title": "",
  "date": "",
  "observed": "I was hunting behind my parents place with 3 older guys and a high school friend. We where over a mile back and there weren't any roads just a trail that we used. We would split up for the morning and then return around noon to a place we called the kitchen to build a fire and have lunch. That day I just kept going south and west because the swamps where frozen and I was seeing plenty of deer sign. It was getting close to noon so I decided to cut north east with my compass and hopefully pick up our trail and meet back at the kitchen for lunch. I came to a swamp with lot's of alder brush and tamarack but I could see highland about a quarter mile through it so I decided to go to it not knowing exactly where I was. The first thing I noticed that was strange was the deer sign had just stopped not a track around. I finally reached the highland and to my surprise through the middle it looked like a trail with branches broken of high. I saw what at first I thought where pac boot tracks then I looked at them closer it looked like a human foot print with toes. It was 12- 14 inches long with a heal that was 4 inches wide and maybe 5 inches across the toes. It was a very creepy feeling and I was glad to have my deer rifle. I wasn't sure what to do but decided to follow them for awhile since they where going the direction I needed to go. When I got to the swamp it looked like it took of running north so I just kept going north east. I finally made it back to the kitchen and met up with the other hunters. I was reluctant to say anything but decided that I had to. Of course they all looked at me like I was crazy. Then I told them that with the snow I could track myself and find my way back there so someone had to come with me to see what I saw. My high school buddy said he would. We started out and I new that daylight time was short but we did make it  back to that highland and my buddy saw the tracks and to this day we still can only say that they where bigfoot tracks. The next day I wanted to bring a couple of other people to the site but the weather turned warm and the snow had melted enough that I couldn't find the location. Everyone was tired trying to find it so we never did get back there. That was 20 years ago and I still tell the story once in a while but have never written it down. Finding this site has made me feel better about what we saw that day and instead of trying to just let it rest it has made me think more strongly about it again. When I read the eye witness account from the young kid seeing a bigfoot over by Cotton, MN, that was  close to the same time period and the distance is only 30 some miles maybe it was the same one. Plus I saw a news clip on a Duluth TV station this week. about Dr Juice taping the noises of a big foot in Washington state also rekindled me to tell my story here.",
  "classification": "Class B",
  "county": "Itasca",
  "state": "Minnesota",
  "location_details": "The area is east of Goodland. South of where My parents and I now live. The forest has changed drastically in the past 20 years because of logging.",
  "summary": ""
}