{
  "id": "22899",
  "title": "Possible daylight encounter on Fort Rucker Army Base",
  "date": "2008-01-19",
  "timestamp": 1200700800,
  "observed": "I was assigned to Ft Rucker, AL from Oct 1991 until Jan 1997 as a fire fighter. As military firefighters we would often be assigned to small airfields (stagefields) around Ft Rucker. At the time this happened I was assigned to Tabernacle stagefield. Tabernacle was on the north west end of a large impact area used for aerial gunnery by pilots in training. During a typical duty day we would have several down time periods where aircraft were not flying. These down time periods would typically take place around noon and evening lasting 2.5 to 3 hours. When I was assigned to Ft Rucker, I had met some other Soldiers that introduced me to Indian “relic” hunting. This consisted mostly of lots of walking through tilled fields, creek washouts, and recently cleared timber tracts looking for arrowheads and anything else related to the old Indian tribes that formally lived in the south east Alabama region. I had found that the down times when aircraft were not flying often granted me the chance to get out in the woods to hunt for arrowheads. Often I was able to get several miles away from the stage field during the down times and was usually by myself for several hours. My typical hiking outfit was to put on a pair of cargo shorts, an old pair of army boots, a belt with a canteen, a pouch (for any finds), a large survival knife, ball cap and a walking stick. I usually would not wear a shirt hoping to get a tan while out walking. This day in particular was in I left my stage field around 1100 AM or so. I headed East, North East for about 1.5 miles on an improved asphalt road that bordered the impact area. I then head north down a dirt road (path was more like it) that was seldom traveled. The road went up and down some gentle hills and was bordered on both sides by heavy vegetation and thick woods. I believe I had walked maybe ¾ of a mile when I was approaching a small creek crossing which was not unusual. I was maybe within 50 feet of the creek when off to my left side I heard a lot of movement approximately 150-200 feet into the woods appearing to come from the creek bank. I heard what I can only describe as a grunt and my first though was a wild pig. That thought was quickly erased though, as I immediately got instant chills…goosebumps running my entire body…and had the heavy feeling that I was not alone. I heard another grunt and peered into the woods from where the sound came from and saw a large “shadow”…easily 6 to 7 foot tall stand from the creek bed. Because of the thick woods I got no clear view of it but my first thought was that it was a large very dirty man but it definitely had the appearance of a man shape. I only saw this thing for a few seconds as it appeared to see me…and me watching it and it turned and went crashing into the woods away from me. I wasted no time turning my walk into a trot away from what I had just seen. Whatever it was it scared me and as I headed back to my airfield I tried to make sense of it. The only thing I could conceive it being was that maybe it might have been a stray horse back in the woods. I know this sounds very unlikely but I really didn’t want to believe I might have seen something I could not explain…a horse in the woods I could almost believe. I never went back into that area of the woods again, and seldom ventured into thick woods period after that. I never gave it much thought after that as I had chalked it up as being a horse, which seemed to make sense to me. I did bring my strange experience up a couple of times to some folks but they thought I was kidding them and none of them had ever heard of anything like that in Alabama before. Two things led me to revise my thinking of what I saw that day. The first being this. In 2000…I was and am still living in Kansas and serving in the Army Reserve. We had a new Soldier join my unit. He was a former Ranger Sniper team leader having been assigned to the Ranger battalion at Ft Lewis, WA. He was a good old country boy from Kansas living in a small town. He and I became very good friends and later served in Iraq together. We would often talk about events in our lives at length. During one conversation I related my story about what I saw in the woods assuming he would think I was nuts. But…he believed me. As a matter of fact he said if I saw something I found hard to believe he said that I should just go with what my gut told me. He then informed me about his experiences. He told me about his time up at Ft Lewis and as a sniper he would often be in the woods alone for days at a time in hide sites during training missions. He told me that at night in the deep woods he would often feel as if he was being watched and would hear the sounds of something large moving through the woods. Now this fellow was an experienced woodsman and was used to the sounds and smells of the woods. On occasion he was able to see something quite large in the shape of a man moving around his hide site through his night vision goggle. He said it would never come too close…just kind of checking him out. He said he never felt threatened by it and on the occasion it would make some sounds (grunts or whistles) as if it was agitated and he would talk calmly too it. He said that he wood talk in a slow, low voice telling it “I’m not here to hurt you, just calm down, I don’t mean no trouble for you”. He said that usually after he spoke towards it, it would just move away from him and would leave him alone. He said this happened numerous times as he was often in the same area. He told me he had no doubts at all that “Bigfoot” was around but he would never do anything to harm it and he felt that if left alone it would not harm anyone. So that got me to thinking, maybe that afternoon in the woods I really did see a Bigfoot. The second reason I feel that I didn’t see what I convinced myself was a horse is that after culling the BFRO website I found that I am not the only one to have seen something in Alabama. So…I am not alone and I am now convinced that what I saw was real…and not something else. I haven’t shared this story with very many people…but maybe this is the time to do it.",
  "classification": "Class B",
  "county": "Dale",
  "state": "Alabama",
  "latitude": 31.35,
  "longitude": -85.7075,
  "location": "-85.7075,31.35",
  "location_details": "I have looked at some satellite images of the area and cannot pinpoint the exact spot just the area within a few hundred yards. Lot of rural homes within a few miles of the area",
  "temperature_high": 41.94,
  "temperature_mid": 34.28,
  "temperature_low": 26.62,
  "dew_point": 37.15,
  "humidity": 0.89,
  "cloud_cover": 0.84,
  "moon_phase": 0.4,
  "precip_intensity": 0.0539,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1018.71,
  "summary": "Heavy rain until afternoon.",
  "uv_index": 2,
  "visibility": 6.55,
  "wind_bearing": 355,
  "wind_speed": 8.17
}