{
  "id": "940",
  "title": "Creature stepping over a guardrail",
  "date": "1984-07-14",
  "timestamp": 458611200,
  "observed": "In July 1984 at about 11:00 p.m. my friend Will and I were traveling westbound on state route 4, when I noticed movement on the south side of the road. What I saw was a large black head and shoulders coming over the guardrail on the south side of the road. As I came to a stop, I turned on the highbeams and saw the creature step easily over the guardrail. It was about 8 feet tall with a kind of shiney black hair covering most of its body. As the creature walked, I noticed it never quite straightened its legs, yet it had a graceful stride. Its arms hung fairly low, coming to just above the knees. It was very powerfully built with massive chest and arms. Even though it was covered with hair, I could see its muscles flexing in its legs and arms. Most of the hair was an inch or two long with some maybe 4 inches on the back and shoulders. This thing was big. In my estimation it had to have weighed 800 pounds or more.  As it neared the center of the road it actually turned and looked right at us. Doing so required it to turn its upper body as its head sat low between its shoulders. When it looked at us its brow furrowed in what I believe to be a look of anger. It looked really p.o'd. I could see its palms as it swung its arms and noticed it had either no or very little hair in the palm area. Also the \"soles\" of its feet appeared to be devoid of hair. there was almost a hairline at the sides of its feet. Also noticed was what appeared to be male genitalia , though the genitalia would have to be considered quite small when taking into account the size of the creature. It turned its head back to the forward position and continued across the road and out of my headlights. On the right (north) side of the road here is basically a shear cliff. It had to have climbed right on up. There was no other place it could have gone. I actually turned my truck in the direction it was moving to see it and could not. My friend who was quite frightened, said \"what the hell was that?\" I believe my response was something like \" A damned bigfoot. That was a damned bigfoot\" In my opinion, there's absolutely nothing else it could have been.",
  "classification": "Class A",
  "county": "Cowlitz",
  "state": "Washington",
  "latitude": 46.1903,
  "longitude": -123.1175,
  "location": "-123.1175,46.1903",
  "location_details": "On State Rt. 4, approx. 5 miles west of Longview WA.",
  "temperature_high": 79.8,
  "temperature_mid": 65.23,
  "temperature_low": 50.66,
  "dew_point": 51.7,
  "humidity": 0.64,
  "cloud_cover": 0.05,
  "moon_phase": 0.56,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.44,
  "summary": "Clear throughout the day.",
  "uv_index": 9,
  "visibility": 9.72,
  "wind_bearing": 331,
  "wind_speed": 5.11
}