{
  "id": "13692",
  "title": "Daytime sighting by young girl hiking with family north of Fairfield",
  "date": "1988-08-20",
  "timestamp": 588038400,
  "observed": "I was nine years old when my family and I were camping at McCan Gulch  which is approx twenty miles North of Fairfield Idaho, Camas County.  We were exploring the mining camp that has for years transferred into a ghost town. The abandoned cabins there were still in reasonable shape. The stairs were still sturdy enough to explore the upper levels. After a while of flipping pennies out of a wrist rocket and playing around with my brother, my dad had told us to gather together and let us know that it was time to get back to camp. My brother was seven and my youngest sister was just four months old. My dad had her in a pack on his back. As we took off on foot back toward camp we had formed a line, my step mother in front, then my brother, followed by me, and my dad was taking up the rear. Our family pet, a Chesapeek Bay Retreiver, was weaving in and out of us while happily sniffing around. I wasn't very perceptive to the cues that my parents were sharing but when my dad called our dog back to him and commanded her to \"sic\" something he thought he'd heard in the bushes on our left I was close to pay attention. A brave and very loyal dog, she obeyed and bolted straight into the thick bushes barking at what could have possibly been the scent of whatever my dad had heard. Only moments went by when our dog yelped briefly then came barreling out of the bushes and escalated into a full run in the direction of our camp. She was a very obedient dog and smart as well, my dad had called her name and commanded her to return as she was running away but to no avail. So he told us to pick up the pace. A little cautious, but not yet frightened, I continued walking but trying to be more aware of my surroundings. I was looking to my right and the mountain was steep but about ten to fifteen feet up on the side of us the mountain leveled out alomst like a narrow path in a ring around the mountain then continued on a steep angle as far as the trees would allow me to see. I glanced up to what I thought looked like a path and much to my supprise I was looking at \"something\" that was looking right back at me. The figure was tall like an adult, slightly hunched over but not hunchbacked, the arms were not a whole lot longer than would be considered normal. It was covered in an orangish, redish, brown hair from head to toe. Seemed to be at a stand still but was in a stride position, as if when I saw him he had been walking paralell to us but I only looked long enough to see him in between steps. It did scare me, alot. The next thing I remember I was running to camp with the rest of my family. I was crying, and wanted to leave. My dad had built a lean-to that we were originally going to sleep under. We got back to camp and my dad built a \"perimeter alarm\" out of fishing string and pop cans with pebbles sprinkled into them and strung it all the way around our camp. Our dog was in the back of the pickup huddled up toward the back window and still would not obey commands. As we sat hunched together wanting to leave but having to wait for my dad to be as frightened as us, our dog began to growl. Shortly after this the pop cans started rattling all around the perimeter of our camp and it seemed to be enough to alarm my dad  to the point of loading up and leaving. I try to tell these details as accurately as I can but I was only nine years old and alot of the parts I tell about what the dog had done and what my dad did I gathered from him telling his version of this story. I do, however, know what I saw and I know, I just know, it was a sasquatch. Theres no other explanation.",
  "classification": "Class A",
  "county": "Camas",
  "state": "Idaho",
  "latitude": 43.4082,
  "longitude": -114.8281,
  "location": "-114.8281,43.4082",
  "location_details": "",
  "temperature_high": 83.33,
  "temperature_mid": 65.95,
  "temperature_low": 48.57,
  "dew_point": 30.22,
  "humidity": 0.26,
  "cloud_cover": 0.09,
  "moon_phase": 0.26,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1006.72,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 10,
  "wind_bearing": 263,
  "wind_speed": 5.65
}