{
  "id": "2036",
  "title": "Multiple witnesses encounter bad smell, three observe creature hiding behind sapling",
  "date": "1988-06-01",
  "timestamp": 581126400,
  "observed": "On a real nice night in June about 9:30p.m. myself and some other guys were talking after a softball game on what we wanted to do. So one of the guys suggested that we go to the \"old resort\" to see if anybody was partying there. The old resort was a abandoned piece of land that had a strectch of driveway from a road that went over a hill down a low part and up again. And on top of that second hill was a old empty in-ground swimming pool and a couple of small collapsed buildings. I havenever been there before but heard of others talking about having a \"kegger\" there a time or two. So we all loaded up in Dave's van and off we went, there were 6 or 7 of us. When we arrived there we went over a gate down the hill and up the 2nd hill to the old resort. No one was there but I wanted to see this place for myself, the moon was real bright and your eyes adjusted real well to the lighting conditions and after about 20 min. of \"exploring \" we decided to head back to the van. Now there was 2 guys ahead of us, myself Mike and Gene, and 3 guys in back of us, at about a distance of 25 feet between each of the groups. The two others that were walking with me was Mike and Gene, I'm about 6' 3\" and Gene is about 6' 5\" and Mike was short. As we were walking west towards the van in between the two hills with woods on both sides of the path back to the road. I started to smell the worse odor that wasn't chemically produced. Something like real bad B.O., musky like and fecal. At that point I said \"Gene, what is that smell ? \" and Gene said \"It ain't a skunk but it's just as bad.\" Thats when Mike stopped in his tracks and began looking at our right .We stopped as well and Gene looked where Mike was and said \"Oh my god, look!\"   I looked and saw a figure about 20' from our location staring right back at us. Couldn't make out facial features because the moon was behind it but it stayed behind some brush just checking us out. I looked ahead of us and the guys in front were there and looked behind me and those guys was acounted for also. I said \"What is that?\" and Gene said \"I don't know but I can't handle this!\"  Off he went with me and Mike.  After him passing by the guys in front and when Gene got to the gate he climbed it with 2 steps and didn't stop until he got to the van. I know this because I was right behind him. We waited for the rest and told them what happened. Then I began to rationalize that maybe we just smelled a dead animal and maybe it was just a cedar tree swaying in the breeze. So Dave and I went back to the spot and there was no smell and no tree at the spot where I saw it. Whatever we saw was taller than both Gene and I by about a good half foot.",
  "classification": "Class A",
  "county": "Greene",
  "state": "Missouri",
  "latitude": 37.07354,
  "longitude": -93.13545,
  "location": "-93.13545,37.07354",
  "location_details": "Wooded area near Lake Sprinfield, which is connected with James River",
  "temperature_high": 82.93,
  "temperature_mid": 70.575,
  "temperature_low": 58.22,
  "dew_point": 61.2,
  "humidity": 0.71,
  "cloud_cover": 0.77,
  "moon_phase": 0.54,
  "precip_intensity": 0.0033,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1014.75,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 8.07,
  "wind_bearing": 155,
  "wind_speed": 5.02
}