{
  "id": "13211",
  "title": "Early morning sighting by resident along Highway 7 near Bismarck.",
  "date": "2005-12-04",
  "timestamp": 1133654400,
  "observed": "On 12/4/05, at approximately 8:15 a.m. I was standing approximately 50 yards from the south-west corner boundary marker of my property when I heard the neighbors dogs start to bark and run southward on Arkansas Highway 7. They only ran a short distance before stopping. I immediately thought that they must be barking at a deer that was crossing the road.  My first thought was to get my gun from my truck.  Then, I remembered that I had parked outside the fence in front of my house.  So, I decided to just stand there and see if it was a doe or buck and hope it would not feel pressured since the dogs had stopped barking.  I also believed the deer would change directions if it saw me hurrying in its same general direction.  Therefore, I just stood still and waited in hopes of getting a glimpse of it.  Then, if the dogs would keep quiet, I could hunt it later.  Only one got to see it for 2 to 3 seconds, but I saw it clearly. My first impression was that I was observing a very large man who was wearing a hooded black parka, then I realized it was some kind of animal.  It was approximately 50 yards away and was on the opposite side of an old fence that has been overtaken by grass, weeds, vines etc. I only had a left side view as it was traveling east along an old fence row.  It covered a distance of about 20 yards in about 3 seconds.  I could only see its upper body.  I could see that it was not a bear but I couldn't make out distinct facial features from the side from that distance.  It was like an ape in some ways but its posture appeared more man-like. I can best describe the size by comparing it to a very large man I know who is approximately 6’9’’ and weighs roughly 280 pounds.  This creature was least that tall, possible a little taller, but close to the same build. I did not get a long view of it. I probably would not have had time to take a picture even if I would have had a camera in my hand. It was moving at a brisk pace, but not lightening fast.  Its stride resembled a trot or a jog.  The body was moving quickly but there was no up and down motion. It appeared to have a moderately thick coat of black hair. From what I could tell its face was dark too, as if there was some hair on its face. It was moving through a well used deer crossing. There is an old fence row there, on of both sides of Arkansas Highway 7.  The west fence row had recently been cleared and the east side was logged about five years ago and has a fair amount of undergrowth and a game trail running along the south side of the fence row. Just a little to the south west of the spot there is a thicket that is approximately 3 acres in size.  There are a couple partial open areas in the woods here. Most parts of this thicket can be walked through fairly easily. In places the thicket is too thick to move through without clippers and or a machete. I did not see where the creature crossed Arkansas Highway 7 but it most likely came from an area that is about 40 yards away from the highway’s west side ride-of-way. I believe that this creature waited until there were no cars coming becoming before crossing the road.  I did not get the impression that it was running from something. I have mentally replayed the entire scenario many times and I have stood and looked at the same area where the creature was seen. I looked for tracks after the incident but the ground was too brushy for obvious tracks. I've stood in the spot where I observed the creature from. I've watched as vehicles traveled north and along Arkansas Highway 7 and considered every other possible scenario. It wasn't any kind of illusion. It was there and I saw it.",
  "classification": "Class A",
  "county": "Hot Spring",
  "state": "Arkansas",
  "latitude": 34.285,
  "longitude": -93.162,
  "location": "-93.162,34.285",
  "location_details": "The general location is approximately 3 miles south ouf Bismarck.",
  "temperature_high": 44.99,
  "temperature_mid": 36.125,
  "temperature_low": 27.26,
  "dew_point": 30.68,
  "humidity": 0.63,
  "cloud_cover": 0.53,
  "moon_phase": 0.11,
  "precip_intensity": 0.0036,
  "precip_probability": 0.19,
  "precip_type": "rain",
  "pressure": 1018.24,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 2,
  "visibility": 9.57,
  "wind_bearing": 19,
  "wind_speed": 7.92
}