{
  "id": "12405",
  "title": "",
  "date": "",
  "observed": "My name is [TH], and I have lived in an old Mining Camp, in Northern California for the past two years. During that first fall I would hear a strange whistling call that would come from a Sequoia tree that stands out in about 2 acres of blackberries that surrounds my yard. The berries run down to a thermal spring on the property that itself runs down to “I” creek, which is around 50 ft. further up the hill from that creek. I thought this was a stray bird of maybe a tropical sort perhaps lost by someone. It would call to me in a guttural clicking sound followed by a series of sing song chirping whistles. I would call back, and then it to me and so on and so forth for around 20 minutes to 45 minutes before it would stop. It was always at dusk towards night and so I would call it a \"night bird\". There have also been numerous times that I smell a strong wet garbage smell that shows up suddenly in my yard and house. The latest incident is taking place around every few days now, at least for the last three and one half months. This smell shows up in the late spring and usually stays around off and on through the last apples falling from the fruit trees on my property. I rent. I have sensed something looking at me from the steep hill across the road from my house that comprises my back yard. Sort of like the feeling one gets when a puma is near. The other night I had an incident where the creature I am talking about banged on my trailer at around four in the morning. When I went outside on the porch to see if it was somebody, I had every single hair on my body go up instantly. I just knew that whatever it was; was right there. I beat feet into the house and locked the door. The early morning smell was so strong that I couldn't even sleep. It smelled like a garbage dump. I have been around lions and have had the hairs on the back of my neck go up, but never anything remotely like this. I have heard very heavy thumps coming down the hill behind my house late at night many times during these same seasons. They sound like very heavy footfall. There is one particularly loud thump that I can hear that I think I have identified as this thing as it jumps from the road next to my house down into the my yard on its way to the creek. I have seen it twice now. The first time was around four in the morning when I walked out of my trailer onto my front porch. The door squeals so it makes a lot of noise and when I opened it I must have startled the thing. At first I thought I had just seen the biggest bear of my life until it registered in my head that it was running on two long legs, crouched over. I noticed that it was swinging two very long arms. It was the fastest moving animal I have ever seen. [In 2005] I reported it to a place here called J.B’s deli and was put in touch with [Carmine (Tom) Biscardi -- a.k.a. \"the Great American Bigfoot Research Team\"]. They came and investigated and now I have a live video feed coming from two spots near the creek. The second time I saw it was at around one- thirty in the morning a few weeks later. I noticed the apple tree in the far corner of my yard going berserk. The big branches were really shaking hard. I had a night vision scope so I took it outside and looked through it but the tree settled down and I did not see anything so I sat the scope down. When I looked back over there I saw a human form from mid upper arm up walking towards the creek at the edge of the berry bushes. The bushes are around six plus feet tall, and this thing was perhaps two feet taller. I saw large rounded head on very large rounded, thick shoulders. It seemed to have very little neck. I could see that it was hairy and got quite a good view because it was silhouetted by a light on my neighbor’s porch. My daughter was staying in a tent out in the yard a few nights later and was awakened by some whistling and then by something hitting her tent. Like something had been thrown. There has been a print found on my property also. It is around 19 inches long and about 8 inches wide. I have never seen anything like it, but it looks like a giant human footprint to me. These incidences are ongoing. I think this thing summers here. What do you think? Also, do you have any suggestions on your experience as to how I may be able to study it or observe it here? I would be delighted at any input. Excerpts from Report # 12910                                           October 27, 2005 OBSERVED: I have new possible evidence on the hill behind my house that I and a few friends of mine have found, and we desperately want someone more qualified to look at what we have here. I would appreciate talking to someone ASAP so that I can connect with you for a possible story. For two years I have heard a whistle and chuffing sounds coming from the berries bushes in my yard. I thought it was some lost big tropical bird. I would call back to it, and it would call back, and so forth. I have had some bad odor incidences including one that woke me up from a dead sleep and gagged me. A volunteer found a footprint up the hill behind my house and some friends of mine, [T. C.] and [N. M.] found additional footprints and hand prints in an area up the hill from my house that appears to be some form of crude camp. I have been there three times now and the second time I went there I observed that some 4-5 inches around 4-5 ft. long branches have been brought from some where other than that location and laid in a sort of rectangle fashion around a depression in the earth. There are more of these depressions without branch borders in the area. There are snapped trees at @ the 10 ft. level; there are \"huts\", for a lack of a better term made from big branches. Some look older and some look recently made. There are also snapped trees and tracks that seem to form a path from this site down the hill towards my house. [N. M.] Found two pretty fresh handprints that appear to be coming out from one of the \"huts\". The finger tips are spread much farther a part than a human could have done. We found three separate footprints there that did not seem to be very old, maybe a couple of weeks, but no more. I saw the Bigfoot three times now, once at 4 AM in the morning, and twice at 1 AM in the morning. It was very dark each time except once it walked in front of a light and I got a good look at its height and silhouette. Excerpters from Report # 20720:                                        August 09, 2007 It was four thirty in the morning as I opened the sliding glass door to my trailer looking east towards my yard and “I” Creek; I thought to myself, that's the biggest bear that I have ever seen. As it stood up from the blackberries in my yard it was eating, I saw two long arms and two very long legs. It began to run north towards the path I have that goes thru the berries to the creek, and I said to myself' \"that's not a bear\". I knew I had just seen a Bigfoot. WOW!!! I saw it run towards the creek and I heard it crashing through the bushes down there. I did not follow. I'm not usually a scared kind of person, but I did not follow because I was scared. I had never seen anything like that in my life. I live in the woods and I have seen lots of bears and large animals. I  consider myself good at estimating, so I estimated it as 10 to 12 ft. tall and it probably weighed somewhere in the neighborhood of 1200 lbs. no lie. Later that day I went down and looked on the trail the way it had gone. I found horse hair ferns that had been torn out from an area of about a thirty foot radius where something had torn them out and made a large \"bed\", for lack of a better word, there on the ground near a natural spring that comes out from under a maple tree. I walked down to the creek and found the tops of two very large footprints in the sand at the very edge of the creek. The prints disintegrated into the water as I watched them, but I was pretty freaked out by then.  On with the story... Every night for a whole summer I would smell it in my yard, it smelled like a mixture of wet dog, garbage and sewer...if you can imagine that. One night the smell woke me up gagging. I thought it was a bag of garbage I had left out on the porch that night. You see, it is so much easier to stay in a sort of denial when you see these things. It really is too hard to believe what you are encountering. Anyway, the cameras were up in my yard at that point and I had these computers in my house so I sat down at the computer and started looking at my emails. There is a window right next to my sliding glass door where my porch and stairs are. I heard a small sound behind me at that window while my back was turned away at the monitor and when I looked I saw a huge dark face in that window. The face was tilted slightly and I could make out the shiny spots at the brow and bridge of the nose. It was very dark outside and what I saw was the reflection of the things face in the light from the dining room. I looked at it and it looked back at me for a few seconds and then it turned away. A few seconds later I heard a loud bang as it slammed something into the end of the trailer. I looked later and found a big dent. I got up and ran out onto the porch. I actually thought it was pranksters. I got out on the porch and noticed how dark it was in the yard at that point. I yelled, \"Get out of here!\" I thought that would scare away any kids that might be in my yard when suddenly every hair in my body stood on end. Have you ever been around a lion when the hairs on the back of you neck stand up, “Yeah kind of like that”, but about 50 times stronger?  I suddenly thought...man, this thing is right here in the yard with me. I promptly panicked...ran inside...and locked my door. A few nights later I saw it walk across my property. There is a field light across my property in my neighbor’s yard and I saw it backlit as it walked down to the creek. I saw a tall figure...@12 ft. tall with large mounded shoulders and a sort of conical shaped head. I saw very long arms swinging as it walked. I could only see the top portion of this guy because it was walking by 8 ft. tall blackberry bushes. I went up on the hill behind my house with a friend and we found a footprint up there. It freaked me out too because I wasn’t expecting to find anything to tell you the truth. We made a cast and I would very much like to have that cast. I heard it is in litigation. I have been up the hill above my house since then and I have found places with big holes in the ground where \"beds\" have been made. Some of them have crude frames in them made from 12 inch diameter snapped off branches that are crisscrossed to form frames. I thought that was strange. In those places there are numerous foot and handprints.",
  "classification": "Class B",
  "county": "Siskiyou",
  "state": "California",
  "location_details": "I want this story to get out because I want scientists and serious researchers to have the chance to verify it, and help me study it. I do not want however, to have every kook in creation to come making trouble. I live at the edge of mining camp town. From my yard across the street on B. Road where my house sits there is really nothing but seventy plus miles of remote wilderness to the coast of California.  I don't know about disclosing the whereabouts at this time because it is so accessible. Plus my neighbors are probably going to kill me anyway. How about hold on to it for now. I am telling you because I know how important the location is for the research aspects. There is a cave and an old mine at the end of a line drawn now from my house, to where the print was found, to where the cave is at. It is a perfect path around a hill through the forest to my house. There is a great vantage point for the thing to watch down on my property from where the print was found. It seems to be watching the place. Very smart...I think.",
  "summary": ""
}