{
  "id": "216",
  "title": "",
  "date": "",
  "observed": "Was out late one night walking my Beagle before retiring for the night.  We live in a somewhat rual area, the village of Orangeville has a population of about 600 or so. Because of the town make up at that time, very few people were up at that hour.  so, in walking west up the road with the mountain to the north of us, all the hoses on the hill were dark and quiet with ony a dog or two barking. I had walked my dog about 300 yards up the road, about 200 yards away from the closest house.  At this point the woods coming down from the mountain are right next to the road. We had just stoped and were beginning our walk back to the house when my dog stoped and looked up  at the mountain.  His hair on his back stood up and he started growling.  I looked up to where he was staring and didn't see any kind of movement or hear or smell anything different. After about 10 seconds I tried to coax the dog into heading back to the house, but he did not move. About 30 seconds after the dog first stoped I heard a howel / scream of something that I have never heard before.  It seemed to come down off the mountain, it didn't sound close by, so I figured the sound to come somewhere in front of us about 1/2 or near the top of the mountain. The sound, similar sounding to the one at http://www.bluenorth.com/klamath_recording.htm made all my hairs stand on end, and my dog made a protective stance between me and the sound.  The sound lasted for about 20 seconds or less with the echo through the woods.  Several of the dogs on the hill also began barking when the sound came down off the moountain. At the time I had no idea what I had heard, I coaxed my dog to move and we went back down to the house and turned in for the night.  Since that night I havn't heard any other sounds like that. The next morning when I took the dog up for his morning walk, I stoped in the area where we had heard the sound.  the dog acted normally and I looked for any kind of animal tracks but didn't notice anything along the road edge or just inside the woods. It wasn't untill a few months later that when I was watching Sightnings and they played the recording of a possible Big Foot scream from Washington state that I realized I had heard the same sound in Pennsylvania just a few months previous. At that time I really didn't know of anyone to report it too, and also figured no one would beleive that I had heard such a sound. It wasn't untill a recient TV show on TLC about bigfoot that I dediced to do some more research and find a location to log my sighting.",
  "classification": "Class B",
  "county": "Columbia",
  "state": "Pennsylvania",
  "location_details": "Just outside of the village of Orangeville.  Village is located at the base of Knob Mountain and has one road called mine street that runs alongside the mountain and connects to Route 93 and Route 487. There are few houses near the end of the road and the woods from the montain come down right next to the road.  Last 100 yards of the road before it connects is all woods to the northern side.",
  "summary": ""
}