{
  "id": "8514",
  "title": "Husband and wife have nighttime road-crossing sighting",
  "date": "1994-03-01",
  "timestamp": 762480000,
  "observed": "In the spring of 1994, my wife, two children and I were returning home to Fernandina Beach from Jacksonville traveling north on A1A. It was late, the kids were sleeping in the back seats, I was driving with wife in passenger seat. Living on Amelia Island (Fernandina Beach) with relatives in Jacksonville, we frequently made this 45 min to an hour drive 2 or 3 times a week. Although a scenic trip during the day, at night its just a boring two lane road cutting through intracoastal type pine tree, dune-filled land. With no traffic heading south, I had my bright lights on and was just listening to the radio and staring straight ahead. My wife was sitting quietly, and, I actually thought she had fallen alsleep as it was approaching midnight. I had just rounded a curve and began on a straight-away north to northwest toward the entrance to Little Talbot Island State Park, which is on the right side of the road, when, in the distance about 150-200 yds ahead on me, I caught glimpse of a bipedal figure standing on the West side of the road just off the right-of-way, not moving. My very first thought was it was a park ranger closing gates and whatnot, but the second that I thought that, the figure began to walk East across the road (A1A), and driving 50 to 60 mph and closing fast on the creature, I began to slow down, all the while concentrating on just what I was seeing. The creature just walked right out in front of my car, never stopping, walking with purpose, swinging both arms, and I really don't recall the creature ever turning its head to look toward me. I would say that it was between 6.5 to 7.5 feet tall, muscular but rather skinny, long, shaggy hair about its entire body, with a tan to reddish brown appearance. As I approached closer and slowed even more, the creature was just about to step off the road and back onto the sandy, grassy right-of-way when my wife, who I thought was asleep, said \"What is that?!\". I instantly said nervously \"You see that...Oh my God, what the hell was that?!\" The creature just walked right into the dune pine area just as we were passing (slowly) by. For an instant, I thought about stopping and turning around to shine my headlights on the area of the dunes that it went in, but looking in my rear view mirror it was black as black can get outside (no streetlights of any kind), so I just continued driving north. Both me and my wife were very shakened and I looked at her and just said \"Did we just see a Bigfoot?!\" She answered back \"I think so, I really think so!\" For the rest on the drive we were a little freaked out, and when we got home, put the kids in their beds, we sat up the rest of the night going over and over again on just what we had just witnessed.",
  "classification": "Class A",
  "county": "Duval",
  "state": "Florida",
  "latitude": 30.4544,
  "longitude": -81.4189,
  "location": "-81.4189,30.4544",
  "location_details": "Incident occurred while driving north on A1A or Heckscher Drive about 900 to 1000 feet south of the North entrance to Little Talbot Island State Park",
  "temperature_high": 69.5,
  "temperature_mid": 66.93,
  "temperature_low": 64.36,
  "dew_point": 55.86,
  "humidity": 0.76,
  "cloud_cover": 0.82,
  "moon_phase": 0.63,
  "precip_intensity": 0.0025,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1018.37,
  "summary": "Breezy in the evening and rain overnight.",
  "uv_index": 4,
  "visibility": 6.88,
  "wind_bearing": 146,
  "wind_speed": 10.09
}