{
  "id": "45347",
  "title": "",
  "date": "",
  "observed": "The main river in this area and the surrounding county can be a double-edged sword, a vast wilderness smack up against a major population–Portland Oregon. With numerous rock quarries used to create the logging roads, at times the shooters make the canyons sound like a war zone. But as soon as playtime is over and evening sets in, people head back down the hill and the war zone transforms into a more serene and mysterious place. Booms and blasts are replaced with the sounds of the wind blowing through the firs, birds chirping and camp conversations. When night falls, another reality becomes quickly apparent. This area has one of the highest instances of Sasquatch encounters in the country. Like many, I have reviewed lots of evidence online and from word of mouth, all the while wrestling with a degree of skepticism. This was not my first experience with this group leader, but it would prove to be my most memorable to date. We arrived at camp somewhere in the 2:30 to 3:00 PM range, set-up and planned for that night’s scouting. As the sun set and dusk turned to dark, the group leader gathered us together. Having sized up the territory and considered several scenarios, he shared his thoughts about that night’s approach. A particularly important point he mentioned was that it was vital to remain flexible, and open to the possibility of modifying our plans if new evidence presented itself. So the initial direction was decided and tactics clarified. He had selected an old closed road farther up the ridge, up against the beginning of the older growth (probably 2nd growth) timber. Access to the road had been blocked years before by a berm, impossible for cars, yet fairly easy to traverse on foot. It was roughly midnight as we crossed the berm into what can only be described, based on everyone’s sudden change of mood, as “someone or something else’s world”. The wind had finally all but stopped and it was now deathly quiet, except for the crunching of rocks under our boots. The brightness of the waxing moon lit the landscape and our company in shadowy shades of black and grey, with silvery highlights. Our shadows were black and well defined. One gentleman of our five-man team, a young veteran of a middle-east war, proudly clad in his fatigues, walked point, followed by the group leader and his son. I was next, having made sure to place myself as close to the middle of the company as possible, and finally, the oldest man in our group picked up the rear of the column. I think that older gentleman understood the value of being last, increasing the chance of being selected for contact. The old road cut across a slope near the top of the ridge. Below, a steep drop-off, choked with new growth, rhododendron and an assortment of other lush Western Oregon varieties of undergrowth. Above us, a dark shadowy stand of old trees, with silvery snags strewn throughout the forest floor; the wildest, most rugged terrain this area offers. We approached a large dead tree that had fallen across the road. As each in the company climbed over the log, signaling yet another barrier into another world, the group leader stopped. He had been carrying a tree knocker and now he would put it to good use. It was time to announce our presence. The group leader let loose with two sequences of knocks– “pop pop… pop, then pop, pop”. Each hit echoed through the forest and rebounded off the steep canyons with the force of a home-run. We all had enough experience to stay completely quiet and wait for a possible response. No crunching boots, no wind, dead silence. After a couple of minutes, we moved on. The older gentleman was the first to hear a response - a soft \"tap-tap.\" He stopped the group for a listen. The first contact had been paralleling us from below, down the hill in the thick brush. We stopped and listened, nothing, then continued on. I began nervously glancing back down the road behind our column. I couldn’t help but wonder if I might catch a brief glimpse of a dark figure slipping quietly across the road back up into the timber. We then came to a bend in the road. There was a wide turn-out covered with ground cover. Our eyes had continued to adjust, so the moon now lit our position on the landing like a large street light. Just as my mind was focused on all of this, just when I least expected it, the real knocking began.  At that moment, reality changed forever and everyone was transformed. All eyes, all thoughts, all senses were now directed toward the dark timber. Not 50 feet away the knocking continued. There among the old trees a shadowy figure, an intelligence controlling a hand, with an opposable thumb, wielding possibly a large stick, sending knocking sounds echoing through the dark cathedral forest. The knocking patterns seemed to be a coded message, letting us know that whoever or whatever it was, knew we were there. The army vet turned to me, I can still remember the excitement in his eyes as he exclaimed: “that’s no woodpecker”, I replied: “this is real!”. I heard my name and quickly turned to see the rest of the group on the ground. The group leader quietly ordered me to get down. There we sat as the group leader exchanged sounds and words with a creature that I now realized for the first time in my life was 100% real and just 50 feet away. Everyone of us felt the rush of being fully and acutely present, alert and alive. During these moments, nothing else seemed to matter. I asked myself, can this really be happening? … It is! The group leader’s words may not have been understood, but his calming tone must have spoken volumes to the figure or figures beyond the tree-line.  We felt, as they must have, that neither was there to threaten the other. The knocks were not aggressive, simply a way to let us know they were there. Once the group leader thanked them for allowing us to share their space, he suggested that it might be time to retreat and not push things any further. We began hiking back toward the cars. It soon became apparent that our progress was now being flanked, and so it was, with glowing yellow-green and red eyes, vocalizations, and rustling all the way back to where we had parked. The following night would further reveal why we had been so closely monitored. Once back we were a buzz, we realized that we had all just been transformed, born again. Nothing would ever be the same.",
  "classification": "Class B",
  "county": "Clackamas",
  "state": "Oregon",
  "location_details": "Mt.Hood National Forest, 5000 ft.",
  "summary": ""
}