{
  "id": "10265",
  "title": "",
  "date": "",
  "observed": "Well it has been a couple of years since it happened, but here goes.  I was stationed at Beale AFB, Ca., and I would always drive around looking for the next great fishing hole.  I had been driving for quite some time and had decided to pull into Humboldt Redwood State Park.  Being from Alabama, I figured seeing these big redwoods would be kind of cool. So, I got off of Hwy 101 and took the Avenue of the Giants exit.  Driving down the road I was amazed at the size of the trees, so they kind of grabbed my attention. I started seeing a lot of places where I was thinking I could fish, so I started to slow down even more to find a place to park.  As I kept driving the river kind of started getting a little farther away, and I was about to turn around. When out of no where something walked across the road, and to say the least it shocked the you know what out of me.  The reason why it got me a little jumpy was because of the fact that I had to have come within a couple of feet of this thing.  Now I'm a pretty big guy 6' and about 220 Lbs., but what ever walked in front of my truck had to have been over 7 feet tall, due to the height of the truck (Chevy Z71). Now when it comes to the poundage of this thing I would have to say it was well over 350 lbs.  As far as physical features all I saw was the back and arm swing. The thing never turned around for me to get a better look at it.  But it had a large back and rather long arms.  As far as the neck goes it didn’t really have one.  The animal’s traps made it look like it didn’t have a neck.  Kind of like me. But after I did find a place to turn around, I went back to look around, dumb I know, to say the least.  I only found a couple of tracks. They had to have been 14 to 15 inches long, plus the stride of this thing was a lot longer then mine. Just to make the stride this thing did, I had to make one heck of an effort.  Now all I can say is what ever I saw that day was nothing like anything I had ever seen in the woods, and I grew up in the outdoors.",
  "classification": "Class A",
  "county": "Humboldt",
  "state": "California",
  "location_details": "Well not knowing the area that well, the only way I can remember the area is if I saw it again, sorry.",
  "summary": ""
}