{
  "id": "37307",
  "title": "Rocks thrown at two hikers on Heather Lake Trail",
  "date": "2000-09-02",
  "timestamp": 967852800,
  "observed": "About 2001, I was up on Mt. Loop Hwy with my best friend.  We decided to go for a late afternoon hike that we were familiar with, Heather Lake Trail.  In fact, that was our routine exercise spot because we knew it was safe.  Before I explain that incident, there is something else I need to share...we went up there on another occasion and noticed a really LARGE kind of hut off the trail.  It was somewhat difficult to get to due to the steep terrain.  I can't even recall how we even noticed it because it was so well-disguised.  It was enormous, though.  We made it down there and explored it:  heavy amount of broken branches covered over a hollowed out tree stump, roof made of fresh branches, tons of more branches on the floor that appeared to be matted as if it was slept on, entrance was covered by more branches.  I'm 5-03\" and it was high enough to be a 2-story home for a kid's playhouse... about 7ft high.  It was amazing, but very eerie because it was obvious that it was recently built and used.  Also, there was a stinky odor (wet dog).  Within a few minutes, Cyndi and I felt like we were being watched and left the hut right away to continue our hike.  We thought nothing of it after that- didn't suspect a bigfoot at all because that didn't cross our mind. The original story I wanted to share was one where Cyndi and I went up as the very last hikers on the trail that late afternoon.  A couple coming down warned us about it getting dark and being the last ones.  It takes about 45-50min to hike up and when we got up there, we turned around to head back down.  Before that, we both had to pee.  Cyndi went first and went behind some trees to squat.  She came out with a smurk on her face asking why I had been throwing rocks at her.  I denied doing so, but she didn't believe me even when I said I couldn't see her because I was doing last second site-seeing about 20 ft away.  Then I had to go pee and we switched places and just as I squatted a rock was thrown about my head and hit the tree I leaned against.  There was no way it was Cyndi because I knew she was behind me, not in front.  I freaked out and told Cyndi it must've been some creepy guy watching.  So, we started hollering out \"a**hole.\"   It was so silent up there and we can feel like we were being watched yet we knew we were the only ones up there.  I told Cyndi let's go now and we started walking really fast and then we started running.  Parallel to us running on the trail, we could hear/feel the ground stomping and branches breaking.  We freaked out and I grabbed Cyndi and we hid behind a tree off the trail.  The sounds of someone following us stopped.  Then, BAM!  Another rock gets thrown at us while in our hiding spot.  We started screaming and ran down that mountain I swear in 15 minutes.  Bloody scraped legs and wet clothes from sliding down the small water-filled rock beds, we got to our car and cried.  We didn't know who or what that was.  No joke, about 2 years later, I watch on TV a couple describing their face-to-face encounter with a big foot on Heather Lake Trail!  I called Cyndi and now I'm convinced that's what it was.  The smell, the strange hut, rock throwing, ground stomping, branches breaking... we were being followed by a big foot.",
  "classification": "Class B",
  "county": "Snohomish",
  "state": "Washington",
  "latitude": 48.0744,
  "longitude": -121.7915,
  "location": "-121.7915,48.0744",
  "location_details": "Heather Lake Trailhead... also, Boulder River incident in 2003 on a backpacking trip.  Something crossed the river and walked past my tent.  That trail is also off the Mountain Loop Highway.",
  "temperature_high": 63.06,
  "temperature_mid": 56.56,
  "temperature_low": 50.06,
  "dew_point": 48.36,
  "humidity": 0.79,
  "cloud_cover": 0.73,
  "moon_phase": 0.16,
  "precip_intensity": 0.0024,
  "precip_probability": 0.73,
  "precip_type": "rain",
  "pressure": 1012.88,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 9.07,
  "wind_bearing": 172,
  "wind_speed": 4.27
}