{
  "id": "4139",
  "title": "Hunting party loses bagged deer to unknown predator.",
  "date": "1992-11-25",
  "timestamp": 722649600,
  "observed": "I am a 42 year old computer systems administrator who lives in East Texas on my 133 acre farm with my wife and two teenage children. Although I was born in the big city, I have spent the majority of my life in the country and I am an avid outdoors man as are the rest of my immediate family and relatives. I will try to relate only the facts and necessary details but please bear in mind that the story I am about to relate to you is the most incredible encounter I have ever had in the Northeast Texas pine woods. As such, I feel the detail is important. It was late November 1992 and my wife and I were deer hunting in a nearby 9000 acre hunting lease with my aunt, uncle, and niece. This area, which is bordered on one side by 5 miles of the Sabine River, is some of the most remote forest land that I know of. The area in which we hunt is really about of the way as the nearest inhabited farm house is approximately 7 to 8 miles as the crow flies. As serious outdoors men, we pride ourselves in finding such inaccessible hunting spots, and this one was no exception as it required a 6 mile drive down old logging roads followed by a 15 minute ride on a four-wheeler deep into the Sabine River bottomland. It was an evening hunt, and, after disembarking the four-wheeler, I walked my wife to her tree stand and settled her in. I then took a 10 minute walk down the old fire lane to my tree stand. I made a mental note of how quiet the woods were that evening, as if there was a serious predator in the immediate area. Three hours later, right before dusk, I heard the familiar crack of my wife's rifle, so I began the walk back to investigate. Upon arriving at my wife s location, I met my aunt, uncle, and niece who also heard the shot as they were headed our way on their four-wheeler to rendezvous with us and begin the journey back. My wife described how a group of four deer had emerged within close range of her tree stand. Upon shooting the biggest one, the other three ran into the woods. To my wife s dismay, the deer she shot struggled to its feet and attempted to follow. Rather than taking another shot, my wife had reasonably assumed that the deer was not going to go far and simply waited for me to arrive. The deer's wound was fatal as it was leaving a heavy blood trail. Even though the sun had already set by the time I got there, the trail was easy to follow by flashlight. My uncle and I left the rest of our party and proceeded to trail the deer armed with two fresh flashlights and a high-powered rifle. We could tell by its tracks in a low, wet spot that it was a large deer weighing 160 to 180 lbs. Approximately 100 yards into the woods, we came to the spot where the deer had laid down for the last time. There was a large quantity of blood, but no deer and no immediate trail! We instinctively began circling the spot, trying to pick up the trail again. When we did, it was very faint. Even though the trail had reduced itself to a trickle of blood every now and then, it was still reasonably easy to follow as it was straight, and traversed open woods. After approximately 15 minutes of following the new trail, we came to a downed tree at which the trail seemed to end again. This was a large sweet gum tree that was much to big for us to step over. But, after climbing over to the other side, we picked up the faint trail again. Upon leaving the downed tree, the trail became more sparse. Eventually, we crossed a shallow creek with steep banks and picked up the trail on the other side. Approximately 50 yards across the creek, we came to a spot on the backside of a large white oak tree on which the ground was very bloody - but no deer. At that point, the trail which had been very straight and deliberate, decided to take a 90 degree turn. We didn't say anything at the time, but, by now, my uncle and I had reached the same conclusion: This deer was being carried. It was being carried by something large enough to traverse obstacles that we had to climb over and wade across. Something that had stopped momentarily behind a large tree to see if we were still following. It was well past sundown now, and we had been on the trail a good 45 minutes. The moon was high and bright, but my flashlight was beginning to fade. Since my uncle s light was larger and brighter, We decided to turn mine off and save what was left. Shortly after, it decided to confront us. It s not what we saw, because we never saw it, even though we were within 50 yards of it, just on the other side of a small clearing. It s what we heard. I can tell you that I have heard everything from panthers screaming to a charging 400 pound wild boar hog but I have never heard anything like the sound that it made. To this day I have initially used one word to describe it: Big. I did not find its incredibly loud, roaring howl hard to interpret. It was letting us know under no uncertain terms that the chase was over and it was time for us to go home. It was so loud, that the rest of our party back on the fire lane heard it, and thought we were on our way back and playing a joke on them. At that point, our party began yelling for us, which caused this thing to growl back at them in challenge. The whole exchange so rattled me, that it took me at least 30 seconds to realize that I was the one with the semi-automatic high-powered rifle and flashlight. Nonetheless, I still remained at the ready and concentrated on exactly where the sound was coming from across the opening. My uncle and I have spent many hours together in the woods, and it didn' t require the spoken word for us to know what the plan was. I immediately flanked to the downwind side of the opening hoping to either force this thing to drop the deer and run, push it into the opening where we could see it in the bright moonlight, or confront me in the tall, open timber where I would have a good clear shot. I suppose that in executing this maneuver it was my dogged desire not to make this deer the first one that we have ever lost. Whatever the reason, the plan didn't work. Whether or not it was for the better remains to be seen. I eventually slipped all the way around the edge of the opening back to where my uncle was positioned. Neither one of us saw a thing. At that point, we decided it was time to head back. Ten minutes into the walk back, our party started whooping for us again. Before we were able to respond, something else decided to take up the reply. We kept moving through open woods, and in the direction of the fire lane. Every time our party let out a whoop, it would answer in a challenging tone. And it was getting closer. As we approached the fire lane, the underbrush became dense except for one opening about 100 feet wide. My uncle and I instinctively positioned ourselves on both sides of the opening. Whatever was following us would have to come directly between us before it entered the fire lane. As we crouched in wait behind two large trees, we heard one of the four-wheelers start and head away from us down the fire lane. We immediately broke for the opening and trotted down the fire lane to where our party was waiting. Upon arriving, my wife told us that they heard me walk out of the woods and head the opposite direction down the lane, walking as if I was carrying something heavy. Upon hearing this, my niece decided to crank up the four-wheeler and go pick me up. This does bear some importance as I am a pretty big fella myself at 6' 1\" and 240 pounds. However, obviously, it wasn't me they heard breaking out of the woods and walking down the dry leaf covered fire lane. I immediately mounted the other four-wheeler and caught up with my niece before she came face-to-face with who knows what. We all headed home, neither one of us saying very much. We had enough hunting for one day. However, we returned for several days after that, hoping to find vultures, a carcass, or any other sign of the deer or its captor. We never found anything.",
  "classification": "Class B",
  "county": "Panola",
  "state": "Texas",
  "latitude": 32.1,
  "longitude": -94.20695,
  "location": "-94.20695,32.1",
  "location_details": "Approximately 8 miles West of FM 31 between Deadwood and Gary.",
  "temperature_high": 50.17,
  "temperature_mid": 44.385,
  "temperature_low": 38.6,
  "dew_point": 31.61,
  "humidity": 0.64,
  "cloud_cover": 0.54,
  "moon_phase": 0.05,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.54,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 9.31,
  "wind_bearing": 269,
  "wind_speed": 8.44
}