{
  "id": "9604",
  "title": "Campers have several visual encounters",
  "date": "2004-09-15",
  "timestamp": 1095206400,
  "observed": "Three strange things in three days: I woke up one morning and went into the trailer to get a cup of coffee and we had two dogs and I let them out and the little dog took off somewhere. I decided to go and look for her. I started walking up the hill right behind the trailer and I got up to a rock face were I could look down on the other side of the hill. I couldn't see anything and I was tired from walking up the hill, so I sat down to have a smoke. I sat there for about five minutes and was looking at the great view. Then I heard the dog bark and I turned my head and looked back and all I saw was a 7-8 foot tall black streak running down the hill. I jumped up and started following it; I couldn't see it but I could here it crashing through the brush. I got down to the bottom of the hill were there was a clearing. When I got down to that clearing, the crashing noise stopped. Then on the second day, I decided to go for a walk early in the morning. I walked to the top of the hill and walked down going north. When I got to the middle of the hill,  the hair on the back of my neck stood up and I got goose bumps. I looked behind me and beside me but didn't see anything, so I started walking again. I walked across the top of the hill and then walked through another clearing that would take me back to camp. I walked through the clearing and saw the trailer and my little brother- he was sitting out side - I waved to him and I walked back up over the same hill. I didn't see anything at all but when I got back to camp, my mom, her boyfriend and my little brother said that my little brother saw something orange in color walking on two legs, following me. My mom said she had never seen him that scared before and her boyfriend was out going to the bathroom and when he walked back to camp my little brother saw the top of his head through the trailer window and he had long hair and she said my brother freaked out and said that it was coming to get him. On the third day, after I knew that something was following me, I walked back up the same hill and when got half way up it, I could hear something. I looked up the hill and there were branches of trees about 2-4 inches thick and about 3-4 feet long being thrown down the hill at me. My mom's boyfriend has heard three very loud screams come out of the canyon only about a 3/4 mile away from the trailer.",
  "classification": "Class A",
  "county": "Grant",
  "state": "Oregon",
  "latitude": 44.9723,
  "longitude": -118.3692,
  "location": "-118.3692,44.9723",
  "location_details": "About 10 air miles N. of Granite, just east of North Trail Creek. The area is also about 4 miles east of the North Fork John Day Wilderness Area.",
  "temperature_high": 67.01,
  "temperature_mid": 55.59,
  "temperature_low": 44.17,
  "dew_point": 47.03,
  "humidity": 0.73,
  "cloud_cover": 0.72,
  "moon_phase": 0.04,
  "precip_intensity": 0.0052,
  "precip_probability": 0.37,
  "precip_type": "rain",
  "pressure": 1013.06,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 9.84,
  "wind_bearing": 211,
  "wind_speed": 4.14
}