{
  "id": "28569",
  "title": "Wood knock and possible nighttime sighting east of Canton Lake",
  "date": "2008-12-27",
  "timestamp": 1230336000,
  "observed": "I had been at my camper out past Canton Lake on N. Martin Rd. finishing a sculpture which was my project for the day. It had just gotten dark so I can guess the time. Having no flashlight I stepped into the road to begin the long walk back to Canton. I lit a cigarette and heard a small knock in the thin group of trees behind me. I turned, looked in the trees, seeing nothing I began walking. Down the road I went. It was a bit chilly. I knew walking would warm me up. I had just enough light to see the road ahead, the night sky was a shade lighter than the trees. About 10 minutes of walking I had just become more at ease with the night time walk when a great noise happened in the road ahead of me (about 30 ft.), like a cow falling into the loose gravel. I strained my eyes to see what it was.  A crumpled shadowy figure stood up. Human? I thought to myself, \"that must have hurt.\" Yet I hadn't heard any groan or speech during the fall. It walked calmly across the road. This is when its legs were seen, a lighter shade of road behind them. Biped for sure, but, too muscley. Some light glinted off the fur. It was animal. I know when I am seeing an animal, and not a snowsuit. Biped! I just seen sasquatch (a strange thin, tall, muscley one). And I still had to get on by where it disappeared into the shadows again. A house to the left had a garage light, which dimly lit up the yard, nothing crossed the yard. My impression was that thing ducked behind a bush and was still laying there when I finished walking by. I think these creatures are mostly nocturnal and curious, but they really just want to be left alone. I didn't want it to feel cornered or provoke a defensive attack, so I just kept walking.",
  "classification": "Class B",
  "county": "Fulton",
  "state": "Illinois",
  "latitude": 40.5634,
  "longitude": -89.95824,
  "location": "-89.95824,40.5634",
  "location_details": "Drive east of Canton Lake on E Middle Lake Rd. Turn right onto Wilson Rd and then left onto N. Martin Rd.",
  "temperature_high": 58.28,
  "temperature_mid": 42.78,
  "temperature_low": 27.28,
  "dew_point": 47.56,
  "humidity": 0.92,
  "cloud_cover": 0.9,
  "moon_phase": 0.01,
  "precip_intensity": 0.0375,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1005.67,
  "summary": "Rain until evening and breezy starting in the evening.",
  "uv_index": 1,
  "visibility": 6.53,
  "wind_bearing": 203,
  "wind_speed": 10.01
}