{
  "id": "1585",
  "title": "Witness reports bad smell and a scream",
  "date": "1985-07-26",
  "timestamp": 491184000,
  "observed": "I was going through some training at Fort Lewis. My platoon was airlifted by helicopter out of the main post area for a one week manuever. It was after dark when we left and not being originally from the area, it was difficult to get my bearings. We were in the air around an hour before we landed and began our mission. All I know for sure location wise is that we were close to the Nisqually River and Mt. Rainier. The last night we were in the field, I was assigned to the LP/OP (listening post/observation post) in our defensive position's forward area. After a week of almost non-stop war games we were advised to expect a non-eventful night and to try and get some rest. My unit was set up in their defensive positions on a hill approximately 1/4 mile to my rear. I was in my foxhole alone with a wired field phone. My job was to notify HQ if our perimeters were breached. Not anticipating contact that night, I prepared myself for some needed rest. Being from West Virignia, I am used to the woods and am comfortable in that setting. Around 2am, I heard loud pronounced footfalls to my front and right. I am certain they were bi-pedal. Thinking our trainers might be trying to harass us one more time, I prepared myself for my duties. However, all I heard were those footfalls continue to my left and away. Then I smelled what I can only describe as rotten cabbage or hot garbage. Very putrid. It actually made my eyes water. About 45 minutes or so after it left my immediate area, I heard a scream I still cannot describe. It sounded painful and maybe even a bit lonely but it made the hair on my neck stand up! It was at an estimated range of a couple of miles perhaps. I nearly jumped up and ran back to my unit but I was afraid of getting into trouble and of being ridiculed so I stuck it out. Additionally, there is so much deadfall and underbrush, I could have seriously hurt myself out there at night. I never saw a thing, but feel I may have experienced a sasquatch creature. The next morning, the smell still lingered in the air. Needless to say, i did not get any sleep that night. This has made a lasting impact on me personally as I am now interested in the research of these creatures.",
  "classification": "Class B",
  "county": "Thurston",
  "state": "Washington",
  "latitude": 46.9363,
  "longitude": -122.7607,
  "location": "-122.7607,46.9363",
  "location_details": "Military Training area.",
  "temperature_high": 85,
  "temperature_mid": 67.655,
  "temperature_low": 50.31,
  "dew_point": 47.62,
  "humidity": 0.51,
  "cloud_cover": 0.1,
  "moon_phase": 0.32,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.97,
  "summary": "Partly cloudy in the evening.",
  "uv_index": 8,
  "visibility": 9.62,
  "wind_bearing": 0,
  "wind_speed": 3.97
}