{
  "id": "56061",
  "title": "Nighttime sighting by a husband and wife driving near Rockmart",
  "date": "2016-12-03",
  "timestamp": 1480723200,
  "observed": "On our way home to Rockmart, GA from Birmingham, AL, we were following the directions the GPS gave for the distance.  This brought us to Hwy 120 and Vincent Mountain Road.  We had just made that turn and gone a mile and a half when my husband and myself saw a large figure standing in the tree line.  There was illumination coming from the right side of the road from an additional light source other than our car headlights.  This enabled us to clearly see this figure that was on the left side of the road with one arm straight down and the other arm slightly moving.  I believe that arm movement is what caught our attention making us both look to our left CLEARLY allowing us both to view this creature.  It was covered in reddish brown fur from head to toe with a face I can only describe as Ape like. It appeared to be over seven feet tall. He/she seemed to be getting ready to cross the road. After about 15 seconds past, he and I both screamed out, \"did you just see what I saw???\" I have never been a big believer in the legend of Bigfoot, but I know what I saw tonight.  And I am floored.  I have never written to any site such as this about anything in my life and I certainly didn't think I would start at 56 years old. Thank you for your time.",
  "classification": "Class A",
  "county": "Haralson",
  "state": "Georgia",
  "latitude": 33.81871,
  "longitude": -85.10207,
  "location": "-85.10207,33.81871",
  "location_details": "1 1/2 mile up Vincent Mountain Rd after turning off hwy 120...left side of road across from a church...",
  "temperature_high": 53.86,
  "temperature_mid": 49.425,
  "temperature_low": 44.99,
  "dew_point": 36.37,
  "humidity": 0.72,
  "cloud_cover": 0.14,
  "moon_phase": 0.13,
  "precip_intensity": 0.0049,
  "precip_probability": 0.93,
  "precip_type": "rain",
  "pressure": 1024.69,
  "summary": "Partly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 3,
  "visibility": 9.56,
  "wind_bearing": 356,
  "wind_speed": 3.75
}