{
  "id": "42978",
  "title": "Daytime sighting by a wildlife biologist on a trail in the Cypress Creek Preserve",
  "date": "2013-11-24",
  "timestamp": 1385251200,
  "observed": "First, I’ll start with the fact that I have never put much stock into the Bigfoot phenomenon.  I have degrees in wildlife management and wildlife biology and I have been working as a biologist for the last 17 years.  I have never believed that something could exist that has never left any concrete evidence.  Furthermore, nothing similar has ever been found in the fossil record that I know of so that has lead me to believe it was all false, until this weekend (Nov 24, 2013). I am an avid birdwatcher and wildlife photographer.  I take very long hikes in various wild areas around Tampa this time of year to photograph whatever I find. I was hiking at Cypress Creek Preserve which is in between interstate 275 and 75 near the apex where they meet. I was walking on one of the rather wide trails and I came to a stop because I heard a noise.  I had seen quite a few wild pigs that morning and I thought I could photograph one crossing the trail in front of me.  I was looking down at my camera adjusting the ISO settings and I saw something large move out of the corner of my eye (to my left) approximately 200 feet away. As soon as I saw the movement I looked directly at it and it was already halfway across the trail at this point. My eyes were directly on the animal as it walked, upright, across the rest of the trail and into the palmettos. It was very large (at least 6 feet tall or more) completely black in color with a VERY wide chest from front to back.  It was walking completely upright with a very fast, purposeful pace. The animal was leaning forward slightly but did not seem awkward with its steps - like a bear would be while walking upright. I slowly walked over to the spot where I saw it cross and I could still hear it moving through the woods in the distance.  I immediately noticed that all the birds around me had stopped chirping and the insects had stopped making noise as well.  I looked for tracks or hair left on the plants in the area but found nothing.  I was able to get a picture of the palmetto on the trail where it crossed and I put my tripod near it for a height comparison. I am extremely knowledgeable about the wildlife in Florida but I cannot explain what type of animal I saw this past weekend.",
  "classification": "Class A",
  "county": "Hillsborough",
  "state": "Florida",
  "latitude": 28.14162,
  "longitude": -82.3948,
  "location": "-82.3948,28.14162",
  "location_details": "Cypress Creek nature preserve between interstates 275 and 75 near the apex where they meet.  The sighting was about a mile due west of Freedom High School.",
  "temperature_high": 69.22,
  "temperature_mid": 63.49,
  "temperature_low": 57.76,
  "dew_point": 57.53,
  "humidity": 0.79,
  "cloud_cover": 0.2,
  "moon_phase": 0.72,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.64,
  "summary": "Clear throughout the day.",
  "uv_index": 2,
  "visibility": 9.96,
  "wind_bearing": 34,
  "wind_speed": 9.67
}