{
  "id": "629",
  "title": "Hunter locates large footprints near Railroad Flats",
  "date": "1968-09-01",
  "timestamp": -42076800,
  "observed": "In the late 1960's my father and I went deer hunting in the area of Railroad Flat, California We arrived late one afternoon and set up camp,then we decided to go seperate ways and scout the area around camp for sign of deer. I climbed a small rise and came to an open area with a wide path running along the top of the hill. I proceded to follow the path for a short ways but I had an uncomfortable feeling. I didn't see any deer tracks so I returned to where we had camped. The next morning I discovered it had rained lightly during the night leaving the ground muddy.I climbed the rise to the path where I had been the day before. When I came to the path I immediately saw large foot prints, they were very deep in the mud and about 14 or 15 inches in length. They were shaped like human bare feet. They were heading down the path that I had followed the day before, some of the foot prints were on top of the ones that I had left the day before. I proceeded to follow them down the path, when the path sloped downword the prints slid leaving elongated prints. The path continued on along the ridge top but the tracks suddenly took a left turn heading off of the trail and down the side into the trees and underbrush, needless to say I didn't follow them. I just thought you might like to put this in your file. I was in a remote area and I don.t belive that anyone was near where we were camped to have faked the footprints.",
  "classification": "Class B",
  "county": "Calaveras",
  "state": "California",
  "latitude": 38.30056,
  "longitude": -120.7053,
  "location": "-120.7053,38.30056",
  "location_details": "",
  "temperature_high": 88.76,
  "temperature_mid": 74.045,
  "temperature_low": 59.33,
  "dew_point": 59.08,
  "humidity": 0.63,
  "cloud_cover": 0.16,
  "moon_phase": 0.32,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1011.72,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 8,
  "visibility": 9.8,
  "wind_bearing": 219,
  "wind_speed": 5.28
}