{
  "id": "38413",
  "title": "Homeowner hears unusual vocalizations in his backyard near Orting",
  "date": "2012-10-15",
  "timestamp": 1350259200,
  "observed": "My family and I live near Orting, Washington in The Buttes housing development.  My house is situated at the highest elevation in the development, right around 700 feet and near the water tower.  My back yard is bordered by woods that extend for 200-300 yards without interruption.  My bedroom window looks out over the back yard from a height of about 12 feet towards the woods and we always sleep with the window open. The first incident occurred right around the last week in August of this year (2012). At 2:45 a.m. my wife and I were awakened by a series of piercing shrieks.  They were very loud and sounded as though they were coming from the woods right in back of our house.  They did not sound like any other animal that I have ever heard. This continued for perhaps 5 minutes and then abruptly ceased as it began to rain.  The second incident happened approximately 5 weeks later early on a Tuesday morning in October of 2012.  This time, at just after 3 a.m. we were awakened by two shrieking screams followed by several minutes of intermittent whooping sounds, something like whoop..whoop...whoop...WHOOooop..This stopped almost immediately after we heard the same whoops from a distance of what I would estimate to be at least half a mile away.  The last incidence was in mid October at 3:15 a.m. when I was awakened to the same whooping sounds from a distance (1/4 mile?).  There were two sets of vocalizations just a few seconds apart, from two different sources.  There were some dogs barking like crazy at that time from the same general direction.  The whoops became closer and closer together until they overlapped (during this time they sounded as though they were moving further away from me, then they stopped.  I have not heard them since but I am going to try to record them on my cell phone if it happens again.",
  "classification": "Class B",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 47.06045,
  "longitude": -122.157,
  "location": "-122.157,47.06045",
  "location_details": "",
  "temperature_high": 60.34,
  "temperature_mid": 55.49,
  "temperature_low": 50.64,
  "dew_point": 55.1,
  "humidity": 0.9,
  "cloud_cover": 0.88,
  "moon_phase": 0.01,
  "precip_intensity": 0.0123,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1009.18,
  "summary": "Rain starting in the afternoon, continuing until evening.",
  "uv_index": 2,
  "visibility": 8.46,
  "wind_bearing": 190,
  "wind_speed": 5.86
}