{
  "id": "47161",
  "title": "Dark figure observed thru binoculars during an afternoon on Baker Lake near Swift Creek",
  "date": "2014-06-14",
  "timestamp": 1402704000,
  "observed": "My son (age 31) and I had spent the night sleeping in our truck camper in the Horseshoe Cove campground at Baker Lake, WA. The next morning, Sat. June 14, 2014, we decided to drive up Baker Lake Rd. to look at the other campgrounds. We pulled into the Swift creek campground (formerly Baker Lake Resort) and paid for space 34. We parked our truck in our campsite and then took a walk above the lake shore. We came to an area that had a picnic table above the lake shore. Over to the right of us were a few people swimming in the swimming area. I sat on top of the picnic table with my feet on the bench (my son was over to the left of me, taking close up pictures of some flowers on the ground) and I was looking across Baker Lake to the other side of the lake with my binoculars. I was looking at the tree line near the shore directly across from me from left to right. Something caught my eye near a tree. It looked like a head next to one of the trees. I didn't see the whole part of a body going all the way down to the ground. I saw only the upper area of a body near the head and it seemed to be peaking out from the left side of the tree. My first thought was, it is watching the people over to the right of me swimming. I watched it for a few minutes trying to figure out if it was part of the tree, or a head with a face. I watched through my binoculars for a few minutes and sometimes would look from left to right of it and then back at it again. For a few minutes I kept seeing this head next to the tree and then I looked away and then back at it, and it was gone. That's when I realized that it was a head because it disappeared. If it was part of the tree, it would still be there. I told my son that I thought I saw a head near a tree and he didn't pay much attention to what I had said. He kept taking pictures of flowers. I can't definitely say it was a Bigfoot because I only saw a head, but a human would probably not be across the lake peaking out from the side of a tree. This didn't look like a human head. I have always had an interest in Bigfoot and I do believe they exist. Up until now I haven't seen one. My son and I thought we heard one yelling late at night back in Montana, north of Columbia falls.",
  "classification": "Class B",
  "county": "Whatcom",
  "state": "Washington",
  "latitude": 48.43505,
  "longitude": -121.3455,
  "location": "-121.3455,48.43505",
  "location_details": "Take Hwy 20 east from I5 to Concrete, WA. and then north on Baker Lake Rd. Continue until you see the sign for Swift creek campground. I can show the location on the google map.",
  "temperature_high": 56.66,
  "temperature_mid": 53.985,
  "temperature_low": 51.31,
  "dew_point": 47.68,
  "humidity": 0.79,
  "moon_phase": 0.56,
  "precip_intensity": 0.0005,
  "precip_probability": 0.52,
  "precip_type": "rain",
  "pressure": 1018.48,
  "summary": "Mostly cloudy in the evening.",
  "visibility": 8.36,
  "wind_bearing": 175,
  "wind_speed": 4.42
}