{
  "id": "20523",
  "title": "Possible whoops and knocks heard by relic hunter in the Ace Basin National Estuarine Research Reserve",
  "date": "2007-07-21",
  "timestamp": 1184976000,
  "observed": "Hello, what I'm going to descibe is real and nothing less.  My friend told me about this web site. I'm going to tell you my story to the tee ! Saturday the 21 of 07, two friends of mine went to the coastal region of S.C. on a relic hunt involving metal detectors in search of civil war relics. I met them at a boat landing on the Ashepoo river to unload the boat for a 30 min boat ride in alligator infested water. Ariving at or destination we tied up the boat to a tree on the bank of the river. I've hunted  here in the past during winter and encountered large boar. It was very hard getting into the clearing because there is a narrow track of land with a 1700's slave dug dike on the right and on the left is a swamp that used to be probably rice or cotton feilds. We got into the opening if you want to call it that compared what we went through to get there. We had two way radios set them up to the right channel so we could stay in touch in case of getting lost. Well after hunting for about 2 hours I heard a boar grunt which Im very familiar with from hunting in remote places , I ignored it and kept hunting. A few min later I meet up with one of my partners and I asked him where Pete was so he got on the radio. Pete replied he was left of our posisioun about a mile.  He went looking for new spots to hunt, I looked at Dennis and decided to take a 5 min break because of the intense heat, but sitting still we were swarmed with skeeters. Dennis went to check out some large oaks on a hill. So I went right in some pines were the slave cabins were, about ten minites later I heard a loud \" WOOP\". I took my head phones off and ducked thinking first instinct that some one else was out there, but again I heard it load as day \"WOOP\" , it was definately- repeat- definately ape sounding. Then I heard a large stick hit a tree three times about 100 yards away. Then about 15 to 20 seconds later I heard it again hittng another tree. This time it was further off towards the river. Before I heard anything I smelled a foul stench in the breeze but thats not concrete evidence because of the dead boar I found in the past.  I do believe in bigfoot and was happy this happend to me. I was not scared one bit but did get goose bumps. I could see someone's mind play tricks on them if they were actually out looking for them but I was concentrating on finding relics. I just cant fully desribe the sound it was so deep and DEFINATELY APE. I hope yall take full instrest in this as much as I do.  Thanks Eddie...",
  "classification": "Class B",
  "county": "Colleton",
  "state": "South Carolina",
  "latitude": 32.825,
  "longitude": -80.559,
  "location": "-80.559,32.825",
  "location_details": "",
  "temperature_high": 83.98,
  "temperature_mid": 78.79,
  "temperature_low": 73.6,
  "dew_point": 67.68,
  "humidity": 0.7,
  "cloud_cover": 0.39,
  "moon_phase": 0.23,
  "precip_intensity": 0.0001,
  "precip_probability": 0.13,
  "precip_type": "rain",
  "pressure": 1014.4,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 9,
  "visibility": 9.21,
  "wind_bearing": 44,
  "wind_speed": 6.27
}