{
  "id": "26447",
  "title": "",
  "date": "",
  "observed": "Never saw anything but 4 years ago my friend, his son and I went camping up near Mount Adams ( A very remote campground) and we were hearing strange screams right before nightfall. Shortly after dark we could hear something messing around on the outskirts of our camp, breaking large branches and such. Around 12am or so my friend was going to bed and unzipped the tent and something very large jumped and ran off from behind the tent. Whatever it was shook the ground to point that I could feel it from about 15 feet away. Later that night I awoke to garbage cans being hit or thrown..at first far off but moving closer over a few minutes time. Then I heard something walking at the edge of camp and it grunted loudly. I had woke up my friend and his son and without my being aware he said a really loud \"BOO\" as I was intently listening for sounds in the forest this scared the holy # out of me.....about had a heart attack. We heard no more sounds that evening. Fast forward to this years trip.......same camp..... Our first two nights were un-eventful. But our last night was not. My friend, his 20 year old Son, my 8 year old Daughter and I were at the same camp. My friend, because of the previous experience, decided to do a little tree knocking, there were no replies. An hour passed and we began to hear screams. First we heard it off in the distance to our south and 3-4 minutes later it was to the NW. I am not sure if whatever it was was traveling or if it was getting a reply from the other location. We probably heard these calls 3 times. All was quiet for a couple of hours. After dark we began hearing something around camp. We heard what sounded like very large branches being broken out in the forest. We shined flashlights out in the direction of the sounds and it would be quiet for a little while. Well this went on for 3 hours or better and we decided to go to bed. My friend, my Daughter and I were sleeping in a little RV and his 20 year old Son in a tent as he was being brave and said he was not freaked out by the noises. Everyone drifted off to sleep except me as I was listening to see if anything came into camp. Aprox. and hour passed and I heard what sounded like something running and breathing very heavy, with an almost grunting with each breath (kind of hard to explain) going right beside the RV and it sounded rather large. I actually thought bear for a moment. I listened intently but heard nothing. Now this night was a full moon and the windows on one end of the RV were faced in a way that allowed the moonlight to shine through them (These windows are aprox. 5-6 feet from the ground). While sitting there listening for any more noises the level of light decreased and I could notice the change in light through these windows. I could see no shape however. (I thought cloud? But this was a cloudless night and the timing of the thing running a few moments before made this a little less possible.) I wanted to look out, but the position in the RV that I was sleeping in would have taken a lot of movement and to be honest I was having these thoughts that if I was to look out that I would see a face staring back at me. I just listened to make sure that my friends Son was not being attacked. I wanted to wake up my friend but did not want my Daughter waking up. I heard no more sounds for a while and eventually fell asleep. I had been sleeping for a while and was awakened to the RV shaking and something trying to get in through the doors. I heard knocking and my friends Son yelling \"open the GD door\". He said he had been sleeping and was woke up by banging on trees and heard something running in the woods around the tent. He said that he heard something next to the tent and that this side of the tent went dark. He said that he was listening and heard what he thought was his Dad say my name and then laugh. He said that the voice sounded very close to his Dad's but he could tell it wasn't. He said that this is when he ran for the RV with a big stick in his hand. We heard nothing else this night. The next morning my friend went a little ways up a trail and knocked on a tree and kept hearing a series of whistles in the trees. Now I am not sure what this was as we did not see anything. The nearest campers to us were aprox. a mile away on the opposite side of the lake. They were a family with Grand parents and did not seem like they would have done all this for a practical joke on complete strangers in the middle of the night and I would think we would have caught a glimpse of them in our flashlight beams earlier. We want to go back here with some night vision and a couple more people next year to see if we can see anything.",
  "classification": "Class B",
  "county": "Yakima",
  "state": "Washington",
  "location_details": "Exact location omitted upon request.",
  "summary": ""
}