{
  "id": "10608",
  "title": "Deer hunter watches large upright walking animal on Butler Knob.",
  "date": "1972-11-18",
  "timestamp": 90892800,
  "observed": "The following was a sighting by my Father. It was about 1972 or 73'. First of all he told me that he had never heard of such sightings before. As my brother and I got a little older we started reading up on Bigfoot sightings and stories in books when we were still about 8 and 10 years old. Anyway, we learned that there had been sightings in the same area as my Father's after his, and he never knew anything about these reports. My Father is an avid outdoorsman and he is far from one who would fabricate something of this magnitude. All he can say to us is that he was deer hunting, in what is very remote country and still is today, and he was up on a mountain ridge. He said he saw something that at first glance he thought was a bear, but as he looked a little longer he realized that it wasn't. Keep in mind that he hadn't ever heard of Bigfoot before. I'm not sure how long the sighting lasted, but he said that it walked too far too long to be a bear. He said that it stopped and started messing with a tree limb and then turned and walked over the other ridge and never saw it again that day. He has not hunted there anymore since. His sighting happened before the others that made local news. I would also like to comment on the sighting that happened in Uwharrie National Forest. My Father, brother, and I hunt there and there is no doubt in my mind that the report made for that is true simply because there is so much remote country there. Not only on the Natl. Forest, but all the private land as well.",
  "classification": "Class A",
  "county": "Cleveland",
  "state": "North Carolina",
  "latitude": 35.6267,
  "longitude": -81.5917,
  "location": "-81.5917,35.6267",
  "location_details": "On a ridge near Butler Knob.",
  "temperature_high": 51,
  "temperature_mid": 47.345,
  "temperature_low": 43.69,
  "dew_point": 34.96,
  "humidity": 0.76,
  "cloud_cover": 0.9,
  "moon_phase": 0.41,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.65,
  "summary": "Foggy in the morning.",
  "uv_index": 2,
  "visibility": 7.6,
  "wind_bearing": 87,
  "wind_speed": 2.14
}