{
  "id": "24539",
  "title": "Two cousins have a sighting in a thunderstorm on a family farm outside Palestine",
  "date": "1981-04-30",
  "timestamp": 357436800,
  "observed": "This was on my Grandparents farm. It was 2 miles down a dirt County road and 1 mile down logging roads. My cousin and I had gone out to the farm to camp and fish over the weekend. We arrived early in the afternoon and set up camp in a clearing near the lake and started fishing. Around sunset, a large thunderstorm came in and we sought shelter in an old barn approx 100 yds from the lake while the storm blew through. We had left the fish on a stringer in the lake with the stinger tied to a small tree. As we were waiting in the barn I looked back at the lake and during several flashes of lighting I saw something approx 7-8 feet tall, walking fast on it's rear legs, with it's arms swinging in a natural humanoid motion. I had a visual on this creature for 3-4 seconds between lighting flashes. I turned to cousin to see if he had seen what I had seen and he said he had. The creature was dark colored, walked upright on its rear legs naturally and averaged 4-5 feet between steps (I have no way to prove that as the rain washed away any tracks).  Also the next morning the fish on the stringer were eaten. I have been around animals my whole life, both domestic and wild. I do not understand why this creature would be moving during a thunderstorm. I still don’t know what we had seen that night but I know that we saw something. When we got back to our place, we told our grandmother what we has seen and she said it was probably a bigfoot. She said she used to see them as a little girl growing up in South Houston County in the Big Thicket.",
  "classification": "Class A",
  "county": "Cherokee",
  "state": "Texas",
  "latitude": 31.82347,
  "longitude": -95.37101,
  "location": "-95.37101,31.82347",
  "location_details": "2 miles East of the Neches River/3 miles North of Hwy 84, I don't have road numbers. All roads are logging roads.",
  "temperature_high": 81.72,
  "temperature_mid": 73.435,
  "temperature_low": 65.15,
  "dew_point": 69.24,
  "humidity": 0.84,
  "cloud_cover": 0.5,
  "moon_phase": 0.87,
  "precip_intensity": 0.02,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1014.08,
  "summary": "Humid and mostly cloudy throughout the day.",
  "uv_index": 8,
  "visibility": 7.56,
  "wind_bearing": 182,
  "wind_speed": 4.44
}