{
  "id": "3634",
  "title": "",
  "date": "",
  "observed": "This incident happened around 1988-89.  I was about 17 years old at the time of the incident.  The incident happened in Harborcreek PA which is where I lived at the time.  My parents have a house up there in the middle of the woods approximately 50 yards off of the road.  The area is surrounded by woods and open fields.  My parents have 56 acres of woods behind the house that they own.  At the back of the property is a huge ravine/gully that runs east/west of the property.  We have apple trees around the house, and a pond.  (I'm just trying to give you a layout of the area that all this happened) The incident happened one night when a friend of mine dropped me off at our house around dusk.  It was just starting to get dark, but you could see just fine through the trees around the house.  You could see all the way to the next road over, approximately 100 yards or so. (visability was fine).  As I was saying,....I got dropped off and I walked up on the front porch to go inside the house and realized that the door was locked and I didn't have a key at that time.  My parents wearn't home, so I just sat there waiting for them on the front porch until they got back. I was waiting on the porch for about 5 minutes when I heard a crashing noise coming through the woods to the left of me.  I didn't think anything of it at first.  I figured it was an animal or something, maybe a limb fell off of a dead tree or something.  That sort of thing happens all the time there.  Anyhow, I glanced over to my left and noticed approximately 40-50 yards away a very large object moving rapidly through the woods.  It was walking very fast with very long strides.  I could see very long arms swinging down by it's sides, almost straight down.  I stood up to get a better look at whatever it was, and as soon as I did, the object stopped walking.  It actually heard me or something, because it turned my way and took a few steps towards me and then stopped.  I could get a good look at it through the trees even though it was getting darker outside, because the trees in that area are spaced far apart etc.etc.  Anyhow it was at this moment that I could see that it had RED eyes.  They almost glowed!  It appeared to me that it was watching me also trying to figure out what I was.  It was very large, maybe 8-9 feet tall.  It had long arms and legs.  It appeared to have no neck, or a very short neck, kind of like a gorilla.  It appeared to be covered in hair.  We looked at each other for maybe 30 seconds or so, before it turned around and ran back the way that it had come from.  When it turned and ran, it was moving!  I mean it was really moving!  It was almost like a blur running through the woods.  You could hear limbs and dead branches breaking as it ran and then I couldn't hear it anymore.  To say the least, I was terrified!  If what I had saw kept walking towards me, I was planning on putting my hand through the window to get into the house!  I had never been so scared in my life.  I waited a few minutes on the front porch and then decided to go up on the deck at the back of the house (It's on the second floor of the house).  I figured that I would be safer there.  I put the lawn furniture around me like a wall and hid.  About half an hour later I heard my parents car coming down the driveway and then saw the lights on the barn.  I ran down off of the deck and told my parents what had happened. I didn't think that they would believe me, but they actually did!  Anyway, we went outside the next morning to do work on the driveway (it was still dirt, we were putting in a cement driveway). In the soft wet dirt was a couple of huge feet prints!  My mother, my stepfather, and I all saw them.  It had just started to rain, so we went inside to find the camera to take a picture.  When we got outside, the prints were gone from all the rain and mud etc.  I told my friends about it the next day at school, and they all said that it was probably a deer or a black bear.  LISTEN:  I know what I saw wasn't a bear, because they don't walk or run on their back legs the whole time, and anything short of a full size grizzly wouldn't have been that big!  It looked more human/gorilla shaped!  Its movements were like a man walking with huge strides, with it's arms swinging at it's sides straight down.  I got a book out on bigfoot sightings and started to read about them and noticed that many of the people had similarities to mine.  Wooded area, secluded, I also noticed that the bigfoot was walking on the deer trail.  I know, because the next day I went down there and noticed that it was following the deer trail that crosses the street into a big field surrounded by nothing but woods.  They also mentioned glowing eyes in a bunch of them.  I know for a fact that these have to be true stories, because I saw the glowing red eyes myself!  I don't know if you believe me or not, but it doesn't really matter to me!  I know what I saw and I will never,ever forget it.  I will always believe in them, because I actually saw one!",
  "classification": "Class A",
  "county": "Erie",
  "state": "Pennsylvania",
  "location_details": "",
  "summary": ""
}