{
  "id": "847",
  "title": "",
  "date": "",
  "observed": "This sighting happened when I was a young boy of about seven or eight years of age. It was a cloudy fall day. I was playing near a window in a second story farm house when something caught my eye. I watched as a hairy nine-foot creature walked up hill across the front yard. It had a huge stride, as if it were in a hurry. It kept looking back as it walked with its long swinging arms. When it turned its head it had to also turn its shoulders to be able to look at a 90-degree angle. I stood watching it walk along when it apeared to look up and make eye contact with me for only a second. It never broke its stride. It's eyes glowed like a raccoon or a cat at night when light is shined in their eyes. What frightened me was that it was still daylight. I didn't get really freaked until it disapeared around the side of the house. That's when I ran in to the kitchen were my parents were playing cards with another couple. I tried to get their attention but they didn't have time for a whiny kid who wanted a cookie or candy. It wasn't until they escorted me out the front door and slammed it in my face that they figured out something was wrong: There was no way I was going to hang around out side with a monster in the area. I flipped out --screaming, beating,kicking the door  and crying for them to let me in. It was only a couple or three seconds and they knew something was terrible wrong. They let me in and I explained what I had just seen through tears. My father and his friend went outside to look around, probably thinking they would find a loose cow. I'll never forget the look on their faces when they saw the foot prints that dwarfed their own. My dad's friend was a tall man of around six foot two or three. When he stretched his legs to step from one foot print to another it was next to impossible. Their disbelief had turned to fear. They did however want to follow the tracks that went across a field that had been plowed recently. I freaked out again. They seemed to understand this time. They decided that going in a car would be better. We drove down a road a short distance, found were it crossed and went on up a hill. The tracks disapeared and that seemed fine with everyone.",
  "classification": "Class A",
  "county": "Litchfield",
  "state": "Connecticut",
  "location_details": "Newton farm",
  "summary": ""
}