{
  "id": "26072",
  "title": "Trout fishermen encounter unnerving sounds & rock throwing in Joccasee Gorge",
  "date": "1998-10-01",
  "timestamp": 907200000,
  "observed": "A couple of my college roomates and I decided to go trout fishing on the Thompson River in Oconee Co., SC.  I grew up close to here and had fished the White Water River extensively so I was pretty familiar with the area.  I had also planned on making this trip a deer scouting excursion as well.  We set off for the journey with the intention of not taking a vehicle even though the gravel road is open at this time of year.  We wanted to get a little exercise and make the most of the next two days of crisp, cool, fall weather.  We reached the river after about a four hour hike and were all anxious to start fishing.  Our luck was great and time slipped away into the dusky twilight before we knew it.  We stumbled our way through the dense laurel thickets until we found a suitable camp spot.  The spot wasn't well used, but had an established fire pit so we were pretty happy.  As my one roommate and I put up the tent, the other started to cook the fish we had caught earlier in the day.  The fish were just about done when we hear an almost childlike cry from the ridge above about two hundred yards away.  My two buddies were instantly asking me what that sound was with a childish fright in their voice.  I grew up bear hunting in the these mountains and have heard some pretty freaky noises, most could be attributed to bobcats, coyotes, or the occasional mountain lion.  I thought nothing of the sound and assured them that it was most likely a bobcat.  We sat down to eat and the sound would happen about every two minutes or so.  It appeared to be moving slightly but was hard to pinpoint because of the terrain and echos, and then it just stopped.  After dinner we built a small fire and had a chew.  As we were winding down the night, we all hear something land in the camp spot with a thud.  We looked around and decided it was probably an acorn falling.  Then another thud, this time I saw the object and it was smooth river stone from the river that was at least 100 yards away.  This freaked me out so I dug into my pack and fetched my 9mm.  Upon my suggestion we carefully scavanged the nearby woods for enough wood to make a decent sized fire.  The rocks would thud periodically but were never bigger than quarter sized pebbles.  Once the fire was going everything stopped, for a while.  I also yelled out that I had a gun and to stop messing around if they could hear me.  At this point we figured it to be someone rather than something.  We stayed up till about 4, spotlighting anything that moved in the leaves nearby.  We agreed to take double watch shifts, with two watching and one sleeping.  About 4:30 we heard the crying noise again and it was still in the same location as before.  This lasted about two min. and was followed with three very loud and distinct knocks.  This sounded like green wood being pounded against a rock or a tree trunk.  This would occur about every 10 min. or so and would be proceeded or followed by the crying sound which was in the opposite direction.  We all stayed up until the sun came up and dismissed the whole incident as someone messing with us.  We decided that since we were already here we may as well fish our way back to the road.  We were all a little rattled from the experience, especially them because they never were more than twenty or so yards away from me all morning.  As we came to waterfalls or rough patches in the river we would walk a couple of hundred yards or so into the woods to get out of the laurel thicks around the river.  I used the opportunity to look for deer/bear sign.  In one spot we noticed that the ground had been absolutely destroyed with animal sign.  Three or four large scat piles were concentrated around two large white oak trees.  To me it looked like bear sign, somewhat, but I've never seen that much traffic sign in one area before.  We walked back to the vehicle without incident and now tell the story from time to time, but I think we all know that it was definitely not a person making these sounds and throwing stones.",
  "classification": "Class B",
  "county": "Oconee",
  "state": "South Carolina",
  "latitude": 35.01305,
  "longitude": -82.7962,
  "location": "-82.7962,35.01305",
  "location_details": "Near the Thompson River in the Jocassee Gorges area.",
  "temperature_high": 85.77,
  "temperature_mid": 69.5,
  "temperature_low": 53.23,
  "dew_point": 63.25,
  "humidity": 0.74,
  "cloud_cover": 0.27,
  "moon_phase": 0.35,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1012.62,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 5,
  "visibility": 8.32,
  "wind_bearing": 347,
  "wind_speed": 6.05
}