{
  "id": "9507",
  "title": "Roadside sighting near Eureka Springs",
  "date": "1994-07-16",
  "timestamp": 774316800,
  "observed": "I've had two possible bigfoot encounters.  The first occured in 1975 when I seven. The second happened in the summer of 1994.  I had been playing and living at an opera festival seven miles or so west of Eureka Springs in the Ozark mountains.  One night after a runout performance in Missouri several of us were driving back to the festival site.  We were on hwy 62(?) between Beaver Lake and Eureka Springs.  It was after midnight when our carlights illuminated someone or thing standing off of the right (south) side of the road. It raised its hands and covered its face I assume due to the carlights.  We saw no clothes on it and it appeared to be covered in brownish hair.  What we saw didn't really register at first.  We all thought it was very strange that someone would be out there naked at that time of night.  None of us thought it was a bear because we saw hands (also, I had seen bear in that part of Arkansas and this did not resemble a bear).  We didn't stop or turn around because we were all a little freaked out. I later realised that this thing had been standing on a small slope.  It must have been 7-8 feet tall.  It wasn't thick or bulky but appeared thin in comparison to its height. Ever since the first incident I have read and seen everything I could get my hands on concerning bigfoot.  That being said, when I saw what I did in 1994 my first reaction was \"who's stupid enough to be out here at this time of night? They'll get run over.\"  Then I realised that it was hair covered and TALL and probably not a man.",
  "classification": "Class A",
  "county": "Carroll",
  "state": "Arkansas",
  "latitude": 36.41,
  "longitude": -93.74,
  "location": "-93.74,36.41",
  "location_details": "Carrol County between Beaver Lake and Eureka Springs.",
  "temperature_high": 85.85,
  "temperature_mid": 77.805,
  "temperature_low": 69.76,
  "dew_point": 68.34,
  "humidity": 0.77,
  "cloud_cover": 0.51,
  "moon_phase": 0.28,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.77,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 8,
  "visibility": 9.35,
  "wind_bearing": 218,
  "wind_speed": 2.67
}