{
  "id": "7109",
  "title": "Possible vocalizations heard by hunters and a biologist in Guana River WMA",
  "date": "2006-10-07",
  "timestamp": 1160179200,
  "observed": "Last year my brother and I were hog hunting in the Guana River WMA in St Johns County, FL.  There was a lot of activity in the woods that day as this place gets crowded during hog hunts.  We were the last hunters to leave and we were talking to the check station attendant (biologist).  It was about an hour after dark and it was starting to get cold.  There was only a propane heater and latern running at the check station.  The Game Wardens had cleared the WMA of all vehicles, so we know that we were the only ones left in the area. To get into the WMA, you must drive through a wooded portion of a state park (no hunting allowed).  The check station is about 300 yards past the entrance gate. As we were getting ready to leave, we heard a very loud screaming (several screams over a 6-7 second period) about 75 to 100 yards behind the check station back towards a marshy area that borders the state park and WMA.  These screams were high pitched and very powerful, and they seemed to go right through you.  It sounded as though there was someone getting attacked by something.  It made the hair on the back of our necks stand up.  The air was very calm and cool.  We could also hear the faint sound of something in the woods moving palmettos and bushes (lasted about 3 or 4 seconds). At first we thought it might have been a bird in the marsh, but this sound was way too loud and the even though it was high pitched, it was very dynamic as though a very large animal had made it.  The sound was closer than the marsh, and we heard the noises of something moving in the woods.  It sounded very similar to some the recorded sounds I have heard on this site.  We asked the biologist what he thought it was and he did not know.  For several minutes we pondered the idea that it was a bobcat/panther, hog, bird, of some sort of small game getting attacked such as a rabbit squeel, but we all concurred that it was none of those.  My brother and I have been hunting/camping all of our lives and know different animal sounds.  It freaked us out pretty bad and we left after hearing this.  I was especially freaked out by the response of the biologist who did not stick around. Normally I would have just ignored this incident and passed it off as some animal as mentioned before, but I know that it was not.  It also brought back the memory of a very similar sound we heard years ago (84-86?) in Pennsylvania while camping on a vaction trip (rural area of Lancaster County).  It was just after dark as we returned back to our camper (grandparents motorhome) from the camp ground fishing pond.  As we arrived, we heard the same type of sound off in the distance.  It scared us to death and we did not leave the camper all night. We urged our grandparents to travel to our next camp ground the next day. I have heard other stories of sightings and sounds from very credible witnesses.  This incident makes me a believer, and I will never walk in the woods feeling the same again.",
  "classification": "Class B",
  "county": "St. Johns",
  "state": "Florida",
  "latitude": 30.0771,
  "longitude": -81.39806,
  "location": "-81.39806,30.0771",
  "location_details": "Guana River WMA which is several miles North of St. Augustine off A1A (Guana River Dam State Park).  Head North on A1A and turn left into the park.  Go past the dam and follow the dirt road into the woods.  Pass through the State Park area and through the gated entrance into the WMA.  The check station and parking area is several hunderd yards past the gate. The sounds were about 75 to 100 yards behind the check station towards a marshy area that borders the WMA and State Park (Southwest direction).",
  "temperature_high": 75.49,
  "temperature_mid": 68.475,
  "temperature_low": 61.46,
  "dew_point": 63.75,
  "humidity": 0.75,
  "cloud_cover": 0.56,
  "moon_phase": 0.52,
  "precip_intensity": 0.0058,
  "precip_probability": 0.08,
  "precip_type": "rain",
  "pressure": 1017.12,
  "summary": "Rain overnight.",
  "uv_index": 5,
  "visibility": 8.3,
  "wind_bearing": 17,
  "wind_speed": 8.36
}