{
  "id": "14503",
  "title": "Night time sighting by a youth leader at a bible camp near Grand Junction",
  "date": "1999-05-15",
  "timestamp": 926726400,
  "observed": "I was about 19 at this time and I was a youth group leader for a bible study in the mountains at a place called \"Twin Peaks Bible Camp\". At night we all played games like glow in the dark dodgeball or went inside the cafeteria to play telephone or mystery date. Sometimes before bed we would go out and watch the bats dive bomb small rocks we tossed up into the air under the light above the back door. Another game we played at night up there is called \"Mission Impossible.\" The idea is that a camp counselor goes into the surrounding woods whitch are cordoned off and hides as best he can. Everyone else (kids and group leaders) goes to find this person so he can give you a slip that says you found him. If you are one of the first five back you get ice cream or cake, some prize of that sort. Meanwhile the other counselors are out with flashlights patrolling around looking for you. If you are spotted you have to go back to the cafeteria and start over. While I was out looking for the counselor I was hidden in the bushes next to the road leading to the cafeteria. Behind me was the baseball field. It was illuminated by a bright moon out that night. I had ducked into the bushes because two of the counselors who were searching walked right passed me. As I was crouched into the thick of the bushes I was motionless listening for anything that would tip me off to the whereabouts of anyone else. Thats when it struck me I couldent hear any of the regular sounds from the woods. No chirps, no animal rustling, none of the natural sounds I was used to hearing out there night after night. As I started looking around I heard a light shaking of bushes adjacent to me in the baseball sidelines. I'm crouched about 5 feet from first base and the bushes were moving over by third base. As I watched figuring I would see one of the counselors or another searcher come out of the bushes, something else did. It was huge. Myself, I am 6'4\" and leveled off this thing as it came out next to the fence whitch was 4 ft high. The fence came up to what I can only guess was its waist witch  I figure would put it about 8' to 8'5\" tall, gigantic shoulders and a thin waist like you would expect on a bodybuilder. I was dumbfounded and shocked, but not scared as it didnt seem to know where I was or that I was even there. It stepped out cautiously and took a few steps into the open to cross toward the outfield. About two steps into the field it crouched down and looked toward the road as a couple kids who got caught came around the bend and walked by me with thier backs to the baseball field. Then as they got farther away I looked back and it was on two feet and was moving in a flash. It was across the field in about 5-6 second and into the woods alongside the mountain. When it ran I could see its whipsy hair in the moonlight, but I couldent make out a color. After It left I emerged from the bushes and spent the last of the evening in the cafeteria. My mother who was a counselor said I must have been cold because I was white as a sheet. This was not a bear, deer, or elk. Looking back on a once in a lifetime chance I wish I would have gone and done something fool hardy like tried to walk out to it. Though hindsight is always twenty twenty and I am glad I stayed put and just watched it.",
  "classification": "Class A",
  "county": "Mesa",
  "state": "Colorado",
  "latitude": 39.16305,
  "longitude": -107.9514,
  "location": "-107.9514,39.16305",
  "location_details": "I know it was in Grand Junction.",
  "temperature_high": 67.11,
  "temperature_mid": 52.385,
  "temperature_low": 37.66,
  "dew_point": 27.13,
  "humidity": 0.41,
  "cloud_cover": 0.19,
  "moon_phase": 0.02,
  "precip_intensity": 0.0002,
  "precip_probability": 0.24,
  "precip_type": "rain",
  "pressure": 1004.57,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 12,
  "visibility": 10,
  "wind_bearing": 237,
  "wind_speed": 5.82
}