{
  "id": "7995",
  "title": "Young teen is chased by a seven foot tall hairy creature",
  "date": "2000-05-25",
  "timestamp": 959212800,
  "observed": "One night I was riding my off road motorcycle on the family property when I stopped to pet one of our dogs. I shined my flashlight at the dog when I noticed behind the dog something was squatting in the ditch. I shined my light on the thing in the ditch and it stood upright. What I was looking at was a tall hairy creature of some sort that had very wide shoulders and glowing green eyes. I quickly panicked and jumped back onto my motorbike, started it up, and raced away. The creature started to chase me down the old railroad towards my house. I knew it was chasing me because since I wasn't wearing a helmet, I could turn around and see the creature running after me. As I approached a pond area, I hit a ditch and flipped my motorbike over and became scuffed up. At this time, the creature stopped chasing me and starting walking towards me. I panicked again and started my bike by rolling down the hill and letting the clutch out. As I approached my house, I wrecked again at the base of our driveway and ran to the house. The creature followed me to my house and didn't leave until I turned the large floodlight on in our front yard. I feel like the creature could have caught me at anytime. Then, it ran off to a dried up swamp area and I didn't see it again.",
  "classification": "Class A",
  "county": "Vinton",
  "state": "Ohio",
  "latitude": 39.17029,
  "longitude": -82.47604,
  "location": "-82.47604,39.17029",
  "location_details": "State Route 93 north out of Hamden to Rowland Road then turn right.",
  "temperature_high": 73.29,
  "temperature_mid": 60.175,
  "temperature_low": 47.06,
  "dew_point": 46.64,
  "humidity": 0.51,
  "cloud_cover": 0.22,
  "moon_phase": 0.73,
  "precip_intensity": 0.0003,
  "precip_probability": 0.29,
  "precip_type": "rain",
  "pressure": 1008.36,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 10,
  "visibility": 9.7,
  "wind_bearing": 287,
  "wind_speed": 7.8
}