{
  "id": "3202",
  "title": "Nighttime sighting by family on Hwy 12 near Packwood, Labor Day Weekend",
  "date": "2001-09-01",
  "timestamp": 999302400,
  "observed": "Saturday of Labor Day Weekend.  My family and I were on our way to White Pass, Washington heading East from Tacoma.  About seven miles or so outside of Packwood heading up the pass we rounded a corner on Highway 12 and saw something covered in fur standing on the passenger side of the road at about 10pm.  Going probably 60, we passed it very fast.  Both my wife, kids, and I could not believe what we had just seen.  After waiting for a car to pass I quickly pulled a U-turn behind it and by this time had the kids screaming in the back of the van not to go back.  As we came back down we were looking out the drivers side window to were we had just seen it when the kids all screamed \"there it is.\"  The car in front of us had slammed on it's brakes too, so I assume they saw it also.  It had crossed the road and was now again on the passenger side walking along the guard rail.  As we passed by it we got a pretty close look at it.  We again turned around and were heading back up but now it was gone.  I have no idea what it was other than to say it walked on two legs, was covered in brown hair.  My gut insinct tells me it was fake, but I do not know.  I have tried to find any rational explaination for it but I am unable.",
  "classification": "Class A",
  "county": "Lewis",
  "state": "Washington",
  "latitude": 46.67111,
  "longitude": -121.5863,
  "location": "-121.5863,46.67111",
  "location_details": "I wrote down the milepost, but I do not have it with me as I write this.  It was near the Mount Rainer/Chinook Pass turnoff highway 12.",
  "temperature_high": 69.18,
  "temperature_mid": 58.635,
  "temperature_low": 48.09,
  "dew_point": 52.66,
  "humidity": 0.72,
  "cloud_cover": 0.61,
  "moon_phase": 0.46,
  "precip_intensity": 0.0026,
  "precip_probability": 0.83,
  "precip_type": "rain",
  "pressure": 1013.22,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 8.46,
  "wind_bearing": 235,
  "wind_speed": 4.22
}