{
  "id": "11248",
  "title": "A series of sound reports, footprint finds and a sighting from a family living near New London.",
  "date": "1999-08-01",
  "timestamp": 933465600,
  "observed": "This incedent took place in the mid to end of summer of 1999.  We were in the woods south of town in the hopes to find the plant \"gensing\".  The timber in the area is very old with dense undergrouth.  Now before I continue the story I have a few other things to let you know about this area. There are stories of coon hunters hearing this sound and having there dogs come running back to them with their tales tucked.  They say that what ever it is, it is not anything they have ever heard. All of the things I am telling you are very true.  They have all happened within 5-10 miles of each other. back to my Dad and I.  We were walking through the woods when this very loud, sort ofrumbley growling howl.  I dont know but I have spent many many hours in the woods and have never ever heard a sound like this.  When we heard this sound all of my hair stood up on the back of my kneck.  I turned to my father and with fright said,  \"what was that\".  With his eyes enlarged he replyed,  \"i dont know\".  Needless to say that had ended our hunt for genseng.  On our way out of the woods we heard the same sound three times.  It was almost like the sound was that of letting us know we were too close to what ever it was. Now listen to this.  Believe it or not the next summer my dad had returned to the same stretch of woods about 2 miles from the previous year.  Again he was hunting for genseng and goldenseal.  He had come home early from his hunt which is not usual.  When he came home I had asked him if he had found anything and he said, \"no but I saw something that shouldnt have been there\".  He said that he was walking through the hills and had to cross the creek bottom.  There in the creek bottom was a footprint.  He said that he looked at it for a minute and then said to himself, \"there shouldnt be anyone out here in bare feet\".  the closest house is about a half a mile from where he said that he was.  Needless to say that was the last time that we have ever went to those woods.  Ocassionaly we walk the railroad tracks that run adjacent to the milesw of woods that run that creek bottom.  Every time we are in the area we get this fealling that something is watching us.  You know what I am talking about.  All the hair stands up on your kneck and you get the fealing that that you are not welcome there at the time.  Wtihout ignoring this feeling we just turn and walk away. I hope I am interesting you because I really believe \"bigfoot\" to be real. Now here is why I strongly believe on top of all these things I have told you about. My brother was driving down the road at a late hour of the night.  He was driving down the raod with two girls in the car, lucky him.  The same roud that runs north and south of the sight were my father seen the footprint.  As he came to crest of a small hill he said that he ahd seen this set of redish looking eyes.  To the right side of the road is a corn field that boarders the woods.  Mind you the corn is at full growth.  As he got closer to the eyes he said that what ever it was stood up and was at least one foot above the corn.  The two girls turned and emediately started crying in fear of what they had just seen.  He said that she just kept telling Justin, mybrother, to take her home, take me home now is what she told him.  Justin said that as they approached the eyes they stood above the corn.  In aww he stoped the car a faced the headlights at the creature.  He said that the animal turned and looked back at them for about three seconds.  he described the animal as being fury and having a greyish light colored \"V\" shape of hair down its chest.  He said that as it turned he was amazed by the size of the creature.  To this day one of the girls that was with im will NOT talk about what she seen that night.  The other girl will slap you if you even bring it up because it scares her soo bad.  My brother still has not hunted or fished that area scince he has seen that creature. Three years later my mom was on her way to work.  It was early morning, just light enough to see without headlights.  When she crossed the bridge, the same bridge that crosses the tracks that run down these woods, she said that she saw this very large man lookinmg hairy thing walking down the railroad tracks.  She said that what ever it was, it was not human.  She said that it had to be atleast 8 feet tall and very hairy.  She said that she thought about turning around to see just what the heck this thing was but she could not build up the courage. I really do know with out any doubt that bigfoot is real.  The type of cover that i have seen on the internet that people have described as bigfoot teritory is the ide4al cover around these sightings.  I hope you take my stories serious and i would like to know if you fallow up on the study of these in the area. ",
  "classification": "Class B",
  "county": "Huron",
  "state": "Ohio",
  "latitude": 41.0672,
  "longitude": -82.41861,
  "location": "-82.41861,41.0672",
  "location_details": "South of New London  close to SR 60.",
  "temperature_high": 82.54,
  "temperature_mid": 73.115,
  "temperature_low": 63.69,
  "dew_point": 65.78,
  "humidity": 0.72,
  "cloud_cover": 0.43,
  "moon_phase": 0.64,
  "precip_intensity": 0.0056,
  "precip_probability": 0.82,
  "precip_type": "rain",
  "pressure": 1013.4,
  "summary": "Partly cloudy until evening.",
  "uv_index": 8,
  "visibility": 8.74,
  "wind_bearing": 354,
  "wind_speed": 6.26
}