{
  "id": "44986",
  "title": "Memory told of a close up daylight encounter with two, possibly young, Bigfoots near Abbeville",
  "date": "2014-12-31",
  "timestamp": 1419984000,
  "observed": "When my aunt was about 11 or 12 years old, she was helping her older cousin (Jerry) in the field at her aunt's house in an area called \"Screamer\" in Henry County, Alabama.  It was a hot day, and after some time Jerry grew very thirsty and asked my aunt to walk up the road to the house and get him a glass of water.  My aunt then walked through the field back toward the dirt road leading to her aunt's house.  Upon reaching the dirt road, she saw two creatures standing on the other side of the road.  She stopped and began slowly backing up, then stopped again.  She stood there looking at them, and they looking at her, for a minute or so, long enough for her to get a good look at them.  They were only around 10 feet away from her at that point - she on one side of the dirt road and they on the other.  She described them as standing next to each other.  One was, in her estimation, around 5 feet tall and the other was slightly shorter, around 4 feet tall.  She said that she got the impression that they were young.  She said that they were \"real hairy\" and completely covered in dark brownish black hair, that they looked sort of like gorillas but with human looking faces with hair on them, human looking hands, and human looking feet.  She said their noses were free of hair and that the color of their noses was dark brown or black, as were their feet and hands.  They stood very still other than blinking, just looking at her.  Except for being covered in thick hair, their faces looked human with regular human-looking noses.  After a minute or so, she took off running as fast as she could back up to the house to get the water Jerry had requested.  She did not look back as she ran.  She got the water, and proceeded to walk back toward the field.  The creatures were not there anymore.  She never told anyone about this incident until just a couple of months ago because she was always afraid people would make fun of her.",
  "classification": "Class A",
  "county": "Henry",
  "state": "Alabama",
  "latitude": 31.651,
  "longitude": -85.19265,
  "location": "-85.19265,31.651",
  "location_details": "Specific instructions omitted for privacy reasons.",
  "temperature_high": 52.83,
  "temperature_mid": 44.505,
  "temperature_low": 36.18,
  "dew_point": 42.65,
  "humidity": 0.86,
  "cloud_cover": 0.14,
  "moon_phase": 0.36,
  "precip_intensity": 0.0006,
  "precip_probability": 0.3,
  "precip_type": "rain",
  "pressure": 1028.4,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 3,
  "visibility": 9.28,
  "wind_bearing": 35,
  "wind_speed": 5.86
}