{
  "id": "4440",
  "title": "",
  "date": "",
  "observed": "I don't know if I'm lucky or unlucky? I've had three run in's with Bigfoot. My name is Steve I'm 40 years old, and I don't really like to tell people about this. When you tell people, most in not so many words call you a liar! Or I don't beleave that stuff! I'm sure a lot of you have experianced that. My first incident was a sighting, at night. My wife and kids and I were on county highway #21, headed back home to Babbitt from Virginia. On the curve just past the Wassa town hall road. The pasenger side high beam light had a broken mount. The light pointed to the oncomming traffic lane. As I was on the curve, I saw a very tall hairy creature walking accross the road. The bad headlight staid fixed on him as he crossed the road. I drive with one of my hands on top of the wheel, and this time it was my right hand. I pointed and tried to yell but nothing came out! Again I tried, still nothing! as it got into the ditch by a evergreen fall. I finnally was able to yell to my wife, \"did you see that!!\" She was playing a hand held yahtzee game. And she jumped in her seat when I yelled. I don't remember what she said, but I know she asked me what I saw. I told her I saw Bigfoot. She later told me, that she beleaved me. I can still see this in my mind clear as a bell. For a long time now I've had recurring dreams about it, some are nightmares. The second incident was again at night but only about an hour after sunset. It was durring deer season, my eldest son and I were tracking a wounded deer. It was getting dark so we decided to give up for the night. As we were leaving, One of my hunting partners showed up. He said we should give it another shot, maybe we'll get lucky. So the three of us walked together on a road that went in a big circle. We got about half way through and we split up. My son went with my partner, and I doubled back. I was about 200 yrds. from the cars, and I thought I heard a grunt. I stopped and then I heard what sounded like a  tree being broken off at the base. Then a loud grunt and a tree hitting brush and the ground toward me. I loaded the gun with the clip so fast! grabbed the fore stock with flashlight in hand and litterally walked in little circle's all 200 yrd's. to the cars. when I got there, my partner and my son arrived. I told my partner \"he's here!\". He replied I know did you find him? I said not the deer HE'S HERE!! Know way where? I said up the hill on the raod, and he through a tree at me!!!! We talked for a while and we went home. I didn't go on that road for the rest of the season. The next year, I had to know. So I went back and found the tree, the tree trunk and it had been thrown about 25 feet. It stopped up against another tree. I can show you where to this day! Last but not least. Last week my son and I found a footprint. I casted it and have it at home.",
  "classification": "Class A",
  "county": "St. Louis",
  "state": "Minnesota",
  "location_details": "I would have to show you",
  "summary": ""
}