{
  "id": "8025",
  "title": "Camper has night sighting near Crater Lake",
  "date": "1983-07-01",
  "timestamp": 425865600,
  "observed": "I believe that I saw a Bigfoot in Oregon back in the 80's. I was with my parents and sister on a camping trip somewhere south of Crater Lake. It was around 9:00 p.m. and had been dark for at least an hour. We all went to bed; my parents slept in the trailer and my sister slept in the camper and I got to sleep in the tent. We had all got in our spots with the tent about 15 feet from the trailer. I crawled in my sleeping bag and could here my parents voices but couldn't understand what they were saying. I could also hear a couple twigs snap. At first I thought it was a squirrel but then I thought; they aren't out at night. The terrain is flat with small pine cones and tons of pine needles covering the ground. We were the farthest campground out and national forest all around. The closest campsite to ours was about 60 yards away and there was one guy in it and he had a great big bon fire going. I saw him right before I went in the tent and could here him banging some pots or pans now and then. So this noise was getting closer. It wasn't very loud but I could make out actual footsteps. It was coming from the wooded side of the tent. This tent is a 9x12 with about 5ft. walls. I could still hear my parents and knew it wasn't the guy in the next camp site. It was at the back of the tent and it was coming around towards the front. In the corner of the tent I could see the glow from the bon fire. I was looking at the glow because that is the only bit of light that I could see anything. I could make out this outline shadow and it was human like but could only see from about the chest down. It was very quiet and purposeful in it's walking. It bumped the corner of the tent and and the whole tent shook. It seemed to stop right in the fire glow and stare at the tent as if to wonder why it shook. I would think that if it was a man, that when it bumped the tent that it would have acted different than just staring at it. It was now walking around to the front of the tent which the zipper was right next to the pavement in which I would not be able to hear it walk anymore; which in fact I didn't. If that zipper would have moved a millimeter; I would have screamed my head off! I didn't get much sleep that night and the next night I slept in the camper.",
  "classification": "Class A",
  "county": "Klamath",
  "state": "Oregon",
  "latitude": 42.8673,
  "longitude": -122.1629,
  "location": "-122.1629,42.8673",
  "location_details": "just south of Crater Lake",
  "temperature_high": 61.21,
  "temperature_mid": 53.87,
  "temperature_low": 46.53,
  "dew_point": 50.94,
  "humidity": 0.85,
  "cloud_cover": 0.94,
  "moon_phase": 0.7,
  "precip_intensity": 0.0181,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1008.75,
  "summary": "Rain until afternoon.",
  "uv_index": 7,
  "visibility": 8.5,
  "wind_bearing": 213,
  "wind_speed": 5.64
}