{
  "id": "1338",
  "title": "Several incidents in the East Fork Community",
  "date": "1973-01-01",
  "timestamp": 94694400,
  "observed": "Unfourtunately, I have no video or audio, only personnel observation. The first encounter did not involve a sighting. As a young boy, I was out on the front porch with my mother, father, uncle, and grandfather. At around 9:00 pm, we all heard a sound that was not unlike a shrill human scream. Untill that night, I did not know what it meant to have your hair stand on end. A somewhat large dog that we had outside barked, cried, and ran away in apparrent terror. The only thing we found the next day was a single partial footprint. The next encounter happened when my cousin and I were in the woods fishing at a pond on our grandfathers property. We first noted a very strong odor that we took to be a skunk. We then heard a sound like a scream, a few grunts, then nothing. Before the next encounter, there were some unusual incidents that deserve mentioning. First was the finding of dead livestock, mainly pigs. They almost always had been found with their liver and heart removed. I never saw this myself, only heard the stories. I did see on at least two ocassions all of the fruit eaten off of trees on the property. In both cases, all of the fruit was removed from the trees, and the pits on the ground around the tree. We laughed about the belly ache something would have from eating an entire tree of green pears. Later, as a teenager, I was alone in the woods. I had the distinct feeling I was being watched. I crossed a barbwire fence near the road, crossed the road and entered the woods there. When I returned to the road a short time later, 20-30 minutes, I saw that the fence I had earlier crossed, had been partially knocked down. Upon approaching the damaged fence, I noticed several \"large\" footprints. They appeared human in every respect except for their size. Even then, I wore a size 12D boot, the prints were at least two to three inches longer and maybe two inches wider than my boot. The tracks led first to the road, then back into the woods. Maybe a year later, a friend and I were in the woods. He was from New Orleans, LA, and knew nothing of the past encounters. While near a creek bottom, he suddenly froze and ask me what was watching us. I stood near him and saw what I first thought was a bear about 25 yards away. It was in a squating position. It then stood upright. It was, I'm sure, seven to eight feet tall. The creature was covered with very dark brown hair over it's entire body, with the exception of it's face. It stood upright like a man, not stooped like a bear. As we departed the area, we watched it follow us. The creature had a long stride and it's arms swung as it walked. It followed us to the edge of the wood line. The only sounds it made were whistling noises. My next and last encounter did not occur until I was in the army. A co-worker and I went to the old house to do some shooting. We arrived late that night. As we sat outside talking, we saw a large man shaped creature walk accross the road about 125 yards away. It walked into the woods and disappeared. It did not seem to notice us.",
  "classification": "Class A",
  "county": "Amite",
  "state": "Mississippi",
  "latitude": 31.1603,
  "longitude": -90.71574,
  "location": "-90.71574,31.1603",
  "location_details": "All encounters occured in Amite County, Mississippi, in a wooded area about one mile south of Hwy. 23. This area, known as East Fork Community is about 15 miles west of McCombe, MS",
  "temperature_high": 45.33,
  "temperature_mid": 43.095,
  "temperature_low": 40.86,
  "dew_point": 38.95,
  "humidity": 0.84,
  "cloud_cover": 0.99,
  "moon_phase": 0.91,
  "precip_intensity": 0.0111,
  "precip_probability": 0.79,
  "precip_type": "rain",
  "pressure": 1023.56,
  "summary": "Rain in the afternoon and evening.",
  "uv_index": 2,
  "visibility": 7.3,
  "wind_bearing": 28,
  "wind_speed": 11.97
}