{
  "id": "31000",
  "title": "Possible night time encounter while fishing near Atwater",
  "date": "2009-06-17",
  "timestamp": 1245196800,
  "observed": "It was July 17,2009 an evening i'll never forget.me and my older brother Michael were enjoying a night of fishing at a spot we frequented on many other occasions.the location was just west of the DAM at west branch reservoir on a secluded point that was only accessable by one road which was a dead end turn around where you have to park. our location was approximately 2.2 miles from the intersection of booth road and new milford road. it seemed to be a very peaceful night of fishing,the water was so calm and the air so still and quiet. after about an hour of letting our bait soak i decided to practice a little coyote/predator calling. its a perfect spot for predator calling because of the great distances the calls travel over the lake and beyond,you can really get some great responses from the local predators. I had a 4 inch speaker high in a tree connected to my mp3 player on full throttle volume playing the worlds best predator callers routines. i let this go on for about an hour and a half straight until we just couldnt handle the noise anymore.we sat very quietly in the dark for about 15 or 20 minutes when i told my brother i heard something coming through the woods in our direction.i just returned from a 19 month combat deployment in iraq and nobody was gonna sneak up on me anywhere,let alone in the forest at night. i listened for a few minutes longer and then hit my 30  million candle power spotlight in the direction of the noises. that's when it happened. a god awful daefening scream that was so unhumanly load and horribly frightening that it immediately put me into a state of absolute scared to death im gonna die if i dont get away from this wretched scream type state of panic. i hadnt felt this alarmed since fighting in iraq for my life. it was the first time i was actually scared in the woods anytime with a firearm at my side. for the last 2 and a half years ive been completely engulfed in the bigfoot researchers association. learning as much as i can about what had happened to us that night. I know one thing for sure,me and my brother were without a doubt approached by a very surprised ohio bigfoot. there is nothing in my 35 years of being in the woods and jungles that can even come remotely close to the absolute roaring scream of a sasquatch. this incident report is being wrote on my own free will and is the absolute truth of the events that took place that muggy june night.",
  "classification": "Class B",
  "county": "Portage",
  "state": "Ohio",
  "latitude": 41.13183,
  "longitude": -81.11617,
  "location": "-81.11617,41.13183",
  "location_details": "",
  "temperature_high": 72.46,
  "temperature_mid": 67.565,
  "temperature_low": 62.67,
  "dew_point": 63.28,
  "humidity": 0.87,
  "cloud_cover": 0.85,
  "moon_phase": 0.81,
  "precip_intensity": 0.0383,
  "precip_probability": 0.86,
  "precip_type": "rain",
  "pressure": 1011.59,
  "summary": "Rain until evening.",
  "uv_index": 6,
  "visibility": 6.92,
  "wind_bearing": 160,
  "wind_speed": 5.27
}