{
  "id": "22996",
  "title": "Girl describes close encounter on family property in the Lookingglass / Roseburg area",
  "date": "2002-08-20",
  "timestamp": 1029801600,
  "observed": "I was walking in the woods behind my house in Lookingglass, near the Callahan Mountains during the late afternoon/evening. I was enjoying the late summer weather by taking a walk when suddenly I heard something stir in the brush several yards ahead of me. I walked silently for a few yards, daring not to get too close. More rustling. It was moving away now.... and then out of nowhere it appeared ahead of me. I don't think I have ever seen any bipedal thing that tall.... and hairy. Of course I wasn't right next to it... with the animal being about 20 yards away. I was twelve at the time, but I know what I saw. Call me crazy, but when I got to where I first heard the rustling, there was this odiferous smell that I can't put into words. The creature was dark brown, almost black, and hairy, like an ape, but bipedal like a human. Its face and muscular structure resembled an ape, but its upright appearance looked more like a human. I followed the animals' route several days later for about 20 yards after it disappeared and found a faint footprint. It was enough to make out the characteristics. Five toes and I would estimate that it was larger than Shaq's foot by a long shot. I walked along the fence line for a while and I couldn't see any holes. There were some parts of the fence though, that the animal could have just stepped over, being that big (8ft approx).",
  "classification": "Class A",
  "county": "Douglas",
  "state": "Oregon",
  "latitude": 43.2073,
  "longitude": -123.5585,
  "location": "-123.5585,43.2073",
  "location_details": "Out in Lookingglass, 5 miles from the Lookingglass Store. Foot of the Callahans. Touchstone Lane up to the logging area. You can gain access to where I saw it from there.",
  "temperature_high": 68.3,
  "temperature_mid": 58.995,
  "temperature_low": 49.69,
  "dew_point": 51.16,
  "humidity": 0.75,
  "cloud_cover": 0.53,
  "moon_phase": 0.43,
  "precip_intensity": 0.0012,
  "precip_probability": 0.36,
  "precip_type": "rain",
  "pressure": 1016.89,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 6,
  "visibility": 9.21,
  "wind_bearing": 331,
  "wind_speed": 4.12
}