{
  "id": "39025",
  "title": "Man remembers his daylight sighting of a bigfoot standing on a stump next to Discovery Bay",
  "date": "1986-09-15",
  "timestamp": 527126400,
  "observed": "Hello, I just found out about your organization from your show on TV.  I thought I'd finally report my sighting from sometime ago. First off, I have been a military officer and I'm finally ready to retire ( just got my 20 years in the Army Guard) and am a very avid outdoors man.  The year was 1986, mid September on a weekend at about 1 to 2 hrs before evening.  It was very bright out, little to no clouds in the sky.  The temperature was fairly mild to warm.  Sunset may of been coming, it was a beautiful day. Earlier on in the year, there was a show on 60 Minutes (or a similar show) about Vietnam Vets who live in the Olympic Peninsula that live off the grid. The location was mountain side that overlooked Discovery Bay, in between Port Townsend and Sequim in Washington State.   We were all in my little truck driving up to some logging roads to do some target practice.  Two of my military buddies and two of our mutual female friends were crammed in my truck as we arrived to the clear cut area to do some shooting.  Just in case there was some animals in the clear cut area, I parked the truck back from the end of the road so the sound of the truck might not scare any animals.  As Kevin and Mike were fussing, getting the two girls out of the truck and trying to load up the other rifles, I hopped out of the drivers seat with my shotgun and a few rounds and ran up to the overlook. I was very nervous as to what I saw standing on a logged stump about 50 to 60 yards away just down the slope in the middle of the clear cut.   There was what seemed to be a very large man wearing a light brown, dusty looking ghillie suit, with his back to me standing on a stump, just staring at the waters of Discovery Bay.  He (or she) was admiring the sun gleaming off the water.  I seriously thought it was one of those Vietnam Veteran hermits that I heard about on TV. As I stood there, nervous, ...the guys at the truck slammed a door on the truck and then the thing calmly turned around to look up the hill at the sound, then saw me.  It had little neck movement, turning its shoulders with its head.  It moved its feet to turn around on the large stump.  It stared right at me and I stared right back into its eyes.  Then, as it looked at me, I saw total intelligence in its eyes.  I saw that it was not a man wearing a ghillie suit.  I saw its face very well.  It appeared to be a male.  It gave me a calm, peaceful but disgruntled look of 'please be quiet, ..you are annoying'.  As I looked at it, 'he' sized me up and saw that I was no threat to him.  I almost felt that it knew I was no threat.  It definitely had a look of high intelligence.  Anyway, it turned its back at me and continued to stare at the bay.  At that point, my heart jumped into my mouth and I hollered at the guys to get there ass over to where I was and make it fast!  The Bigfoot once again turned around to me again, making the same right hand turn and looked at me for the second time but this time it turned a little faster.  When we locked eyes, it looked even more annoyed or disappointed and maybe a little scared.  It took one long stride off the stump towards the tree line.  It didn't run but it was almost fast walking.  Then appreciating it was between 7.5 to 8' tall, and seeing that huge stride, I hollered to the guys and started running after it.  The guys then saw me sprinting after it over fallen trimmed branches, logs, over stumps with rifle in hand and they knew something big was up.  Before I got half way to it, it already made it into the tree line. My friends never saw it.  All of us re-traced the steps of the thing after I showed them where it was standing.  We saw a few good prints.  All of us heard it snapping a few big 'loud' branches as it took good cover deeper into very thick bushes.  There was a little bit of a unique smell, unlike anything I've ever experienced in terms of an animal's scent.  It was faint but notable.  I couldn't sleep for a week after that.  I wasn't far behind in my chasing of the thing.  I was extremely bewildered at how it could make it through that very dense brush and not slow down.  Maybe it just got out of our view and sat down and hid in the bushes?  Its almost like it just 'phased' away once it got to where it wanted to go like some kind of strange spirit or something.  If it was an elk running into that brush, it would of got slowed to the point that I could gain on it, but that thing just slipped into the foliage.  Anyway, that's my one and only Bigfoot sighting.  I hope you can find this useful info.  Since I'm about to retire, I'm more inclined to tell my story without getting looked at oddly from my military peers. You can post this if you would like :-) Eric S.",
  "classification": "Class A",
  "county": "Jefferson",
  "state": "Washington",
  "latitude": 48.00503,
  "longitude": -122.911,
  "location": "-122.911,48.00503",
  "location_details": "From the stump that the bigfoot was standing on, the hwy was bewtween the stump and the bay that it was watching.",
  "temperature_high": 60.82,
  "temperature_mid": 55.655,
  "temperature_low": 50.49,
  "dew_point": 48.52,
  "humidity": 0.83,
  "cloud_cover": 0.68,
  "moon_phase": 0.42,
  "precip_type": "rain",
  "pressure": 1015.16,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 8.2,
  "wind_bearing": 0,
  "wind_speed": 1.75
}