{
  "id": "12594",
  "title": "Possible beach sighting at night by a tourist near Point Brown",
  "date": "2005-10-29",
  "timestamp": 1130544000,
  "observed": "I've been debating whether to report this to you guys for about a month. Sorry for the delay but what I saw doesn't seem explainable other than a sasquatch. I was staying at a place called Mariner Village about 5 miles south of Ocean Shores. It's about 1/4 mile from the north jetty at Browns Pt. The time is about 1:30am (I knew this because I had just left my room at 1:20 am to return to my fire on the beach). My back was to the ocean watching the fire. I turned to look at the ocean (which was about 30 yards away) and saw what I thought was a person walking south along the water line down the beach. The moon was full and when I first saw it, it was directly west of me. What I could see was a dark figure from about mid-torso up because the beach slopes down quite a bit in that area. It appeared to be just a person out for a late night/early morning stroll on the beach. So I decide to follow them, maybe go talk to them and start walking at an angle down the beach to cut them off. Seeing that I wasn't catching up to them I start running down the beach still at an angle in there direction. It was hard to make out detail while running so I stopped to get a better look. That's when I realized the following, with the full moonlight I could see only it's upper body and it was all black, it had no neck, looked like it was wearing a hooded sweatshirt. I start running again as fast as I could. This thing was fast, it must have covered the 1/4 mile from where I first saw it down to about 50 yards from the jetty in about a minute and a half. I stop running and I could see it way down the beach about 200 yards away. It stopped about 50 yards from the jetty turned and faced the ocean. It was at an area on the beach that I saw it's feet turn towards the incoming waves. It's movements seemed very unnatural and overexagerated. When it turned towards the ocean it flexed it's back like it was leaning backwards. It seemed like it was looking back to see where I was. I know it saw me standing by the fire, I had a white t-shirt on and a shaved head, and probably saw me go after it, that's why it got down the beach so fast. It moved off and when it got near the shadow of the jetty I lost sight of it. That's when I decided to turn around and go back. Tried to find tracks but it was moving along the water line at high tide, the waves would have covered them up. The next day I took my friend told him to go stand down by the water and stood in the spot I first saw it, I could barely see the top of his head. Like I said I didn't report this for awhile because it's hard to fathom this happening in such a populated area. But considering the surrounding area, Oyhut State Game Refuge is very close and only 6 miles away is thick forested area to the north,one of these creatures could travel that distance easily in the cover of darkness. Once it got to that jetty it leads to the game refuge. If you have the book \"Meet The Sasquatch\" on page 213 that's the shape of what it looked like when I first saw it.",
  "classification": "Class B",
  "county": "Grays Harbor",
  "state": "Washington",
  "latitude": 46.92694,
  "longitude": -124.1736,
  "location": "-124.1736,46.92694",
  "location_details": "On beach in front of Mariner Village (condos) about 1/4 to 1/3 mile north of the north jetty",
  "temperature_high": 54.32,
  "temperature_mid": 49.965,
  "temperature_low": 45.61,
  "dew_point": 46.27,
  "humidity": 0.87,
  "cloud_cover": 0.59,
  "moon_phase": 0.89,
  "precip_intensity": 0.0169,
  "precip_probability": 0.89,
  "precip_type": "rain",
  "pressure": 1020.44,
  "summary": "Mostly cloudy until afternoon.",
  "uv_index": 2,
  "visibility": 9.01,
  "wind_bearing": 158,
  "wind_speed": 5.41
}