{
  "id": "20259",
  "title": "",
  "date": "",
  "observed": "My daughters, about 12 and 14 at the time, about 1977, were sitting on a small stone wall joining our patio in the backyard and I was up in the front yard. It was dusk, almost nightfall with very little daylight left. All of a sudden our three dogs ran down the gravel driveway from the front to the back of the house barking vigorously. I ran to the back of the house to find out what they were barking at. Here I encountered my two daughters; I asked them what the dogs were barking at. At this point in time there was no talk of a Bigfoot in Ohio, we never thought of anything being a Bigfoot. We had heard of a \"Sasquatch\" in the northwestern states but heard nothing of a Bigfoot in Ohio. My daughters told me that a large man ran right past them about 10 feet away running in a westerly direction. I said to them, “Well when he runs into the barb wire fence, we will hear it.” The dogs at this time were still barking and had followed this man in the direction towards the fence. They then stopped barking and returned to us. We never heard the man hit the barbwire fence. (No yelling and cussing) The girls described to me that this man was very tall, had unusually long strides, and was running very fast, they also perceived that the man had a \"cape-like\" thing that was flowing out behind him as he ran. As we later discussed this incident we could not figure out what this \"cape-like\" thing could have been. We live in a rural area, and we have 15 acres of property with a horse pasture, we thought what man would be running through a rural area at almost dark. We thought he might have been a jogger or cross country trainer late in getting home, and started running through people’s property to get home as it was almost dark. Years later as we heard about a possible \"Bigfoot\" in Ohio, which led to a discussion with my two daughters, now much older, about what they had seen in 1977. We discussed the \"cape-like\" thing that this so called jogger had on. We had as yet not figured out what this \"cape-like\" thing could have been until our knowledge about a possible Ohio Bigfoot. In talking about it with my daughters we came to the conclusion that this might have been a Bigfoot that they saw. And the cape was actually flowing hair from this possible Bigfoot. We also questioned how this \"runner\" could have got over the fence without hitting it. If it was a Bigfoot it probably leaped over the fence on the run. This incident comes up in family discussions from time to time. We decided to file this report as the topic of Ohio Bigfoot has become more pronounced in our family.",
  "classification": "Class B",
  "county": "Geauga",
  "state": "Ohio",
  "location_details": "Specific directions omitted for privacy.",
  "summary": ""
}