{
  "id": "12528",
  "title": "Campers have a night-time encounter in Mark Twain National Forest",
  "date": "1998-04-25",
  "timestamp": 893462400,
  "observed": "About seven years ago some friends and I went camping.  At a lake called Fourche Lake.  The lake is a small sucluded lake about 10 acres or so and not very heavily used in the Mark Twain National Forest.  There is one road in and about 3-5 miles off the highway.  So I cant imagine anyone out there and if they came down the road we would have heared them unless the walked and it would have been a long walk.  We where all siting around the camp fire talking and something come runing out of the woods.  Just out of the distance of the light of our camp fire and ran down toward the lake.  Where the moon light was the fairly bright.  It ran around that area for awhile almost like it was running circles like it was confused.  It also was waving it arms and making a very strange noise.  Then ran back in the woods. It's appearance was diferent from most that people report.  It was about four feet tall like a baby bigfoot.  It was on two legs and very stalkey and the sounds it made were not like any of the ones on your web sight. A few years back I was whatching a t.v. show that was about bigfoot.  They had some audio of sounds much like the ones you have.  But there was a man in Colaorado that had a recording that was diferent he had it tested by some scientist and he said it was something unexplainable.  But it sounded just like what I herd. Now I dont know what I herd or saw was a big foot. But I know I can't explaing it.  I have done a lot of camping and hunting before and since this and have never seen or herd anything like it.",
  "classification": "Class A",
  "county": "Ripley",
  "state": "Missouri",
  "latitude": 36.66708,
  "longitude": -90.9525,
  "location": "-90.9525,36.66708",
  "location_details": "37 mileseast of Riverton Mo turn on V highway go five or so miles turn on the government road When you see the sign fo Fouche Lake go three to five miles down there to the lake.",
  "temperature_high": 77.07,
  "temperature_mid": 69.05,
  "temperature_low": 61.03,
  "dew_point": 51.07,
  "humidity": 0.58,
  "cloud_cover": 0.13,
  "moon_phase": 0.97,
  "precip_type": "rain",
  "pressure": 1010.87,
  "summary": "Partly cloudy in the morning and breezy starting in the afternoon, continuing until evening.",
  "uv_index": 10,
  "visibility": 9.39,
  "wind_bearing": 183,
  "wind_speed": 12.46
}