{
  "id": "624",
  "title": "Sounds heard at Skookum Lake.",
  "date": "1991-07-04",
  "timestamp": 678585600,
  "observed": "I have a friend whose father worked for the Forest Service. We found Skookum Lake from one of his maps. This was a primitive camp site just north of Bagby Hot Springs. As soon as we arrived, we set up camp and went for a long hike up Thunder Mt. After the hike the sun was beginning to set. All four of us were beat, so we got ready for bed. No drinking, no drugs, no funny stuff. Exhausted, I fell asleep as soon as I hit my mummy bag. Sometime during the night, I heard some noises, not your usual night-time forest noises. I heard large rocks being thrown down the ridge. Banging off the other rocks on the way down. And from the hike earlier in day I noticed a large pile of boulders near the top of the ridge. It sounded like something was hunting for something. I sat up in my tent 100% alert. I wasn't dreaming. I tried to wake up my friends, but was frozen stiff. I was surprised no one else woke up. Finally I was asleep, only to be awakened to footsteps outside our camp. It didn't sound like a bear, because the foot steps were spaced apart longer than a four legged animal. I could not talk, so I tried to throw my socks at my friends. Nothing at all. I forced myself to sleep and the next day I only asked if anyone else woke up last night to any loud noises. No one did, so I never mentioned the rocks, and footsteps. There were no footprints anywhere. We didn't like all the mosquitos, so we left Skookum Lake for another camp. It wan't until a few years later when I read about other incidents at Skookum. That's why I think it may have been the Sasquatch.",
  "classification": "Class B",
  "county": "Clackamas",
  "state": "Oregon",
  "latitude": 44.99745,
  "longitude": -122.1647,
  "location": "-122.1647,44.99745",
  "location_details": "In U.S. Forest Service issued MT. Hood Natl. Forest Map grid C-6 Forest Service road 350(I think) North of Bagby Hot Springs, and east of Table Rock Wilderness. My map is issued in 1993.",
  "temperature_high": 79.83,
  "temperature_mid": 65.715,
  "temperature_low": 51.6,
  "dew_point": 49.48,
  "humidity": 0.57,
  "cloud_cover": 0.07,
  "moon_phase": 0.74,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.11,
  "summary": "Clear throughout the day.",
  "uv_index": 11,
  "visibility": 9.98,
  "wind_bearing": 332,
  "wind_speed": 7.97
}