{
  "id": "4143",
  "title": "While searching for their uncle, two boys see a tall creature look at them, grunt and run off towards the woods",
  "date": "1982-04-15",
  "timestamp": 387676800,
  "observed": "My cousin and I were playing outside. It was near dark. We were told to find my uncle.  He was working out in a pasture that was cleared for cattle.  We jumped the fence to go find him.  My cousin said \"there he is\", so we started toward him.  We were about fifty feet from him when we realized it wasn't him.  It was a hairy creature about six and one half feet tall.  It turned around to look at us, grunted and ran towrd the woods.  It stepped over a fence and disappeared.  We screamed as it turned. My uncle heard our scream and came out of a nearby barn.  He thought we were making it up. That was until about eight months later.  In December of 1983 we had another encounter.  It was a Saturday night and we were going into town to see a movie.  Rain and sleet had been falling most of the day.  We lived back off the main road and had to travel logging roads to the highway. About 1000 yards from our driveway, my aunt suddenly screamed.  We looked up in time to see it.  It was crossing the road right in front of us.  It jumped across a ditch on the side of the road and disappeared into the woods.  In the headlights, the color of the animal was that of a brown bear.  He was covered with hair.  The hair was not very long.  There were missing patches of hair on the arms and legs.  Again he seemed to be about six and a half feet tall, kind of sloped up the back.  We heard no sound as he crossed.",
  "classification": "Class A",
  "county": "Red River",
  "state": "Texas",
  "latitude": 33.64555,
  "longitude": -95.16028,
  "location": "-95.16028,33.64555",
  "location_details": "In Bagwell, northeast of Paris. On wooded land owned by International Paper Co.",
  "temperature_high": 79.68,
  "temperature_mid": 73.13,
  "temperature_low": 66.58,
  "dew_point": 61.98,
  "humidity": 0.72,
  "cloud_cover": 0.83,
  "moon_phase": 0.73,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1003.67,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 7.01,
  "wind_bearing": 168,
  "wind_speed": 12.24
}