{
  "id": "607",
  "title": "while hunting hogs near a cypress bayhead, witness saw a dark brown/black bi-pedal creature.",
  "date": "1983-11-19",
  "timestamp": 438048000,
  "observed": "I was hunting hogs by myself and had been in this area for about 3 hours. I was armed with a Remington model 1100 12ga. shotgun. I was walking between two large Cypress Bayheads in a sawgrass field that was approximately 500 yds. wide by 1/4 mile long. I was looking down at the ground searching for hog tracks. I had seen a group of about 8 hogs approximately 45 minutes earlier, and was trying to outflank them. I looked up to see how close I was to the Bayhead, when I saw, what at first was just a dark object at the edge of the bayhead. My first thought was that it was a bear. I crouched down and started to advance in order to see it better, and, maybe get a shot at it. When I was approximately 80 to 100 yards away, it stood up on two feet. I froze solid, inside and out! What I saw was NO BEAR! It's back was to me at first, but after about five seconds, it turned to face me. It was dark brown to black in color, stood approximately 6 1/2ft. high and was VERY solidly built. I got the height by looking at vegetation where it had stood after the encounter was over. I was able to view the creature for approximately 10 to 15 seconds before it turned and went into the bayhead. I think it took me five to ten minutes just to get my heart rate and breathing back to normal. I forgot all about the shotgun I was carrying! When I approached the area where it had been, I detected a foul odor lingering in the air. It was like something had soured. The grass was bent down, but there was no bare dirt from which to detect a track. I DID NOT follow it into the bayhead! I have told only my wife and father of this incident. I had heard, from time to time, about Bigfoot in the Pacific Northwest, but this was the farthest thing from my mind that day. There is a creature in that swamp that is not a bear, not a human. I can't really say what it is, but I know it exists.",
  "classification": "Class A",
  "county": "Collier",
  "state": "Florida",
  "latitude": 26.15915,
  "longitude": -81.76041,
  "location": "-81.76041,26.15915",
  "location_details": "The area was in a sawgrass field between two cypress bayheads. It was about 500 yards wide by 1/4 mile in length.",
  "temperature_high": 79.38,
  "temperature_mid": 73.15,
  "temperature_low": 66.92,
  "dew_point": 59.43,
  "humidity": 0.74,
  "cloud_cover": 0.43,
  "moon_phase": 0.47,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.75,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 8.85,
  "wind_bearing": 107,
  "wind_speed": 7.72
}