{
  "id": "7368",
  "title": "Morning sighting by deer hunter near Naples",
  "date": "2006-10-07",
  "timestamp": 1160179200,
  "observed": "This was years ago. I'm 38 now, but when this happened I was 14. My father worked with a guy who had some prime property in Naples, NewYork. Being that I was 14, I was not old enough to have a hunters license. So my father let me go with him, and I had the task of pushing the deer to him. We got to the property just before daylight, Dad went about 200 yards up the the road, and I went the opposite way, and went into the woods. It started getting light out, and I remember that it was real cold that morning. It had snowed the day before but there was only patches of snow on the ground. I had been walking through some thick sections of brush and was getting tired. I was walking in a shallow gully with a 20ft ridge on both sides of me. I walked up the ridge (I believe) to my left. There was a large tree laying down, so I sat down with my back against it. I could see pretty clear, the whole area. I guess I dozed off for a bit. I woke up, hearing what sounded like a large branch had snapped. I looked to my right, and then to my left, but as I looked to my left (paning the view) I saw something on the the oppisite ridge across from me. There was this large dark figure just standing there turned my way. It had heavy fur like hair all over it. I could'nt make out a face because it had long tangled hair hanging down. Now this figure was maybe 30 ft away give or take. Being cold as it was, I remember it breathing through the hair in front of its face (that really creeped me out). I sat there up against that tree with my heart racing out of my chest, afraid to move. This went on for minutes, feeling like a lifetime.Then all of a sudden it took one step torwards me (I think it was its left leg).That's when I jumped up, turned, and ran as fast as I could. I remember, I had run into a high fence line earlier that morning, that took my some time to scale. Well I jumped through this area of the fence from total terror of what might be chasing me. I managed to get to the road and ran full sprint to the car which was a ways down the road. The car was locked. Thats when I looked around, but nothing was after me (thank god). I waited about 2 hours and finally saw my dad walking down the road. He was pretty upset with me leaving the woods as early as I had but I told him what happened, and what I saw, and he did'nt believe any of it. He figured I was just cold and tired making it up. I had never even heard of bigfoot when I was 14. I didnt know what it was, but I know for a fact that it wasn't a bear.This figure was dark brown but lighter colored around its shoulders and thighs. Its arms were, I thought, too long for its body. I figure it was at least between 7 to 9 foot tall. It had to weigh 4 or 500 lbs. at least. From reading some of your articles, people have said it smelled bad, but I didnt smell any odor that I remember.",
  "classification": "Class A",
  "county": "Ontario",
  "state": "New York",
  "latitude": 42.6153,
  "longitude": -77.4028,
  "location": "-77.4028,42.6153",
  "location_details": "",
  "temperature_high": 62.27,
  "temperature_mid": 52.365,
  "temperature_low": 42.46,
  "dew_point": 37.22,
  "humidity": 0.71,
  "cloud_cover": 0.09,
  "moon_phase": 0.52,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1030.48,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 4,
  "visibility": 8.77,
  "wind_bearing": 103,
  "wind_speed": 2.35
}