{
  "id": "4650",
  "title": "Campers find stacked rocks and hear unusual rock banging near Strawberry",
  "date": "2002-07-04",
  "timestamp": 1025740800,
  "observed": "I took a trip over the fourth of July to visit a friend in Modesto.  We traveled to Tuolumne County, past Sonora, and camped off of Gargoyle trail above Strawberry on the night of July 4th.  We got to the camp site at about 4:00pm and set up.  My two friends took a nap after setting the tent up but I decided to look around, so I took a hike down a dirt road that lead into the forest.  I was hiking around when my friend came to look for me.  We hiked further into the forest and found a big rock formation and climbed up.  The top was about the size of a football field.  On top we found three stacked rocks and took some video of it.  The bottom rock was big, it came up to my shins and the top two were smaller. Maybe five pounds each. We then went off into the unknown on the other side of the rock formation.  We had to hike down a lot of boulders and the brush was getting pretty thick.  It was now probably 7:00 or 7:30 so the sun was disappearing and it was getting dark.  As we got closer to the trees I felt as though we were being watched.  Just my imagination I thought, so we hiked on.  This feeling remained and I started to think about how long it would take to get up the rocks we were clibing down. Besides if something was watching us it could have been a bear.  I convinced my friend to go back to camp and we did. At about 8:30 or 9:00 my friend heard rocks being clinked together of in the distance and he said they were answered off in the opposite direction.  I didn't believe him but soon I heard the clinking too.  It was fast but obviously not a wood pecker.  My friend commented that the pattern seemed not human, but I thought it could have been. This banging went on for about twenty minutes and then quit.  We went to sleep later and didn't hear anything all night.  I did notice it was a moonless night and the forest was pitch black.  The next morning we got up and I checked for foot prints around the camp fire were I cleared everything within five feet but saw nothing.  As we were packing up we heard the banging off in the distance again so I decided to try and copy the patterns.  I tried using two rocks and the sound wouldn't carry.  So I then tried a rock on a log.  Finally I settled on a small branch on the log because it sounded to me like what was coming from the forest.  The banging was repititious with a pattern on the end.  I mimiced the banging for about ten minutes before it stopped answering me.  I started packing up again and we heard it another time so I tried to answer it.  No answer.  It did it again, I answered, no answer.  There were long pauses in between my responces and its banging.  I got the feeling what ever it was, wanted to continue it's banging but not in response to me.  We finished packing up and left.",
  "classification": "Class B",
  "county": "Tuolumne",
  "state": "California",
  "latitude": 38.24805,
  "longitude": -119.9924,
  "location": "-119.9924,38.24805",
  "location_details": "Take Highway 108, past Strawberry to the Trail of the Gargoyles.",
  "temperature_high": 86.29,
  "temperature_mid": 71.06,
  "temperature_low": 55.83,
  "dew_point": 43.46,
  "humidity": 0.38,
  "cloud_cover": 0.06,
  "moon_phase": 0.81,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1010.85,
  "summary": "Clear throughout the day.",
  "uv_index": 13,
  "visibility": 9.97,
  "wind_bearing": 260,
  "wind_speed": 3.36
}