{
  "id": "7568",
  "title": "US Air Force retiree encounters bigfoot in Sulphur River bottoms near Cooper Lake",
  "date": "2003-12-16",
  "timestamp": 1071532800,
  "observed": "I was born in 1936 and grew up on a farm in Delta County, while working in the field we would see what we referred to as the nude woman.  It was a large animal walking upright along the edge of woods and never coming completely out in the open. I left in 1954 to serve my Country for 23 years and returning to same area that I grew up in. Sometime in the mid 1980's after a heavy rain with flooding, my baby brother found footprints where this animal had departed the water and walked around in the mud.  In the early 1990's my Mom and Dad were traveling down TX 71 in Delta County and just before crossing the South Sulphur River a large man like animal walked across the road in front of them and stepping across fence and heading north. Again in the 1990's my son-in-law and myself had a couple of encounters with a large animal walking through trees in waist deep water while we were duck hunting in what is now Cooper Lake. Around 1995 while checking my cattle about 10PM I encountered a rather large man like animal (look to be about 8 ft tall) in my light and he went one way and I the other.  One never hears of this animal any longer and the only wild animals you see now is wild boar and black panther.",
  "classification": "Class A",
  "county": "Delta",
  "state": "Texas",
  "latitude": 33.26222,
  "longitude": -95.82056,
  "location": "-95.82056,33.26222",
  "location_details": "North off TX hwy 71 on South Sulphur River and East from FM 1531 between Middle Sulphur and South Sulphur River.  Most sightings were seen at the end of County Road 2070 onto the Cooper Lake area.",
  "temperature_high": 53,
  "temperature_mid": 40.2,
  "temperature_low": 27.4,
  "dew_point": 25.77,
  "humidity": 0.51,
  "cloud_cover": 0.16,
  "moon_phase": 0.75,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1023.42,
  "summary": "Partly cloudy in the morning and breezy until evening.",
  "uv_index": 2,
  "visibility": 9.98,
  "wind_bearing": 315,
  "wind_speed": 13.28
}