{
  "id": "11487",
  "title": "Security policeman has nighttime sighting at Myrtle Beach Air Force Base",
  "date": "1974-04-18",
  "timestamp": 135475200,
  "observed": "At the time of the sighting I was on duty as a Security Police officer in the U.S. Air Force at the Myrtle Beach AFB, SC. I was patrolling on a security road called the Serpintine at about 9 pm. The temperature was pleasant at about 69-73 degrees. The Serpintine is in a restricted area zone within the base and lies in a heavily wooded area. There was a full moon that night so I turned off my headlights to see if I could follow the road with just the moonlight... it was very bright and this was easy to do once my eyes adjusted to the darkness. I remember driving around a curve when I decided to turn my headlights back on. Much to my surprise I saw a creature in mid-stride just as it was about to leap over a ditch by the roadside. It made the jump with ease and disapeard into the tree line in about 3 seconds. The creature had light brown fur covering all of its body that was not long but it was not short either. As I had been trained to  report situations of any nature as correctly as possible I believe that the following information is fairly correct. The creature stood about 7-8 feet tall and probably weighed about 400 to 450 lbs. For its size and obvious weight it had remarkable agility and speed. The jump that it made cleared 14 to 16 feet with no problem. It had a body like a large human covered with hair. I called my flight chief and had him meet me out on the Serpintine road where I explained to him what I saw as was my duty at the time. He said that he believed me but thought it was in the best interest of my career to not put this report on the police blotter that night and that I should simply forget about the incident altogether. Until now, I have done just that.",
  "classification": "Class A",
  "county": "Horry",
  "state": "South Carolina",
  "latitude": 33.72,
  "longitude": -78.9211,
  "location": "-78.9211,33.72",
  "location_details": "",
  "temperature_high": 68.87,
  "temperature_mid": 58.59,
  "temperature_low": 48.31,
  "dew_point": 47.18,
  "humidity": 0.7,
  "cloud_cover": 0.26,
  "moon_phase": 0.87,
  "precip_intensity": 0.0026,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1019.47,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 9,
  "visibility": 7.09,
  "wind_bearing": 324,
  "wind_speed": 0.99
}