{
  "id": "7363",
  "title": "Family Encounters Red Eyes and Unusual Smells",
  "date": "2002-08-30",
  "timestamp": 1030665600,
  "observed": "We had driven from the San Francisco Bay Area to Sierra County for a camping trip.  When we arrived, our usual campground was full and we went to a less popular campground which was a few miles further down the road.  By the time we arrived it was already dark and we hurried to set up camp for the night.   Our intention was to camp at this campground for the night and look around the surrounding area for a better site closer to the water the next morning.  Since we has children with us they had to go to the bathroom and my friend (who had spent his youth camping in the area and this campground) took the girls to the closest outhouse while my husband and I started setting up camp.  They came back and everyone was talking about how horrible the area around the outhouse smelled and we laughed saying it was close to end of season and about time to clean out the vault toilets.  Soon we finished setting up tents and unpacking the few things we would need for the night.  I decided I should visit the outhouse and my daughter (who had already been with our friend) said she would show me the way.  We set off down the trail and my husband decided to join us.  We walked down the trail slowly because it was very dark and I had only brought a small flashlight that I always keep in the jeep since we hadn't fully unpacked.  The outhouse was located in an area that was about 10 feet below the trail from the campground.  My daughter finally found the trail down and I flashed my light down into this gullky to look for the outhouse.  I found the outhouse and also found two red eyes looking back at me.  The eyes which were reflected in my flashlight seemed to crouch down.  I  decided that I didn't need to go to the bathroom after all andmade the decision to walk back to camp rather rapidly.  When we got back to camp my husband and friend decided to go back and look around with a better flashlight but found nother although both noticed that it didn't smell as bad as it had before.  The next morning I got up and decided I had to go to the bathroom no matter what was there!  When  got to the outhouse I realized that the eyes I saw reflected back at me had stood about 7 to 8 feet off the ground.  Also on further investigation we found some small trees uprooted and pushed over in the outhouse area.  And most important of all, the smell was gone.",
  "classification": "Class B",
  "county": "Sierra",
  "state": "California",
  "latitude": 39.5575,
  "longitude": -120.8294,
  "location": "-120.8294,39.5575",
  "location_details": "We were in Ramshorn Campground in the upper campsite area.",
  "temperature_high": 87.83,
  "temperature_mid": 72.735,
  "temperature_low": 57.64,
  "dew_point": 50.58,
  "humidity": 0.52,
  "cloud_cover": 0.12,
  "moon_phase": 0.74,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1010.93,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 9.96,
  "wind_bearing": 191,
  "wind_speed": 4.13
}