{
  "id": "11930",
  "title": "Soldier sees large figure while on patrol at Fort Lewis",
  "date": "1971-03-01",
  "timestamp": 36633600,
  "observed": "Read report 3281. I had basic training at Ft.Lewis,Wa. I was there from Jan. 71 to May 71. I was assigned to Company E 4th Battalion 2nd Brigade. That is were my barrick was. Between the barricks was an open field 100 yds or more wide. On the other side of the field the outline of the forest trees began and after them more trees and more trees. Anyway it was winter and it had snow. The area was covered in snow. It was a cold clear night. There was a full moon which illuminated the night sky. I can't recall what month it was. I was assigned guard duty of our barricks area. My shift was the early mouring hours (After midnight). I was to walk for two hours patrolling our company area.You could hear the crunching of the snow under my boots as I walk. As I was walking towards the last barrick, I was facing the open field. I saw something at the distance in front of were the forest trees began. It was walking towards me and then it would stop. Where it stood, I looked to the right side of the area and to the left side of the area and saw only this thing in front of me. It started to move again towards me.I saw a silhoutte of a figure it was all black. When it walk it was swaying back and fourth. Scared, I turned around and walked towards my barrick and went inside and told no one about what I saw. A day or two later I think it was in the Seattle times newspaper there were photos taken of bigfoot prints in the snow near a fence at a ranch in the area. I wonder if this is what I saw that night?",
  "classification": "Class B",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 47.0849,
  "longitude": -122.5926,
  "location": "-122.5926,47.0849",
  "location_details": "This occurred in 1971 so if you could locate the barricks area of Company E 4th Battalion 2nd Brigade. You will find the location.",
  "temperature_high": 38,
  "temperature_mid": 31.605,
  "temperature_low": 25.21,
  "dew_point": 16.61,
  "humidity": 0.64,
  "cloud_cover": 0.47,
  "moon_phase": 0.16,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1031.04,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 9.22,
  "wind_bearing": 144,
  "wind_speed": 3.94
}