{
  "id": "26271",
  "title": "Hunter tells of possible encounters while in the DuPuis Reserve east of Lake Okeechobee",
  "date": "1998-11-22",
  "timestamp": 911692800,
  "observed": "I was on quota for wildhogs in Dupis Forest WEA in South Florida. There was one other person with me on this hunt. We had walked in to a area we call the Intersection it is the junction of forest road and a canal.My buddy was about 150 yds NW of my position and I was at the intersection.It is two to three mile hump into this place. When we left the trail head there were not any other vehicles parked and vehicles are not permitted off the grades.It was 30 minutes till day break and still very dark when got to my spot. I sat there till about thirty minutes after first light till I see thru my scope safely. I stood and scoped north up the canal and then to the east and the south.I moved about fifty yds north and scoped to the north from a mound of dirt over a culvert. I saw two small black hogs 150 to 200 yds north of me so started moving up dike towards them to get a shot. I hadn't moved very far when I saw in grass on my left what looked like two trail through wet grass. It looked like two people had crossed the field recently side by side. This struck me for two we had very seldom see anyone in our area and they would had to have past by buddy to cross this area. Also there few quotas given out. I walked down get a better look and look for tracks then heard noise behind me across the canal in small cypress head like soft splashing sounds. I moved back up over the dike to the canal and stood still for a couple of minutes looking for movement in the head. IT was still pretty shadowy in the head. I raised my rifle to look through the scope something made sound I have never heard before. I can best describe as hrumpff. I am former Marine Sgt and Desert Shield/Storm Veteran. The Hair stood up on my the back of my neck and I was instantedly on alert. I took a couple of steps back and stood trying to find the source of the sound and could not went down the dike to the mound I mentioned and dropped down the west of it crawled back upto the top laid my pack in front of me rested my rifle on top of it. I spent the next hour watching for movement. I cannot vouch for it leaving out the northside but it did not leave east , west or south. The sound immediately made me feel like it was saying all right that close enough!   I did not mention this to my buddy but I asked if he had seen anyone pass by him and he said no. When we returned to truck there was not any vehicles but ours there.",
  "classification": "Class B",
  "county": "Martin",
  "state": "Florida",
  "latitude": 26.91319,
  "longitude": -80.48412,
  "location": "-80.48412,26.91319",
  "location_details": "",
  "temperature_high": 81.51,
  "temperature_mid": 77.62,
  "temperature_low": 73.73,
  "dew_point": 70.06,
  "humidity": 0.81,
  "cloud_cover": 0.52,
  "moon_phase": 0.11,
  "precip_intensity": 0.0021,
  "precip_probability": 0.21,
  "precip_type": "rain",
  "pressure": 1021.69,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 9.25,
  "wind_bearing": 85,
  "wind_speed": 7.98
}