{
  "id": "46546",
  "title": "Mother and son, while backpacking, experience a possible night-time camp approach near Natches",
  "date": "2014-09-15",
  "timestamp": 1410739200,
  "observed": "September 14 My adult son, daughter and her son and I all hiked into Twin Sisters Lakes from the Deep Creek Campground around 1 1/2 to 2 miles. My son and were planning to spend 2 nights and daughter and her son, just for the day. We set up camp, ate lunch and just enjoyed the day at the lake and surrounding area. Many hunters were leaving due to it being the last day of Bow season for Elk so we watched them being packed out by Mules and Horses. Beautiful day in the low 80's I would say. My daughter and her son left around 3:30 so it was just my son and I and the 2 dogs. He fly fished and I just relaxed and read at camp. At dusk we started a fire, ate and had a glass of wine.  I did a couple wood knocks but did not hear a response. Around 9:00 we went to our tents with a dog in each for the night. At 1:30 in the morning the dogs needed out to do their business so we did also then back to bed. My son snores terribly so my sleeping was intermittent. Our tents were between two trees about 8 feet apart and a foot from each other and the trees. I awoke sometime in the night and raised up because I heard the dog moving around. He was staring out the window towards the Lake. He did this several times that night, didn't bark or growl. I heard nothing that night except my son and the dogs snoring. September 15 Awoke early and we decided to take a hike to Blankenship Lakes and Meadow. Spooked a Rough Grouse on the way and met 2 Bow Hunters on the trail. They had no luck but said where they were camped at Blankenship was busy with coyotes during the previous night. When we reached the Lake one of the dogs Maggie would not leave Bob's side so we continued on. Got back to camp around noon. When dusk arrived we made a fire and I decided to do a call, one loud Whoop and immediately across the lake we got a return whoop and Elk on both sides of the lake started bugling back and forth to each other. Also a coyote yip then it was quiet for awhile and then more Elk bugles and a loud knock on the hill behind our tents. By this time my son was wide eyed and couldn't believe what he was hearing. I had told him of all of my expeditions and reports from others so he was a believer but had never experienced it for himself. We decided to go to bed and he immediately went to sleep snoring right away. I on the other hand was awake and listening when I felt something heavy stepping on the side of my tent where my arm was lying , I slowly moved my arm not making a sound because I didn't want whatever it was to know I wasn't sleeping. I felt my head being pushed down also as it went by and a loud swoosh on the tent fly. I was petrified and tried to call out \"Go Away\" but nothing came out. I was mute, but continued to try and say something to wake my son up. He and both dogs were snoring. After it passed my tent I continued to hear soft bipedal footfalls around our camp. I did not sleep all night. Around dawn I heard another wood knock. We got up , packed up and left. Very memorable trip for us, shook me up but I still want to have a sighting and will keep doing this. Note: Actual names edited by the investigator in order to protect the identity and privacy of the witnesses. ST",
  "classification": "Class B",
  "county": "Yakima",
  "state": "Washington",
  "latitude": 46.73581,
  "longitude": -121.3201,
  "location": "-121.3201,46.73581",
  "location_details": "Trail head at Deep Creek Campground to Twin Sisters Lakes",
  "temperature_high": 82.08,
  "temperature_mid": 70.035,
  "temperature_low": 57.99,
  "dew_point": 41.27,
  "humidity": 0.45,
  "cloud_cover": 0.02,
  "moon_phase": 0.74,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1011.89,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 9.97,
  "wind_bearing": 317,
  "wind_speed": 2.28
}