{
  "id": "16295",
  "title": "Mutliple daylight sightings in Suquamish",
  "date": "2008-01-28",
  "timestamp": 1201478400,
  "observed": "I used to live in Suquamish, WA. during 1994-2002. My house was located at the top of center street in the middle of the suquamish tree farm. My family and I during those years of residency had seen and heard quite a few times what we believed to be sasquatch. The first time I saw one was in early 1995, and I was 8 years old at the time. It was a fairly chilly overcast winter day. We had few neighbors at the time and there was noone outside, so it was very peaceful. My mom had instructed me to pick up some cans from the backyard alone. The backyard was connected to the woods. I was at the edge of the woods and started heading back towards the house when I heard something very large running in the woods about 20 feet away. I quickly turned around to look and I saw what I thought was a bear at first, but it was running on two feet and it stopped quickly as it saw that I turned around. When it stopped, it stood straight up (on two feet like a man), and held its arms and hands close to its side. Ferns were covering parts of its legs. It was about 10 feet from any trees. I got the impression that it was hoping that I didn't see it. As it stood still there, I stared at it for several seconds trying to figure out what it was. It was about 6'5\". It was very muscular, and very hairy except for I did not see hair on the face and on the fingers. Its fur was a dark brown color. To be honest I cannot remember exactly what the skin color was, but I think it was light tan. Its eyes were directed toward me. The facial features were very similar to human features. I remember them being a lot more human than ape-like. Its face was not course and scary! I stared at it for about 10-15 seconds until I finally figured out what it was, and then I bolted back to the house as fast as I could. There was a few more occasions that I have seen a Sasquatch, as well as my mother and my brother. We not only had sightings but almost every night we heard branches being broken in the woods and being hit in patterns, hollars and/or \"woo woo\" vocalizations coming from deep in the woods or close to the edge of the woods near our house. We often heard the \"woo woo\" sound between 2 or 3 sasquatches (I believe). My brother and I had gone out in the woods a lot trying to recreate the \"woo woo\" vocalizations and we would hit sticks on trees in patterns. I can only remember two ocasions that we actually got a response. The first time was when we were in the woods at the edge of our property, and we were beating a stick on a tree in a pattern of 4 strikes each. After doing this for about 20 minutes not very far away from us we heard a very large tree branch being broken off of a tree following by 4 loud strikes on a tree. It responded in with 4 strikes a few times and then it stopped. The other time was when my brother and I were in the yard at about 9 o'clock at night, and it was very dark. Jokingly to my brother I did the \"woo woo\" vocalization, not expecting a response, but about 3 seconds later near the edge of the woods that were infront of our house we heard a  loud and somewhat dragged on \"woo\" .",
  "classification": "Class A",
  "county": "Kitsap",
  "state": "Washington",
  "latitude": 47.45411,
  "longitude": -122.3219,
  "location": "-122.3219,47.45411",
  "location_details": "Center Street is the only road that runs along through all of Suquamish. The sightings ocurred west at the very top of the hill. At that time the forest was owned by the Suquamish Indian tribe, but this may have changed I don't know.",
  "temperature_high": 37.38,
  "temperature_mid": 36.285,
  "temperature_low": 35.19,
  "dew_point": 31,
  "humidity": 0.86,
  "cloud_cover": 0.93,
  "moon_phase": 0.71,
  "precip_intensity": 0.0034,
  "precip_probability": 0.99,
  "precip_type": "rain",
  "pressure": 1005.78,
  "summary": "Overcast throughout the day.",
  "uv_index": 1,
  "visibility": 8.92,
  "wind_bearing": 196,
  "wind_speed": 6.16
}