{
  "id": "2954",
  "title": "",
  "date": "",
  "observed": "As a young person I vaguely remember hearing something about a creature called \"Bigfoot\". I suppose I thought he was something the Indians had conjured up. That is how others seemed to think. Then approximately eight years ago, my sister gave me a book to read during a visit in Florida. I think it was called \"Mysteries of The Unexplained.\" I found it to be an interesting book, especially the story about a creature called \"Bigfoot.\" I don't remember the details, however, I do remember thinking that there is much more to this so-called myth than meets the eye. Sometime later I saw the famous \"Patterson Film\". A film of a large, heavy, hairy, bipedal subject quickly walking away from a startled cameraman and his horse. My curiosity at that point had me wanting to find out for myself what the truth was. Was this creature real or just a never-ending series of hoaxes and grossly exaggerated stories? I was in no position at the time to set out on an expedition so I promised myself and a few close friends that someday I would head to the northwest corner of the United States, the reported home of this creature, and answer the question for myself. Years later the opportunity finally presented itself. I started purchasing enough supplies for a thirty day solo expedition into the northwest. Having recently read three books on the subject of Bigfoot, I thought my best bets were either Washington State, Oregon, Northern California or Idaho. Sightings were consistent in and around the large forests of these states. While purchasing supplies, I picked up the August issue of a camping magazine that, as it turned out, contained an article about backpacking in Northern California. The article stated that you are more likely to see a bigfoot in the forests of this region, than another human being. I took the article seriously. Northern California here I come. At this point I had read enough material to have a plan that I was confident would bring me face to face with one of these creatures. My plan was not to go after one. It was to give one the opportunity to come to me. I just had to put myself in itsbackyard. As I made my way into the northwest corner of the state, I realized I wasn't in for a casual stroll through a forest. This forest was thick with undergrowth and either going almost straight up or straight down. One week into my \"hike\" into the back-country I decided to change my plan. After reflecting on conversations I'd had with the locals, I decided to turn around and head for an area about twenty-five miles from where I was now standing. The people that had talked openly with me about bigfoot activity, all mentioned geographical locations that were in the same general vicinity. They also said that there hadn't been any activity there in the past ten or so years. After making my way to this new location, I met a man that had lived there for the past thirty years. He said pretty much the same thing everyone else said. I had come to the right place but I was about ten years too late. He then pointed to a spot on my map that to the best of his recollection was the area many footprints and sightings had been reported over a decade ago. That would be my final destination. At this point my feeling that a bigfoot was no longer in this immediate area was growing somewhat stronger. I considered the possibility that bigfoots had lived here at one time and now lived elsewhere due to the logging activity in this valley some ten to thirty years ago. The forests of this area are large enough to play hide and seek with the entire U.S. Army. Dense forest covers the land further than the eyes can see and these creatures could be anywhere in it. I pressed on. As I made my way toward my final destination I continued to look for signs of something big and heavy leaving some kind of marks on the earth. If they were still around I should find something. I came across what looked like a bedding area for a creature that could fit a bigfoot's description. It was a bowl like depression in the ground about eight feet in diameter. Everything within this circle was flattened. It was only fifteen feet from a stream. Convenient I thought. There was also what looked like a large print on the side of this bowl headed toward the water. Many small to medium sized trees in the immediate vicinity were bent over or broken off at the base. It all fit, but it could be a bear's resting place, I thought. I left without bothering to take a picture. That same day I followed an old logging road to a point that it turned into a poor excuse for a rabbit trail. Along the way I found three depressions, about 14 inches long and 7 inches wide, in the soft mossy like growth between two old fallen trees. It appeared to be three steps taken by a very large and heavy bipedal animal. Coincidence, I thought, and pushed on. By this time on my trip I had seen several bear, a couple of deer and two mountain. Their tracks were all over the place -- especially bear tracks. Bear excrement was also in great abundance. This put me at ease. The better they were eating the less they would be interested in what I was eating. Blackberries are abundant in August, and from the looks of the scat it appeared the bears were taking full advantage of this. Visibility was usually about ten to fifty yards through the trees. Some of the noises that had been around me on a regular basis were bear and deer that I could not see because of the poor visibility. At the start of this expedition I would reach for the pepper spray at the mere sound of a couple of squirrels playing in the leaves. This behavior was probably due to the fact that a bear had wanted to join me for dinner the very first evening I was in the bush. I'll never forget the sound of him coming towards me through the forest. From that point forward I was well aware that I was carrying approximately forty pounds of bear bait (thirty day food supply) on my back. As my time in the woods progressed so did my ability to guess what animals were around me by the sounds they made in the brush. Given the opportunity, my eyes would usually confirm what my ears had told me. Since I was on foot and usually on a logging road, I sometimes got extremely close to animals before they realized I was there. One time I had walked to within 35 feet of two bear (not on purpose) that were feeding off to the side of the logging road. They never heard, saw or smelled me. Anyway, I reached my destination and made camp at the intersection of four logging roads. It was now almost two weeks into the expedition. My plan was to recon the three logging roads that led down to a river. If I could get to the river I might find some nice fresh bigfoot tracks in the sandy banks along the waters edge. I checked out the east road that evening. No luck. It dead ended about a quarter mile from the river just like the forestry map showed. I went back to camp, ate dinner, set out a chem-light and hit the tent. I put the chem-light out in hopes of deterring bear from casually strolling into my little area of operation. The night passed without incident. I slept like a log. How appropriate. The next morning I checked out the north road. Success, it led right down to a nice open field next to the river. The map I was given by the National Forest Service showed it to dead-end about half a mile short. I'm glad I checked it out. I thoroughly checked the southern bank of the river. No tracks. The northern bank was covered with heavy growth, therefore I did not plan on a crossing to check it out. No tracks and I was sure this was the place that had stirred up much of the controversy some ten to thirty years ago. As I stood in the field and looked back towards the forest, I decided to check all around the field. I started at the west end. Almost immediately after starting this new search pattern I came across a depression similar to the ones I had recently seen but didn't pay too much attention to. Again there was no detail because of the type of ground. It was a bigger and deeper depression than I thought a man or bear could ever make. I looked further and there was another one and then another one. This time I was sure these were tracks because there were about seven of them strung together in the pattern of a natural bipedal walk. I walked in the tracks. The bottom of the depressions were very hard. As though something of great weight had made them the last time this ground was wet. The distance between the steps was not extraordinary, at an average of about three feet apart. I lost the track momentarily over hard ground and then found it again. It was a consistent track. I figured I was tracking him (I say him when in all actuality it may be a her) the opposite direction he was walking judging from the shape of the tracks. It was now time for something to happen that I had never considered or read about in any book. I followed the tracks through a soft section of ground to the base of a fifty foot tall pine tree. At the base of the pine tree was an area of ground that looked as though it had been trampled down repeatedly by this heavy creature. It was at that very instant that I realized he had been leaning against the tree. Then it occured to me that if he was leaning against this bark and sap covered tree, there must be hair stuck to it. I moved may face closer and there it was. From a level of about three to six feet off the ground, hair was stuck in crevices and tree sap. I collected some samples and then stood, in the same place that this creature had stood, with my back against the tree. I couldn't help but notice the nice view of the open field next to the river he might have enjoyed while standing in that position. The surface of my back from my buttocks to the area between my shoulder blades naturally was against the tree. If this creature did not put his head against the tree, as I did not do, then I guessed that I was about 2 feet shorter than the Bigfoot that had rested against this tree. I'm 5'10\". After collecting the hair samples from the tree I continued tracking. I had only gone another twenty yards when I found a similar trampled down area at the base of another pine. This pine however was a much younger tree and the top had been broken off at a height of about 6 feet. The top was lying off to the side. As I looked closer I noticed that all of the branches on the side of the tree directly over the trampled down area were either bent back and to the side or broken off. Hair was all over this tree as well. This creature wasn't resting against trees, he was scratching his back! I continued the track and had only gone another 15 or so feet when I found another young pine that was in the same condition as the one I had just inspected. The top had been broken off at about the 6 foot level also. More broken and bent branches with the telltale hair stuck in the bark and sap. This creature had a definite itch. Since I was tracking him backwards, I guessed that he must have tried to rid himself of this itch on the two small trees. They probably weren't sturdy enough to satisfy him so he made his way over to the large pine and finished the job. The tops of the small pines that I found lying on the ground still had a small percentage of green needles with the majority looking brown and dying. I don't know enough about trees to make an educated guess as to how long ago the tops had been broken off. I ventured to guess that it was no longer than a month before I stood in the very same spot. Wow, he had been through here quite recently I thought to myself. For some reason I thought he had just been passing through and was no longer in this area. He had been here but was long gone into another valley. Looking back I am not quite sure why I didn't think he was still around. Maybe it was because I wasn't finding any fresh tracks. I continued tracking him for another three hundred yards or so. He was about as hard to track as an elephant through a corn field. The tracks led to the edge of the thick forest undergrowth at which point I decided to terminate my efforts. Looking back over the area I had tracked, I realized he had stayed just inside the edge of the wood-line the whole way. A smart bigfoot, I thought, unlike the bear and deer that were leaving their tracks all over the place in the wide open field. As I started to circle back around the east end of this large open field next to the river, I came upon a large pile of excrement. It looked human except for the fact it was a very large pile and the contents were plant-like. As I mentioned earlier, I had seen a lot of bear dung and this looked quite different. Tracks led up to and then appeared to straddle this dropping. Again, this was not the best ground for holding a track, however it did look as though the tracks were made by a large, heavy, bipedal ... bigfoot. I collected a large sample of the excrement and put it into a plastic baggy. At this point I was feeling pretty good about what I had found and satisfied that this had been a successful expedition even if I wasn't going to see a bigfoot. I had hair and excrement samples -- good physical evidence that a bigfoot is still roaming these woods. I looked around some more and found two more of the same type of piles fairly close to the first one. I remember thinking this must have been his bathroom. He probably would feed all night, get a drink from the river and then relieve himself here. If this was being done by a bigfoot then he seemed to be a creature of habit. By this time I had been down by the river for a good few hours. I headed back to camp which was located about two miles up the logging road. After dinner I decided to go ahead and recon the west road which was the last logging road I had to check out. It came to a dead end just as the east road had. As I was making my way back to camp, before the mosquitos set in, I noticed something I did not see on my way out. On the north side of this old logging road stood a young pine tree that had been topped at a point about 6 feet above the ground. I immediately looked down at the base of this tree and saw what I knew I would see. The large trampled down area of ground. Those big padded feet had stood right there. I then saw the tracks leading up to the tree as well as the top of the tree lying on the ground off to the side. This time I closely inspected the broken off top of the tree and found hair stuck on it. Hair most likely from the side of the hand that broke it off. I must add at this point that I was keeping a lookout for claw marks in the tracks and teeth marks on the broken off tree tops which would most likely have been left behind if a bear had done this. I was paying attention to this not for myself but for the people that would ask me later about it, when this expedition was done. I had no doubt what was doing this and it wasn't a bear. Anyway, I didn't find a trace of either claw or teeth marks. This time I kept the broken part of this little pine with hair intact in the sap and put it in a plastic baggy. It seemed as though this creature had a habit of preparing these small pines for back scratching posts in an intelligent and consistent manner. I wondered if other bigfoots did this. I completed my journey back to the tent and realized that the pine I had just collected the sample from was only about 100 yards away. If the other depressions I had seen on the way into this area were indeed tracks as I thought they could be, then bigfoot was leaving too much evidence around here to be just passing through. I figured I was camped right smack in the middle of a bigfoot's backyard. I had gathered about three chords of firewood in the course of the day which I now started using to stoke up a pretty good sized camp fire. The wood burned quickly because of the fact it was very old and dry. About every twenty minutes or so, I would have to put on another log. This kept the fire at just under the bonfire setting. Darkness fell without incident. No bears, no mountain lion and no bigfoots. Wow, if my friends could see me now. Bigfoot Bait! Every few minutes or so I would look up the west logging road and then up the east logging road. The north and south avenues of approach were covered by very heavy brush. I could here a lizard coming toward me from either of those directions so I wasn't too concerned about them. Actually it would have to be a pretty large lizard to be heard over the snap, crackle and pop of my camp fire. I passed some time by sharpening the ends of my walking stick. I got a chuckle out of the fact that my walking stick was about three feet longer than the one I had started with. The further away from civilization I got the softer I walked and the bigger the stick I carried. Everything I had read about and heard about bigfoots told me that they are not aggressive unless shot at. Since I had no gun that wasn't a problem, however I did keep the pepper spray ready at all times just in case. I also tried to stay aware of which direction the breeze was blowing because into it the pepper spray had a maximum effective range of only about two feet. I continued to look up and down the two logging roads. My camp site was surrounded by complete darkness. I looked at my watch. It was 11:00pm. If I didn't see anything by 1:00am I would hit the tent for a good night sleep. A bigfoot could be miles from here. Time dragged on as I occasionally looked up and down the two roads. I was sitting on a short log set in an upright position at a distance of about five feet from the fire. My back was to the fire so that it wouldn't impede my vision as I scanned the surrounding darkness. I looked into the darkness of the west road then looked into the darkness of the east road. That is when it happened. The hair on my back and neck stood straight up. It was the strongest instinctive reaction I had ever had in my life. I was looking directly into a pair of eyes that were looking directly at me. I didn't move a muscle. It was a bigfoot. There was no doubt in my mind that what I was looking at was not a bear, mountain lion, owl or a deer. His eyes were set wide apart and well above where I knew the ground should be. I didn't take my eyes off of them. The Omah, as it is called by the local Indians, was watching me. Something that I had not spent much time thinking about, until right at that moment, was now of prime concern to me. Had anyone ever taken a shot at this creature? Did this creature, for whatever reason, hold any sort of grudge against human beings? I hoped not. Actually it was more like a quick prayer. I did not want him to direct any ill will towards me at all. It most likely would have been about 750 pounds of powerful ill will. He wasn't moving. I wasn't moving either, even though my neck was crooked to the left in an uncomfortable position. I watched him and he watched me. The longer I looked into his eyes, the more I got the feeling this was just an intelligent and lonely creature curious to see what I was doing. I began to relax. I had a Mini-Mag flashlight in my left hand and the pepper spray in my right. I wondered if I should shine the flashlight on him to get a look at his body. Again I should point out that this could have been a female, but for the sake of simplicity I will continue to refer to the creature as \"he\". I opted not to shine the flashlight on him. He came to me, I saw him, and now the ball was back in his court. I waited for him to make the next move. His nocturnal eyes were reflecting the light of the fire I was sitting next to. I tried to make out the outline of his body. I could not. The camp fire illuminated bushes and trees out to a certain distance depending on how recently I had put on a fresh log. Beyond that point of illumination the forest was pitch black. I believe the fire was at a point that a fresh log had just been added when I first looked up and saw Bigfoot. I continued to observe. The right eye (his left), occasionally seemed to fade in and out as though it was partially blocked by a leaf or branch of the bush I was sure he was standing behind. Earlier, at times when I really had the fire going, the front of this bush would be illuminated for the period of time that the fire was brightest. I couldn't see the bush now but I was sure of it's position. As I studied his eyes I got the impression they were wet. Liquidy you might say. An effect probably caused by the flickering of the fire they were reflecting. They were a glossy yellow when I first saw them and faded to a real faint yellow (almost white) toward the end of our staring session. Looking back, I would guess that while paying complete attention to him I had neglected the fire and as the fire lessoned in intensity so did his eyes. Occasionally it looked as though he would blink. His eyes would simultaneously disappear for a fraction of a second. It also looked as though his head was shifting from side to side. Similar, I thought, to what I would do if I was trying to observe someone from behind a bush. His eyes looked to be approximately 4 1/2 to 5 inches apart and almost 1 inch in diameter. Minutes ticked by. My neck was beginning to get sore from the position I was sitting and watching him as he watched me. I casually looked at my watch. It was 12:15am. Then I slowly raised and extended my left arm for the purpose of using my hand as a measuring tool. He didn't move while I did this. He just kept watching. I used the width of my left hand to measure the distance from his eyes to the top of a lone pine silhouette against the night sky in the background. I made a mental note that his eyes were almost directly under and 2 hand widths below the tip of the lone pine. I also made a mental note not to move the log I was sitting on for the rest of the night. I would use this information when the sun came up. After making these observations, I decided to relieve the soreness in my neck and look at him from another position. I slowly spun around in the direction away from him. I didn't want him to think I was getting ready to confront him. I looked up and he was still there watching me. I remember wondering if he could tell if I was watching him. The fire was now slightly behind and to the left of me. From his vantage point, I was most likely silhouette by the fire. His eyes were now getting harder to see. They were there but not as bright. My eyes were getting sore from staring. Then I noticed how dark it was getting in my camp. The fire had barely a flame left to flicker. It didn't take me long to decide that I wasn't going to sit here in complete darkness with a bigfoot just spittin distance away. I slowly stood up to get another log from the pile that was just out of reach. I positioned the log in the fire and sat back down. When I looked up I could not find his eyes. He was gone. At about 3:15am I thought I could see his eyes again but in a position further back from where he had stood the first time. I was kind of expecting him to come back and see what I was up to. It was hard to tell if he did or not, but I think he did. Time passed slowly as I waited for the sun to come up so I could check for tracks. I'd thought about doing it with a flashlight but rejected the idea. I would see things much more clearly in the morning. As the sun came up I sat in the same position I was in when I had measured his eyes from the top of that lone pine tree. According to how everything lined up his eyes would have been centered at the top of the 8 foot bush that stood 70 feet from where I had been sitting. When it was light enough to see the ground fairly well, I made my way over to the area behind the bush. It was an area that was just to the side of the logging road. The ground was similar to the logging road itself which was hard packed gravel. The difference was that the area where I figured a bigfoot should have been standing was covered in a dry, sparse, wheat type of grass. There they were -- the same size tracks I had been finding all along. The tracks were not much more than the grass being squashed, and I do mean flattened, in the shape of a big padded foot. Narrower at one end than the other and approximately 16 inches long and 7 to 8 inches wide at the front of the track. There was a set of tracks leading to a point exactly behind the bush where they then became less distinguishable as though he had been shuffling around. There was however one depression in the ground at a point close to the bush. I guessed it would have been his right foot that made it by its shape. I stood where it looked as though he had stood and found myself directly behind the bush. I looked up to see that if I was about 2 feet taller my eyes would have been at bush-top level. There was another set of tracks that led away at a slightly different angle than the set that led in. He had come in and left on the east logging road. Nice and quiet. No crashing through the forest. At this point I thought to look for a hair sample around the tracks in hopes of later matching it with the samples I already had. I got down on my stomach and looked. Nothing. I quickly looked over the logging road for more tracks but didn't find anything. It was very hard packed. Decision time. Do I stay camped here and hope to see a bigfoot in the daytime? This is when I realized I had taken too many pictures the day before and I didn't have anymore film for the camera. Last time that ever happens. Anyway, Bigfoot is nocturnal and daytime sightings are extremely rare. He would probably be somewhere very well hidden and fast asleep during daytime hours. As I mentioned earlier my plan was to stay thirty days in the bush. But now that I had the hair, excrement and tree samples as well as the pictures of the tracks and the experience of last night. I decided 2 weeks was long enough. I packed everything up and headed out on the east logging road. I was walking at a pretty good pace. Having 17 miles to cover before nightfall with about 60 pounds worth of gear still in my rucksack, I didn't want to waste any time. I'd only gotten about 75 yards up the logging road when I heard what sounded like an extremely large animal thrashing in the woods at a point next to where I was walking. The noise was so close that I didn't think I was going to get the pepper spray I wore on my left forearm out of its holder in time to use it. Then I realized it was running away from me. Crashing through the woods I think best describes it. Large branches snapping as it escaped my nearness. As I listened to it's escape I tried to figure out what it was. It covered a lot of ground very, very quickly. Through the process of elimination I started guessing. The list of possibilities was short because there are not many animals large enough to have possibly made that much noise. The speed suggested a deer but there was no snorting or hoof sounds that I had previously heard from deer running away from me. Nor did the animal in question sound as \"fleet-footed\" as a deer. The feet were crunching a lot of material underneath them suggesting that they were large surfaced extremities. Could it have been a bear? Possibly, but all the bear I had dealt with to this point were not that afraid of anything. The creature in question was also running away from me on the downhill side of the road and it is my understanding that bear don't run downhill too well. Things happened very quickly, which made it hard to tell, but it also sounded as though the creature I had heard was not getting away from me in a four legged gallop. There is one thing I am sure of. The noise I had heard was caused by an extremely large and powerful creature that desperately did not want to be that close to me. I will venture to guess that my ole buddy had stayed pretty close to me the whole night and may have even been watching for me the next morning. I call him that because I felt as though we had somehow bonded during my long look into his eyes that night by the camp fire. I had seen his soul and it was a kind soul. My question had been answered. July 1997-Author's note to the reader: I have made a number of trips into the wilderness since the August 1993 excursion and have yet to find tracks that approached the size and shape of the ones described in the above account. The excrement I had collected was never tested but here again I have not found a similar sample to this day. And as for the hair. It was tested and the result was \"no match\" to any known North American animal ...",
  "classification": "Class A",
  "county": "Del Norte",
  "state": "California",
  "location_details": "About twenty-five miles outside of Bluff Creek",
  "summary": ""
}