{
  "id": "11168",
  "title": "Late night sighting by motorists in Crosswicks",
  "date": "2005-12-10",
  "timestamp": 1134172800,
  "observed": "In the fall of 2003 my husband and I were living in Bordentown NJ. We were on our way home from Yardville NJ, driving down Hogback Rd heading towards Ward Ave. This road is located in Crosswicks NJ. As we came around a bend in the road we noticed what seemed to be a primate looking creature running across the road. It was upright but crouched over useing it's arms to propel itself across the road. This was no oversized monkey. It was dark, but it looked to be a dark brown color, and the body covered in a thick shaggy looking coat. It was roughly 5 foot in height hunched over. It's startling feature was it's broadness. We only saw a side and back  view, so we could not make out any frontal features. As we passed the point were we saw it crossing the road, we looked in both directions of where it had ran to, and from where it had come. Looking in the direction of where it had come we saw a dog standing at the edge of the property barking. There was no sign of the creature in the direction it ran. My husband and I saw the same thing, both being startled and trying to think  of logical possibilities. Trying to think of logical explainations, and none could be thought of.",
  "classification": "Class A",
  "county": "Burlington",
  "state": "New Jersey",
  "latitude": 40.16465,
  "longitude": -74.68135,
  "location": "-74.68135,40.16465",
  "location_details": "Take US 195 and get off  the exit for route 130 south toward bordentown. At the light for Groville Rd you make a left. Go down until you come to Hogback rd. Make a right. The road will go straight for a while. Where it bends around to the left that is the approximate location where we saw it. If you come to the youth correctional center you passed the site.",
  "temperature_high": 33.53,
  "temperature_mid": 26.725,
  "temperature_low": 19.92,
  "dew_point": 18.88,
  "humidity": 0.71,
  "cloud_cover": 0.09,
  "moon_phase": 0.33,
  "precip_intensity": 0.0013,
  "precip_probability": 0.26,
  "precip_type": "snow",
  "pressure": 1016.6,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 1,
  "visibility": 8.71,
  "wind_bearing": 237,
  "wind_speed": 5.41
}