{
  "id": "9393",
  "title": "Driver has early morning encounter near Rice Hill",
  "date": "1991-10-15",
  "timestamp": 687484800,
  "observed": "I was traveling back to Southern Oregon, from Portland, Oregon in the fall of 1991.  It was approximately 2:30 am, on a Saturday morning.  I was driving south on Interstate-5 and it was raining lightly.  The area is known as Rice Hill, about a half hour north of Roseburg, Oregon.  Heading south, the highway runs up rice Hill, sweeps to the west across the top, and then turns back to the south as it drops off.  As I crested the hill, and was exiting the the turn to the west, my headlights came level with the road and the guard rail, along the turn to the south.  Right at the point of curve, of the turn to the south, right next to the guard rail, was a bigfoot.  It was crouched down, kind of squatting, like a baseball catcher, untill my headlights were right on it, and then it stood up, quickly, took a step or two and jumped the guard rail, and went down the enbankment.  At 65 mph, I didn't see it for long, especially at night; however, there is no doubt that it was the stereotypical bigfoot.  Needless to say, I was quite surprised, and I pulled over.  My stopping distance, at that speed, put me downhill from the spot quite a way.  I was carrying a .44 magnum pistol with me, and thought about going back up on foot to look for sign, but I was a little rattled at the time, and opted not to.  I sat there for probably 5 minutes, and then continued home.  I told friends and family, but have never contacted any organization about the incident.  The only issue I have with this sighting is that is was within 4 days of Halloween (before or after, I don't remember).  That being said, I still don't quite know what to think about it. The bigfoot, as I said, was the stereotypical bigfoot.  Dark brown, shaggy, little or no neck, long arms, and stood on two legs.  Having seen many bears in the wild, I'm certain it was not a bear.  Its ability to jump a guard rail in two steps was not anything a bear could do.  It didn't seem huge to me, however, when I stand next to a guard rail, it comes up to the top of my knee (I'm 5'8\"), so it must have easily been in the 6'+ range.  I never got to see its face, mostly the back and a bit of its left side.  All I can say is that it looked like Chewbacca from the back. I know it sounds weird to most people, but I saw what I saw, whether it was a costume or not.",
  "classification": "Class A",
  "county": "Douglas",
  "state": "Oregon",
  "latitude": 43.5251,
  "longitude": -123.311,
  "location": "-123.311,43.5251",
  "location_details": "Approximately mile post 147 on I-5.",
  "temperature_high": 78.65,
  "temperature_mid": 66.78,
  "temperature_low": 54.91,
  "dew_point": 41.34,
  "humidity": 0.52,
  "cloud_cover": 0.09,
  "moon_phase": 0.25,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.08,
  "summary": "Partly cloudy starting in the evening.",
  "uv_index": 3,
  "visibility": 9.63,
  "wind_bearing": 211,
  "wind_speed": 4.06
}