{
  "id": "3229",
  "title": "",
  "date": "",
  "observed": "Well, I feel queasy even writing this. I went on a camping trip alone for two nights this summer, from July 10th to the 12th, near Lower Richardson Lake (by South Arm, ME). I expected the moose, deer, beavers, chipmunks, woodchucks, and the wild birds.  I did not expect the unusually stormy local weather--or the unusual sounds I heard.  It seemed to rain from the first day I set up camp, until I left early on the afternoon of the 12th. I was camped roughly in between the South Arm camp grounds and the summit of Elephant Mountain, very close to the Appalacian Trail. (North of Andover, ME) I had never been in the area before, And pretty much blazed my own trail up into the old reforested logging area.  I set up my tent on a thirty or forty year old logging road (flat), cut into the side of the mountain.  To further specify my location, I would say I was in the saddle at the source of the Clearwater Brook. (About 3.4 miles up the left side of the stream.) The rain let up for a few hours on the 10th and the 11th in the evenings, long enough for me to make a small cooking fire each night.  On each night, I heard the most unnatural sounds of my life.  My eyes are welling up just writing this. I was in my tent the first night it happened.  I had a new microlight one man tent.  It was basically just big enough to lie down in.  I had just finished eating a fire-warmed MRE, when the noises began.  It started to rain, and I heard, down by a pond about forty yards away or so beneath the logging road, the deep groaning/barking noise.  I thought:  It's a moose..or a wolf?  No... I got really scared.  I bring a Beretta 9mm with me when I camp alone, and let me tell you, I had white knuckles and a ****in' round in the chamber after that shit started up!  Anyway, after about two minutes of these ugly, scary, deep groaning noises, it stopped.  What gets me still, to this day is the fact that some of the sounds reminded me of recordings that I have heard on old shows about Bigfoot (Leonard Nimoy narrated?). SO, the second night, I heard it again a couple of times, and just tried to ignore it.  Damned if I didn't stay awake the whole night.  I got out of there the next day when the rain let up.  I packed my whole camp site up in five minutes and tromped back down to my car briskly (I parked my car in the South Arm Campground parking lot). What gets me to this day is the sound.  I want to be honest with you:  I did not even consider checking it out or investigating.  I did not look for tracks, I did not \"feel investigative\"  at all.  Those noises were enough to scare me out of my wits.  So, I don't know what to tell you.  I have noises. That's it.  I do have pics of my campite, and views from my site, but thats it, really.  I could take you right back there again, if need be. I haven't mentioned this aloud to anyone.  I have put off developing the film on the disposable camera because I know when I see the pics they will remind me of the trip. I just needed to tell someone.  I suppose you can ignore this if you want.  But I do feel better just writing it all out. Thanks, Mark",
  "classification": "Class B",
  "county": "Oxford",
  "state": "Maine",
  "location_details": "Take Route 5 north, (from Maine Turnpike: I-95) until you get to Andover, ME.  Then, Take South Arm Road to South Arm Camp Ground.  You will cross over the Appalacian Trail.  Elephant Mountain will be on your right.  Park in the South Arm Camp ground parking lot, walk back out to the road, turn right.  Walk back down to the FIRST brook corssing.  There is a snowmobile trail, following the left side of the stream, heading upstream. Hike on the trail for about a mile, until it turns into a moose trail.  Continue up, until you reach the boggy area in the saddle between the small peak to your left and the larger Elephant Mountian  on your right.  There won't be a trail, so turn left and climb up the steep slope about forty yards when you can't do anything else.  There is an old logging road chiseled out of the hill there.  This is where I camped.  About 3.4 miles in. I left my fire ring on the road.  It should be easy to locate.",
  "summary": ""
}