{
  "id": "11228",
  "title": "Two teenagers have a surprise encounter in mid - 80's",
  "date": "1985-06-15",
  "timestamp": 487641600,
  "observed": "It was summer in the mid 80's. (Sorry I can't be more specific.) Some friends and I had taken to exploring the woods that surrounded our town. We were constantly in the woods for one reason or another. On this particular morning, I think it was around 0900, only one of my friends was able to accompany me into the woods. We followed our normal trail to the rim of Curry Hollow, which was about 400yds into the woods. We strung some ropes, and went down the incline. It was steep enough that the ropes were necessary. When we got to the floor of the hollow we started walking through a section of woods that we hadn’t checked out yet. Mostly we were just wandering, and seeing what was in the area. At that time of my life I had a started developing an interest in the outdoors and wildlife, so whenever we were in the woods I tried to make sure we were quiet enough not to scare away any animals. We all enjoyed trying to track the different species in the area. In our wanderings we had found raccoon dens, snake and bird nests and even tracked a few deer through the trees and brush so when we saw the animal stand up in front of us we knew instantly that this was something different. We were coming up on a deadfall that had been covered over with vines and surrounded by small saplings since it had fallen. We started to go around the fallen tree (it was approx. 80 to 100 feet long and 2 ½ feet wide and the crown caused it to be about three to four feet off the ground) and had made it to the base when we both spotted a humped shape covered with brown hair or fur. The shape was about 10 feet in front of us and was close to a tangle of vines and brush. We both froze and just stared. We had both been told that though they were rare in the area, some people had seen bear in and around these woods. And that’s what we thought it was, and we knew we were to close. Thinking it might be injured since was so still, I decided we should go home and let my father know a local cop know about it. I glanced to my friend and motioned to him that we should go back the way we came. We had just started to turn when the shaped stood up and took off running. When it stood, we saw was that it was at least 2 feet taller than us. At the time we were both around 5’ 5”. When it started running was when I got scared, it was on two legs. It cleared a good 20yds through the brush in what seemed like a split second. We instantly took off the other way and didn’t stop until we had made it up the rope and out of the woods. We didn't discuss it at the time. Later that week we talked and told some friends, and few days later we went back to the area with 3 more people. We found the tangle of brush the figure was behind and saw a large clear space, the size of which a small family of deer would have made, but there were no tracks, neither foot-prints or hoof-prints. The ground cover was a thick mat of leaves over the entire area. We noticed nothing else out of the ordinary. At that time I had seen bears in the zoo and on nature programs. And had seen them stand up on two legs. This was not a bear. It moved too fast and did it upright. And it certainly wasn’t a deer, or a big dog or anything else I had ever seen outside of a movie. When the figure stood up it was a good 2 feet taller than us so that would put it around 7'5\". It had it's back to us and I got a good perspective of it's bulk. It was muscled but not fat like a bear. And it had sloping shoulders. That was all I saw. I started running around that time. I've read about a foul smell others have noticed during their encounters, but I noticed nothing like this. It did make a lot of noise as it ran, crashing thru the brush and trees. It ran in the direction of road which splits the hollow in half. The other side of the hollow has less steeply angled sides and would have been much easier to climb. Plus there was more wooded area on that side of the hollow. I have never spoken to anyone about this since that summer. I knew no one who would have believed me.",
  "classification": "Class A",
  "county": "Allegheny",
  "state": "Pennsylvania",
  "latitude": 40.357,
  "longitude": -79.8765,
  "location": "-79.8765,40.357",
  "location_details": "Curry hollow is a steep sided valley the leads from the Monongahela river and Route 837 in Dravosburg to Lebanon Church Road and the Allegheny County Airport in West Mifflin. It passes below the Irwin Works steel processing plant. At the time of the sighting it was a medium to densely wooded area with a gravel road running parralel to a small stream that fed into the river. The sighting accured on the downhill side of the large train bridge that crosses the hollow and leads to the steel processing plant.",
  "temperature_high": 69.56,
  "temperature_mid": 63.905,
  "temperature_low": 58.25,
  "dew_point": 49.35,
  "humidity": 0.63,
  "cloud_cover": 0.82,
  "moon_phase": 0.91,
  "precip_intensity": 0.0043,
  "precip_probability": 0.83,
  "precip_type": "rain",
  "pressure": 1016.63,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 7.8,
  "wind_bearing": 162,
  "wind_speed": 6.52
}