{
  "id": "19589",
  "title": "Dawn sighting by hunter within 2 miles of boundary of Pittsburgh International Airport",
  "date": "2007-07-22",
  "timestamp": 1185062400,
  "observed": "It was about 430 am and I had just settled into my treestand for a day of hunting.  It was extremely quiet which was the first thing that I noticed.  It was going on about 500 when I heard what sounded like a log being hit with another log.  I brushed it off as something going on up at the new construction site on top of the hill.  About 520 am I heard something walking back and to my left toward the top of the hill I was sitting on.  I was about 1/4 of the way up the hill and this was near the top where I heard it.  I knew the walking was bipedal and at this point in time I got very angry about somebody tresspassing and ruining my day of deer hunting. As the noise got closer the sun was just up enough I could skyline this huge \"man\" walking across the top of the ridge.  I looked at him through my binos and well it wasn't any man.  I know this bigfoot had to be 7' 5\" tall and at least 650 lbs.  He was dark brown or black in color unable to tell exactly due to lighting issues.  I wasn't able to make out facial features.  His hair was maybe 2 inches long and his hands were definitely below knee level.  I put my binos down and it was then he must have noticed something and within 3 strides he disappeared into the grapevine thicket.  The entire actual sighting lasted maybe 15 seconds.",
  "classification": "Class A",
  "county": "Allegheny",
  "state": "Pennsylvania",
  "latitude": 40.52825,
  "longitude": -80.25475,
  "location": "-80.25475,40.52825",
  "location_details": "A steadily disappearing forested area near Pittsburgh International Airport. Road names withheld at the request of the witness.",
  "temperature_high": 77.51,
  "temperature_mid": 66.76,
  "temperature_low": 56.01,
  "dew_point": 48.31,
  "humidity": 0.54,
  "cloud_cover": 0.23,
  "moon_phase": 0.26,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1023.49,
  "summary": "Partly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 9,
  "visibility": 9.96,
  "wind_bearing": 47,
  "wind_speed": 5.68
}