{
  "id": "26943",
  "title": "",
  "date": "",
  "observed": "Something very unusual  just happened to me this Thanksgiving. I went with my wife to see her father.  The area is western  Oklahoma. It is wheat country.  The land is flat and laid off into square sections of land. Occasionally a stream interrupting the square sections of land. The streams are the only place you will find trees with the exception around the houses and machine sheds. There are wheat fields after wheat fields.  Other crops grown there such as sunflowers. I have tried counting wild turkeys. There would be as many as 200 in a flock feeding in the stubbed fields.  There are plenty of deer, some pheasant, rabbits, coon, lots of small rodents. I don’t believe there are caves there. It was getting about 9:30pm Thursday evening the 26th of November 2009.   I was bored so I went out of the house away from the rest of the family, found a solid piece of wood out of my father-in-law’s shop and gave a couple of wood knocks then walked over to the corral fence and gave a holler.  I didn’t expect anything at all. Then to my surprise I got a wood knock back.   The knock came from the creek where all the trees grow.   At this point I went to the house and had my wife come out and listen with me.   I gave a couple of hollers right away a coyote howled back and started coming our way. Wasn’t long before he was about 100’ to 120’ away in the shadows and started yipping and howling at us, which was very strange. I also smelled a terrible odor and I have a very keen sense of smell. It smelled like human sewage mixed with rotten meat. It was really bad. Also my wife heard a low moan or growl. She said it lasted a long time and it was a ways off. She does not know what to think about the sounds she heard. So the next night I had my son-in- law come out of the house with me. I gave the same wood knocks then went over to the corral gave a holler.   And again a little to my surprise I got an answer. This time my son-in-law was there to hear and witness.    The knock came from spot as same as the night before. ",
  "classification": "Class B",
  "county": "Major",
  "state": "Oklahoma",
  "location_details": "",
  "summary": ""
}