{
  "id": "6734",
  "title": "Family members encounter footprint",
  "date": "2003-07-24",
  "timestamp": 1059004800,
  "observed": "I may have stumbled onto a print by pure accident, while hiking with my niece and nephew in the Siuslaw Natl. Forest, west of Dallas, Or. I will give details of the location later, as not to saturate the site with the public, so I can finish my investigation in the area and get more readings and data... GPS, photos, and history on the area...  Here is what I have thus far.... On the mid afternoon of 24 July, I took my niece age 13, and nephew age 16, to an area I used to hunt and log about 30 years ago west of Dallas, Oregon. Thirty years has changed the area quite a bit as Weyerhauser has bought up a lot of the land, Boise and Hampton Co. as most of the area is logged out, there is still a large standing area of some old growth and an area in which to hike. We were not 15 min. out from my truck on a trail and my nephew blurted out... \"Uncle Ron, look at this foot print!\"  Off the trail a foot or two was a large print made in dried mud, (the last rain in the area was about 6 July 2003), so the print was well defined and clear as the photo shows. Several things I noticed about the print, 1) It was not a boot print as no boot tracks were showing, the print was smooth, consistent with a bare foot print. 2) The width was about 9 inches wide at the largest width, and about 14 inches long. 3) Toe contours could clearly be seen, but it looks like what ever made he print may have stepped on a twig, wood, so not all the toes made an imprint in the mud, as the casting shows. 4) The foot print clearly shows a heel print, and arch in the foot, the edge of the foot at wide proportions from a very heavy individual. 5) As the trail is used lightly by mountain bikers and horses, as seen by tracks on the trail. Our 5 hours up on the trail, I only saw one mountain biker that day while in the area. So, it is not used that much, maybe only by locals who live in Dallas or people who know the area. I attempted to make GPS readings that day, but for some reason, my GPS could not pick up satellite signals possibly from the heavy canopy of trees. Another attempt for a long/lat reading with negative results on a second trip. I will attempt a 3rd trip with new batteries and see what happens. The print was, as I said, left of the trail, going SSW. I searched the area for about 2 hours, hair samples on trees, scat, or other prints in area...negative results...photos of area were taken from different perspective points. At this point, as I dont want to \"contaminate\" the area with undue traffic, I will keep the exact location confidential until I complete my investigation.  Now a little history on the area. I have hunted the Falls City and Dallas area since 1970. In 1972, while heading to Falls City, Or. my friend Rick swerved to miss something darting across the road... I was a witness to something large, tall and running on two legs, not four....thinking it may have been a bear, or a crazed hunter dressed in black... we both, as teenagers could not answer what we saw... The stories we had heard is, that the Dallas and Falls City area from old timers, and hunter friends of ours, stories of BIGFOOT circulated during that time... especially after the famous RED BLUFF, Ca. film clip of the famous Roger Patterson... from 1967. As the photo shows I took a casting of the footprint, as mentioned, only one was found thus far. Within the next few days I will attempt to return to the area for further investigation and findings. Will keep you posted... You do have my permission to post this report and photos... At this point, \"undetermined what made the print\" At his point only two other Bigfoot Research Websites have been contacted on this sighting, no response as of yet. My friend RAY CROWE has highly recommended your site and organization for years. I first met Ray Crowe at a seminar he did on BIGFOOT in 1994. I am also a good friend of Lyle Vann of the Arizona Bigfoot Center Paulden, Az.",
  "classification": "Class B",
  "county": "Polk",
  "state": "Oregon",
  "latitude": 45.0487,
  "longitude": -123.5792,
  "location": "-123.5792,45.0487",
  "location_details": "West of Dallas, Or. off Ellendale rd. Right on Rob Mill Rd. about 10 miles past WeyerHauser Land and west side of the Siuslaw Natl Forest. Off the Mud Puddle/Tree Fort Trail (used by mt. bikers and horses).",
  "temperature_high": 74.59,
  "temperature_mid": 63.795,
  "temperature_low": 53,
  "dew_point": 50.87,
  "humidity": 0.64,
  "cloud_cover": 0.1,
  "moon_phase": 0.85,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.28,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 9.94,
  "wind_bearing": 340,
  "wind_speed": 9.54
}