{
  "id": "7205",
  "title": "Morning sighting by carpenter crew near Ochopee",
  "date": "1979-08-01",
  "timestamp": 302313600,
  "observed": "As a member of Carpenters Union #1641 out of Naples, Florida, I was offered work disassembling a house in Ochopee. Our crew of about 8 men arrived very early, before the trucks, so we climbed up to the roof to enjoy the sunrise and the view. A couple of us were munching on sandwiches, or sipping sodas. On the way up to the roof, some of us noted a foul smell emanating from the basement, As all of the lower windows were broken, we assumed an animal had crawled in there to die. Suddenly, one of the guys at the edge yelled for us to look below him. We all came to the roof edge and observed a tall, hairy creature leaving the basement of the house and walking upright towards the edge of the trees, directly away from us. As soon as the creature reached the tree line, it turned and squated facing us on the roof, about 40 yards away. The creature was about six feet tall, with reddish-brown hair all over it's body. It made no noise or other movement. This silent standoff continued until the creature suddenly stood and gazed far off to the west. It had heard our trucks arriving before we could even see them from the roof. The creature turned and had totally disappeared within just a few steps away from us. Although we were looking down from a height in full daylight, it was just gone. Later, we examined the basement and noticed a sleeping area under the stairs. It was composed of old clothes, rags, weeds and animal fur. There was a nasty smell and we left this spot alone as we took down the entire house, which was moved in pieces to the Gainsville area.",
  "classification": "Class A",
  "county": "Collier",
  "state": "Florida",
  "latitude": 25.8972,
  "longitude": -81.3065,
  "location": "-81.3065,25.8972",
  "location_details": "This house stood alone at the time. I don't recall any other homes near by. There would be nothing left now but the basement foundation, unless someone else built there later.",
  "temperature_high": 90.76,
  "temperature_mid": 84.345,
  "temperature_low": 77.93,
  "dew_point": 72.49,
  "humidity": 0.69,
  "cloud_cover": 0.38,
  "moon_phase": 0.27,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.24,
  "summary": "Humid and partly cloudy throughout the day.",
  "uv_index": 10,
  "visibility": 7.3,
  "wind_bearing": 173,
  "wind_speed": 0.64
}