{
  "id": "20870",
  "title": "",
  "date": "",
  "observed": "In the fall of 1974 I was bowhunting for deer near the small town of (edit) Nebraska.  Not seeing any signs of deer in an area I decided to try another spot.  I drove east of (*) along the Niobrara river.  A road which along the south there is somewhat steep dirt cliffs and wooded flood plains with swamps and marshes to the north.  There are several ravines and creeks which flow into the river from the south.  About 5 or 6 miles East of (*) there was an area past the second auto gate in which people were allowed to hunt.  I hunted this area but left before dark because my car was not too dependable and did not want to get stranded after dark.  Driving back towards (*) I decided to look for deer in the ravines as I past. I came to a ravine about 4 or 5 miles east of (*).  When I looked into the ravine (south) I saw a large Gorilla looking thing about 40 to 50 ft away.  I estimated it to be about 7 feet tall and had coal colored hair about 3-4 inches in length all over its body.  I could only see from about the knees up.  It's face was more human than ape and lighter in color, kind of a dark tan color (could not tell if it was skin or very short hair on it's face).  It had almost nothing for a neck. It looked right at me for about 2 seconds.  Then it turned around and ran on two feet up the ravine (south). When it turned it twisted it's whole torso as if a person with a sore neck would do. It turned from it's right to it's left.  It also had thrown its right arm accross it's face as if to gain momentum for it's turn or maybe hide.  As it turned I could see it's muscles of it's upper back and shoulders ripple.  This thing had to be very strong.  When it ran it made very little noise,  crunching of twigs of leaves.  I would guess it's weight to be about 300 to 350 lbs. I got the feeling that the thing was traveling south to north to the river. I sat parked there for a few minutes trying to put everything in order.  I had heard stories about ape like things out in the area and always just consider them as tall tales.  I decided not to tell anyone because I did not think anyone would believe anyway.  Many years later I did tell a few close friends and they just laughed. I know it's been a long time ago but I still can see it in my mind, one of those things. I had another experience while bowhunting south of (location removed at witness's request), Nebraska in 1995.  I did not see anything but am very convinced that something of this nature took place.  Willing to talk to someone about it.",
  "classification": "Class A",
  "county": "Holt",
  "state": "Nebraska",
  "location_details": "(removed at witness's request)",
  "summary": ""
}