{
  "id": "23414",
  "title": "",
  "date": "",
  "observed": "My friend and I were fishing along the Rocky River in the Rocky River Reservation. We were up on a rock wall that was about eight feet above the river. We had been fishing there about two hours when we saw a herd of deer cross the river away from us. About five minutes later we could see something moving around in the woods directly across from where we were sitting (The River in this part of this reservation is about 20 feet across). We just figured it was the deer and continued to fish. Then I realized that if that was a deer it would have to be really tall or standing on its hind legs. It looked as though it was trying to eat leaves off the trees. The sunlight caught its eyes and I realized it was looking forward at us with these glowing reddish orange eyes (glowing from the sunlight, and I'm not implying it possessed scary demon-eyes or something). As I was trying to figure out what this \"deer\" was doing, I realized it was starting to make its way out of the woods. This is when my friend and I realized it was not a deer at all. A large black image that was standing on two legs started to appear through the trees. My friend took off with her fishing gear at this point and went to her car. I continued to stand there in disbelief of what I was seeing. It stood there at the base of the woods looking at me. I could see this creature standing plain as day 20 feet across the river from me. I could see it was well over six feet tall and had black fur from head to toe. Once I realized what I was looking at I grabbed my fishing gear and took off across the field to my friend’s car. I even tripped and fell over at one point and peed my pants in fear that it may have been chasing me because I started running. Once I got in the car I asked my friend what she saw and she said she wasn't sure but that she was never going to Rocky River Reservation again.",
  "classification": "Class A",
  "county": "Cuyahoga",
  "state": "Ohio",
  "location_details": "I’m not sure what road it was on. But If I would go back down there and drive around I could find it again. There is actually a bridge that goes over the river by where we were fishing.",
  "summary": ""
}