{
  "id": "34725",
  "title": "Ginseng hunter has an unexpected encounter near Blaine",
  "date": "2003-08-16",
  "timestamp": 1060992000,
  "observed": "While looking through reports for Kentucky I came across report #11966 in Lawrence county, KY. I had a sighting/experience around the same time period and same area near Blaine, KY. I have never told anyone of this other than at the time it happened I told my wife I had been stalked out of the woods by something large and packed my family up, leaving the area. In 2003 my wife and I took our daughter and youngest son with our travel trailer to camp at Yatesville Lake State Park in Lawrence county,Ky near Blaine. We arrived on a Friday in August with intent of fishing and I always go on ginseng hunts where I am able/allowed. I think it be noted I am an avid outdoorsman having hunted, fished, hiked, and camped in at least 28 states of the USA for 40+ years. I am well acquainted with big game animals including bears, mountain lions, elk, deer, and wild hogs. I stake my reputation on my word and kept this encounter to myself. On Saturday morning I took my family to fish in the lake at a spot where Highway 32 bridge crosses a fork of Blaine Creek. After my family was set up, I took off into the mountain on the southwest side of this bridge and possibly part of Yatesville Lake WMA to hunt ginseng. As I had worked my way up a long deep hollow and neared the top of the ridge and to my left I heard knocking like someone striking a piece of wood against a tree (similar to what researchers hear/do). I also had several rocks come through the trees from the top of a small cliff at the top of the ridge, but thought they had fell off the rock formations on their own. Then as I happened to look back behind me from the hollow I came out of on the far side of that ridge I saw a very large dark hair covered figure that was watching me and it was standing upright, it definately was not a bear. I estimated later it was near 8' tall, I'm also a carpenter and pretty good at measurements. As silly as it sounds, when it left my sight, I spoke aloud to this \"thing\" and said \"Old one I mean no harm and I'm only taking what I need\" all the while easing my way around and down toward my family, once I was out of eyesight I took off down the mountain as fast as I could, I could hear this \"bigfoot\" following at a distance. Once I got to my family I told my wife to get everything to gather and packed my family out of the area telling them a bear was stalking me off the mountain. It was not a bear and I guess I'm only reporting this now because of the other sightings in the area around the same time. BFRO is welcome to contact me and I would be willing to travel back to the exact spot and show where this occurred even though it was over 8 years ago. ",
  "classification": "Class A",
  "county": "Lawrence",
  "state": "Kentucky",
  "latitude": 38.06181,
  "longitude": -82.69125,
  "location": "-82.69125,38.06181",
  "location_details": "",
  "temperature_high": 82.52,
  "temperature_mid": 75.635,
  "temperature_low": 68.75,
  "dew_point": 70.78,
  "humidity": 0.86,
  "cloud_cover": 0.43,
  "moon_phase": 0.65,
  "precip_intensity": 0.01,
  "precip_probability": 0.38,
  "precip_type": "rain",
  "pressure": 1015.9,
  "summary": "Light rain in the afternoon.",
  "uv_index": 7,
  "visibility": 4.63,
  "wind_bearing": 266,
  "wind_speed": 2.58
}