{
  "id": "5535",
  "title": "",
  "date": "",
  "observed": "I live in Albuquerque New Mexico in the summer of 1998 during the September elk Hunt I had an experence while stalking for elk with a hunting buddy of mine I had the feeling something was near but could not tell what. I stopped and waited for a while but nothing when we started do walk again we heard a very loud and low growl and I mean a loud and low growl near by. I have been hunting far a long time now and have been in the wilderness since I was a boy and have never heard anything like this it scared my partner very much and since I was the only one armed with a firearm he did not leave my side for the rest of the day. I had an idea of what it was but kept it to myself and did not want to scare my friend more I told him it was just a bull in heat as their was cattle all through the area he kind of believed me when we got back to camp we kept the enconter to ourselves. A few other things happened that week the next day we found a bear hunting dog in camp he was very scared of something and very hungry we tried to get hold of him to check his collar but he would have nothing of it he would stay close to camp but not close enough to get him we finally had to leave him there. Also the next day I kept my eyes and ears open some of the elk rubs did not look right not till a couple of years later did I connect what I was seeing some of the them where tree twists not scrapes like an elk would do reading some books I have read say that sasquatch mark there territory this way. In 2000 I was deer hunting this time with most of the same people not in the same area while sitting around the fire I just happen to say something about bigfoot some of the people laughed but some did not so I took a chance and told them about 1998 hunting trip that night I found out the night before I got there the hunting party heard some loud screams and moans from the hill nearby it scarred them enough that they all armed themselves. Some of them to this day still do not believe but I have played a recording of sasquatch sounds for some of them and they say that was it. I know that New Mexico would not seem bigfoot country most people think of it as all desert but it is not we have one of the largest elk populations in the country and lately we are having more sittings where I herd the growl is not far from the Colorado border and two other sittings in southern NM near Ruidoso which has a large elk heard. I know what I heard and it was not anything I have heard before not a bear or big cat or a bull it almost sounded human and very powerfull it thrilled me and scare me but I know it is real and out there to think other wise would not be sensable.",
  "classification": "Class B",
  "county": "Sandoval",
  "state": "New Mexico",
  "location_details": "Seven mile East of Cuba near the new baca ranch location",
  "summary": ""
}