{
  "id": "41232",
  "title": "Sighting of two animals walking a ridge line in Salt Fork State Park",
  "date": "2013-05-05",
  "timestamp": 1367712000,
  "observed": "I was a vender at creature weekend at Salt Fork State Park on May 4th. And at 9:45pm a fisherman that was in a tournament came in all shook up and said at first I thought you were a bunch of nuts until now so he started to tell his story to other venders. So this grabbed my attention so I went over to listen and there were about five of us that decided to go out the next morning at 6am to check out the site. So I got there at 5am and waited and said to myself if they are not here by 5:30am I'll start without them and maybe they will catch up with me. So I started to head down the sagebrush trail and headed to where he got the picture. The wind was from my left to right and the sun was on my left shoulder and half way down the path two deer must have smelled me because they were on my right and started running. So I kept walking and the sun started to come up and when I hit the first turn on the Shadebush trail I heard something like talking on the ridge on my left. At first I thought it was Friend A and Friend B with Friends A's black shirts on. So I hit a tree and yelled hey guys wait up then they started to walk faster and I yelled very funny guys this is when I got a great look at them. Then I knew what I was looking at on the ridge it was two bigfoots and they were black and huge. I tried to catch up with them and get a picture these things were walking fast and once they got to the bottom of the ridge they took off into the brush but I did manage to get one good picture. You can see in the picture the one turned to look to see if I was still trying to follow them. When the one turned to look back he had to turn his whole top half of his body with his left arm going a crossed his chest to look back at me. I tried to follow them but once they got in the brush I could not hear or see them. But I got a great look at them they were black as coal and the hair length was as long as a bear and well groomed. At anytime they could have stopped and tore me in half but all they wanted to do is get away as fast as possible.",
  "classification": "Class A",
  "county": "Guernsey",
  "state": "Ohio",
  "latitude": 40.10348,
  "longitude": -81.50933,
  "location": "-81.50933,40.10348",
  "location_details": "It was in Salt Fork State Park itself on Shadebush Trail.",
  "temperature_high": 72.38,
  "temperature_mid": 62.87,
  "temperature_low": 53.36,
  "dew_point": 35.34,
  "humidity": 0.41,
  "cloud_cover": 0.03,
  "moon_phase": 0.86,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.87,
  "summary": "Clear throughout the day.",
  "uv_index": 10,
  "visibility": 9.99,
  "wind_bearing": 98,
  "wind_speed": 8.82
}