{
  "id": "26709",
  "title": "Young man recalls encounter behind his house and close to the Meander Creek Reservoir",
  "date": "2001-09-30",
  "timestamp": 1001808000,
  "observed": "8 years ago my friend and I were bored one fall day and decided to hike through the forrest behind my house.  The forrest was very deep but also very easy to see through because there was very little brush.  Its the type of forrest with no trails, just tree after tree for miles.  It was late in the day, early evening.  The sun was going down and sending beams of late through the tree tops.  It must of rained the day before because it was very wet.  We wore our boots to keep our feet dry. With the musty smell of wet leaves and mud we walked deeper and deeper into the forrest.  All of a sudden we saw some type of wooden scraps laying on the ground.  With us pondering we saw what seemed to be cat eyes staring right back at us.  We believed it was a cat or raccoon or something.  While staring we heard a crackling noise of sticks being snapped.  When we looked behind us to see what it was we were shocked.  A furry creature between 7 to 8 feet tall was standing upright like a man staring right at us.  We freaked and began to run back towards my house.  As we were running I kept glancing back and the figure was keeping up with us.  As we got to the end of the woods my friend stepped on an apple thorn which went through his boot and into his foot.  He fell to his knees but with our addenaline pumping and fear of the creature we continued back to my house.  This took place 8 years ago but I still remember it like it was yesterday.  I stopped telling the story to people cause no one believes it.  Only me and my friend know it to be true from witnessing the creature with our own eyes.  We still talk about it from time to time but after meeting a believer a few days back I was influenced to share my story.",
  "classification": "Class A",
  "county": "Mahoning",
  "state": "Ohio",
  "latitude": 41.09087,
  "longitude": -80.77592,
  "location": "-80.77592,41.09087",
  "location_details": "I was between route 224 and Mahoning Ave.  Austintowns water comes from Meander Reservoir which is protected by park rangers.  We were within a mile from the reservoir but exact location within the forrest is unknown due to the production of housing developments within the past few years.",
  "temperature_high": 64.83,
  "temperature_mid": 53.395,
  "temperature_low": 41.96,
  "dew_point": 42.58,
  "humidity": 0.71,
  "cloud_cover": 0.08,
  "moon_phase": 0.44,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1024.71,
  "summary": "Clear throughout the day.",
  "uv_index": 4,
  "visibility": 9.93,
  "wind_bearing": 14,
  "wind_speed": 6.45
}