{
  "id": "13083",
  "title": "Participant observations during BFRO WV Expedition",
  "date": "2005-04-09",
  "timestamp": 1113004800,
  "observed": "I was on the BFRO's West Virginia expedition this past April. The expedition lasted ten days all together.  I participated from April 7 to April 11, as did over a dozen other people.  The base camp was along the Greenbrier River. Almost all of the incidents on this expedition happened within a few miles of this base camp. On the first morning after I arrived I heard a vocalization very much like the Ohio Howl recording. [Click for the Ohio Howl recording.] I was just falling asleep in my tent when I heard it. At first I thought the guides were call-blasting. It was long-drawn-out moaning howl. It sounded real, and clear.  It was echoing up through the river canyon.  There may have been an upturn or a sharp yelp at the end. It was startling. While I was thinking about the sound, I heard radio calls going back and forth from some of the people who were near the river: \"What was that?\" and \"Did anyone else hear that howl?\" When everyone returned to camp, I and the other people who heard the howl compared notes. We all agreed that it was a loud, distant, echoing animal sound, and it was similar to the Ohio Howl. [Click for the Ohio Howl recording.] ------------------------------------------------- The next incident occurred on the second night. I hiked with two other people along a river trail to rendezvous with another small group. We were on a stretch of the Greenbrier across from a very large tract of land where hunting is forbidden, and where whitetail deer are abundant. One of the guys in my group had gen-3 night vision goggles. At one point he asked if I and the other guy could see a spotlight up ahead. We saw nothing except the starry sky and the silhouettes of the hills around us. After taking the goggles off and on, he said it must be an infrared beam up ahead. It was visible through the nightvision goggles, but not visible to the naked eye. The person up ahead who was shining the infrared beam was with the small group that we were trying to rendezvous with. He was sweeping the light beam across the riverbank on the other side, as if he heard something over there and was trying to illuminate it. We reached them and asked if something happened. They said they thought they heard something over there, but it was probably just a deer snorting.  We stayed with them for a while. Eventually they got cold and wanted to go back to camp. The three of us stayed on the trail. One guy slept on the trail for a half hour. When he woke up he asked if anything happened while he was sleeping. We had not heard anything so we all agreed to give it a few more minutes then  hike back to the vehicle. The first sound happened as we were getting up on our feet. It was a loud splash in the river. It was a bit like a carp or a gar would produce on a warm-water lake on a summer night. This isn't warm water though. Two of us heard the first splash and didn't know what to make of it. A few moments later, it happened again. This time it was louder. All three of us heard it clearly. One guy mentioned that some of the reports from the Greenbrier were from fisherman. Some said they've heard rocks thrown into the water near them when they were fishing at night on the river. People from this area know what a beaver tail slap sounds like. It wouldn't happen in this river anyway. The Greenbrier is a swift moving, snow melt river in April. It's not the sort of body of water that beavers will guard and slap their tails in. Beavers will quietly swim around and slap their tails in ponds, lakes and slow moving creeks.  It sounds like a big rock hitting the water. Beavers won't do this in rivers with strong currents and rapids though. A beaver would get swept away in April if it wasn't constantly using its tail to fight the current here. We started moving back along the trail, back toward the vehicle. We didn't want to scare off the splasher, whatever it was, by shining bright lights across the river. We actually wanted it to follow us, and it did. We strolled down the trail with out headlamps turned off. We talked and laughed at normal volume. We wanted to make our presence known. We wanted to show that we were on the move, and make it clear that we weren't trying to sneak up on anything. Before long we heard another loud splash. We stopped and listenned. Nothing. We started walking and talking again. Within a few minutes there was another loud splash. It was keeping pace with us on the opposite side of the river. We kept walking and talking and joking and laughing along the river trail. Every few minutes there was another loud splash, directly across the river from us as we walked down the trail. We were obviously being paralleled by something. After each splash we would stop for just a moment to get a bearing on the direction of the sounds. We also listenned for walking or brush snapping sounds, but there was too much noise from the rapids to hear anything subtle. We returned to the truck and drove back to camp. We told everyone who was still up about what happened, before turning in for the night. --------------------------------------- On the third night, most of the participants spread out along the same river trail. All the vehicles were parked well away from the river, up on a bluff. There was a twisting, steep gravel road for accessing the river. I had to walk this road by myself after accompanying some attendees back to their vehicle.  As I was looking up the slopes above me I saw a stick come flying from right to left. The stick hit a tree, and bounced, and fell onto the road in front of me. The stick was the thickness of a baseball bat, but longer. When I caught up with the other people I told them what happened. One guy walked back to the spot with me. As we were getting close we could hear something big climbing up away from us on the slope.  We radioed for the rest of the people to come to us. When they arrived, one of the guides wanted to examine the stick that I thought was thrown. He looked at the stick and showed it to everyone else. He pointed to the mud and stains on it. The caked rim of mud and water stains showed that it had been sitting on the ground for a long time. It could NOT have just fallen off a tree from above. It must have been picked up off the ground and thrown. To be able to throw something like this, you need an arm, and a hand, and a thumb.",
  "classification": "Class B",
  "county": "Pocahontas",
  "state": "West Virginia",
  "latitude": 38.10785,
  "longitude": -80.19044,
  "location": "-80.19044,38.10785",
  "location_details": "Along the Greenbrier River",
  "temperature_high": 65.42,
  "temperature_mid": 52.915,
  "temperature_low": 40.41,
  "dew_point": 38.58,
  "humidity": 0.56,
  "cloud_cover": 0.1,
  "moon_phase": 0.03,
  "precip_intensity": 0.0001,
  "precip_probability": 0.17,
  "precip_type": "rain",
  "pressure": 1016.14,
  "summary": "Clear throughout the day.",
  "uv_index": 9,
  "visibility": 9.81,
  "wind_bearing": 82,
  "wind_speed": 4.71
}