{
  "id": "1326",
  "title": "Early morning sighting by a hunter",
  "date": "1975-11-15",
  "timestamp": 185241600,
  "observed": "I had spent Saterday night at a friend's house, and awoke at 6 a.m. Sunday morning. I decide to go hunting, so I asked my friend if he wanted to go. He said he did not. So I went to an area I knew. I was hunting rabbits along the dike on the east side of the witchita / Valley center flood control project. This is an area that my friemd and I had hunted at several times. This morning I was not having any luck. I notice that their were several doves, flying down to the course of the water flowing through the center of the \"Ditch\". I decide to try my luck at some dove. I conceal myself in some tall brushes along the side of the water, on the East side. After about fifteen minutes, I started hearing water splashing to the South of me. I leaned out to see the source. There I saw appr. 1/4 miles down stream, a creature. At first I thought it to be a dog getting a drink of water. As it was standing in the middle of the stream. But I soon realized that it was splashing the water with one of it front limbs. It suddenly raise to it hinded legs. And seemed to be looking around, and smelling the air. Even at this distance, and the foggy conditions. I could make out it general appearance. 5'7\" to 6'0\" covered with short, black , hair or fur. It's coat was tight to it body. the head appear to be egg shaped. the ears close to the head. the body was fit, and preportional over all. It appeared to be humaniod. After a few minutes, it resumed it splashing. By bending at the waist, and swiping with it right limb. I wanted a closer look, so I checked the wind and found I was down wind. I worked my way farth North in the hope I would not alert it. Crossed the stream and worked back a long the top of the cliff over looking the water. But by the time I got to the section above where it had been. It was gone.",
  "classification": "Class A",
  "county": "Sedgwick",
  "state": "Kansas",
  "latitude": 37.64103,
  "longitude": -97.40294,
  "location": "-97.40294,37.64103",
  "location_details": "USA, Kansas, Sedgwick,wichita,hoover and k42. 1/4 miles south. In the \"Big ditch\".",
  "temperature_high": 66.61,
  "temperature_mid": 53.5,
  "temperature_low": 40.39,
  "dew_point": 33.3,
  "humidity": 0.58,
  "cloud_cover": 0.32,
  "moon_phase": 0.4,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.46,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 10,
  "wind_bearing": 182,
  "wind_speed": 9.01
}