{
  "id": "1811",
  "title": "Witness and cousin see \"hairy brown man-like creature\" watching them",
  "date": "1977-09-15",
  "timestamp": 243129600,
  "observed": "September 1977, I was ten years old.  My Aunt, my cousin and myself were out in the woods behind my Grandmas house.  We had been working on building a cabin all summer, just for fun.  We would often pack a picnic lunch and spend the day out in the woods.  I heard a noise, like snapping twigs, I turned around and saw in the distance a glimpse of a figure running that appeared light brown in color.  I first thought that it was one of my other cousins coming back to help and then dismissed it from my mind and continued on with the work.  Later that day when we went back up to Grandma's house I then discovered that it could not have been my other cousin, because he had a blue shirt on, not a light brown one. The following weekend, my Aunt, two of my cousins and myself were working on the cabin, we ate lunch and then my cousins and I walked up the trail and down an incline to play on the huge grapevines that we like to climb on. I looked up and saw a hairy brown man like creature sitting up against the fence post.  He was sitting on his behind with his legs bent up and his arms were wrapped around his legs.  He was just looking at us.  I screamed, my cousin looked over and we ran with my other cousin who is younger than us, she did not see what we saw.  I looked back once and the creature was standing in an upright position. I'm not sure if he ran after us or not, I was too scared to look back. To this day the cabin is not finished.  We have all been too scared to go back.",
  "classification": "Class A",
  "county": "Midland",
  "state": "Michigan",
  "latitude": 43.59611,
  "longitude": -84.42722,
  "location": "-84.42722,43.59611",
  "location_details": "Midland County.  Lee Township. South of M-20.",
  "temperature_high": 62.78,
  "temperature_mid": 59.315,
  "temperature_low": 55.85,
  "dew_point": 50.43,
  "humidity": 0.84,
  "cloud_cover": 0.77,
  "moon_phase": 0.08,
  "precip_intensity": 0.0146,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1022.08,
  "summary": "Rain starting in the afternoon, continuing until evening.",
  "uv_index": 3,
  "visibility": 7.8,
  "wind_bearing": 102,
  "wind_speed": 8.52
}