{
  "id": "1621",
  "title": "Fisherman witnesses bigfoot cross the road in front of his car",
  "date": "1969-03-05",
  "timestamp": -26092800,
  "observed": "We (myself and husband John) met with Don Cox the latter part of March, 1969. He had read the article in the newspaper about the footprints we had found, and called to see if we could get together. We agreed, and met him at a designated place, and proceeded to go to Bear Creek where we had seen the footprints. It was his, and our intent to explore each others experience. He was riding in our car, and when we got to Beacon Rock, he said to slow down. The place where he saw Bigfoot was not too far ahead. He related the following: He was going fishing at Bonnevile Dam shortly before 4 a.m., Wednesday, March 5. It was foggy, and when he emerged from a patch of fog, just a short distance East of Beacon Rock, his headlights caught something strange in the road in front of him. At first, he thought it was a tree which had blown over the highway...but it was moving across the road. He slowed down,and then realized it was no tree....but a large, fur clad creature crossing the road. He watched as this huge creature continued across the road, and then with one leap, cleared the embankment (14' high) on the other side of the road. He was so \"shook-up\" he had to stop at Jerry's Cafe in North Bonneville for coffee, and was there encouraged to report the incident. He said the \"animal\" was definitely not a bear. He reported all of this to the Skamania County Sheriff. When we got to the spot where Don had seen whatever he had seen, we parked the car, got out, and Don explained exactly what he had seen (again),and showed us the 14' high embankment which the creature had jumped with such great ease. During Don's recounting of his experience, he was still visibly shaken. I had the feeling he just wanted to tell us about this, and get out of there.",
  "classification": "Class A",
  "county": "Skamania",
  "state": "Washington",
  "latitude": 45.66194,
  "longitude": -122.0144,
  "location": "-122.0144,45.66194",
  "location_details": "East of Beacon Rock.",
  "temperature_high": 46.58,
  "temperature_mid": 41.79,
  "temperature_low": 37,
  "dew_point": 37.88,
  "humidity": 0.83,
  "cloud_cover": 0.91,
  "moon_phase": 0.55,
  "precip_intensity": 0.0111,
  "precip_probability": 0.74,
  "precip_type": "rain",
  "pressure": 1011.84,
  "summary": "Mostly cloudy throughout the day and breezy in the afternoon.",
  "uv_index": 2,
  "visibility": 8.03,
  "wind_bearing": 197,
  "wind_speed": 8.27
}