{
  "id": "9868",
  "title": "Youths in Summer Camp have noisy nighttime experience",
  "date": "1967-07-15",
  "timestamp": -77846400,
  "observed": "My name is J. G. and I am 48 years old. When I was a child I used to go to church camp at different camps through Public Welfare Assistance. We didn't have much money and my mother would send me to camp every summer. This summer was different for me for it was the first summer I was going to camp by myself. My sister would go with me in previous years. I am not sure where the camp is located other than it was near Mt. Rainier, Washington. The camp was named Camp Timberlake [now Camp Arnold]. This was a brand new camp and it was the opening summer for the camp. The camp had Boys Town and Girls Town. There was a lake that had a dock with a slide that spiraled. The dock floated out a few yards form the shore. All the cabins were \"A\" frames with a loft for the councilors. Between the boys' cabins and the girls' cabins was the dinning hall. I had a lot of fun that summer swimming, shooting guns and bow and arrows. The cabins were set within the fir trees and we had about eight boys per cabin. I think there were about fifty to seventy kids in camp. I was only about ten to twelve years old. (1965 - 1970) It was about the third day of camp when everything changed. We had retired for the night and everyone was in bed. I was awoken by loud noises. The counselor told us all to stay in our beds. I remember the boy who slept in the top bunk above me - I called him Silver Tooth for his front tooth was silver - looked out the window and said he saw several large hairy men around the water tower and the cabins and they were ten feet tall. I was scared so I hid under my covers and wished it would stop. The counselor was upset and said for us all to stay in our bed and to stay away from the door and windows. After what seemed to be hours the ruckus stopped and we went to sleep. The next morning when we went outside. Just in front of our cabin was a 30 to 40 foot fir tree tipped over and the root ball was up in the air with a hole in the ground about eight feet. There were human like foot prints everywhere. There must of been several of them and of different sizes. I saw hundreds of foot prints everywhere. They were from eight inches to maybe fourteen inches in length and depressed into the ground about a quarter of an inch. You could see the toes - think four or five -  I was pretty young and don't remember. They took us for a walk that day around the perimeter of the camp. I remember them telling us that the girls played a joke on us and that we were going to play a joke on them tonight. One counselors said you should see the dogs here they are five feet tall. As we walked, we came to the water tower where silver tooth saw the ten foot men, and there were large foot prints all around the water tower. When we got to the lake something had pulled a bunch of algae or sea weed out and it was everywhere. That night we played a scary record (didn't sound anything like the night before) and the counselor said we really got  back at those girls. When we woke up the next morning they told us we were going home early and we loaded the bus to come home two or three day early. Back in those days I never heard of Bigfoot. Later in my life the movie Bigfoot came out and I went to see the movie. When the Bigfoot came into the camp it brought me back to the night in camp and the noises I heard that night. As an adult I often think about that night and wonder how I could get a hold of someone else who was at Camp Timberlake that summer night. I know that all the adults must have seen them and even got some photos. My older sister said that she went to that camp on Mt. Rainer and at the gate it has a sign that says the only known sighting of Bigfoot. If you know of this sighting please, tell me how I can find more about it and maybe even visit the camp or get in touch with others that were there that night. Thank you ",
  "classification": "Class B",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 46.951,
  "longitude": -122.2985,
  "location": "-122.2985,46.951",
  "location_details": "A camp now called Camp Arnold at Timberlake, belonging to the Salvation Army, about 5 miles WNW of Eatonville.",
  "temperature_high": 78.73,
  "temperature_mid": 65.925,
  "temperature_low": 53.12,
  "dew_point": 45.79,
  "humidity": 0.52,
  "cloud_cover": 0.01,
  "moon_phase": 0.29,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.01,
  "summary": "Clear throughout the day.",
  "uv_index": 9,
  "visibility": 9.87,
  "wind_bearing": 345,
  "wind_speed": 2.83
}