{
  "id": "975",
  "title": "",
  "date": "",
  "observed": "My brother, Doug S, was out camping with friends one Friday night.  It was late, and my Grandmother and I were watching TV.  Doug suddenly burst into the house, scared and wild-eyed.  \"Bigfoot! Bigfoot!\"- he came in yelling. \"Bigfoot ran us off!\" Doug was always very brave and I had never seen him scared like that in my life.  He had a shotgun with him, but he said he didn’t shoot it because he was afraid it would kill him if he did, so he ran. Doug stated that they had a campfire going, as always, and suddenly they heard a lot of noise in the darkness around them and this tall, hairy, man-like creature appeared, scared them and ran them off.  I went with him the next day to get his stuff out of the woods, and he was very scared, looking around and watching the woods.  Doug and I had been stalked by wild cats in the swamp before, faced and killed wild boars and had to kill huge snakes, we had all kinds of adventures in the swamps and woods as kids, but I had never saw him scared, much less terrified before.  The camp was torn up, their stuff was scattered about everywhere, the campfire was scattered about as well, and there were strange footprints showing toes all over the dirt.  Later we tried to get our grandfather to go out in the woods and look at them, but he wouldn’t.  Doug and I gathered up his belongings, some of which were torn, like his blanket.  We got out of there as fast as we could, Doug had scared me by acting so terrified. The next day the story was all over the county.  My grandfather and his friends made fun of Doug and his friends.  Granddaddy accused them of sneaking a bottle of moonshine into the woods with them. However about a week later, we received a call from somebody in Hampton, they told us that a truck driver with a major national carrier had came into Hampton, possibly going to the police, terrified, saying he had an encounter with bigfoot.  He had left Savannah in his 18 wheeler, and was on his way to Charleston.  He saw the bigfoot in the road, and had to either stop or hit the animal.  He stopped and the bigfoot either banged on the door or jumped onto the hood.  The truck driver was terrified, and fled the scene.  The local newspaper, the Hampton County Guardian ran a story on the truck drivers encounter.",
  "classification": "Class B",
  "county": "Hampton",
  "state": "South Carolina",
  "location_details": "Between Estill and Hampton, near the Salkehatchie River.",
  "summary": ""
}