{
  "id": "35940",
  "title": "Possible early moming sighting from second story apartment in Atlantic Beach",
  "date": "2012-07-06",
  "timestamp": 1341532800,
  "observed": "This just happened to me about 5:15am this morning. I stepped out on the balcony of my second story apartment I'm in Atlantic Beach fl. I live about 3 to 5 min from Hannah park. I turned on the back porch light as I walked out.  I took about two or three steps out onto the balcony and I heard a loud screaching yell and then three woo whoo whoo noises. As I live and breathe that WAS the sound of a primate!! Immediately the dog in a fence of a neighbor's house right behind the apartment began barking like crazy for about 30 seconds and then stopped. It kind of freaked me out I thought, did an ape escape from Jax zoo or something? I crouched down a little on the balcony and watched the area. In about 5 min I could see the tree in the very back of the apartment back yard rustle a little and it was as if something was moving toward the fence. Then I heard two low grunts from the ground from inside the fence on the neighbors side. It is a privacy fence so I couldn't see what made the grunt. The way the fences are all I could hear were like footsteps moving along the fence toward the trees I saw one shadow really dark moving along the fenceline...it wasn't a person because the shoulders were way too wide and bulky and it wasn't even fully upright. It kind of lumbered along like an ape....people just don't move like that.",
  "classification": "Class B",
  "county": "Duval",
  "state": "Florida",
  "latitude": 30.36186,
  "longitude": -81.41444,
  "location": "-81.41444,30.36186",
  "location_details": "",
  "temperature_high": 91.04,
  "temperature_mid": 84.67,
  "temperature_low": 78.3,
  "dew_point": 71.23,
  "humidity": 0.68,
  "cloud_cover": 0.32,
  "moon_phase": 0.61,
  "precip_intensity": 0.0001,
  "precip_probability": 0.05,
  "precip_type": "rain",
  "pressure": 1016.03,
  "summary": "Humid and partly cloudy throughout the day.",
  "uv_index": 10,
  "visibility": 9.66,
  "wind_bearing": 210,
  "wind_speed": 5.48
}