{
  "id": "378",
  "title": "Sighting by woman visiting an old rural cemetery, near Logan",
  "date": "2000-07-11",
  "timestamp": 963273600,
  "observed": "We went out to an area off of State Route 93 looking for an old Cemetery.  One of my hobbies is Cemetery head stones.  We turned left onto Bear Run Road, then turned left onto a dead end dirt Road.  Then we pulled into an oil access road and got out to look for an old cemetery.  We all walked down the access road (with me behind) when I caught something moving on my right hand side.  I turned to look and there was a large 6 1/2 to 7 feet tall carmel blonde creature staring at me.  It had a very stocky build with no apparent neck.  It was around 25 feet away.  I noticed the face had light colored skin and dark eyes.  Then, it moved from behind one tree to another standing up on two legs the whole time.  After this, I told my family we should go and I started running to the car.  I was so upset, I even locked the family out of the car because I was so frightened.  Once in the car, I told my husband to get out of here.  Wondering what was wrong with me, he asked what's wrong.  Once we got to State Route 93, I started telling them what I saw.  They all laughed at me.  Didn't believe me at all.  Even though they didn't believe me, I know what I saw.",
  "classification": "Class A",
  "county": "Hocking",
  "state": "Ohio",
  "latitude": 39.58157,
  "longitude": -82.36887,
  "location": "-82.36887,39.58157",
  "location_details": "Take State Route 93 north out of Logan, turn left onto Bear Run Road and follow until you pass Rowland Derr Road.  Then turn left on the first dirt road (no outlet) you see.",
  "temperature_high": 80.02,
  "temperature_mid": 70.88,
  "temperature_low": 61.74,
  "dew_point": 66.91,
  "humidity": 0.82,
  "cloud_cover": 0.66,
  "moon_phase": 0.35,
  "precip_intensity": 0.002,
  "precip_probability": 0.34,
  "precip_type": "rain",
  "pressure": 1013.77,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 7.24,
  "wind_bearing": 45,
  "wind_speed": 4.86
}