{
  "id": "3380",
  "title": "Two high school students are chased by large unknown creature",
  "date": "1991-09-15",
  "timestamp": 684892800,
  "observed": "Myself and my best friend at the time were still in high school And we were \"investigating\" a \"supposed\" haunted bridge one night. So we went out to this old rail road bridge,(the kind that you can drive through And it is only one lane), and we went there at night. So we preceded to look around and we heard rustling in the woods next to us about 50 yards Away. We didn't think nothing of it so we continued looking around. The rustling began to get closer but we thought that it was a deer or something So we decided to walk up to this old abandoned barn to see what was in it. Well, all of a sudden there was this loud, deafening scream-roar-growl noise And we heard what sounded like heavy footsteps in the field next to us. I saw, running at us on what appeared to be somewhat all fours but it wasn't a massive creature with long shaggy hair. It stopped about 15 feet away and stood up and it had to have been at least 16 feet tall!!! We then took off running for the car and the creature pursued us. By the time we got to the car another was coming down the road and it scared the creature away.",
  "classification": "Class A",
  "county": "Ashland",
  "state": "Ohio",
  "latitude": 40.82327,
  "longitude": -82.32803,
  "location": "-82.32803,40.82327",
  "location_details": "The incident in question took place in Ashland county about 5 miles south of Ashland on a one lane country road. If necessary I can go And get the actual township number for the road.",
  "temperature_high": 90.05,
  "temperature_mid": 82.56,
  "temperature_low": 75.07,
  "dew_point": 68.81,
  "humidity": 0.71,
  "cloud_cover": 0.51,
  "moon_phase": 0.24,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.33,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 6.24,
  "wind_bearing": 220,
  "wind_speed": 9.28
}