{
  "id": "44489",
  "title": "Witness recalls unknown animal seen crossing road near Snohomish",
  "date": "2003-07-01",
  "timestamp": 1057017600,
  "observed": "From 1997~ 2003 I lived in Snohomish, Washington, located near the top of Cathcart Hill which I think is about 350 ft  above sea level, maybe higher. It also was all forested west of there for 5 square miles until they developed it all over a short period of time.  Now it is only forested to the east. I had heard many calls during the development of all the land near me. I suspected Bigfoot but didn't know what it sounded like at the time. Also, a strange thing happened around my house. When I smoked outside at night I would hear what sounded like an elephant smashing through the ten feet tall blackberry bushes towards me. It scared a friend if mine so bad when he went outside to pee and it screamed a blood curdling scream from the bushes. So these things happened for years.  Then one night I came around the corner driving north on Snohomish Ave. towards my road coming home with a friend and right before my road there was a swamp, I came around the bend and saw eye shine so I slowed to a crawl so not to hit what it was. Then I inched closer and it came across the road, I thought it was a pony at first then I saw its size was disproportionate. Its back end was taller than the front.on all fours. It turned and looked at us right before it went into the darkness and I thought its face reminded me of a sloth. I still didn't know what I'd seen. It wasn't dark brown. It was a light color like grey or maybe white. Then I pulled forward and my friend and I rolled down the side window and tried to see where it went and we smelled a strong sulfur smell, but we couldn't see anything and we got scared and went home. I tried to look up if we have some species of giant sloth in Washington. Now days I've been better educated about Bigfoot from watching shows on TV and I'm very sure that is what we saw that night. My friend was convinced it was Bigfoot that night but I wasn't sure because it was on all 4's & wasn't brown or black. Now I know, that its the only thing it could've been. I think it was running out of habitat and with many other wildlife was driven east thru that neighborhood. It's unknown if it is there still as I moved a long time ago and haven't felt stalked since.",
  "classification": "Class B",
  "county": "Snohomish",
  "state": "Washington",
  "latitude": 47.8465,
  "longitude": -122.1357,
  "location": "-122.1357,47.8465",
  "location_details": "",
  "temperature_high": 65.89,
  "temperature_mid": 58.12,
  "temperature_low": 50.35,
  "dew_point": 46,
  "humidity": 0.66,
  "cloud_cover": 0.55,
  "moon_phase": 0.06,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.37,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 9.44,
  "wind_bearing": 348,
  "wind_speed": 4.25
}