{
  "id": "14154",
  "title": "Night time sighting by motorist near Hartsville",
  "date": "2006-03-13",
  "timestamp": 1142208000,
  "observed": "I was on my home from work in Bishopville, traveling on Hwy. 15 at approximately 2:10am. I had a near miss with a large deer near Lydia that had me shaken and alert for other possible deer on the road. I made the left turn on hwy 15 to 15 north and I drove about 3 miles when I noticed a large shape on the other lane ahead of my car about 100 yards, I assumed that it was another deer so I slowed my car down to about 30 to 40 mph to allow time for the animal to cross over. as I approached nearer to this shape I noticed that it was human like because it was standing erect on 2 legs and it had arms like a man however, when I got within 40 ft of this creature I realized that it wasn't a bear or a deer and that it appeared to be very tall. I floored it... I was very afraid, I didn't know what to expect, but I knew that I was safer than a sitting duck. As I passed this creature, It seemed like it lunged towards my car and nearly took off my side mirror. I looked out of my drivers side window and noticed that its shoulders were above the top of my van and I also noticed that it was covered in hair that was light in color. I did not see the face of this creature, only its body and the outline of it as I approached.",
  "classification": "Class A",
  "county": "Darlington",
  "state": "South Carolina",
  "latitude": 34.374,
  "longitude": -80.074,
  "location": "-80.074,34.374",
  "location_details": "About 2 miles from BoBo Newsome Hwy. Incident occured on Hwy. 15",
  "temperature_high": 81.39,
  "temperature_mid": 71.125,
  "temperature_low": 60.86,
  "dew_point": 57.36,
  "humidity": 0.67,
  "cloud_cover": 0.27,
  "moon_phase": 0.46,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.28,
  "summary": "Partly cloudy until evening and breezy in the afternoon.",
  "uv_index": 5,
  "visibility": 9.3,
  "wind_bearing": 216,
  "wind_speed": 9.86
}