{
  "id": "396",
  "title": "",
  "date": "",
  "observed": "These encounters were reported to me by a witness who doesn't want to be identified but authorized me to post this report.  I took quick notes during a long phone conversation, so it is possible I may not have gotten every detail down perfectly. The witness impressed me as very articulate and credible. April 1999: The witness and his family were gathered around a campfire at the edge of a dense forest, near a stream on the east side of the Tushars, close to Marysvale, Utah.  As the evening got darker, they started to hear branches breaking as if a large animal walked through the woods on the other side of the stream.  The water was high and making a lot of noise, so the breaking branches had to be thick ones to make enough sound to be heard over the stream and the family's conversation.  The breaking sound continued every several seconds for a few minutes.  Then, suddenly, the \"stalker\" make a human-like screaming cry, causing several of the children to scurry for the nearby cabin. The witness thought it was possible, but not likely, that it may have been a human trying to frighten the family. The witness is an avid hunter and said the cry was unlike those of any of the wild animals in the area. The experience motivated the witness to research bigfoot information on the net, which brought him to the BFRO and his phone call to me. The second incident occured in July of 2000.  The witness and several others were riding 4 wheel ATV vehicles about ten miles south of Marysvale, Utah. The group stopped in a remote meadow and several of the women went to admire some wildflowers.  There they found a large imprint of a bare foot in a sandy spot of soil.  The heel part of the print was on grass so the exact length couldn't be measured, but the witness estimated it be about 14 inches in length and 5 inches wide.  No photo was taken. One of the women accidently damaged the footprint in an attenpt to protect it with a circle of sticks. The group also found an old dugout-type shelter nearby, but it contained a battered mattress and the witness said he had the impression it was an abandoned hunter's shelter. That doesn't preclude the possiblity that it might be used by a large animal now. The witness emphasized that the Tusar Mountains are much less visited and have far fewer human trails and intrusions that Utah's Uinta Mountains which are noted for Bigfoot sightings.  He told me his many hunting expeditions there have demonstrated to him that there is ample feed for a population of primates. Although no actual sighting took place, these experiences and the name \"gorilla gulch\" suggest the Tusars as a good location for further research.",
  "classification": "Class B",
  "county": "Piute",
  "state": "Utah",
  "location_details": "Tushar Mountains in Southwestern Utah.",
  "summary": ""
}