{
  "id": "1003",
  "title": "Two horseback riders see hairy creature",
  "date": "1984-10-15",
  "timestamp": 466646400,
  "observed": "Around fifteen years ago me and a friend of mine were horse back riding along side the FEC Railroad tracks between SR207 and Kings Estate Rd. We were heading south towards Kings Estate Rd when we noticed a smell like something was dead. I thought maybe it was a hog or something that died in the woods. We heard branches braking like something was in the woods, but didn’t pay much attention to it. Then the horses started to act up (horses were blowing and snorting and rearing) and I just thought that they were being bad and difficult. As we passed that area the horses acted better and we went on down the side of the tracks still heading south, when I heard the sound of the rocks on the side of the tracks like someone walking up onto them. I told the friend I was with “don’t walk the horse on the rocks!”  and she said “I’m not!”. Just then I turned to look around (she was just behind me) to see what it was. That’s when we saw it. It was about 150 yards away from us where we just passed, but standing in the middle of the railroad tracks. It was in sort of a crouched position  but not all the way down, like it just saw us and froze and staired at us. What I saw was slim and covered in reddish brown hair. It had long arms and  I could see the eyes a little, it was at least 6 ½ feet tall and around 250 lbs. or better with no neck. It was getting dark out so we couldn’t see any detail on the face. All the time that we saw it we had to fight with the horses to keep them under control. They didn’t want any part of whatever it was, and neither did we. So we got out of there and I never went back riding there again. It wasn’t a bear. And it wasn’t a man, unless he was covered in hair from head to toe.",
  "classification": "Class A",
  "county": "St. Johns",
  "state": "Florida",
  "latitude": 29.85375,
  "longitude": -81.3456,
  "location": "-81.3456,29.85375",
  "location_details": "Take SR 207 East from I-95 to the Florida East Coast Railroad tracks. Sighting was south bound of the the RR tracks on right-of-way. Between SR 207 and Kings Estate Rd. (next crossing south of SR 207)",
  "temperature_high": 83.96,
  "temperature_mid": 75.45,
  "temperature_low": 66.94,
  "dew_point": 65.08,
  "humidity": 0.76,
  "cloud_cover": 0.62,
  "moon_phase": 0.68,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.84,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 4.95,
  "wind_bearing": 215,
  "wind_speed": 2.44
}