{
  "id": "19073",
  "title": "Large creature leaps in front of car on TX-37 near the Sulphur River",
  "date": "2004-10-20",
  "timestamp": 1098230400,
  "observed": "i was driving south bound on hwy 37 from bogata texas at about 1am with my girlfriend and another friend headed toward mount vernon texas.Hwy37 there is a what i call a wide 2 lane road (it is 2 lanes but has a wide shoulder lane on both sides) when i saw something in my peripheal vision moving fast.i didnt slam on my brake but took my foot off the gas pedal thinking oh ****  a deer but when it came out of the ditch it lept into the middle of the road and was now in full view of our bright lights i realized it was no deer!it was big black and long haired landed in full stride and it was then when it launched its self not straight across the road but angled back toward us. it used its arm to push or pull it forward.that is when i realized its other arm had ROTATED all the way around like a pitcher warming up all the way around over its head. its head was down turned away from the light so i did not see its face.but my friend did as it went past the other side of the car and he said it looked right at him turning its head up and back at us like damn what hell was that.we where all silent for a split second or two still processing what had just happened when all at once we yelled WHAT the **** was that.no one in the  car was impaired in anyway.we all saw the same thing which was a large ape like animal run or leap in front of us.i will take ANY lie dector test are any other test but WE DID SEE EXACTLY THAT PERIOD END OF STORY.",
  "classification": "Class A",
  "county": "Franklin",
  "state": "Texas",
  "latitude": 33.36867,
  "longitude": -95.23958,
  "location": "-95.23958,33.36867",
  "location_details": "right past the sulfur river bottom on hwy37",
  "temperature_high": 86.86,
  "temperature_mid": 78.705,
  "temperature_low": 70.55,
  "dew_point": 64.84,
  "humidity": 0.79,
  "cloud_cover": 0.19,
  "moon_phase": 0.24,
  "precip_type": "rain",
  "pressure": 1011.36,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 4,
  "visibility": 7.49,
  "wind_bearing": 191,
  "wind_speed": 2.59
}