{
  "id": "3633",
  "title": "Hunters find track in mountains above Falls City",
  "date": "2000-10-15",
  "timestamp": 971568000,
  "observed": "I WAS HUNTING WITH MY TWO BROTHER IN LAWS IN OCTOBER OF 2000. WE WERE IN THE COASTAL RANGE MOUNTAINS ABOVE FALL CITY. WE WERE DRIVING OLD LOGGING ROADS LOOKING FOR GOOD LOCATIONS TO SPOT DEER. WE DROVE UP ONE LOGGING ROAD WHERE   THERE WAS A TURN-AROUND OVERLOOKING A HUGE REVINE  CONTAINING A DENSE FOREST. I GOT OUT TO LOOK OVER THE EDGE WHEN I NOTICED A LARGE HUMAN-LIKE FOOT PRINT. IT WAS SLIGHTLY LONGER THAN MY SIZE 12 HIKING BOOT AND POSESSED 5 TOES. THERE WAS NO EVIDENCE OF ANYONE BEING THERE RECENTLY(I.E., TIRE TRACKS, SHOE PRINTS, FRESH GARBAGE AND BULLET SHELLS, ECT....ALL THINGS COMMON TO THESE TYPE OF TURN-AROUNDS). WE WERE VERY DEEP IN A COMPLEX SERIES OF LOGGING ROADS THAT WERE PROBABLY SELDOM USED. THE TRACK LOOKED RELATIVELY FRESH, MADE UP OF LOOSE DIRT( A FEW DAYS OLD AT THE VERY MOST). I TOLD MY BROTHER IN LAWS(WHO ARE VERY SKEPTICAL) WHO WERE STILL IN THE CAR TO GET OUT AND LOOK AT WHAT I FOUND. THEY WERE INTERESTED, BUT VERY SKEPTICAL. AT A CLOSER LOOK WE DISCOVERED THAT THERE WAS A HAIR OF SOME SORT WITHIN THE PRINT. THE HAIR WAS ABOUT AN INCH LONG AND WAS VERY CORSE. IT WAS VERY DARK BROWN AND HAD A BLONDISH COLORED TIP. WE HAD A VIDEO CAMERA AND A STILL CAMERA WITH US JUST IN CASE WE ACTUALLY GOT A DEER ON OUR HUNTING TRIP( WE NEVER HAVE). SO, WE TOOK VIDEO AND STILL PICTURES OF THE PRINT. WE COLLECTED THE HAIR AND PUT IT IN A FILM CONTAINER. UNFORTUNATELY WHILE TAKING THE HAIR OUT TO SHOW SOMEONE, IT WAS LOST. I DO HAVE EVIDENCE OF IT IN THE VIDEO THOUGH. THE PRINT WAS LOCATED BETWEEN A PATCH OF GRASS/UNDERGROWTH AND THE STEEP LEDGE. WHATEVER IT WAS THAT MADE THE PRINT WAS STEPPING FROM THE GRASS TO THE LEDGE. THE LEDGE SEEMED TO HAVE SOME IMPRESSIONS MADE BY THE SAME CREATURE WALKING SIDEWAYS DOWN THE HILL, BUT IT WAS SO STEEP AND HAD SUCH LOOSE SOIL THAT NO ACTUAL PRINTS WERE APPARENT. I DO HAVE PHOTO AND VIDEO EVIDENCE OF THE PRINT.",
  "classification": "Class B",
  "county": "Polk",
  "state": "Oregon",
  "latitude": 44.86875,
  "longitude": -123.4462,
  "location": "-123.4462,44.86875",
  "location_details": "OREGON COASTAL MOUNTAIN RANGE NEAR FALLS CITY OREGON.",
  "temperature_high": 63.09,
  "temperature_mid": 56.6,
  "temperature_low": 50.11,
  "dew_point": 43.26,
  "humidity": 0.83,
  "cloud_cover": 0.47,
  "moon_phase": 0.58,
  "precip_intensity": 0.0007,
  "precip_probability": 0.5,
  "precip_type": "rain",
  "pressure": 1018.91,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 7.56,
  "wind_bearing": 160,
  "wind_speed": 2.32
}