{
  "id": "14953",
  "title": "Possible intimidation in the late afternoon reported by hikers in the Big Tujunga Canyon area.",
  "date": "2006-07-30",
  "timestamp": 1154217600,
  "observed": "Me and a friend at the time were hiking in the Angeles National forest. My friend was just out of boot camp USMC and we started hiking as often as time would allow. We were hiking down a small stream bed that went down hill. The stream was all dried up and it was mostly rock hopping until we got to the bottom of the hill, at one point there is a small section off to the side that is just dirt and makes for a much easier walk down to the bottom. When we got to the bottom we hiked a bit more but as the sun started to go down, we headed back up the same hill/creek bed. I followed my own boot tracks back up as I was tired of rock hopping, while going up, the smell in the air was horrible, like rotten eggs or portable toilet, I then noticed on one of my tracks laid a dead ground squirrel, right over my boot track. I pointed this out to my friend and as soon as I did this, a loud banging over a short hill side was heard, it was coming from about 35-50 yards away from us. It sounded as if it was a large log being hit against a tree. I looked at where the noise was coming from and noticed the tops of the trees were swaying back and forth; all this time of the swaying of the trees the pounding on them could be heard. Then the pounding stopped and a loud groan/scream was heard from the same area as the pounding of the trees. I have never heard anything like it. I’ve heard Mt Lion, Black bear, this was nothing like that, and was very-very loud, to the point is was damn scary. My friend asked if we should look over the small hillside to see what was making the noise. I said no way, and he agreed. When we started walking away the banging and screaming would stop, but as soon as we stopped it would proceed with the groan and screaming and the trees would start swaying. We finally got out of there and my friend did not want to talk about what had happened.",
  "classification": "Class B",
  "county": "Los Angeles",
  "state": "California",
  "latitude": 34.25,
  "longitude": -118.225,
  "location": "-118.225,34.25",
  "location_details": "It was up the Angeles Crest Hwy, Not sure on exact mileage, but I would say about 10-15 miles maybe a little bit further up Angeles Crest Hwy, this road can be reached off the 210 Freeway up foothill blvd.",
  "temperature_high": 80.41,
  "temperature_mid": 74.21,
  "temperature_low": 68.01,
  "dew_point": 64.56,
  "humidity": 0.73,
  "cloud_cover": 0.75,
  "moon_phase": 0.17,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.08,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 8,
  "visibility": 9.62,
  "wind_bearing": 226,
  "wind_speed": 6.08
}