{
  "id": "36505",
  "title": "",
  "date": "",
  "observed": "My partner and I were bow hunting for elk just outside of the major power lines running down the North Fork of the Siuslaw River.  He set up to call elk under the power lines just in the brush from the open field area and I proceeded up the road as it enters the forest to set up at a creek area the road crossed. As I approached my set up point, I could clearly hear a very loud knocking.  It was not patterned but was like a sound I have never heard in my 30 years of hunting in Oregon forests.  It sounded very distinctly of stone, possibly an enormous piece of wood but I really have decided it had to be stone, on a very hard substance of some sort, like a solid piece of wood.  This knocking had to be less than 75 yards from where I was.  It would continue in small groups, like 3 to 4 knocks, pause, then follow up between 10 and 20 seconds with 1 or 2 more knocks, silence for around a minute and go again.  This went on long enough that I was seriously starting to think a person might be up there, but we were behind a locked gate with no other cars parked there and there is just no way anyone could walk through the forest from the other side.  It is like miles and miles of timber and undergrowth to I don't even know where to get to where I was. I would estimate this continued for 15-20 minutes, and a good 10 or so was while my partner was performing regular cow calls.  He had to be approximately 150 yards+ from where I estimated the knocking.  Then he used an elk call referred to as a hoochie mama, and the knocking just stopped.  The call didn't go off right and even I was thinking it sounded way wrong.  Then I thought I could hear something moving through the brush towards the call.  I never saw the brush move or anything, but I could hear a very clear movement of something trying to be quiet.  No real twigs snapping or anything just a sound of brush/undergrowth rustling. About 15 minutes after the knocking stopped, I started moving up the road quietly towards the rustling to make sure I was in bow range.  I had dismissed the knocking and was thinking elk coming to the call at this stage.  I set up 3 different times along the road, hugging the brush in my camo to help conceal me.  The third set up was more in the open and I was standing next to a thinner tree.  This was about 30 minutes after the knocking stopped.  I was straining hard at the brush that would still rustle in approximately the same place like something was stirring but not really moving towards the call any more. Then out of nowhere about 30 yards from my set up there was this super loud knock on the only large tree in that spot.  It totally freaked me out.  There is no way that was an elk, or bear.  I can't decide if this was the same creature that was knocking first and it moved to that area to look for my partner and then spotted me or if the original knocking called up another creature that spotted me as it was moving towards the original knocking.  Either way, it was too dark to see my bow sight pins anymore and my partner had moved out of the brush to the road so I quickly crept up the road with an eye towards the brush looking for what made the sound. When I spoke with him, he said he heard some knocks but had dismissed them.  When I explained the  knocks, he couldn't really come up with any plausible counter explanation.  By the time we got back to the car, it was almost pitch black, approximately 7:45pm.",
  "classification": "Class B",
  "county": "Lane",
  "state": "Oregon",
  "location_details": "I am still going to investigate this so please don't disclose.",
  "summary": ""
}