{
  "id": "10277",
  "title": "Loud, unseen animal torments deer hunter two days in a row",
  "date": "2005-01-17",
  "timestamp": 1105920000,
  "observed": "This blind is the most remote blind on the 3,000 acre lease. The land consists of a couple of open fields, but is mostly heavily wooded. The blind I was in always has a lot of activity around it. You will see deer, bobcats, armadillos, coyotes, rabbits, all manner of birds, and hogs, lots of ferrell hogs. The blind sets at the end of the road, at the end of the property, in somewhat of a valley. As you exit the woods,the road turns slightly to right and drops down into the \"valley\". From where the road exits the woods to my blind is at least 700yds or more. The road continues on down to the blind, but when I am hunting, I park my truck and walk to the blind using a small flashlight so as not to disturbed the wildlife. The land opens up from one end of the \"valley\" to the other. There is about 300yds of fairly open gound from one tree line to the next. My blind sets on NW side at the tree line. As usual, there was a lot of wildlife activity, until about 7AM. All the animals, even the birds, left. Then I started to hear large branches breaking and then something hitting the trees with, I assume, the branches. The blind sets about 12' off the ground, but I never saw anything. I used my scope and binoculars, but the woods are very thick. About 30 minutes after the branch breaking started, a hog ran out of the woods from the direction of the noise and ran into one of the guide wires on my stand (3/8\" cable). Very easy to see. It then jumped up, ran into the ladder and then proceeded over the hill. It seemed to be a bit frightened. About an hour later, a branch hit my blind. When that happened,I almost had to change my drawers. The branch breaking and tree pounding kept up for about 2 1/2 hours. When the noise stopped and the wildlife came back, I left. The next morning, I went back to the blind, walking in as usual. About halfway, I could hear something walking with me. It was a little ways inside the brush. At that point, I reached in my hunting bag and got my headlamp and put it on. I put my flashlight up so I could get to my side arm easier. I never wanted to run so bad in my life but thought better of it. Just as I got to my stand, something very close to me made a very deep, grunting growl. That is the only way I can describe the sound. I dropped my hunting bag and went up the ladder into my stand in record time. About daybreak, the events from the previous day began again. I never smelled anything nor did I find any tracks. To be honest, being alone, I didn't look very hard. I just recently told one of my hunting buddies, and to my surprise he said, \"I knew there was something strange about that place.\" He said ever since he started going out there, he has felt very uneasy, as if he is being watched, sometimes more than others. He has been hunting the woods all his life, so is very familiar with the surroundings. He told me there is one place he absolutely will not go on the lease. If you knew him, you would realize how totally out of character this is for him.  I didn't hunt the lease in 2004 because of time constraints, but I think constantly about those two mornings in November 2003.",
  "classification": "Class B",
  "county": "Burleson",
  "state": "Texas",
  "latitude": 30.525,
  "longitude": -96.59167,
  "location": "-96.59167,30.525",
  "location_details": "",
  "temperature_high": 53.26,
  "temperature_mid": 45.425,
  "temperature_low": 37.59,
  "dew_point": 29.23,
  "humidity": 0.67,
  "cloud_cover": 0.05,
  "moon_phase": 0.26,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1035.92,
  "summary": "Partly cloudy overnight.",
  "uv_index": 4,
  "visibility": 9.52,
  "wind_bearing": 52,
  "wind_speed": 3.62
}