{
  "id": "50124",
  "title": "Elk hunter has late afternoon sighting near Spencer",
  "date": "2015-10-20",
  "timestamp": 1445299200,
  "observed": "Oct 20 6:15 PM Observed 2 big foots walking up the trail that I was hunting on. My father, brother and I were camped at the head of Swampy Draw on Pleasant Valley creek during the cow elk muzzle loader season. Camp location: 16.5 miles N by NW of Dubois Idaho as the crow flies. Camp was at 7,054 ft elevation. General topography is pine covered mountainsides with grassy / mixed alder brush and sage brush valley floors. We had been hunting elk and deer for 5 days and saw lots of deer on the hillside above camp ~ 250 yards away (from range finder) and a few elk. After spending days exploring around the area we decided to hunt the deer right at camp. My father is 83 and walks with a cane so he hunts close to camp. For the evening hunt my father walked up the hill behind camp ~100 yards and my brother positioned himself a few hundred yards along the base of the hillside. I decided to take my atv up swampy draw and sit at the head of it for the evening. That way we would have a fairly large area covered. Swampy Draw has an old logging road right up the middle of it but the access from Pleasant Valley is difficult. I managed to get up the road on my atv leaving camp at 2:30pm as I wanted to be in hunting position early and let the area quiet down way before prime hunting hours. Prior to the evening hunt I explored a skid road that climbed the east side of the draw and hooked north toward camp. The climb disturbed the area so I headed back down to the main logging road then turned up to the head of Swampy Draw and positioned myself for the evening hunt. At 6:15pm I saw 2 figures coming up the trail towards me at approximately 200 yards. I thought it was 2 hunters that were blowing my evening hunt. But as they came into full view I saw that they were black in color. Most hunters in the area have some sort of blaze orange on them or are dressed in camo. These figures were not dressed. They were walking side by side and I suspect they were a male and female pair although the distance was too great to identify sex. I estimate the height of one at approximately 8 foot and the other 7-1/2 foot. I could not see any facial features at my observation distance. My overall impression was that they were incredibly tall and rather slender. As they saw me they turned to my left and disappeared into timbered hill side. As they turned and walked into the timber I saw very long arms, almost to the knees. They swung their arms in fairly long arcs as they walked; much like a human power walker. It was then that I remembered that I had left my 454 Casull pistol in camp and only had the single shot 54 cal muzzle loader with me. A over sight I will never duplicate. The whole sighting took approximately 20 seconds. Since the creatures were between myself and camp with only one way out I waited 10 min for them to hopefully clear the area. I put my rifle across my lap and headed back to camp. Distance to camp was only a bit over a half mile. Half way to camp I came across a road block on the trail in a small creek that had not been there when I came in. The creatures had picked up a large log and placed it in the creek to block my way. As it was getting dark, with a bit of adrenaline and heavy handed throttle I managed to climb my ATV over the smaller end of the tree. The next day I went back to the barricade only to find that during the night the creatures had improved on their efforts and completely blocked the trail with additional logs and stumps. The logs that they placed in the trail were too heavy for 3 men to pick up and I could find no evidence of dragging. They were picked up and carried, an enormous feat. To make the story a bit weirder, my father kept talking about a stick fort that some kids must of made about 200 yards from camp at the base of the hill. My brother said it must have been made by some Boy Scouts. But nobody uses the area. I went and found the stick structure and it was clearly evident that it was not man made. The main structural tree was pulled down in an arc and no 3 men would have the strength to perform the task. Masses of sticks were then woven into the frame to produce a hollow area approximately 6 feet by 12 feet. My father said it looked like it had been recently used. I think that the course of events were as follows. I came up the logging road on my ATV, explored the spur road that climbed the hill toward camp and close above the stick structure. I disturbed the creatures and they built the barricade. Then they came up the road and showed themselves to me as if to say – Hey here we are and you should not be. I never went past the barricade again. I looked very closely for foot prints but could not find any clear prints in the hard gravelly ground. Of note: The evening of the sighting my brother and father counted over 30 deer on the hillside in the area of the structure. After my sighting we saw no more deer during the 4 days we continued hunting. Also during the night I heard my horse trailer tack door open and shut which I thought was odd. I stored the camp food in the tack room and nothing was missing. I know I had the door tightly shut in case of the odd bear wandering into camp. It takes fingers to work the latch and the door was not latched when I found it in the morning. A bit about me: I am 62 years old and have spent a lifetime hunting and fishing in the wilds. Mostly Montana, Colorado, Wyoming, Idaho, Oregon, Alaska and Northern Minnesota. I have had other what I believe were close encounters but this is the only time I have clearly observed the creatures. Seeing is believing, the debate for me is over.",
  "classification": "Class A",
  "county": "Clark",
  "state": "Idaho",
  "latitude": 44.41131,
  "longitude": -112.2873,
  "location": "-112.2873,44.41131",
  "location_details": "Camp location: 16.5 miles N by NW of Dubois Idaho as the crow flies.",
  "temperature_high": 48.8,
  "temperature_mid": 40.43,
  "temperature_low": 32.06,
  "dew_point": 40.69,
  "humidity": 0.86,
  "cloud_cover": 0.29,
  "moon_phase": 0.25,
  "precip_intensity": 0.0031,
  "precip_probability": 0.43,
  "precip_type": "rain",
  "pressure": 1019.24,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 3,
  "visibility": 9.73,
  "wind_bearing": 214,
  "wind_speed": 2.43
}