{
  "id": "11616",
  "title": "Fishermen find footprints east of Egegik.",
  "date": "2004-07-20",
  "timestamp": 1090281600,
  "observed": "To whom it may concern, I am a commercial fisherman in Alaska and have been doing so since 1970. I am an avid outdoorsman, hunter and someone who just loves to get out there. Every year after fishing, I try to take a trip up river with a friend or two to wind down and enjoy ourselves before we go home. This year while I was on this trip into Alaska's interior our main mission was to take pictures of bears and the surrounding wildlife to promote a new bear viewing and sports fishing buisness. While on our five day trip, we spotted more than fourty bears. I took hundrends of pictures of these bears and their tracks. One of which, was so big, it put chills up my spin and gave me and my companions a very uneasy sense of insecurity. What set this track apart from the others was it's enormous size and human shape. In one of the pictures that I took of this track, I placed my foot next to it on the ground, keep in mind I am wearing a size 13 boot. Whatever made this track was so heavy, heavier than the biggest bear, that it pushed the gravel so far into the earth that it made us truly speculate what we were looking at. Other pictures that we took of bear tracks were nowhere close to the indentation that this track had left. One of the most intriguing things about this track was there were no visible claw marks as with all the other bear tacks. Both of us felt extremely uneasy of our surroundings and had the feeling that we were being watched. For the rest of the day we didn't have much to talk about, and that night felt uncomfortable at camp. We never heard or smelt anything out of the ordinary. To this day I'm not too sure what we saw and I'm not making any claims other than the words I have put fourth. I would like to include the photos I spoke of, as maybe you or someone on your staff might help me shed some light on this situation. I want nothing but to put my mind at ease. Wether this is a bear track from an extrememly enormous bear or...? Please help if you have any input.",
  "classification": "Class B",
  "county": "Bristol Bay",
  "state": "Alaska",
  "latitude": 57.7566,
  "longitude": -155.981,
  "location": "-155.981,57.7566",
  "location_details": "Approximately 95 miles east of Egegik, Alaska. Up the Egegik River thirty-five miles, and sixty miles accross Becharoff Lake to the far south/east corner of the lake on the mouth of the Bear Creek spit.",
  "temperature_high": 61.52,
  "temperature_mid": 57.335,
  "temperature_low": 53.15,
  "dew_point": 54.9,
  "humidity": 0.94,
  "cloud_cover": 0.86,
  "moon_phase": 0.1,
  "precip_intensity": 0.0138,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1009.06,
  "summary": "Rain in the evening and overnight.",
  "uv_index": 3,
  "visibility": 5.5,
  "wind_bearing": 230,
  "wind_speed": 5.3
}