{
  "id": "1158",
  "title": "Child encounters a man-like creature in a shed.",
  "date": "1956-10-15",
  "timestamp": -416966400,
  "observed": "As a child I was between 10 or 12 years old, at the time the incident happened. we were visiting my grandmothers house as we often did on the weekends. A bunch of the grandchildren including myself were playing hide & seek it was nearing sun down I kept getting caught early in the game & decided to venture outside of the fenced area and up the gravel road about 200 yards to an old corn crib in a field next to the road. If my memory serves me right the crib was next to empty, the door was facing away from the road and it was starting to get dark, I entered the crib in a hurry not paying any attention to what may be in the crib, while looking through the cracks in the crib towards the house to see if anyone had seen me enter, I heard a heavy breathing behind me, upon turning around what I saw was indescribable for a kid my age, this huge man like creature was standing over me just staring at me he was hairy and huge it made no sounds and smelled some what like a hog pen which everyone raised in that area and time. After wetting my pants and running like a bat outof hell back to the house crying and scared to death, I told my uncle what I had seen, only he did not take me serious and started making fun of me, because I had peed my pants. I will swear to this day what saw was a bigfoot.",
  "classification": "Class A",
  "county": "Washington",
  "state": "Missouri",
  "latitude": 38.039,
  "longitude": -90.7517,
  "location": "-90.7517,38.039",
  "location_details": "Between DeSoto & Potosi on old Missouri Highway 21.",
  "temperature_high": 81.64,
  "temperature_mid": 70.22,
  "temperature_low": 58.8,
  "dew_point": 52.63,
  "humidity": 0.57,
  "cloud_cover": 0.65,
  "moon_phase": 0.37,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.42,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 9.82,
  "wind_bearing": 175,
  "wind_speed": 6.51
}