{
  "id": "3233",
  "title": "",
  "date": "",
  "observed": "This sighting occured in october of 1981.I had just been discharged from the marine corps.I was 21 years old at the time.I have lived in this area of indiana all my life.I am an avid hunter and outdoorsman with much experience .I am a raccoon hunter also and have been hunting at night by myself many times.It was a warm Saturday afternoon in late october.My sister and her boyfriend and his sister and myself went on a picnic at Spring Mill State Park.After the picnic my sisters boyfriend and her went home.The other girl and myself decided to go out riding around in the country to enjoy the fall leaves.  We were heading east of Bedford,  Indiana on a small gravel road near the airport .This road went to a small creek bottom by leatherwood creek.There was thick forest on one side of the road and a cornfield on the other,surronded by thick briars.We had crossed the bridge over leatherwood creek and i pulled my 4x4 truck off to the side of the road,we were headed east.I was looking down adjusting the radio when my companion stated that someone was watching us.I looked up and to my disbelief I saw something standing in the middle of the road about 50 to 60 yards to our front.This thing was at least 6 to 7 feet tall standing upright.It was cover in long dark gray and brown hair.I could not see its face.I could feel the hair on the back of my neck standing up.My companion was terrified.I slowly removed an M1 carbine from its case and inserted a magazine the creature continued to watch us closely .I opened the truck door and stepped out on to the road.I began to move slowly towards the creature as I did it turned and ran thru the briars in to the cornfield.I returned to the truck very shaken I have never seen anything like this my companion insisted that I take her home .Which I did we never went out again.I have often wondered why I did not fire my weapon at the creature. I guess it looked somewhat human like and it made no threating behavior.I never reported this incident because I figured no one would believe me anyway.",
  "classification": "Class A",
  "county": "Lawrence",
  "state": "Indiana",
  "location_details": "It was just off the airport road east of Bedford and just south of Hwy 50 about 3 to 4 miles on a small gravel road near Leatherwood creek.we had just crossed a bridge over the creek and were heading east.",
  "summary": ""
}