{
  "id": "28739",
  "title": "Hikers find large barefoot prints on the Elwha River Trail",
  "date": "2011-01-16",
  "timestamp": 1295136000,
  "observed": "My three friends and fellow soldiers recently spent a three day camping trip into Olympic National Forest Elwha River Trail. We had to return to cell coverage, so myself and my buddy headed out of the forest and north on the main trailhead. The night before was a heavy thunder storm so the trail was very muddy. I was a leading us out and stumbled upon a very clear muddy print of a left foot. I wear a size 11 mens boot and to me this was clearly a size 14-15. The print seemed recent and had clearly defined toes and arch. We only had a cellphone to take the picture with and regrettably only took the one. The tracks, that seemed to be from the same source (none as clearly defined), went on heading north on the trail an additional 25-30 feet. That night we decided it was in our best interest with the horrible weather to make camp at one of the historical cabins on the trail. We retrofitted a poncho in one of the open windows to shelter us from the rain and wind. We secured it by weighing the bottom half down with a 2x2 piece of wood. During the heaviest gusts of wind it seemed to hold up. At approx 0100 hrs the tarp was opened and something knocked the piece of wood onto one of my fellow campers. Being woken up by this, I saw the tarp movement with no wind source being observed.  These events could have easily been a bear...  I do note, however, that the large garbage bag that was littered with foodstuff was untouched throughout the night. I include these occurrences to make sure and give you a thorough recording of events substantial or not.",
  "classification": "Class B",
  "county": "Clallam",
  "state": "Washington",
  "latitude": 47.94485,
  "longitude": -123.5436,
  "location": "-123.5436,47.94485",
  "location_details": "About a mile and a half into the Elwha River Trail.",
  "temperature_high": 51.39,
  "temperature_mid": 49.235,
  "temperature_low": 47.08,
  "dew_point": 47.12,
  "humidity": 0.93,
  "cloud_cover": 0.93,
  "moon_phase": 0.39,
  "precip_intensity": 0.0452,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1006.84,
  "summary": "Rain until afternoon, starting again in the evening.",
  "uv_index": 1,
  "visibility": 8.66,
  "wind_bearing": 214,
  "wind_speed": 7.5
}