{
  "id": "37010",
  "title": "",
  "date": "",
  "observed": "Late one night my wife and I decided to go on a moonlit walk on our property to find good spots to look up at the stars because we were considering on getting a telescope. we got into the car and drove the very end of our driveway and parked, our driveway is approximately a quarter of a mile of the main road with thick Woods on both sides. we started walking up the driveway about halfway up we felt like we were being watched so we stopped and we started hearing very loud noises in the woods to the left. it sounded like something was running towards us, shocked and panicking my wife turn and started running back towards the vehicle. (Reba) - I wanted to get out of there as fast as I could. I told my husband to come on, and he told me to go ahead. so I ran back to the car as fast as I could. I got into the car lock the doors. (Jason)- after my wife ran back to the vehicle, I immediately got a flashlight out of my pocket to scan the woods. I did not feel comfortable turning my back on whatever this was. I smelled a foul in the air. it is hard to describe this odor. the best way to describe it is an overwhelming nauseating odor it smelled like a mixture of roadkill and a wet dog with a faint sent of sulfur ( the best description of the sulfur smell is the smell after striking a match and blowing it out but more potent). my heart was racing and my palms were sweaty. my senses were hightened and my body went into a state of alert from fear, which is not normal for me. I grew up my whole life hunting entering the woods well before daylight and exiting the woods well after sundown. I know what deer sound like running through the woods, and I'm familiar with local wildlife like Bobcats, coyotes, raccoons, Panthers, wild hogs, etc. I'm not easily scared, there has been times that I have had to leave the woods with nothing but the backlight of a cell phone. so I don't scare easily. but this animal kept charging at me a little at a time then it would stop and charge again, it was so loud that it sounded like a bull elephant coming through the woods at me this was when I knew it was something that I had never heard before. I never did get a glimpse of the creature. I did not see any eye shine i search high and low scanning the woods. the animal had to be far enough into the woods to where I could not see it but it sounded like it was right next to me in the edge of the woods. at this point I slowly back up the hill never turn my back and always keeping the flashlight on scanning the woods. not knowing what to expect i built up enough courage to shout out \" that's enough, just stay back\" in a stern, loud voice... I doubt the creature understood anything I just said but I was hoping the tone I used would be enough to make it stop coming towards me. then shortly after I shouted everything began to calm and I think it understood that we were leaving the area. after feeling that I was being watched and pushed out of the area, I finally reached the top of the hill and felt it was safe to turn around so I ran the rest of the way to the car. my wife had the doors locked so I flash my light and tapped on the window, she immediately unlocked the doors and I got in, then she immediately locked the doors back and we drove back up to the house. this was the first of many occurrences that happened on the property. is seemed that after this encounter the activity picked up in the following months. I have heard many stories at deer camp about people seeing this creature but I always dismissed it as a folklore, but this experience made me realize that there is really something out there. this made me have the desire to look into it further and do some of my own research because I felt as if I were losing it. as I replay the events in my head, I tried to make sense of all this but the research I have done seems to bring me more questions than answers.",
  "classification": "Class B",
  "county": "Hot Spring",
  "state": "Arkansas",
  "location_details": "The exact location of the property is not disclosed at the request of the witnesses. The general location is south of the City of Malvern, between U.S. Highway #67 and State Highway #9.",
  "summary": ""
}