{
  "id": "12271",
  "title": "Possible visitation at a camp, 10 miles northeast of Whiskey Lake.",
  "date": "2005-08-06",
  "timestamp": 1123286400,
  "observed": "My sister is in town visiting from Texas with my niece and nephew. She wanted to visit my grandmother's summer camp up in the Chuska Mountains before she headed back to Texas. We left on Friday the 5th of August from Albuquerque and headed through Farmington to Shiprock. We didn't arrive until about 2330 at the location of my grandmother's home which is abandoned now and dilapidated. The door faces east the back portion of the home the roof has collapsed. We set up camp in a clearing north of my grandmother's home near my aunt's home and my uncle's home, just to the west of the clearing and east of a small grove of pine trees. We finished setting up the tent about 0030 the 6th of August (Saturday morning) with the main tent door facing south and the other 3 small doors facing west, south and east. We ate a late dinner of warmed up hamburger patties my sister made earlier in Albuquerque. We finally bedded down about 0115. I was near the west door and then my mother, my niece and nephew and my sister was near the east door of the tent. We said goodnight goofing around saying \"good night John Boy\". It was then I shut off my cell phone to conserve the battery and it listed 0128. I settled in and looked up thru the rain cover, it has a clear plastic portion in the center of the tent and I couldn't see any stars because of the clouds. Also due to the rain cover I could not smell much from outside the tent. The outside of the tent you couldn’t see without a light source, the best you could see was about 2 feet in front of you and the rest was pitch black. About 15 minutes later I heard what I thought was leaves blowing from the northwest direction. The reason I thought it was leaves at first was because I only heard it when the wind was blowing from the southwest. When the wind started again I heard what sounded like leaves but then it occurred to me there are only pine trees around and only pine needles were on the ground. It came close to the tent still on the northwest side of the tent and bumped into the nylon rope used to secure the rain cover of the tent. I heard the nylon rope pull the rain cover and snap back. Then it moved to the door I was nearest. From there it walked around, even when the wind stopped blowing for about 30 seconds. The sound of the footsteps was muffled and was bi-pedal. Earlier (about an hour) there were dogs barking to the west on the other side of the lake, so I thought it was a dog at first, but it was walking on 2 legs. It then moved to the southwest portion of the tent but did not yank the other nylon rope staked down. It moved closer to the tent, near where there were 2 nylon belts for the rain cover staked down in the ground. It sounded like it squatted down and started scratching the rain cover. I heard about 10 scrapes or so, like it was wondering what this structure was made of. It must have pulled up the stakes up because when the wind blew that portion of the rain cover started flapping. I couldn't see any shadows from outside because of the overcast. It was still squatting by the corner when I heard a second set of footsteps to the southeast of the tent about ten feet away. This is when I got nervous because now there were two of these things outside the tent. I didn't hear the second one come close to the tent. About a minute later I heard rocks clicking from the northeast direction, but it was a distance away. I got more nervous thinking there might be three of those things out there, so I hit the panic button on my sister's SUV key chain. The alarm went off. That's when my sister woke up wondering why the SUV was beeping. I told her there's two of something outside the tent. I didn't hear the one near the tent (southwest) leave but the other started walking away and it stepped on a branch as it left. Then about 3 minutes later I heard the rock clicking again but this time from the southeast direction and this too sounded quite a distance from us. My sister couldn't hear the rocks clicking. She's a little hard of hearing but she did hear the branch breaking as one of them walked away. All of this occurred in about a 20 minute time frame. I waited for 10 minutes more but didn't hear anymore footsteps and I turned on my cell phone again to check my time which listed it as 0215. I stayed up for about 30 minutes and finally went to sleep. When morning came I heard my sister wake up her kids to head to the outhouse just west of our camp. I got up to see if there were any footprints. I didn't find any. The grass was growing randomly and was already trampled by us. This is when I found the tent stakes were pulled up about 4 inches from the ground. There were no marks on the tent where the scrapping occurred. Then I checked where I heard the second moving and found what looked like a footprint. There were outlines of toes facing south. The whole track looked about 8 inches long.  I compared it to my hand which measures 7 3/4 inches. We had breakfast and left the location about 1030. Before we left I took a look around and found 4 trees bent from about 4 feet from the ground.",
  "classification": "Class B",
  "county": "San Juan",
  "state": "New Mexico",
  "latitude": 36.14505,
  "longitude": -108.8548,
  "location": "-108.8548,36.14505",
  "location_details": "[Removed]",
  "temperature_high": 77.14,
  "temperature_mid": 68.75,
  "temperature_low": 60.36,
  "dew_point": 55.52,
  "humidity": 0.69,
  "cloud_cover": 0.5,
  "moon_phase": 0.05,
  "precip_intensity": 0.0189,
  "precip_probability": 0.78,
  "precip_type": "rain",
  "pressure": 1017.72,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 12,
  "visibility": 9.67,
  "wind_bearing": 84,
  "wind_speed": 1.85
}