{
  "id": "11886",
  "title": "Tracks found south of the Warm Springs Reservation        (REPORT UPDATED)",
  "date": "2005-07-09",
  "timestamp": 1120867200,
  "observed": "Today is June 12 2005.My husband and I were around Lake Jefferson north of Suttle Lake out fishing and scouting elk. When we stopped to follow fresh bear and elk tracks. We could smell something very bad in the air and thought we were very close to a bear. A large bear. We came across a large stump that had some kind of hair all over it. We studied this for some time trying to figure out what had happened there as the stump had hair all over it and it was also all over the ground. We brought some home with us because it was the strangest fur we had ever felt. This fur was white and very coarse.It was not elk or deer or any fur we knew of. We looked on the ground and notice a set of elk horns that had been dropped. We continued down what looked like a game trail and found a wallow. In it were several foot prints from what looked like elk and bear. Also we saw foot prints that were at least 18 inches long and as wide as my foot.(I wear a 6 1/2).   shoe.) We followed the tracks and they headed toward a creek. The prints were easy to follow as the ground was clean where they stepped but surrounded with what looked like splashing from wet fur around each print. We investigated further, though I was scared to death, and had noticed the bushes and tree branches had been splashed as well with the muddy water from the wallow. There were tracks every where.   What ever made the prints was very heavy. The tracks were deep. My husband who weighs 230 lbs. tried to make prints that deep by jumping next to some and barely dented the ground. My husband, who was a logger and is very familiar with the wilderness had never seen anything like it before and was also astonished. He was curious and wanted to keep investigating but I was so frightened I just wanted to get back in the truck. To the best of our reasoning we figure the tracks were a day old. It had rained on Friday and they had dried enough for us to see them on Sunday afternoon.  We usually carry our video camera with us when we go out in the woods but forgot it on this trip. If it doesn’t rain this week my husband is going to go back and film it, he wants to gather more evidence of what is there. I don’t know if I can go back.  It may not sound like much in the telling of this story, but in real life you could just feel that something very large and strange lives there and we should not be in this place.  This has made such a lasting impression on us both, that we had to come home and tell someone right away.",
  "classification": "Class A",
  "county": "Deschutes",
  "state": "Oregon",
  "latitude": 44.56625,
  "longitude": -121.6384,
  "location": "-121.6384,44.56625",
  "location_details": "on the border of deshutes and jefferson counties",
  "temperature_high": 70.42,
  "temperature_mid": 63.805,
  "temperature_low": 57.19,
  "dew_point": 52.84,
  "humidity": 0.73,
  "cloud_cover": 0.78,
  "moon_phase": 0.1,
  "precip_intensity": 0.0019,
  "precip_probability": 0.44,
  "precip_type": "rain",
  "pressure": 1013.7,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 9.87,
  "wind_bearing": 274,
  "wind_speed": 2.55
}