{
  "id": "1815",
  "title": "Hiker encounters intimidating beating sounds and heavy running footsteps",
  "date": "2000-05-15",
  "timestamp": 958348800,
  "observed": "In early May 2000, I had decided to go hiking in an area which is closed between November and May 1st. On previous hikes and camping trips in the area I had noticed a trail and on this day I decided to see where it went. I stopped my car, and upon getting out noticed that the area was silent; no birds, frogs,or other animals were calling out, which I found odd. I had started up the trail(approx 1/8 mile) when I heard(and felt) what sounded like someone pounding on a hollow tree in an incredibly fast and hard manner. The sound was coming from my left and I guess it was maybe 1/4 to 1/2 mile away. Approximately 10-15 seconds later, I heard the same type of noise more to the right and closer. I would say within 200 yards. I could feel the percussion as well as hear it. I continued walking uphill along the trail for another five minutes when I encountered an odor that I had never smelled before. I did note the breeze was in my face.I continued for another 40 yards when something started walking/running rapidly through the brush approximately 20-30 yards ahead of me, moving from my left to my right. Every time it stepped, I could feel it through the ground, so whatever it was was big. I immediately took a trail to the left that led downhill, as I thought I may be cut off on the trail I was on, and I didn't want to get in anythings way if it was coming down the trail I was coming up. Whatever it was then moved from my right to my left through the brush as though to cut me off on this trail as well. I then started running to my left diagonally through brush and deadfall to try and cut the trail I came up on. I did cut the trail and ran back to my vehicle. Whatever was there did not follow me down to my car, nor did I ever see it. Upon reaching my car I again heard the same drumming noises, this time the second one was much closer and uphill of the trail I had started on. ",
  "classification": "Class B",
  "county": "King",
  "state": "Washington",
  "latitude": 47.1608,
  "longitude": -121.6594,
  "location": "-121.6594,47.1608",
  "location_details": "To get there go up highway 410 eastbound. Go through Greenwater, take the \"_\" FS road up onto Huckleberry Mountain. Note:  Witness did not want exact location of events made public for reasons of public safety.  BFRO Investigator has verified the exact location witness described.",
  "temperature_high": 70.46,
  "temperature_mid": 59.22,
  "temperature_low": 47.98,
  "dew_point": 47.54,
  "humidity": 0.65,
  "cloud_cover": 0.35,
  "moon_phase": 0.42,
  "precip_intensity": 0.0004,
  "precip_probability": 0.5,
  "precip_type": "rain",
  "pressure": 1012.32,
  "summary": "Partly cloudy until evening.",
  "uv_index": 7,
  "visibility": 9.8,
  "wind_bearing": 249,
  "wind_speed": 3.07
}