{
  "id": "7988",
  "title": "",
  "date": "",
  "observed": "It was a typical winter afternoon in Humbolt County, it was raining intermitantly and the river was on the rise and becoming too turbid to fish.  But, I wanted to catch another steele before the river blew out so, I drove down to the river bar as described in the \"Where did it occur?\" section of this report. I parked about 30 yards away from the rivers edge, on a dirt road surrounded by dense willows.  I turned off the car and opened the door.  Immediatly I heard two bellows that seemed far off.  I initially thought it was local kids.  The best I can do to discribe the noise is to ask you to try and make it--- put your lips togeather as if to make the sound of a \"B\" then bellow \"Whoooooooop\", wait two seconds and do it again. This is what I heard. To this day I can physically emulate the soud. The sound was similar to the bugle of a bull elk.  I used to work as a horse patrol park ranger on the eastern slope of the Rockies in Rocky Mountain National Park, I kept visitors away from the elk.  In addition, I have frequently heard elk bugle near Oric, CA. I know the bugle of an elk.  That's not what this was. Well, I didn't think much of it so I got my wadders on and proceeded to the rivers edge.  I wadded in up to my thigh and began fishing moving slowly down stream.  The river was probably about fifty yards wide and nearly at bank full about ten minutes went by and I noticed a dark figure down stream an accross the river, seemingly standing behind a large root wad.  I could see what I though was a head and shoulders of a bear or something? It was drizzeling and I couldn't focus on it at first, I wasn't sure it was an animal I thought it might just be part of the root wad. As I fished down stream I worked my way dirrectly accross from it and looked at it again, I looked right into its eyes, they were dark, it didn't move. I then saw another to its left, I could see its body from the thigh up, it didn't move, it was looking slightly down stream and I couldn't see its eyes. These things looked taller than a man, had flat faces and large round eyes, their shoulders were broad and their arms were long, they were mostly covered in hair although the one on the left seemed to have bald spots on its chest area, like mange.  They stood still, never once moved.  Ikept fising and tried to work down stream of them to a tailout wher I could cross and sneek up on them to get a closer look, the river was to high. As I worked back upstream I noticed a cacoon shaped object perched on the root wad overhanging the rivers edge.  It was shaped like a foot ball but was probably 4 feet long and 21/2 feet in diameter (hard to tell at 50 yards).  This cacoon like thing appeared to be neetly wrapped in dry grasses like cat tail or pampas grass blades.  I kept fishing moving upstream of them back toward my car, at one point I looked back to get another look anfd the cacoon like thing and the animals were gone.  A day later I drove to the other side of the river to go see if I could track um but the river had flooded the entire area. I don't follow Big Foot stuff, but I do know no bones have ever been found.  As a scintist this encounter has stimulated me to develope a theory.. I theorize that they warn eachother with this BWhooooop sound, and that the reason we have never found their bones is that they cleverly dispose of them by waiting till the rivers are on the rise, packaging the bones, and putting them in the rivers close to their mouths so that they wash out to sea.  I'm not sure I belive in any of this but thats what I saw and heard and thats my theory.  My second theory is that it was an elaborate hoax preformed by somm sort of Big Foot fan club or somthing.  But why would some one do that on an empty river bar I was the only one there and no one knew I was going to be there. ",
  "classification": "Class A",
  "county": "Humboldt",
  "state": "California",
  "location_details": "Glendale Drive in Blue Lake, CA runs parallel to Hwy 299.  At the west end of the drive is a Murphy's Market and gas station.  From the market, drive east on Glendale Drive about 1/4 mile, make a right on the road that runs south toward the highway, this road will T, stay to the right (your on a gravel road), this road will take you under the highway and then will swing left (BE CAREFULL OF GAVEL TRUCKS).  Pass the first set of buildings on your right and find your way through the giant gravel piles to the rivers edge.  Be couteous and ask someone for dirrections please, its a bit of a maze down ther with the large gravel piles and the dense willows.  Once your on the river bar look accross to the south west.  Thats were they were on the far bank behind large woody debris.",
  "summary": ""
}