{
  "id": "9627",
  "title": "Hunter hears strange chattering and finds tracks in Sam Houston National Forest",
  "date": "2004-10-29",
  "timestamp": 1099008000,
  "observed": "Deer hunting in the Sam Houston National Forest last November (2003). Near dark, I heard what sounded like a large limb or small tree snap. I listened, but heard nothing further.  Next day, I returned before sun-up, and spent the day hunting the area.  Late afternoon, I hid in a clump of small trees near the edge of the field.  As darkness fell, I heard a mumbling sound, like someone was whispering.  No words could be made out, although individual syllables were definately distinguishable.  The sound was coming from the thick woods and sounded maybe 300 yards distant.  Sounded quite human, but carried far better than I would think human whispering would.  Most syllables seemed to start with \"s\" sounds.  I listened for a while, then said \"who's there?\" No reply, and silence for maybe 10 minutes.  Then the chattering resumed.  The source of the sounds seemed to move around, but I took it to be one critter, changing location.  It was very dark by now, and I turned on my flashlight and moved into the woods to try to see what was making the sounds.  As I walked, the source of the chattering seemed to maintain it's distance.  I spotted a \"hair\" on a sapling bent over the game trail that I was following. It (the \"hair\") was later analyzed by a competent scientist and determined to be of plant origin. As I walked, I realized that I would have to be within 10 or 20 yards of something to see it. Not likely, so I reversed direction and left for the night. No odors were noticed.  I have returned to the location many times since, and found nothing.  That is until a few weeks ago, and almost a year after my first \"encounter\". October, 2004, same location: Bow hunting, I spotted a few does on the way in, but could not get a clear shot. I passed. Later, kicked up something, but had no visual contact (probably a deer). Near dark, I decided to walk the fire trail quietly.  A few hundred yards in, I found a somewhat human shaped footprint along the side of the firetrail.  It was the same length as my size 12 EEE boot [14 inches], but quite a bit wider at the \"toe\" end.  The \"toes\" also seemed to end rather evenly, and not the arched, rounded look of a human track. As I photographed, I noticed an odor, mild at first, and quickly becoming quite powerful. I would describe it as complex, layered. The predominant odor was of sour sweat. I could also smell decaying flesh, and a musky undertone. I finished photographing the best track (there were several other \"impressions\"), and photographed the woods directly behind me, from where I felt the odor eminated. I slowly and quietly walked back to my truck (20 minutes), and set my bow in the bed of the pickup as I retreived my keys from my pocket. It was completely dark by now, and overcast. Something growled at me. It was close, maybe 25 yards. The growl lasted between 1 and 2 seconds. I waited a good 5 minutes staring at the woods where the growl came from, then reached to my flashlight and turned it on. Nothing. The woods are incredibly thick here, and I could hide from someone easily in there. I had at least expected to see eye-shine. I keep plaster in my truck after the former incident, last November. Although I was entertaining the thought of going back in to make a casting, the growl made me think better of it. Had I been carrying my sidearm or a rifle, I would have done so, but not with a bow in complete darkness. That growl, while not loud, sounded serious. I headed out to develop the film, then home.",
  "classification": "Class B",
  "county": "Montgomery",
  "state": "Texas",
  "latitude": 30.52694,
  "longitude": -95.71278,
  "location": "-95.71278,30.52694",
  "location_details": "Little Lake Creek Wilderness Area, Sam Houston National Forest.",
  "temperature_high": 85.81,
  "temperature_mid": 79.675,
  "temperature_low": 73.54,
  "dew_point": 71.05,
  "humidity": 0.8,
  "cloud_cover": 0.42,
  "moon_phase": 0.55,
  "precip_intensity": 0.0058,
  "precip_probability": 0.42,
  "precip_type": "rain",
  "pressure": 1014.92,
  "summary": "Rain in the afternoon.",
  "uv_index": 4,
  "visibility": 8.56,
  "wind_bearing": 173,
  "wind_speed": 8.45
}