{
  "id": "9188",
  "title": "While picnicking in early evening, a couple has sighting at Salt Fork State Park",
  "date": "2004-08-18",
  "timestamp": 1092787200,
  "observed": "My wife and I were having a picnic supper at Salt Fork State Park on August 18, 2004 at approximately 7:00 p.m.  After approximately 15 minutes we decided to hike down a path into the woods with our dog.  After progressing approximately 15 feet into the woods we heard loud unexplainable noises.  The noises/howls continued as whatever was making the noises seemed to be walking parallel with us.  We were nearly 75 yards into the wooded area when we stopped and looked more closely to see what was making the noises.  The noise was heard again and I saw it, and began shouting at my wife, \"There it is!  There it is!\" Together we saw what appeared to be a nearly 8 foot tall, dark colored subject looking at us.  We watched it for about 10 seconds and then it walked upright, in a human form, deeper into the woods and away from us.   Scared, we turned and quickly walked out of the woods hearing the noise several times behind us.  We reached our picnic area, picked up our belongings, and that's when we heard it again, this time thunderously loud, and we knew it had followed us and believe it was within about 50 feet of us still concealed in the woods.  We grabbed our stuff and ran for our vehicle (with our dog).  It was the eeriest encounter we have ever had in our lives.",
  "classification": "Class A",
  "county": "Guernsey",
  "state": "Ohio",
  "latitude": 40.1218,
  "longitude": -81.5117,
  "location": "-81.5117,40.1218",
  "location_details": "",
  "temperature_high": 79.92,
  "temperature_mid": 73.045,
  "temperature_low": 66.17,
  "dew_point": 60.23,
  "humidity": 0.75,
  "cloud_cover": 0.34,
  "moon_phase": 0.08,
  "precip_intensity": 0.0168,
  "precip_probability": 0.82,
  "precip_type": "rain",
  "pressure": 1014.58,
  "summary": "Rain starting in the evening.",
  "uv_index": 8,
  "visibility": 6.53,
  "wind_bearing": 192,
  "wind_speed": 6.83
}