{
  "id": "2704",
  "title": "",
  "date": "",
  "observed": "Whitehall is a small town with little to do for teenagers.  Driving all the back roads was one of the past times of choice.  Late one night a girlfriend and I drove out to East Bay and stopped to talk for a while. After a few moments spent parked near the bridge, I saw what looked to be a man walking accross the marshy area to our left.  The distance, I am assuming, was about 200 to 300 yards.  This I gauged by seeing a fence line at that distance. At the time my tested vision was 20/10 (documented). We both watched as this man approached the fence line.  He cleared it without stopping.  Simply stepped over it as if it were a low stool.  Knowing that the snow was not that deep or that hard to support a man of his apparent size, and that it was highly unlikely for anyone to be out on the marshes at that time of night, I stepped out of the car to get a better look. As soon as I had gotten out of the car, the man changed course and began heading straight toward us.  I closed the car door to cancel the interior light, and prevent showing my location.  At this point the man broke into a run.  His speed was incredible.  He closed the distance between us very quickly.  My girlfriend was screaming for me to get back into the car at this point. I got back into the car, and she drove back over the bridge into NYS.  As we went, I looked behind us and saw that we were being pursued, although we were building a gap.  As soon as we returned to hardtop road, he broke off pusuit and ran back into the forest near the bridge. We returned to town and never spoke of this incident to anyone other than two trusted friends.  I have since told friends and relatives that I saw \"something\" out there but could not say that it was any animal I had ever seen, nor could it have been any man. I should add that at that time I had spent 16 years working and playing outdoors.  I had encountered all of the major predators of our area, knew their habits and habitats.  I know that I did not mistake an animal for a humanoid creature that night. I will further add that I am now a Natural Resource Scientist with 16-years of experience studying and reporting information based on my observations and analysis.  I still cannot state with precision what it is I saw that night.",
  "classification": "Class A",
  "county": "Washington",
  "state": "New York",
  "location_details": "This happened in an area known as East Bay.  We had crossed the bridge there which takes one from Whitehall, NY to Poultney, VT.  The siting began in Poultney, VT and ended in Whitehall, NY.  Here's an approximte Lat & Long for where the siting began: 43-degrees 34' 13.94\" North 73-degrees 23' 34.67\" West",
  "summary": ""
}