{
  "id": "27702",
  "title": "Man recalls seeing a tall dark creature behind his house at dusk near Laurel",
  "date": "2010-08-15",
  "timestamp": 1281830400,
  "observed": "Can't remember exactly when it was but it was sometime in the mid-90's over in the far western portion of Anne Arundel County - Laurel to be exact where 3 counties come together - Anne Arundel, Howard, and Prince Georges.  We lived up off of Brock Bridge Road parallel to the Baltimore-Washington Parkway and one evening out with the dog out back - our home backed up to woods - I hear a rustling noise behind what was a drainage pond for our community. It was summer and the sun was getting ready to go down so it was dusk-like -- I turned - and by the way so did the dog - our Labrador Retriever -  and could not believe my eyes. I observed a large - I am guessing 10-11 feet high - ape-like figure stalking in the woods behind the pond - I would say it was about 100 yards away.  I just froze - and so did our dog.  No one else witnessed this and we just both stood there for what seemed like 2 minutes - until the creature turned and looked our way and then slowly turned and dashed back off in to the woods....never to be seen again.  I remember this like it was yesterday but did not know about this site until today when my awesome nephew, AB, told me about  it.....so....here I am today...reporting this incident so everyone can be aware and know the truth.",
  "classification": "Class A",
  "county": "Anne Arundel",
  "state": "Maryland",
  "latitude": 39.08414,
  "longitude": -76.82731,
  "location": "-76.82731,39.08414",
  "location_details": "From Brock Bridge Road follow River Bridge Way west to left on Forest Bridge Court then right on Serene Court. Sighting occurred adjacent to retention pond at end of cul-de-sac.",
  "temperature_high": 76.65,
  "temperature_mid": 74.155,
  "temperature_low": 71.66,
  "dew_point": 70.62,
  "humidity": 0.89,
  "cloud_cover": 0.92,
  "moon_phase": 0.21,
  "precip_intensity": 0.0163,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1016.01,
  "summary": "Rain until afternoon.",
  "uv_index": 5,
  "visibility": 9.06,
  "wind_bearing": 165,
  "wind_speed": 6.31
}