{
  "id": "48013",
  "title": "Memory told of a close daylight encounter behind a home outside Sandy Lake",
  "date": "1978-10-15",
  "timestamp": 277257600,
  "observed": "When I was 12 years old, my mother was cooking my breakfast before school and as she was cooking and looking out the window she said, what in the world is that? I jumped up just in time to see a large brown figure going into the woods toward a stream behind my house. She said it ran from the neighbors down a powerline and was snapping off sumac like they were twigs.  Being young and curious I ran about 75 yds to the spot the animal had entered, there was a small drop off of about 20 feet then a level spot about 10 ft, then another 4 ft drop to the creek bed. When I arrived I observed the bigfoot at about 50 yrds, It must have heard me as it stopped and turned its upper torso and looked at me. The animal was between 6 and 7 ft tall with a dark face, after looking at me it made great strides down the creekbed and was gone around the bend. When my father arrived we went to check the area. There were very large heel prints in the top of the bank where the animal had landed when it leaped off of the top. I hunted those woods for years and there were times that I felt I was being watched, We heard vocalizations one night but my father said it was a bobcat, after hearing bigfoot recordings I believe they are what made the noise.",
  "classification": "Class A",
  "county": "Mercer",
  "state": "Pennsylvania",
  "latitude": 41.21365,
  "longitude": -80.26563,
  "location": "-80.26563,41.21365",
  "location_details": "From the red light in Sandy Lake take 173 north to Mill Street stay on Mill Street it turns into Coal Road go about 1 mile you will cross a small creek in a valley the incident happened near the back of the property.",
  "temperature_high": 46.02,
  "temperature_mid": 41.365,
  "temperature_low": 36.71,
  "dew_point": 34.53,
  "humidity": 0.81,
  "cloud_cover": 0.63,
  "moon_phase": 0.48,
  "precip_intensity": 0.0033,
  "precip_probability": 0.56,
  "precip_type": "rain",
  "pressure": 1017.91,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 8.4,
  "wind_bearing": 251,
  "wind_speed": 5.71
}