{
  "id": "18632",
  "title": "Woman describes childhood sighting (multi-witness) on abondonned RR bed outside Barnwell",
  "date": "1978-06-08",
  "timestamp": 266112000,
  "observed": "In the summer of 1978, my brother along with myself and a friend of mine who lived next door were playing outside on [a country road near] Barnwell, SC.  Our backyard butted up against woods as well as an old railroad track that had long since stopped being used.  We were not supposed to go near the edge of the yard bordered by the old RR tracks, but being kids this is exactly where we were playing when all three of us witnessed the most amazing (and at the time probably the scariest) thing we had ever seen. We heard a high pitched screeching or wailing like noise and went to see what it was. It was in the evening but the light was still very good outside. When we came to the old RR tracks this creature came across the other side and seemed as startled to see us as we were to see it.  I only saw it for about 15 seconds or so as we all just stood and stared in utter shock before I got the hell out of there, running and screaming along with my brother and neighbor back to the house! It seemed to be at least 7 feet tall and had very long arms and was very hairy with long tufts of dark brown hair covering it's body.  As best as I can recall, its face was oddly human-like in appearance yet at the same time seemed like an ape.  It did not make any noise at all once we all saw each other.  It just stood there looking at us but seemed to be peaceful and it certainly appeared not to be hostile.  It's sheer size is what scared me so badly. I remember running as fast as I could back to the house. If our mother had not heard the commotion and opened the back glass door, I'd have crashed through that glass door. My brother and I did not talk about this occurance for many years. When we finally did, our recollections of the event matched closely. You're more than welcome to ask my brother about this.  I still recall the name of our neighbor that was there as well.  I believe she still resides in Barnwell, as a matter of fact.  By the way, it was about a month and a half before she returned to our house to play after we saw that creature.",
  "classification": "Class A",
  "county": "Barnwell",
  "state": "South Carolina",
  "latitude": 33.245,
  "longitude": -81.359,
  "location": "-81.359,33.245",
  "location_details": "[Edited out]",
  "temperature_high": 86.94,
  "temperature_mid": 80.345,
  "temperature_low": 73.75,
  "dew_point": 71.51,
  "humidity": 0.83,
  "cloud_cover": 0.78,
  "moon_phase": 0.09,
  "precip_intensity": 0.028,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1014.54,
  "summary": "Heavy rain in the evening.",
  "uv_index": 7,
  "visibility": 8.22,
  "wind_bearing": 206,
  "wind_speed": 5.08
}