{
  "id": "49954",
  "title": "Memory told of encounter at a remote cabin at Sandy Run",
  "date": "2015-10-11",
  "timestamp": 1444521600,
  "observed": "I personally did not have an incident but my Aunt and Grandmother did.   I am not certain the year.  My aunt was a young girl and she is in her late 70's now. My grandparents bought a cabin for a weekend get away.  This cabin was very remote.  It was near Eldorado and the area was called Sandy Run.   There were 4 cabins on a lake surrounded by woods.  Very remote. My aunt and my mother were sleeping in the front room.  My aunt awoken in the middle of the night when she heard the front screen door on the enclosed porch open.  She heard footsteps.  There were 3 front windows and a door looking out onto the porch.   She saw a large man-like figure walk past all three windows and stop at the door.  The figure bent down to look in.  She said it looked like a very large man covered in red hair and had a pointed head.   She was afraid and ran and got into bed with my grandparents.  And never spoke of it until years later. I have been listening to this story (only when I ask her to retell it for many years).  She has never deviated from the story. Ever.  My aunt would not lie to me. As I was a young girl.  My grandmother told me she was at the cabin alone in mid day.  She looked out the back and saw a large ape looking creature on the cliff and descending down the cliff like no human ever would be able to.   She told me that story once and I will never forget her conviction about it.   My grandmother would have no reason to lie to me either.   My grandmother has passed but my aunt is still living. After these stories I have become a major bigfoot enthusiast.  Everyone I know thinks I'm a nut.  But there is no doubt in my mind what my grandmother and aunt saw. I would love to meet other researchers or enthusiasts.",
  "classification": "Class A",
  "county": "White",
  "state": "Illinois",
  "latitude": 37.9308,
  "longitude": -88.362,
  "location": "-88.362,37.9308",
  "location_details": "",
  "temperature_high": 75.63,
  "temperature_mid": 67.055,
  "temperature_low": 58.48,
  "dew_point": 47.3,
  "humidity": 0.7,
  "cloud_cover": 0.02,
  "moon_phase": 0.96,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.23,
  "summary": "Clear throughout the day.",
  "uv_index": 4,
  "visibility": 8.72,
  "wind_bearing": 196,
  "wind_speed": 5.36
}