{
  "id": "25189",
  "title": "Husband and wife recall daytime sighting while their boys swam in Tipsaw Lake near Leopold",
  "date": "1981-06-15",
  "timestamp": 361411200,
  "observed": "My wife and I had a sighting in June 1981 at Tipsaw Lake in Perry County.  We had taken a picnic lunch with us to the park and beach area, only to find it under construction and closed.  We did enter the beach area by way of the boat ramp area where we parked our car.  The area was closed that day and not a single person or fisherman was on the lake.  We had two small boys who immediately began to swim at the end of beach area next to the boat ramp.  My wife and I were under a shade tree about 15 yards off the beach watch the boys swim.  My wife was putting the picnic together while I was relaxing and looking across the lake. I could see a tall man moving between the popular trees very strangely high on the hill side near the dam to our right.  The boys were having a great time, playing in the water making much noise.  The tall dark man behind to move down the hillside to the edge of the water looking toward our boys in the water. The strange looking person or bigfoot began pacing back and forth looking in the direction of our boys.  I continued watching but could not believe what I thought I was seeing. I then stop my wife and ask her to look toward the dam and tell me what she was seeing. My wife and I observed this being for another minute or two when he stopped pacing and began moving up the dam in a diagonal manner some 1200 yards away. My wife said we our leaving, get the boys and lets get out of here.  We then headed back for Crawford Co. and have never forgotten that day. We returned to Tipsaw for the first time this past summer and looked at the spot that invoked all that fear some 27 years ago.",
  "classification": "Class A",
  "county": "Perry",
  "state": "Indiana",
  "latitude": 38.12318,
  "longitude": -86.64338,
  "location": "-86.64338,38.12318",
  "location_details": "Lake Tipsaw",
  "temperature_high": 91.27,
  "temperature_mid": 82.91,
  "temperature_low": 74.55,
  "dew_point": 70.29,
  "humidity": 0.67,
  "cloud_cover": 0.16,
  "moon_phase": 0.44,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.16,
  "summary": "Humid throughout the day and partly cloudy until evening.",
  "uv_index": 8,
  "visibility": 8.5,
  "wind_bearing": 209,
  "wind_speed": 9.77
}