{
  "id": "34479",
  "title": "Woman walking dogs hears possible vocalizations and knocks in Marymoor Park",
  "date": "2007-03-15",
  "timestamp": 1173916800,
  "observed": "I was walking my dogs in Marymoor Park, near Redmond, WA.  It was in the early-to mid-afternoon. The park was predominantly empty and quiet, and despite recent rain, the paths were not overly muddy.  It was a sort of hazy day, with some sun, probably 50-60 degrees. We had followed a somewhat under-utilized trail/road that parallels Hwy 520, going from the velodrome down to the Sammamish River.  It is a grassy area with occasional brush.  The trail makes a T-junction at the Sammamish River bank.  One can turn right and go under Hwy 520 to Redmond Town Center shopping district, or turn left and remain in Marymoor Park. Just at the bank of the Sammamish River, there is a stand of brambles that create large mounds on both sides of the trail on the Marymoor side of Hwy 520.  This little bramble forest is probably about 30 yards long.   The Sammamish River travels along the west edge of the park, emptying into Lake Sammamish about 1/4 mile away (or slightly more?), in the park.  (Salmon run this river in October/November.) We turned left and were walking through the brambles, parallel to the Sammamish River, heading into the park and away from Hwy 520. Just as we were at the end of the bramble mounds, and emerging into a clearing area, to my right, from the river bank, there arose a hair-raising screeching howly yowling sound, like something terrified and screaming. It did not sound human and was quite long-winded/sustained. I stopped and stood very still.  I was chilled to the bone by the sound, the hair standing up on my body.  One dog looked towards the river, his fur also standing on end and the other cowered a bit, her tail down. The sound was coming from within about 50 yards of us, but I could not see anything or anyone along the river bank.  There is brush and trees there, so they were blocking my view of some areas of the river bank. The W. Sammamish Parkway is across the river and parallel to the river and the trail I was on.  The cars travelling along that road create a certain roar as do the ones on Hwy 520.  Whatever this yowling sound was, it was super audible above the sound of traffic on both these busy roads. After a minute, we began walking again, and the sound arose again.  This time, it was further away, maybe 75 yards up the river.  This time, the yowling sound was followed by knocking sounds of wood on wood.  At this point, I did go to the edge of the river and look up the river bank to see if I could catch a glimpse of whoever or whatever was making the noise, but I could not see anyone or anything there.  I wondered if it was people goofing around, but I did not see anyone or hear people sounds. A few minutes later, I heard knocking, again, but no yowling.  It was probably from the area just below an old non-functioning windmill that stands on the banks of the Sammamish River, near the west entrance & bridge into the park. When we reached the main bridge that comes into the park from the Sammamish Parkway (close to the windmill), we turned east, towards the Clise Mansion and park facilities area, and were no longer walking along the river.  I did not hear any other yowling sounds after that.  Also, from that vantage point (the bridge), I could not see anyone or anything along the river. About 15 minutes later, when I drove out of the park, I again stopped near the bridge to look up and down the river, but saw nothing and no one.",
  "classification": "Class B",
  "county": "King",
  "state": "Washington",
  "latitude": 47.6633,
  "longitude": -122.1253,
  "location": "-122.1253,47.6633",
  "location_details": "Marymoor Park is a fairly large park that used to be a farm.  It is on the edge of Lake Sammamish and is bordered by the Sammamish River on the west.  Part of the park is open grassland, some is forested by pines and flowering trees, and part of it is swampy terrain, especially along the lake edges.  There are several large brambled areas.  There are intermittant stands of brush throughout the park, a community farm, a pet cemetery, large off-leash areas, sporting grounds (cricket, baseball, soccer, tennis),an auditorium, a velodrome, and a house/museum.  The old chicken coops and barns are now facilities/maintenance offices and sheds.  The park hosts a great deal of wildlife:  rabbits, weasels, water fowl, salmon, snakes, birds of prey (owls, osprey, hawks), coyotes and deer. There are residential areas to the west of the park.  To the east, mountains arise above the lake, and there is a great deal of wild terrain.",
  "temperature_high": 61.86,
  "temperature_mid": 52.675,
  "temperature_low": 43.49,
  "dew_point": 33.87,
  "humidity": 0.76,
  "cloud_cover": 0.64,
  "moon_phase": 0.88,
  "precip_intensity": 0.0012,
  "precip_probability": 0.8,
  "precip_type": "rain",
  "pressure": 1027.39,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 9.78,
  "wind_bearing": 139,
  "wind_speed": 2.01
}