{
  "id": "57471",
  "title": "Memory told of a close daylight encounter with a white Bigfoot while riding a motorcycle inside Camp Joseph T. Robinson",
  "date": "1976-09-15",
  "timestamp": 211593600,
  "observed": "My friends and I would work on our motorcycles, and then ride them in the woods at Camp Robinson in North Little Rock, AR. (back when they let us do such things ). The day started off normal, with my friends  Loren P., Jerry W., Tommy B., Jim O., and myself riding our motorcycles. There was a ditch about 6 feet deep, and 7 feet wide and we took turns jumping it. I was on a yellow Suzuki 185 motorcycle with a stinger exhaust system on it. I was jumping the ditch and almost crashed my motorcycle, and thought I had better quit before I got hurt. My friends all wanted to keep jumping the ditch, so I decided to ride East along a dirt trail that ran parallel to the ditch. I was in no hurry since I was not familiar with the trail, and was just enjoying the ride. I had ridden about 20 minutes or so when I saw what I thought was a white motorcycle going South. Since I was going East and it was going South I was afraid I would run into the other motorcycle, so I stopped to keep us from colliding into each other. I got glimpses of the white motorcycle as it was going though the trees, and was going to wave to the other rider as they either turned onto or crossed over the trail I was on. MUCH to my surprise the white motorcycle was not a motorcycle at all... \"IT\" was a very tall creature walking on it's hind feet like a man, but with a stride that seemed to be about 6 feet per stride. The arms were lanky and long and swung slightly as it walked, and it's hands hung down about knee level. The creature had long lanky legs, and they looked to be fairly muscular like it did a lot of walking and running. The feet were long, my guess they may have been 15 to 18 inches or so, but they seemed accurately proportioned for a creature of it's height. The creature was about 8 or 9 feet tall, and stopped right in the middle of the trail, and then turned to face me. It was about 25 yards from me, and there were no trees or brush between us to block my view of the creature. It was very tall, and lanky and was a dirty white albino color. It did not have any clothing and seemed to be covered in short dirty white hairs. I could not see any indication of the creatures sex. It's head was more of a triangular shape than round, and I'm certain it was not human. The eyes were close together, and were very focused on me...I would describe them as definately being predator's eyes. The nostril holes were small, and seemed to be about 2 inches apart, and the mouth was similar to a humans but just a bit wider. I had a full motorcross helmet on, so if the creature had an odor, I could not smell it. The only sounds I heard were the beating of my heart about to explode out of my chest, and the popping of the 185 Suzuki's stinger exhaust. The creature and I looked at each other for what seemed like an eternity, then it made a snarling expression and squinted it's eyes at me. It's mouth went from a closed frown to rising it's upper lip and showing me what I considered it's meat eating teeth...I GOT THE MESSAGE !!! Then it's eyes squinted more at me, as if it was starting to get really pissed at me for being there. About the time I thought it was fixin to attack me, it turned and started walking South again. The creatures stride still amazed me, it's single walking stride from one foot to the other was probably 4 times my stride. I'm certain that if it had tried to run up and catch me, I would not have been able to flee in time. I had a hair standing on the back of my neck suspicion that it might be about to make a fish-hook loop like an injured bear, and then suddenly pop up right beside me on the trail. I turned the 185 Suzuki around and rode like a professional to get the hell out there. I was too scared to look behind me, and was praying for Jesus to protect me as I also tried to make sure I didn't crash! I felt that if I crashed the motorcycle, it would surely catch me if it was in pursuit. It had taken me about 20 minutes or so to get to where I saw the creature, it only took about 10 minutes to get back to where my friends and I had been jumping the ditch because I was riding skentback and scared to death. When I did get back to the truck, my friend Jim O. was sitting on the bed of the truck relaxing. The rest of our friends were not at the ditch, or the truck. I yelled at Jim O. with a half squeeky pitched voice, because in my heart was still in my throat,  I said \"Jim there's something in the woods! We need to warn the rest of the guys!\" Then came my next major surprise of the day, Jim asked me \"Is it real tall and white?\" I yelled \"YES, why in the Hell didn't you tell me about it?\" Jim said \"I didn't tell anyone about it, because I didn't want anyone thinking I'm crazy, or making fun of me!\" Then Jim proceeded to tell me about the time him and his nephew Pete saw the creature while squirrel hunting at Camp Robinson. This occurred back in 1976 while I was a Senior in High School. I bow-hunt in Camp Robinson from time to time, and as God is my witness, the hairs still stand up on my neck when it's dark and gets too quiet in the woods. There have been times that I feel like something was watching me, and I immediately remember the creature I saw by the All American Drop Zone. There are times where bow and arrow or not... I waited until it got light enough for me to see before I would get out of the truck. It doesn't matter to me if you believe this story or not...I've been telling it to family, friends, co-workers, and even strangers since the day I actually saw the creature, and it saw me back in 1976.",
  "classification": "Class A",
  "county": "Pulaski",
  "state": "Arkansas",
  "latitude": 34.92336,
  "longitude": -92.30519,
  "location": "-92.30519,34.92336",
  "location_details": "It was just North of the All-American Drop Zone inside Camp Robinson.",
  "temperature_high": 86.13,
  "temperature_mid": 73.815,
  "temperature_low": 61.5,
  "dew_point": 62.21,
  "humidity": 0.72,
  "cloud_cover": 0.29,
  "moon_phase": 0.72,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.31,
  "summary": "Partly cloudy until evening.",
  "uv_index": 6,
  "visibility": 6.8,
  "wind_bearing": 170,
  "wind_speed": 1.25
}