{
  "id": "37336",
  "title": "",
  "date": "",
  "observed": "Hello, So last night I had a rather odd, run-in with something I could not explain. I feel like I need to say something. Last night I was on the way home from my friend's house around 1 am, and as I was nearing my families farm,(which is half farm land, half forest and overgrowth)I saw something cross in front of me about 500 yards up the gravel road. So being tired, I shook my head and turned up the music and thought I was crazy. As I past the part of road that I had seen this object cross I kinda laughed, and brushed it off, but as I looked more closely at my rear-view mirror I noticed that my tail lights were shining off an unusual figure standing kinda close to the road, but more closely in the brush around the road. Lately I've heard my mom and dad talking about some local farmers that have been having sheep, and chickens go missing, I heard them say that some of the sheep have been found in trees, I know there are bobcats around here so that is what I speculated. But tonight, after seeing this I walked in the house and my mom and dad were still up which is odd because they are normally asleep by 11. My dad asked me if I had counted the cows and our pigs recently within the last 24 hours and I said I had, and just asked why. He told me that sometime in the night, last night, someone or something got a hold of a cow and injured it pretty badly to the point they had to put it down and that 2 pigs were missing with one being found in our forest in the crotch of a tree.(the pigs were farm fed non-confined so they are pretty bulky) Which brings me back to the real reason why I'm here, a year ago I was hunting bow-season. I woke up around 2:30 am and got my stuff ready to go hunt before class on my families farm. I usually walk a little over a mile to get to my \"honey hole\" as I set out it was still very dark but the moon was very visible, and I could see very far and clear. As I was walking down the gravel road I heard like a light whistle coming from my right which was the beginning of the forest, but I kept walking thinking it was me with my bow bumping against me. To my left was the crops, so I slowly just started walking closer to the ditch opposite from the forest. About 3:15 am I was nearing the other edge of the forest (which is on the north side of our property) I opened the gate and started walking towards my tree stand and had my flashlight on (RED LED) I was almost to my stand when I heard another whistle sound. I stopped and slowly turned in all directions and saw nothing. So I continued to walk, when finally I found my stand and began to walk up the ladder. 10 min passed and I started smelling this foul odor, but just thought someone had hit a skunk on the highway about 3000 yards away, and the smell was just heading my way. Have you note that my stand faces north into the corn in which I can see about a mile of open land and my back facing the woods, about 50 yards from the clearing inside the forest. As I continued to smell this odor, I started also hearing walking pretty far away to my right, of course I could not see anything but just in case it was that trophy buck I had longed for, I strung up an arrow just so I wouldn't have to later. Another 10-15 min passed and I started to smell the odor yet again, so I plugged my nose with my fingers and started to listen closely to my surroundings, as I sat there I heard a another whistle from my right, then from my left I heard a whistle that seemed to copy the first. I looked to my left and about 60 yards away I noticed a small figure kinda crouched down, and at first I thought it was a stump that I'd overlooked before but as I looked closer the moon kinda reflected a weird shine off the object, then as I was talking myself into thinking it was just some weird overgrowth, it stood up. My heart dropped to my stomach, I slowly looked to my right and saw a somewhat same object that looked like it was already standing about 4 feet tall and the one on my left about 6-7 feet tall. I sat there scared to death when I don't know if stupidity or instinct kicked in but I started yelling and stomping my feet on the metal stand making some pretty loud noises. I looked to my right just to see the object running east away from me at a very fast sprint, and looked to my left to see the object to my left crouch back down, then pick something up and threw it at me, not sure what it was I only heard it land 30 yards from me, then the object to my left let out a loud whistle and then a grunt, I was so terrified, I started climbing down the ladder grabbed my skinning knife and ran to the corn field as fast as I can. I ended up calling a friend and waking him up to come get me in the field very far from the forest. I told him about the situation and he informed me that a year or two before that his dad had a similar run-in with the same odd situation and that his dad has not been hunting alone since his encounter. I have never been one to think that big foot or whatever is real, and maybe I brushed it off last year because I was too scared and that it was very early morning that I could have been seeing things, but last night made me think about the year before and kinda makes me very scared to live where I do now. I more or less want some sort of explanation... Or info I've lived in Iowa and the same farm here for 20 years and I've never had something like this happen, or me being from the country and living here my whole life to now being to scared to go in the woods alone.",
  "classification": "Class B",
  "county": "Jasper",
  "state": "Iowa",
  "location_details": "Exact sighting coordinates withheld.",
  "summary": ""
}