{
  "id": "36008",
  "title": "Photograph taken of a figure sitting by a creek outside Red Lodge",
  "date": "2012-06-30",
  "timestamp": 1341014400,
  "observed": "I went to visit my brother who had gotten a firefighting job up in Montana recently and on one of his days off, I wanted to go up into the secluded woods on a hike. Since he was working with the forestry service, he knew of a place that was very secluded and was extremely thick forested. We hiked about a mile and a half up into the mountains and about half way up, we crossed a little creek about 4 to 5 feet wide. I stopped and pulled out my phone to take a picture of the upstream view. I got the picture and we continued on without realizing what he had just done. Later that night I was going through the pictures of that days hike, when I came across something in one of the pictures that was extremely startling. About 45-50 feet from where I took the picture, there was a black figure that seemed to be sitting near the bank of the creek looking right as us. Curious about what I had seen, a few days later when my father arrived to visit my brother, I took him to the place I had taken the picture. Sure enough, where there had so clearly been something sitting next to the creek, there was nothing. In fact there were even freshly broken branches off trees that were no where near the spot it was sitting. I took more photos with my father sitting in where we suspected it was and there is a clear and definite difference where there was a figure sitting, nothing sitting there, and my dad sitting in the same place.",
  "classification": "Class B",
  "county": "Carbon",
  "state": "Montana",
  "latitude": 45.28074,
  "longitude": -109.5528,
  "location": "-109.5528,45.28074",
  "location_details": "",
  "temperature_high": 86.52,
  "temperature_mid": 70.885,
  "temperature_low": 55.25,
  "dew_point": 42.99,
  "humidity": 0.4,
  "cloud_cover": 0.02,
  "moon_phase": 0.39,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1012.06,
  "summary": "Clear throughout the day.",
  "uv_index": 11,
  "visibility": 10,
  "wind_bearing": 43,
  "wind_speed": 2.08
}