{
  "id": "3072",
  "title": "BFRO Investigators detail activity around Twain Harte",
  "date": "2001-03-01",
  "timestamp": 983404800,
  "observed": "This report details a two-year investigation of bigfoot activity in the Twain Harte area by BFRO investigators Kathy Moskowitz and Montra DuMond.  Only highlights are listed here, but monitoring occurred daily. March, 2001:  screams heard; the locations of the screams are pinpointed by four broken trees. April, 2001:  blasting of Lake Tahoe and Ohio scream begins.  Seven additional broken trees appear, one each the morning after blasting occurred, and in the same location where the blast originated. late April-early May, 2001:  baiting begins at the PG&E Columbia ditch.  Baiting material is apples.  Bait is taken within a day.  New bait is placed every other day. May 12, 2001:  new broken trees, dozens of fresh footprints, and two nests are found.  An obvious trail crosses the road in the same location, so the area is staked out.  Although no bigfoot is seen, something very large and walking on two feet approaches the stakeout location.  A sudden oncoming car scares whatever it was downhill and a large, two legged creatures is heard crashing through the brush. May 13, 2001:  all the broken trees, two nests, and dozens of footprints (14 inches, 5.5 foot stride, trees broken at the 6 to 6.5 foot level) are documented.  One nest was \"incomplete\" and obviously not used recently, but the other was very unique.  As an archaeologist, it was obvious that only hands could have constructed the shelter (the branches were interwoven).  The body imprint (matted down veg), was 7 feet long.  This location is about 1/2 mile from the other location with the 10 broken trees, and where he had been taking the bait (and always leaving just one apple).  This week, no fruit was taken (PG&E is clearing trees along the powerline, disturbing the area). May 18, 2001:  nests investigated.  The nest floor was excavated and screened; construction photographed, and the nests taken apart to determine construction method.  A detailed report, with photos, is at http://www.bfro.net/ref/fieldres/sasquatchnest.asp May 29-31, 2001:  intensive field investigation, more prints found.  Local resident reports screams from Big Hill area. June 23-31, 2001:  intensive field investigations, more prints and broken trees found.  CDs (to try to recover finger prints) placed in nests and general area. July, August, Sept. 2001 - no new information or activity.  Hot weather may have driven the bigfoot uphill. October, 2001 to Feb. 2002 - checked the area about once a week (when the roads are snow free).  Checked the nest area for new activity, nothing.  Checked CDs hung all over the location, all are still in place and no fingerprints noted.  Tried blasting, but nothing responded. March, 2002 - continue to check the Big Hill and Ditch areas.  No new trees, nests, prints, or other activity noted.  Baiting location reestablished with apples, peanut butter, and various vegs.  After three weeks, no bait taken.  Snow has been very heavy, unlike last year when March was warm (Spring weather).  Usual vegetation is not yet blooming.  Local deer herd appear to be in need of food, as they are eating non-native shrubs, which they haven't eaten before.  Next few weeks are supposed to be warmer. March 2002 to current - PG&E cleared the area of trees to prevent fires.  No new activity has been noted since that time.  It is likely that whatever was in there is now gone.",
  "classification": "Class B",
  "county": "Tuolumne",
  "state": "California",
  "latitude": 38.05,
  "longitude": -120.2667,
  "location": "-120.2667,38.05",
  "location_details": "Location:  a two mile radius around the Regional Learning Center on Big Hill Road and 2N01.",
  "temperature_high": 55.25,
  "temperature_mid": 48.66,
  "temperature_low": 42.07,
  "dew_point": 33.6,
  "humidity": 0.71,
  "cloud_cover": 0.27,
  "moon_phase": 0.21,
  "precip_intensity": 0.0005,
  "precip_probability": 0.24,
  "precip_type": "rain",
  "pressure": 1017.84,
  "summary": "Mostly cloudy starting in the afternoon.",
  "uv_index": 5,
  "visibility": 9.04,
  "wind_bearing": 178,
  "wind_speed": 1.01
}