{
  "id": "43217",
  "title": "Memory of 3 hairy fingers sliding under the front door outside Nauvoo",
  "date": "1988-07-15",
  "timestamp": 584928000,
  "observed": "This happened in 1988 in Nauvoo AL.  I was 14 years old. I was at home in my living room watching TV and my brother was outside working on a car. We were the only ones at home.  The front door was located in the living room. We never used this door because we had no steps to it and the door was about 4 feet from the ground. So we used the back door of the house. I was sitting on the couch watching TV when the door began to move and the door knob was turning. The only thing holding the door shut was a nail someone had nailed at the top of the wall and bent it over to hold the door shut. I first thought it was my brother but he knew we didn't use the door. As the door was moving just a little I noticed at the bottom of the door where there was a gap, 3 fingers slide under the door. My heart began to beat faster, I tried to move but I couldn't at first. Then I wanted so bad to look out the window beside the door but I was too scared. These fingers were very long and the nails were long too and black. The hand like finger had hair on it dark brown. The hair was long. This only lasted for 3 min. When the fingers move out from the gap the door knob and the door stop moving. About 45 min. later my brother came inside and I asked him why he was trying to use the front door he said he hadn't. I didn't tell him what happened until sometime later. Because of fear he wouldn't believe me and the fear of him using this to scare me later on.",
  "classification": "Class B",
  "county": "Walker",
  "state": "Alabama",
  "latitude": 33.89236,
  "longitude": -87.3775,
  "location": "-87.3775,33.89236",
  "location_details": "Wooden area. Just past the intersection of Trotter Rd. and Nichols Rd. On the right about 40 yards past intersection going north away from Jasper.",
  "temperature_high": 94.41,
  "temperature_mid": 84.77,
  "temperature_low": 75.13,
  "dew_point": 73.97,
  "humidity": 0.73,
  "cloud_cover": 0.34,
  "moon_phase": 0.06,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.01,
  "summary": "Humid and partly cloudy throughout the day.",
  "uv_index": 9,
  "visibility": 6.81,
  "wind_bearing": 279,
  "wind_speed": 3.21
}