{
  "id": "6249",
  "title": "",
  "date": "",
  "observed": "I believe it was May or early June of 1985.  I rented a cabin in the Catoctin State Park with a friend and we just spent one night.  The cabin was just a simple one room building with a window on either side and a cabinet to store your belongings.  There were two army style cots on either side of the cabin, each near a window.  It was very rustic.  The door didn't even have a lock on it, it was just a wooden latch that went through a slot on the door frame. My friend and I hiked during the day and then went to some store and bought submarine sandwiches and a bottle of wine.  As night was fallng we sat out on the tiny porch, ate the sandwiches and split the bottle of wine.  It was a very pleasant evening.  We sat on the porch and talked for several hours, but by the time 10:00 PM rolled around, the combination of all of the hiking and the bottle of wine made us sleepy. My friend and I turned in for the night and we both fell asleep very soon.  My friend is a very heavy sleeper, but I'm a much lighter sleeper.  At some point during the night I was awakened by something.  I didn't know what it was, just that my sleep had been disturbed.  I lay in bed and just listened, starting to fall back asleep when I heard this strange cry off in the distance.  I had no idea what it could be having never heard it before.  I would hear a series of three or four crys and then silence.  Then after about a minute or two it would start up again, only sounding closer each time it started anew.  It was a very weird sound. I just lay there and listened and I kept thinking that the only thing that I could match it up with was the cry of a gibbon that I had heard on TV.  But I thought, that certainly can't be what it is.  I'm not exactly an expert, but I'm a big nature lover and I'm fairly familiar with the common animals of Maryland and I just had no idea what the sound was.  Well, it just kept getting louder and louder each time the next series of cries started.  It sounded like it was maybe a half a neighborhood block away when, even though it was a warm night, I shut the window near my bed because it was so creepy. I tried to gently awaken my friend on the other cot, but to no avail.  I remember that I had to go to the bathroom, but was to uneasy to go out.  There was no bathroom, just the woods.  I stayed awake for about another hour and since I didn't hear the cries anymore, I went out on the porch and urinated as fast as I could and went back in and locked the door and eventually went back to sleep.  I told my friend about it the next day, we had a laugh and that was it.  I have thought about it on and off all these years. What prompted me to report it is that I saw and then bought the Discovery film, \"Sasquatch, Legend Meets Science.\"  There is this segment of the film where this older male scientist and his young female assistant are analyzing these sounds reported to be Sasquatch vocalizations.  When I heard the crys that they were listening to, chills just went up my spine.  They are darn close to, if not exactly what I heard that night in the cabin in Catoctin State Park. I have never heard anything like that in the woods before that night or since, except the first time that I watched that Discovery Special about the efforts of those scientists trying to use scientific disciplines to prove or disprove the existence of Sasquatch.",
  "classification": "Class B",
  "county": "Fredrick",
  "state": "Maryland",
  "location_details": "The only thing I can remember at this point is that it was The Catoctin Mountain State Park.  I remember that there was a public swimming pool not too far from the cabin.",
  "summary": ""
}