{
  "id": "2226",
  "title": "",
  "date": "",
  "observed": "Sent to the Internet Virtual Bigfoot Conference (IVBC) mailing list: I've been interested in the Bigfoot phenomenon for many years, and have read most of the serious books covering the subject, including Krantz's stuff. About three years ago I began visiting a woman in Quincy CA, a small northern Sierra community which Tom Morris notes, \"has always been notorious for its Bigfoot sightings.\" He sure was right. Over the last three years the local paper, the Feather River Bulletin, has reported seven different sightings in the same general area of the county. Five of those may have been hoaxed, but two deserve further discussion. The first one occurred at 1:15 a.m. on February 13,1994. Mary and Jerry Cain, Quincy's only bakers, were returning from Reno. Near Lee Summit, ten miles east of town, a large fur covered animal crossed Hwy. 70 in front of their car and strolled up a steep bank and into the forest. It looked exactly like the many drawings they'd seen of Bigfoot. They doubt this was someone dressed in a Gorilla costume. When it was light, Mary and Jerry returned to the scene and found large, deep footprints in the snow. They took pictures of the prints, wrote a narrative of their adventure and posted the information on the wall of their bakery. I've had a chance to study the photos and I'm convinced they aren't contrived; I've also spoken to the Cains and I believe they're telling the truth about their experiences. The second sighting happened near Cemetery Hill, an area which divides east and west Quincy. It was about 11:30 p.m. on October 16,1995 when Larry Riddle, out for a stroll, smelled what he thought was rotting garbage. As he was looking for the source of the smell, he felt he was being watched. He turned and saw an eight foot, fur covered creature watching him. Riddle lived near Yellowstone most of his life: \"I'm familiar with bears and this was not a bear\". He stated that there was no bearlike snout. He also refuses to believe it was someone trying to fool him. He felt it would be hard to mimic an eight-foot-tall Bigfoot. \"I'm sure I'm going to get laughed at\" Riddle said. \"This thing was real. This thing was real.\"",
  "classification": "Class A",
  "county": "Plumas",
  "state": "California",
  "location_details": "",
  "summary": ""
}