{
  "id": "2755",
  "title": "",
  "date": "",
  "observed": "During the weekend of may 26th and 27th I was conducting a sound survey project with three other people near the town of Johnson and the Klamath River.   This area we were in had a sighting last year around the month of July. The place where we decided to set up was a recent clear-cut that ran along the hillside.   It was about 1000 feet wide and 1200 feet long.   On the edges were fir and oak trees that developed  a thick cover.   Running the width and centered in the clear-cut was a dirt road that the local people and loggers used on a daily basis.   It also provided us with a place to park and set up our sound equipment.   it also became base for our team. From our base, looking down into the valley about two miles we could see the town of Johnson.   From or point we were about 1500 feet above the river and town. Just prior to dusk, I had two members climb to the top of the clear-cut (about 150 feet in elevation and about 300 feet away from base).   I did this so if anything was to come closer to our base camp, they would have the best field of vision, and with their night vision device would be able to determine what it was.   We also had two way potable radios for the upper lookout and base. Manny and myself continued to set up the equipment and waited until nightfall. Because I was scheduled to participate at 10:00 PM in a live broadcast with Jeff Rense “Sightings” program, I was insuring that my bag cell phone was working properly.   All the equipment checked out other than the phone worked but had some static in the line. At 9:40 we started to broadcast.   The sound traveled very well, and seemed to echo forever.   The location we were at easily helped the sound to travel well over five miles from valley to ridge top, and saddle, it covered a large area.   Very happy with the sound, we continued to broadcast a few more times before the Sightings show started. It was almost 10:00 PM when the phone rang, it was the Sightings show.   The show went fine for the first few minutes, but the static was getting horrendous, cutting Jeff Rense off completely at times.   About ten minutes into this show, Jeff asked me to try and find another location where the reception might be a little better.   A commercial was playing at the time so I quickly contacted the upper team and Manny and told then that I had to move.   I started my vehicle and drove about 600 feet towards the tree line.  I reconnected to the show and was relived that it was a better connection. I was in this new location less than 15 feet to the tree line, with visibility not over 5 feet into the trees.   I was parked for a few minutes and heard what I thought was a bear charging me (I am in a convertible) with the window down, not much protection in anyone’s mind.     I looked for my revolver and it was gone, I must have forgot it with Manny when I was in a hurry to get into a better location!   I sat there for a second, and again I heard this charging, that sounded like a few feet away from me.   This time I started my car got on the radio and told the upper team that I was moving out because of something charging me in the bush.   (Manny didn’t have a radio, as we were together at base camp and had to share two, one for base and one for the upper team). I asked the upper team “do you see anything” and they replayed no.   I decided to wait it out, as this thing could expose itself to me (although I just realized that my camera was also with Manny). The show continued on and I would hear footfalls, breaking branches and at least one grunt growl.   I kept asking the upper team if they could see anything and they kept saying no.    I at least had a flashlight, but didn’t want to use it in fear that I would scare off whatever it was. Obviously I was becoming very concerned for my safety, not knowing what it was.   But I remained there on a chance I might be able to see a Bigfoot or at least see something.   I heard the charging again and again and finally a crackle in the radio  “John it’s looking right at you, can’t you see it, it’s about 25 feet away, that ****** is huge”.   My heart started pounding FAST, and trying to carry on with this live program without sounding distracted was even harder. The other upper team member confirmed what they were looking at, it was something that was at least 8 feet tall with shoulders that were 4 feet across.   As I sat in my car, cell phone to one ear, and the other to the forest, I could hear it charge again, and that’s when they would say, “it went back into the trees”, this happened several times.  This sighting went on for several minutes, with the Squatch looking at me by moving its body from side to side trying to get a better look through the trees and brush.   It was also observed moving its arms in a quick motion as if signaling to others. This whole incident from the first charge heard to the last tree branch breaking, lasted about 30 minutes.   It was by far the one of the most intense moments in my life. That next day we did search the area and found the soil disturbed where this Squatch was spotted.  Due to the soil condition, it did not allow any prints to be left.   Judging from a tree and stump in the area, it was determined that it was at least eight feet tall but closer to nine feet.   From the Squatches point of view, it had several windows to look at me, and by moving its body from side to side it would have a clear view of my entire vehicle and me. You can listen to this event by going to sightings.com and clicking on archived shows.   Look for May 27th 2001.     The Bigfoot portion is the last hour of the show. ",
  "classification": "Class A",
  "county": "Humboldt",
  "state": "California",
  "location_details": "from 101 past Orick about one mile turn right at Lady Bird Johnson Grove (AKA Bald Hills Road).  Go up about ten miles to a Fire station located on left.   Turn down that road and continue about eight miles to a large clearcut.",
  "summary": ""
}