{
  "id": "1446",
  "title": "Deer hunters find footprints near Wahtum Lake.",
  "date": "1974-10-01",
  "timestamp": 149817600,
  "observed": "We were deer hunting near Whatum Lake, covering a ridge where we'd seen deer on previous occasions. Being the youngest I was sent up the ridge while my father and uncle went around one side and my mom watched the other side. After I broke over the top I came upon a game trail of sorts, chewed up ground but no discernable tracks. It seemed to be headed in the direction I was going so I followed it. When I came to an area that had less undergrowth I saw the tracks I'd been following. They were huge human like footprints, about 1-1/2 times longer than my boots (size 10-1/2) and were spaced farther apart than a human gait. I continued following them with the hair on the back of my neck standing up. Suddenly I saw a red hat. It was my mom, so I signaled for her to come down where I was. I showed her the tracks and she said something like let's get out of here. We followed the tracks a little farther where they crossed the road. Close to where they crossed we found a pile of feces. It resembled bear feces in that it contained berries. At that point we made a B-line for the truck. When we got there I saw my dad and uncle working a brushy draw, apparently they had seen a deer. I went up the hill towards them through an old burn area and came upon another set of the tracks. I left my orange hat there to mark the spot. When my dad and uncle came down I showed them the tracks. They both agreed they were way to big to be bear tracks. When we left down the road, we showed them where the other tracks crossed the road. At this point we were all convinced that these were bigfoot tracks.",
  "classification": "Class B",
  "county": "Hood River",
  "state": "Oregon",
  "latitude": 45.5666,
  "longitude": -121.7745,
  "location": "-121.7745,45.5666",
  "location_details": "About 1-mile from Wahtum Lake a spur road takes off to the right. We were hunting the ridge.",
  "temperature_high": 79.91,
  "temperature_mid": 67.005,
  "temperature_low": 54.1,
  "dew_point": 43.61,
  "humidity": 0.59,
  "cloud_cover": 0.47,
  "moon_phase": 0.51,
  "precip_intensity": 0.0001,
  "precip_probability": 0.16,
  "precip_type": "rain",
  "pressure": 1017.37,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 9.69,
  "wind_bearing": 241,
  "wind_speed": 1.38
}