{
  "id": "23637",
  "title": "",
  "date": "",
  "observed": "First of all, we are staying at a park that has a winding deep creek at the back of 16 + acres.. anyway today my grandchildren and their parents came out to the park to see us.  The children's parents recently bought them 4-wheelers and this is approx. the 4th time they have come to the park to ride them... Today was just like every other time they have come out to ride them. We drive our vehicles about 1/8 mile away from the actual park grounds and that's where the kids and adults ride the 4-wheelers.  We all rode back there for hours... We were making alot of noise of course with 3 children and 4 adults.  Even the owner drove back there in his pickup and stayed awhile... All I am saying is there was alot of noise and I had my Jack Russell Terrier, with me. I came back to the park area along with my husband about 6:30p.m. The kids and their parents continued to stay out there and ride.  I got a call from my son.  He told me that my 7 year old grandson had just encountered some type of large animal.  He said that he wasn't sure what it was but said it was big and looked sort of like a monkey with long hair all over it and had a bump on it's head. He said it wasn't running.  It scared him half to death and he looked behind him at his dad yelled for his help.  My son went on to say that he immediately sped up to where my grandson was and knew immediately something was wrong by the sound of his scream. He immediately got to where my grandson was on the 4-wheeler. He said that it was as if a limb had been pulled way back on a tree and then let go.  It was still moving when he got over there.  His immediate thought was, what is it? First thought was maybe a large dog, but as my grandson began to describe it standing all all fours and yet being as tall as his dad's chest...dog seemed to be out of the question.   I wondered if there are bears in Oklahoma..  We sort of dismissed it but my grandson kept talking about it. You would just have to know this 7 year old.  He doesn't lie about anything.  You can pretty much always believe him. He is a really calm, good kid who just loves 4-wheelers more than anything in life.... Anyway, we couldn't figure out what it was and his parents are trying to convince my grandson that whatever it was is gone now.... my grandson  said, \"It looked like Harry on Harry and the Hendersons movie but with a bump on it's head and it wasn't standing up. He described it as having long hair all over it's body.  He said it was the color of his hair(blonde) on part of it and dark too. Well, late tonight, my husband called my son and told him that he knew of a man in Davis, Oklahoma that had written a book about bigfoot and swears that they are in Oklahoma... It sounded ridiculous until my daughter-in-law typed into a search engine on the internet tonight.. bigfoot sightings in oklahoma..  She began to read about them and that's when my grandson said, \"that's what I saw except it wasn't standing up. Now it's got us wondering if whatever my grandson saw today, actually lives there and is upset that we have disturbed it all. I mean what animal would come that close to all that noise of 4-wheelers and people and cars and a barking Jack Russell dog? It was approx. 7:00pm when this happened today and still light outside. I don't know what to make of it except my grandson saw something that scared him bad, so much so that he refuses to do his most favorite thing....ride the 4-wheelers at Papa and Nanas.",
  "classification": "Class A",
  "county": "Carter",
  "state": "Oklahoma",
  "location_details": "",
  "summary": ""
}