{
  "id": "1055",
  "title": "Two hikers have morning sighting in the Desolation Wilderness",
  "date": "1993-04-01",
  "timestamp": 733622400,
  "observed": "First I would like to say that I'm very reluctant to tell this to anyone. I didn't report this because I thought the park service would think we were nuts, and I new of no other source that would take it seriously. I also didn't think the location of my sighting was one where other sightings had accrued until I used your sightings map. It was April 1993 when I went hiking in Desolation Wilderness with two of my friends for a bachelor weekend. We started out at the Horse Shoe Falls trailhead at Twin Bridges off of HW50 and hiked up to Lake Aloha. It was very hot going up the falls so we were very surprised to se all the snow at the top (that year we had some late snowstorms). We were disappointed because the lake still had a lot of ice on it, but not enough to walk on. We tried to walk around the lake but the deep snow and steep sides male it unappeasable. We set up camp at the south end of the lake 200 yards west of the trail near a picnic bench. We were the only ones up there that fare in except some one that went up the southern slope of eastern mountain. There was no other tracks going around the lake and to my knowledge the back way in was to far to hike in those conditions. Trevor and I woke up early  (near sun up) to try to fish in one of the unfrozen spots near the bank, but it had frozen over that night. We were looking over the lake when we noticed some one on the other side of the lake walking around. We watched him because we didn't think there was a way around the lake and were curious how he got there. That's when it walked by the picnic table across the lake and we noticed that it was a lot larger than we were judging were the table came to on it's leg compared to were our picnic table came to on us (I'm 6ft and Trevor is 6.1ft). That's when we got out the binoculars and took a better look. We couldn't ses any detail of its face but its whole body looked dark brown to black. We were arguing about what we were looking at because we didn't want to believe what were looking at. At first we thought it was a bear but it walk to well on its back feet. We thought it was a hiker but it was not quite walking like a man (judging the long strides by the bench, we could not walk like that comfortley) and how easily it moved across the snow. We went over to the tent to wake up Rob and show him but by the time we got back, he was gone. About 15min. later a lone hiker came down the southern slope of the eastern mountain into our camp and we asked him if he saw any thing on the other side of the lake and he said he watched some thing walking near the lake and then leave out through the north west side. We asked him if he saw any way we could get to that side and he said he could not see a way over. We told him about what we saw and he noticed the same thing (but not the same detail) we did. The sighting was about 10 minutes or so, and has left us a lot to think about. I don't know if it was a Big Foot or not, but after watching the famous video of the Big Foot walking, I noticed that that's the strange way we saw the \"thing\" moving. ",
  "classification": "Class A",
  "county": "El Dorado",
  "state": "California",
  "latitude": 38.86,
  "longitude": -120.1358,
  "location": "-120.1358,38.86",
  "location_details": "The north end of Aloha Lake in Desolation Wilderness",
  "temperature_high": 48.92,
  "temperature_mid": 41.25,
  "temperature_low": 33.58,
  "dew_point": 36.22,
  "humidity": 0.71,
  "cloud_cover": 0.57,
  "moon_phase": 0.32,
  "precip_intensity": 0.0006,
  "precip_probability": 0.53,
  "precip_type": "rain",
  "pressure": 1016.29,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 9.09,
  "wind_bearing": 231,
  "wind_speed": 5.35
}