{
  "id": "1342",
  "title": "Child sees a large, dark face staring at him from the bushes.",
  "date": "1977-04-30",
  "timestamp": 231206400,
  "observed": "When I was 8 or 9 years old, my sister, some friends and I were swimming in a small water hole(more like a wide spot in a creek), behind the military housing.  Probably about 400 yds. into the woods.  I wasn't swimming I was sitting down at the side of the water hole with my feet in the water but kind of drawn up beside me and my sister was sitting between my legs in the water.  We were all just playing around being pretty loud and I don't know if I heard something, caught some movement out of the corner of my eye or what, but my attention was drawn to a large bush on the other side of the \"swimming hole\". I sat there staring at this bush for a good 30 or 40 seconds maybe a full minute, before I realized what it was I was seeing.  There was a face looking at me from behind (between) some branches.  The face was very big, flat, dark brown almost black, eyes were black. I thought at the time that the eyes were looking at me with curiosity or amusement.  It didn't look evil, menacing or well you know. I don't remember a mouth or nose.  I remember the hands being huge, gigantic, the size of baseball mitts.  It seemed like I was looking at it for minutes or longer, but couldn't have been that long, and all of a sudden I was just terrified.  I picked up my sister and screaming ran out of there and everybody just followed me out. I was the only one who saw it, my friends wanted to know why I was so scared.  I told them it was Old Man Walker, (A hermit who supposedly lived way back in the woods, and would shoot at you if he saw you), and they were o.k. with that.  I didn't want to believe what I saw but it defiantly was not an old man. I found it very comforting to know I was not the only one to have seen something so frightening. Thinking about my encounter I was in no way threatened and I don't know why I was so frightened, but to this day I still wake up with night mares. Thank you.",
  "classification": "Class A",
  "county": "Lauderdale",
  "state": "Mississippi",
  "latitude": 32.3372,
  "longitude": -88.74805,
  "location": "-88.74805,32.3372",
  "location_details": "Meridian, Mississippi, Lauderdale County.  By the NAVY base, In the woods behind Military housing.",
  "temperature_high": 81.03,
  "temperature_mid": 67.55,
  "temperature_low": 54.07,
  "dew_point": 54.71,
  "humidity": 0.72,
  "cloud_cover": 0.09,
  "moon_phase": 0.39,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.17,
  "summary": "Partly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 11,
  "visibility": 8.19,
  "wind_bearing": 177,
  "wind_speed": 5.01
}