{
  "id": "7113",
  "title": "Brothers have close, long sighting of \"thing\" in Wolf Creek",
  "date": "2003-10-26",
  "timestamp": 1067126400,
  "observed": "MY brother and I were fishing on wolf creek in a area known as high shoals. This area is heavily wooded with steep terrain and a rushing waterfall. We had park our truck at the top of the hill and walk down the trail to the creek below. We had been fishing about a hour and had no luck when we decided to move upstream. We got our gear together and starting walking up the shoals and heard a large splash hit the water up ahead. We first thought it was a rock that had rolled of the side of the steep terrain when suddenly a large black/brown human like creature was slashing at the water with it's long arms. The creature never new we were there and we must have viewed him for 2-3 mins playing around in the water. We never moved only making eye contact with each other. Suddenly it darted off to the right up the steep terrain not knowing whether it had seen us or not. We never got a good look at it's face. It must have been 6-7ft. around 300-400lbs. and look very healthly. We were around 25-30yds from it. We kept this to ourselves for quite a while only shareing it with family members . We have returned to the area several times and have never seen it again but have seen unexplained markings when no bear is to be in the area.",
  "classification": "Class A",
  "county": "Carroll",
  "state": "Georgia",
  "latitude": 33.5388,
  "longitude": -84.869,
  "location": "-84.869,33.5388",
  "location_details": "The area is steep terrain in some places clear cut in some and very wooded in others. This is a very remote area with several thousands of acres. There is plenty of game in the area and a well known whitetail hunting area.",
  "temperature_high": 66.1,
  "temperature_mid": 59.935,
  "temperature_low": 53.77,
  "dew_point": 62.01,
  "humidity": 0.95,
  "cloud_cover": 0.78,
  "moon_phase": 0.04,
  "precip_intensity": 0.0172,
  "precip_probability": 0.79,
  "precip_type": "rain",
  "pressure": 1018.96,
  "summary": "Rain in the morning and afternoon.",
  "uv_index": 2,
  "visibility": 5.58,
  "wind_bearing": 110,
  "wind_speed": 2.56
}