{
  "id": "14280",
  "title": "Night sighting outside rural home near Bruceton Mills",
  "date": "2005-10-05",
  "timestamp": 1128470400,
  "observed": "My fiance B. and I just got done watching a movie, when the dogs started barking, then within 5 minutes they got really quiet, and went into their dog houses.  We thought this was strange so we opened our back door toward where the dogs were barking at a few minutes before and saw something near our mineral feeder for the cows. We live on a farm so we had an unused mineral feeder in the back yard. It looked at first that it was on all 4 legs, and as big as the outline was we assumed it was a bear, until it stood up on two legs.  Now mind you we still thought it was a bear because well you know bears do stand on there hind legs.  We had our back porch light on so we could see it, but the thing we saw was still about maybe 80 ft away.  Anyway what we thought was strange was after it stood up it heard us at our back door,and turned its head our way and when it did we saw big yellow like eyes, we looked at each other to make sure we both were seeing the same thing.  Then we saw its side arm move and it looked like it was below its knees.  When it started to walk away it walked mostly upright on 2 legs swinging its arms and still looking at us until it turned its head to the hay field and walked away. To this day we stil can't explain what we saw, but we did see it.",
  "classification": "Class A",
  "county": "Preston",
  "state": "West Virginia",
  "latitude": 39.6995,
  "longitude": -79.5375,
  "location": "-79.5375,39.6995",
  "location_details": "We live near Bruceton Mills in Preston County, WV",
  "temperature_high": 80.3,
  "temperature_mid": 69.86,
  "temperature_low": 59.42,
  "dew_point": 55.76,
  "humidity": 0.67,
  "cloud_cover": 0.19,
  "moon_phase": 0.07,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1023.51,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 4,
  "visibility": 9.06,
  "wind_bearing": 154,
  "wind_speed": 4.56
}