{
  "id": "733",
  "title": "creature observed walking weird and slightly hunched over.",
  "date": "1998-11-22",
  "timestamp": 911692800,
  "observed": "Witness and a friend were deer hunting that day. They were resting by their vehicles at approximately 1:30 pm when the witness looked north on the road (Rd. #1) and observed 2 Bigfoot crossing the road from west to east. The Bigfoot crossed from an oak hammack into an area of pines and tall palmettos. Approximately  225 yards east through the pines is a large swamp. The witness and his friend were roughly 2/10  of a mile away from the creatures when they crossed the road. The witness saw a large male, 6.5 ft. tall with light brown hair cross the road first. When the witness first saw the male he thought it was another hunter walking around without an orange safety vest on. The witness states that it was walking weird and slightly hunched over. When the second one came into view (5.5 ft. tall) it was completely black and had breasts. She also appeared to be carrying something about her waist with both hands. The witness feels she was either very pregnant or carrying a young Bigfoot. The male was 15 yards in front of the female. The witness states that the female had hairy breasts and that both bigfoot walked without locking their knees.",
  "classification": "Class A",
  "county": "Osceola",
  "state": "Florida",
  "latitude": 27.97255,
  "longitude": -81.12476,
  "location": "-81.12476,27.97255",
  "location_details": "NNW end of Three Lake Wildlife Management Area Keenansville, Florida Approx. 6 miles west on Williams Rd. then north 2.85 miles on Rd. #1. Road #1 runs parallel with the Florida Turnpike and is approximately 1.25 miles east of the Turnpike at the point of sighting.",
  "temperature_high": 79.56,
  "temperature_mid": 74.87,
  "temperature_low": 70.18,
  "dew_point": 67.52,
  "humidity": 0.82,
  "cloud_cover": 0.75,
  "moon_phase": 0.11,
  "precip_intensity": 0.0044,
  "precip_probability": 0.53,
  "precip_type": "rain",
  "pressure": 1023.17,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 3,
  "visibility": 8.75,
  "wind_bearing": 72,
  "wind_speed": 7.43
}