{
  "id": "43612",
  "title": "Woman recalls encounter she had as a youth on rural property north of Bethany",
  "date": "1979-08-01",
  "timestamp": 302313600,
  "observed": "I was visiting my Father and Grandparents during a summer school break. I was about 11 years old at the time. (It has been many years since my sighting; about 34 yrs. ago to be exact, but I remember it vividly as it was very traumatic). My Father’s home was in Ridgeway, MO and my grandparents lived about a mile away.  The area consists of vast farmland with many creeks, ponds and heavily forested areas in between. It is a very rural area with a sparse population. I was fishing alone at a pond that was located very near to my Father’s home. The sun was just starting to set, so I decided that it was time to quit and go inside. The pond was encircled with barbed wire and posts for the cows. I put my tackle box and fishing rod through the fence first and then climbed on top of the post to go over the fence myself. Just as I climbed on top of the post to jump over, I heard a loud roar/yell “Raaaah” and looked to see where it was coming from.  There is thick wood land that is on the edge of the property; probably about 100 yards away.  I spotted something on the edge of the wood line as I was on the fence post.   I was shocked at what I was seeing. I immediately knew that it was not a man, but an animal, standing on two legs upright when I saw it. It was standing just outside the edge of the wood line and had roared. It then had its elongated arms raised above its head and waving them from side to side, which it appeared to be alerting me that it was there.  It looked more man-like in face and body, but I knew it wasn’t a man. It was very tall, much taller than a normal man, muscular but thin, with sparse hair covering its body and partial face. The face appeared to be long with a pronounced forehead. The flesh that was visible appeared to be flesh tone and grayish in color. I could see skin through the fur/hair. The hair color was a brownish color with what looked like varying lengths, but very thin.  I only observed it for about 20-30 seconds as I was scared to death. The way that the property is situated is the house in the center, pond that I was fishing in to the right of the house and the wood line to the left of the house.   I had to run toward the house; which was also toward the wood line to escape inside. As I ran, I was too scared to see where the thing was and just made a beeline (tunnel vision) to the door. We never locked our doors there, but as soon as I got inside, I locked all the doors. My father asked me why I was doing this and I didn’t want to tell him as I thought they wouldn’t believe me. That night, I slept in my room on the floor in between the bed against the wall as I was so afraid. I left the next morning for my Mother’s home in Kansas City, MO. I was never so grateful to leave in my life. I had returned to Ridgeway for subsequent visits over the years and I made sure that I was never alone outside again after that sighting. My Father has since moved and Grandparents have passed away. I have not been there since 1986. I would love to go back one day and perhaps try to see it again. There was a small, old non-maintained cemetery that was between my Father and Grandparent’s home.  The wooded area is very dense.  I frequently walked the mile in between my Father and Grandparent’s homes.  Many times on the way, I would stop at the cemetery; which was overgrown with trees, grass and vines and look at the old headstones, many dated back to the 1800’s so I was fascinated. On many occasions I had heard something large moving nearby and always felt like I was being watched. I always thought it was due to the location that I was in, but after my sighting, I could not go there again with or without someone else. I have told my story over the years many times to my husband, and he has been watching BFRO for about a year now and he convinced me to write this report of my sighting for documentation. I carried my secret sighting for many years before I mentioned it to anyone for fear of disbelief.",
  "classification": "Class A",
  "county": "Harrison",
  "state": "Missouri",
  "latitude": 40.39956,
  "longitude": -94.02478,
  "location": "-94.02478,40.39956",
  "location_details": "Harrison County around Ridgeway, MO",
  "temperature_high": 80.3,
  "temperature_mid": 72.865,
  "temperature_low": 65.43,
  "dew_point": 63.26,
  "humidity": 0.73,
  "cloud_cover": 0.42,
  "moon_phase": 0.27,
  "precip_intensity": 0.0001,
  "precip_probability": 0.36,
  "precip_type": "rain",
  "pressure": 1015.54,
  "summary": "Partly cloudy until evening.",
  "uv_index": 7,
  "visibility": 8.31,
  "wind_bearing": 347,
  "wind_speed": 4.55
}