{
  "id": "26919",
  "title": "Early A.M. sighting returning home from family event",
  "date": "2009-11-24",
  "timestamp": 1259020800,
  "observed": "I had just dropped my father off at his home at 1:50 AM in De Soto Missouri as I made my way down from Highway B onto NN heading north to my hometown Pacific MO. I was taking my time down NN traveling at around 30 mph to avoid any deer collisions due to the fact it is deer season.  I had seen frequent deer so I am very keen with knowing what animals in a field look like, especially through the peripheral vision of car headlights. I was about 5 miles from the Franklin County line when I saw a rabbit dart across the road and I slammed the brakes to avoid hitting it. I was at a 5 mph rolling stop when I looked where the rabbit had run from and I saw a 7 to 8 foot tall ape like animal running on it's hind legs at my vehicle as if it were aggressively charging at me. I did not get a look at it's face other than the clear outline of the creature. I was very frightened at the site, and the sense of knowing it was an animal not native to Missouri, and it had just made me start to reconsider what I had just seen. I have recently heard of the Missouri MOMO, and I have been very skeptical about it. I would like to know what animal in Missouri could run at that speed on it's hind legs, surely a Bear cannot. I also cannot understand why I would have angered a Bear in anyway from just stopping in the road. I debated on whether or not I should report this, because a lot of people treat you like an idiot when you tell them what you saw. I thank you for taking the time to read my report. ",
  "classification": "Class B",
  "county": "Jefferson",
  "state": "Missouri",
  "latitude": 38.4063,
  "longitude": -90.7357,
  "location": "-90.7357,38.4063",
  "location_details": "http://maps.google.com/maps?hl=en&q=cedar+hill+mo&ie=UTF8&hq=&hnear=Cedar+Hill,+Jefferson,+Missouri&gl=us&ei=YFQKS92QOIO6NY-v3LYK&ved=0CAgQ8gEwAA&ll=38.387688,-90.725956&spn=0.044335,0.076475&t=h&z=14",
  "temperature_high": 53.75,
  "temperature_mid": 49.03,
  "temperature_low": 44.31,
  "dew_point": 45.1,
  "humidity": 0.82,
  "cloud_cover": 0.89,
  "moon_phase": 0.25,
  "precip_intensity": 0.0096,
  "precip_probability": 0.88,
  "precip_type": "rain",
  "pressure": 1013.06,
  "summary": "Rain until afternoon.",
  "uv_index": 1,
  "visibility": 8,
  "wind_bearing": 200,
  "wind_speed": 7.41
}