{
  "id": "27035",
  "title": "Man recounts childhood incident at his home on Oneida Lake",
  "date": "1972-10-28",
  "timestamp": 89078400,
  "observed": "When I was 11 years old I was living with my mother and step-father in upstate New York. Our home was on the shores of Oneida Lake and bordered the southern boundary of Verona Beach State Park. One evening shortly before Halloween I had gone to bed late about 10pm. The window in my bedroom was directly behind the head board of my bed, and one of only three street lamps beamed light through this window. The height of the bottom of the window frame was approximately 6 feet above the ground. My bedroom window was also the only window in the house that faced our neighbor's house. The neighbors house was about 8 to 10 feet away with no french between the properties. On this particular night the light from the street light shown brightly into my bedroom and lit the entire room well enough to almost be able to read by its light. A few minutes after going to bed a \"figure\" moved into the light and cast a huge shadow on the opposing wall of my room. I amassed that this figure had to be standing with in only a few feet of my bedroom window do to the sharpness and size of the shadow. Also, considering the size of the shadow and the height of my window above the ground the figure had to stand at least 7 to 8 feet tall to cast such a shadow. I froze in my bed (and embarrsingly enough, I had wet myself in fright). I could not muster the strength to look out the window, I simply froze. the shadow remained for all of about 20 to 30 seconds, then it was gone. About three to four minutes later heard a very loud crash of wood and metal as someone or something had ripped off the door to our back storage room. I heard someone or something moving items, then I heard the big freezer chest open (and the toys I had left on the freezer fall to the ground). Again, I was still frozen with fear and in my bed, and could not moved. There were some loud bumps and bangs as if something was throwing bricks around the storage room (our storage room was approximately 16 feet by 32 feet and attached to the back side or lake side of the house). After the banging stopped the freezer lid slammed shut and all banging stopped. Later that night my step dad and mom had come home from work around 3am (they owned the restaurant a few blocks away) and started screaming and my mom was very very panicked. My mom called one of her friends that was also a good customer and was a State Trooper. I don't know what was said between them. The next morning my step dad and two of his friends were trying the fix the door to the back room. This is when I first saw the damage done. The room looked as if it were turned upside down, then right side up. My step dads large roll-away tool box was on its side and on the other side of the room, and packages of frozen meet were all over the place. A car transmission had been tossed as if a toy. The freezer had some faint scratches on the side and on the lid, but no tool marks or pry bar marks (my parents normally kept the freezer locked). These same scratches were located on the side of the house and the removed door. Missing were packages of my mom's frozen strawberries, and two frozen turkey's. None of the prepackage streaks or hamburgers, or lobsters were taken (they used this freezer as a back up to the freezer at the restaurant). The State Trooper friend of my Mom's said that it looked like three or four people had to of done this, but could not offer an explanation to the faint scratch marks. When I told my mom of the shadow figure my mom would only start to cry and hug me, saying we were so lucky that God had protected me from this situation. Of note was the conversation between my step dad and our neighbor. Our neighbor told my step dad that he too had seen some kind of shadowy figure moving between the houses. Our neighbor said he had tried to let his dog out to investigate, but the dog would not go outside. But as soon as the figure appeared, it had gone away, and he had gone back to watching tv. Our neighbor did not hear any of the knocking or bangs in our back room. At this age I had not ever heard of Bigfoot. But later, (the next spring) the other boys were talking about a \"monster\" called bigfoot that had been on TV, and for the first time (since that night)I froze again in fear (for a few seconds this time) and somehow knew what they were talking about, and what they were describing.",
  "classification": "Class B",
  "county": "Oneida",
  "state": "New York",
  "latitude": 43.1546,
  "longitude": -75.73906,
  "location": "-75.73906,43.1546",
  "location_details": "This occurred along the shore of eastern Lake Oneida area adjacent to the southern boundary of Verona Beach State Park.",
  "temperature_high": 58,
  "temperature_mid": 54.13,
  "temperature_low": 50.26,
  "dew_point": 46.8,
  "humidity": 0.85,
  "cloud_cover": 1,
  "moon_phase": 0.72,
  "precip_intensity": 0.0087,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1017.74,
  "summary": "Rain starting in the evening.",
  "uv_index": 1,
  "visibility": 5.46,
  "wind_bearing": 137,
  "wind_speed": 4.25
}