{
  "id": "11956",
  "title": "Unusual events at remote family cabin near Keene Valley, NY",
  "date": "2005-12-28",
  "timestamp": 1135728000,
  "observed": "I didn't have an encounter exactly but we are owners of a camp in a remote region of the Adirondack Mountains.  This camp is only accessible by hiking to it.  There is rarely anyone ever around our camp.  We have found strange things that have occurred. 1) Fall 2002: We went hiking for the day  and when we got back we found a small pile of rocks at the back door that were neatly stacked with a stick coming out of them.  These rock were not there when we left.  They appeared to be deliberately stacked.  We understand that these could have been made easily by a human, but there is never anyone around up there. 2)  Fall 2003: One night around 7:30 pm (dark) my wife and I  went outside with 2 dogs.  We smelled something very strong and musty, like nothing we smelled before.  It wasn't the dogs or anything we could identify.  The 2 dogs got very antsy and wanted to go inside right away.  This was very strange and freaky, these dogs are generally not scared dogs.  They also are large dogs about 80 lbs. each. We had never seen them act this way.  When we bring them out at night or day they run all over the woods this night they wanted nothing to do with that.  Almost like they smelled something that scared them. 3)  The same exact night as number 2.  I went outside around 9:30 pm to relieve myself.  While I was doing that I heard large heavy stomping behind me. The stomping was loud and heavy as if something was fleeing.  The strange part is it sounded like it made 4-5 bounds then stopped.  I heard nothing else after that.  I looked around a little but the happenings of this night made be uneasy so I went inside and locked up the cabin. I don't know what did all of this and maybe it is easily explained away but these things altogether make me think it might have been a bigfoot.",
  "classification": "Class B",
  "county": "Essex",
  "state": "New York",
  "latitude": 44.1856,
  "longitude": -73.8094,
  "location": "-73.8094,44.1856",
  "location_details": "",
  "temperature_high": 32.97,
  "temperature_mid": 31.39,
  "temperature_low": 29.81,
  "dew_point": 22.45,
  "humidity": 0.89,
  "cloud_cover": 0.74,
  "moon_phase": 0.91,
  "precip_intensity": 0.0013,
  "precip_probability": 0.9,
  "precip_type": "snow",
  "pressure": 1009.26,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 8.87,
  "wind_bearing": 97,
  "wind_speed": 3.44
}