{
  "id": "9137",
  "title": "Route driver has early morning road encounter near Atlanta",
  "date": "2004-08-10",
  "timestamp": 1092096000,
  "observed": "I was headed north on Hwy 59 into Atlanta, Texas.  I was the only one on the road for as far as I could see.  I came to an S curve in the road.  It went to a curve to the right and then back to a curve to the left.  I made the first curve and when I was coming aroung the other curve I saw this huge beast just step over a six strand barbed wire fence. I slammed on my brake and then just took off. I was scared to death.  This was no man and damn sure not a bear.It had to be at least 8 to 8 1/2 feet tall and weight no less than 500.bs. I weigh 230lbs and it was at least twice my size! It's hair was a really dark brown and not as long as I thought it would be. It looked to be covered with 6 to 8 inch hair. It's chest and abdomen didn't seem to be as hairy and I could see it's eyes, nose, and mouth, so I assume they were not hairy either.  As I've said before when I made the curve it was stepping over a 4' fence like it was nothing.  It saw me and didn't run, but just turned it's head and continued to walk down the fence line.  I should have taken a longer look, but I was really freaking out at this point so I just drove on into Atlanta.",
  "classification": "Class A",
  "county": "Cass",
  "state": "Texas",
  "latitude": 33.07639,
  "longitude": -94.25694,
  "location": "-94.25694,33.07639",
  "location_details": "I was on Hwy 59 heading north into Atlanta.  I couldn't have been more than 2 to 5 miles south of Atlanta at the time. I only got a look at it for no more than 4 or 5 seconds.",
  "temperature_high": 93.44,
  "temperature_mid": 82.99,
  "temperature_low": 72.54,
  "dew_point": 68.15,
  "humidity": 0.68,
  "cloud_cover": 0.13,
  "moon_phase": 0.83,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.55,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 9,
  "visibility": 7.46,
  "wind_bearing": 7,
  "wind_speed": 0.89
}