{
  "id": "50160",
  "title": "Gibberish-like talking heard at a residence near DuPont",
  "date": "2012-06-01",
  "timestamp": 1338508800,
  "observed": "In June of 2012 my son woke me up at approximately 3 am telling me that he heard whispering somewhere around the house. I told him to go back to bed because he was dreaming. within minutes I heard the whispering as well. I grabbed a flashlight and left my bedroom which is on the second floor of my house. My son immediately asked me if I heard the whispering as well. The \"whispering\" sounded like someone was whispering loudly and it sounded like a foreign language or gibberish of some sort. I first thought that is was outside in my back yard but wanted to clear my house first to be sure someone wasn't in my home. shortly after looking around my house I the whispering stopped. five or six days later  on July 4th I was in my back yard getting ready to cut the grass when I noticed the area of my yard where the grass was higher was trampled down and there was a feces pile in the grass. I have seen scat from most all of the animals in my area and this didn't appear to come from any of them. It was very large, black and looked like it came from a human. my first thought was that someone took a crap in my yard. I then called my son to come take a look and he reminded me of the whispering that had taken place days earlier. I was watching finding bigfoot one evening and I heard Bobo talking about squatch's speaking gibberish and it immediately made me think of that incident. April of 2015 my dog woke me up wanting to go out side to go potty at around 2-3 am. while outside i heard what sounded like a baseball bat or something striking a tree two times in the wooded area to the east across the road from my house. this past May my daughter and her boyfriend also experienced something strange while walking a trail  to my house. I wont post it here as it is her story and I don't want to speak for her on record but am happy to provide the story verbally.",
  "classification": "Class B",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 47.09982,
  "longitude": -122.6246,
  "location": "-122.6246,47.09982",
  "location_details": "",
  "temperature_high": 66.05,
  "temperature_mid": 59.675,
  "temperature_low": 53.3,
  "dew_point": 57.4,
  "humidity": 0.88,
  "cloud_cover": 0.86,
  "moon_phase": 0.4,
  "precip_intensity": 0.0087,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1014.11,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 8.64,
  "wind_bearing": 221,
  "wind_speed": 4.5
}