{
  "id": "14982",
  "title": "Jefferson Head encounter by community service group",
  "date": "2006-11-03",
  "timestamp": 1162512000,
  "observed": "On 6/10/06 My daughter and 8 youth from the Suquamish Tribe we doing beach clean up at Jefferson head. At about 2:00 p.m. the girls started hearing what sounded like a woman or animal sreaching and screaming, The sound made them very uncomfortable and some of the girls returned to the adults who were on the other end of the beach. My daughter says here friend Cori spotted it first it looked like to them  nothing they had seen before. With parents who hunt the are aware of what wildlife look like and are certain it was no bear. It walked out of the marsh and seemed to be startled with the girls as it tried to quickly duck behind a large piece of drift wood. It did not run away it continues to watch the girls from a crouched position,poking his head out from the side of the wood. The girls ran to the van and demanded to leave the Beach. We had heard stories and believe them to be out there. It is said by the elders of our Tribe that it is a blessing for one to show its self to You. Cheayvone My daughter who is 18 was  terified to speak about what she saw. I was able to days later calm her down and she told me about it.She said it reminded her of Big Foot from That harry and the henderson movie. only it looked like it was on crack. Light brown hair on its face with the tips almost dark brown. She says it was about 2 blocks infront of her.(thats her way of telling me how far away it was)",
  "classification": "Class A",
  "county": "Kitsap",
  "state": "Washington",
  "latitude": 47.74897,
  "longitude": -122.4966,
  "location": "-122.4966,47.74897",
  "location_details": "",
  "temperature_high": 58.82,
  "temperature_mid": 56.935,
  "temperature_low": 55.05,
  "dew_point": 52.73,
  "humidity": 0.9,
  "cloud_cover": 0.97,
  "moon_phase": 0.44,
  "precip_intensity": 0.0229,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1006.74,
  "summary": "Breezy until afternoon and light rain in the afternoon.",
  "uv_index": 1,
  "visibility": 8.42,
  "wind_bearing": 162,
  "wind_speed": 14.41
}