{
  "id": "17847",
  "title": "Possible late night vocalizations heard outside Redmond",
  "date": "2005-10-12",
  "timestamp": 1129075200,
  "observed": "I was lying in bed, trying to go to sleep, when I heard an unusual sound from outside through my partly-opened window.  It sounded like a cross between a person moaning, a dog howling, and a cat growling (the timbre was human-like and in human vocal range, it was a high-to-low pitch sound like a howl, and there was a hint of growliness underneath that sounded like an angry cat, but much larger).  It sounded almost like someone moaning \"booooooo\".  The \"b\" sound was faint, but definitely present.  Each vocalization was about 5-6 seconds in length, with about 5 seconds between each.  It didn't seem very loud, but it also was not faint. I listened for several seconds, then got out of bed to peek out the window.  My front yard is well-lit by a streetlight, but I didn't see anything.  I have very bad eyesight, though, so after looking and listening for a minute and seeing nothing obvious, I went to get my glasses.  I noticed my cat was staring at the window very intently, not moving.  Normally when he hears a noise outside he will ignore it, glance over casually, or watch intently with his tail switching.  He didn't move a muscle. I looked out the window, through the blinds, with my glasses on but still saw nothing.  Being very familiar with the noises of dogs, cats, and coyotes (howling, fighting, mating, growling, etc.), I was spooked when I could not place the sound.  The next day I also looked up sounds for different types of owls, bears, and large cats--no matches. I went to my parents' bedroom to wake up my mom.  My bedroom is at the front of the house, and theirs is at the back (both on the 2nd floor).  I was shocked to hear the noise just as clearly from their room, echoing around the neighborhood.  From my room it just didn't seem that loud.  This makes me wonder if whatever was making the noise was really at the front of the house, or if it was elsewhere in the neighborhood and the sound carried. By the time I awakened my mom I had been hearing the sound for about 4-5 minutes, at fairly regular intervals of no more than 10 seconds.  When she got up I told her to listen to the noise and asked her to come to my room (since I still thought the creature might be visible from my window).  She went to the window and quickly pulled up the blinds and opened the window (which made quite a bit of racket).  We saw nothing, and the noise immediately stopped.  I never heard it again that night, or any night after. It was somewhat simliar to the Mississippi recording.  If my neighborhood were in a more sparsely populated area, I would probably be much more certain of the possibility that it was a sasquatch.",
  "classification": "Class B",
  "county": "King",
  "state": "Washington",
  "latitude": 47.6597,
  "longitude": -122.105,
  "location": "-122.105,47.6597",
  "location_details": "Neighborhood is near Marymoor Park (640 acre county park), which is linked by sparsely populated, wooded areas to the Cascade foothills about 10 miles away.",
  "temperature_high": 58.7,
  "temperature_mid": 54.71,
  "temperature_low": 50.72,
  "dew_point": 47.26,
  "humidity": 0.81,
  "cloud_cover": 0.71,
  "moon_phase": 0.33,
  "precip_intensity": 0.0016,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1019.48,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 9.61,
  "wind_bearing": 159,
  "wind_speed": 6.6
}