{
  "id": "29139",
  "title": "Afternoon sighting while hiking at Mahlon Dickerson Reservation",
  "date": "2013-02-15",
  "timestamp": 1360886400,
  "observed": "On April 15, 2011 my sons and I were camping at Mahlon Dickerson Reservation near Jefferson Township, NJ. The temperature was approximately 52 degrees and the day was overcast. At around 3 PM the three of us struck out from our campsite directly into the timber. There was no overgrowth and the trees were still bare. This is the reason we didn’t take any of the marked trails in the area. The terrain is very rocky and over the next hour we hiked and climbed. Circling back into the camp area we emerged at the far end and headed toward the road that runs the length of the campsite. From our position on the road, immediately to our right would be the beginning of a two-way trail. The lower trail heads off and skirts the bottom of the mountain while the upper trail heads up it. As we got to the road I looked over my right shoulder (Why I did this I still do not know. In other words, there was no noise that I heard or any other reason I can think of that made me turn around). There, at the beginning of the upper trail was a tall bulky black figure. It moved from right to left. Its arms were long and swung in large motions as it walked. The head was dome shaped and very close to the shoulders. In fact, it seemed that it would have had to turn its entire body to look in any direction other than straight ahead.  It walked out of site rather quickly. I was completely caught off guard when I saw it. My very first thought was why is this guy walking up the trail wearing black from head to toe? That’s when it hit me that no one would. Sure there are hikers and mountain bikers on the trails but not at this time of year during a work day. In fact, we had spent the previous night here and were the only campers on the grounds. There had been no visitors to the grounds the entire day save one woman who came to walk her small dog. The next thought that ran through my mind was how big it was. It did not appear to be exceptionally tall (not eight feet tall anyway) but the sheer girth of the thing was impressive. It seemed to me that it could have wrestled a bear and easily won. I have to admit that it took me a few seconds to gather my wits once it had moved out of sight. Once I did I told the boys to stay behind me and we moved up to where I had seen it. Once we reached the area I looked to the right where I had first seen it come into view and got another small surprise. I had thought it was walking along the upper trail when I first spotted it. However, that trail began where I had first seen it. The direction it came from was an off trail wooded area. We did follow the trail for about ten minutes but I decided to abandon it and head back to camp when the kids got spooked. On the way back I had my 12 year old, 155lbs, 5’6” son stand at the top of the trail where I had first seen the thing while I went back to my original spot where I first saw it. Whatever I saw that day was an easy 12” taller and three times bigger around than my son. Those are the facts. Now, I have to add that my impression of this thing was one of curiosity. I had been having a feeling, not an overwhelming feeling but a feeling none the less, that as we hiked off trail that day we were being watched. I never felt threatened or perceived any danger or I certainly would have moved my boys right out of there. It seems to me that it had been watching us and once we had left its area and gotten back to ours it was more than happy to move on its way.",
  "classification": "Class A",
  "county": "Morris",
  "state": "New Jersey",
  "latitude": 41.01941,
  "longitude": -74.57013,
  "location": "-74.57013,41.01941",
  "location_details": "Mahlon Dickerson Reservation",
  "temperature_high": 52.58,
  "temperature_mid": 42.92,
  "temperature_low": 33.26,
  "dew_point": 29.18,
  "humidity": 0.65,
  "cloud_cover": 0.38,
  "moon_phase": 0.19,
  "precip_intensity": 0.0004,
  "precip_probability": 0.35,
  "precip_type": "rain",
  "pressure": 1014.62,
  "summary": "Mostly cloudy starting in the afternoon.",
  "uv_index": 3,
  "visibility": 8.59,
  "wind_bearing": 233,
  "wind_speed": 3.85
}