{
  "id": "26759",
  "title": "Two hunters describe vocalizations, stalking, rock-throwing, near Elbe",
  "date": "2008-11-19",
  "timestamp": 1227052800,
  "observed": "My friend and I were hunting East of Elbe, WA in Nov 2008. We had just pulled up at our spot and were unoading our gear when we immediatly started hearing a strange sound coming from the treeline behind us. It was a whooping, tongue clicking type of sound and it was really creepy. Reminded me of the ape cage at the zoo except for the weird sound at the end. We started making similar sounds back at it and it started answering us. Then, we heard it walking north in the treeline while continuing to make the sound.  We grabbed our guns and jumped back into the truck. It made it's way around to the other side of where we were but never stepped out into the open. After a few minutes, we heard and felt a thud on the road about 20 feet from our truck. We locked and loaded our guns and went to check it out. There was a small boulder in the middle of the road that was not there a few minutes before. I could tell it had been thrown there due to the fresh indents in the ground and marks on it. We scanned the area and the sounds started again, this time from the treeline on our right. The fog was lifting and we walked towards the area the sounds were coming from. All of a sudden, we heard something very big moving through the forest away from us. It was breaking tree branches and we could hear it walking through the underbrush. We headed back to the truck and got in to talk about what had just happened. We were both freaked out and our adrenaline was really pumping. We stayed in the truck for a while until the sun came up shortly afterward and started burning off the fog. We briefly looked around the area but didn't find any sign. We both knew it had to be a sasquatch and decided to leave the area and hunt somewhere else. After reading reports on this website, the sounds we heard were similiar to sounds heard by other witnesses so I'm 99.9% positive it was a sasquatch.",
  "classification": "Class B",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 46.81398,
  "longitude": -122.0571,
  "location": "-122.0571,46.81398",
  "location_details": "Please keep location private. (Specific directions edited per the witness request)",
  "temperature_high": 52.12,
  "temperature_mid": 46.035,
  "temperature_low": 39.95,
  "dew_point": 38.38,
  "humidity": 0.79,
  "cloud_cover": 0.46,
  "moon_phase": 0.74,
  "precip_intensity": 0.0013,
  "precip_probability": 0.79,
  "precip_type": "rain",
  "pressure": 1021.53,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 8.86,
  "wind_bearing": 27,
  "wind_speed": 3.62
}