{
  "id": "26065",
  "title": "California BFRO researcher has sighting with a thermal imaging unit in Wenatchee National Forest",
  "date": "2007-08-18",
  "timestamp": 1187395200,
  "observed": "It happened close to midnight on August 18, 2007, on the last official night of a private expedition, east of Mt. Rainier in the Wenatchee National Forest, of Washington State. Out of respect for our WA-BFRO crew's primary Central Washington State research area, I've purposely withheld the exact location and am using \"Chinook Pass,\" which covers a broad general area. The event was both a weekend social gathering as well as a field expedition with one main base camp and several satellite camps over a 10-mile area. The area (which I initially felt was very dry aside from several marshy areas nearby, contained a tremendous amount of elk sign) has been used for a previous BFRO expedition as well as other private outings. It's been a consistent “hot zone” for our WA crew, who, lacking sophisticated heat-sensing equipment, have experienced a lot of curious activity over the years including purported vocalizations, wood-knocking, powerful footfalls, branch breaking, persons being paralleled, etc. and several documented sightings nearby within the BFRO database. In attendance were various members of both WABFR (Washington Bigfoot Field Research Group) & a majority of WA-BFRO researchers. A few of us CA-BFRO members were invited and held the furthest base camp from the main camp & shared that particular site with various WA bigfooters. A matter of fact, on any given night our camp held about 14-15 people with many walking back and forth only on the primary dirt road to the closest adjacent camp about one mile away. During the first two nights, there was no activity to report from my perspective other then some of the best barred owl vocalizations I've ever heard in my years in the field. For most of that Saturday, August 18th, I spent the day in Seattle with my friend Jamie J, picking up his son and we returned to the camp location around 5:30 PM. At around 11:00 PM our site held about 13-14 people (most of them researchers) who were consolidated in one small area. Everyone was congregated into this section of the camp that was bordered by vegetation on the backside in which there was a berm and trail running parallel right behind that vegetative border. Being a little antsy and not much in a socializing mood, I took a walk down that back pathway about 100 yds, (which was pitch black on a dark night with plenty of tree cover) to relieve myself. 30-40 yards further down that pathway the trail led to a swampy marsh & was broken up by denser vegetation & ponderosa pine (see map picture for camp layout). In the middle of urinating I was facing towards camp and heard a very close step-branch break at my eight-a-clock, 6-7 yds from me that did not give me the immediate impression a large subject was responsible. Casually walking back to camp and not hearing anything further, I asked one of my best friends & research partner, former BFRO researcher Cliff B., if I could borrow his X200xp handheld thermal imaging unit to scout around camp & see if I could see the subject responsible for the branch break on the pathway I'd just returned from. He immediately obliged and we walked to his truck, which was located about 30 yds behind the current congregated area in the opposite direction of that same pathway. When I received it, I immediately walked to the front of that pathway near where our tent was placed perpendicular to the trail and my companions congregation area was to my left about 20 yds in front of me down a small berm. As I could hear Cliff reshuffling equipment around the back of his truck, I put the imager to my eye to tune it and while doing so caught a glimpse of a small wood rat running 10 yds in front of me to the right. Straight ahead, I caught the heat signature of what I initially thought was a person standing behind a tree, beyond my party where it was pitch black. My initial impression did not change for about 20 seconds with the combination of only seeing about 10-15% of the subject. (partial legs, arms, knee & head were contrasted behind that biggest tree in view: see re-creation pic # 2) The subject then began to move its head right to left behind the tree repeatedly as if to possibly discern me or my presence more clearly. It then stepped out in plain view and dropped to \"all fours\" positioning, (see re-creation pic #3) looking over its left shoulder rotating its head in my direction as if to \"lock-in\" with arms fully extended and knees down. The second when it stepped out before dropping, the realization of what the subject was hit me and my reaction was a \"surreal\" shock considering the unexpected circumstances. When on the ground, the subject transitioned very rapidly to where it appeared it was now full body down favoring its right shoulder, rapidly moving and appeared to actually be inching up away from the tree it was initially behind & into a bit of a clearing from my perspective view. Knowing that the thermal unit I had was not self-recordable like a camcorder (at that time, to record video, our set-up was a back-pack attached to your front side containing a mini-DVR, connecting battery with plug-ins and helmet mount for the imager) I began snapping my fingers whispering loud \"Cliff,\" \"Cliff\" as I could hear Cliff repacking his truck about 30-35 yards behind me at a seven-a-clock position- back left. As I did that, the subject, who was grounded, still leaning off the right shoulder, began an almost unnerved & panicked, full-body convulsive movement obviously reactionary to the sound of my snapping fingers and voice (see re-creation pic #5). Oddly enough, it would pause-freeze in between those intervals and I was blown away that it appeared to react to my minimal sound, while my party (almost halfway between our line of site) was making a considerable amount of noise with conversing & acoustic guitar-playing. Cliff never responded in my cautious 5-6 attempts to get his attention and the subject further transitioned on the ground into what appeared to be a \"breaststroke\" uniformed-like motion (see re-creation pics #6 & #7). \"It\" was on its knees, head straight, facing toward a nine-o-clock position from my point of view, slightly down, back straight with clear space in between front torso and ground and violently swinging back what appeared to be both arms in a stroke-like motion. The hand positioning from my view (looking at the left arm) appeared to be positioned as if having four fingers held tight together and a thumb spaced away or extended, but I'm not absolutely certain. I could clearly see the subject repeat this movement 3-4 times and it appeared as if the large upper-body was being held up by the subject's abdominal muscles by the positioning and vertical space between the upper torso and ground. From this position, the subject got back down completely on the ground on its right shoulder and held an open hand above its face (facing me) as if \"blocking the sun from its eyes.\" (see re-creation pics #8 & #9) I could even make out pretty clearly, five spread digits on the left hand up by its face. From this positioning the very agile subject appeared to \"pop-up\" from the ground clearly using no arms and quickly backed behind the initial tree I first witnessed it from. Again it looked at me right to left with its alternating head on both sides of the tree before dropping right back to the ground behind that same tree. It immediately came back up with what appeared to be the benefit of one arm which I believe was its right (am not certain because of how quickly it got up). Within seconds, it had quickly moved a few feet further back in the clear with its back clearly to me and what looked like the left leg slightly forward (see re-creation pics #10 & #11) and remained completely motionless for the next 40-45 seconds or so. Now I could clearly see the full profile of the subject (estimate about 90%) from about just below the calves up. Remarkably, I do not recall actually seeing its feet from my vantage point during the entire encounter. I can remember just repeating to myself under my breath, over and over, \"Oh my god, oh my god, I can't believe it's really happening, right now.\" Its appearance (even with a white thermal profile) was absolutely remarkable & distinct with uneven weight distribution. The subject appeared to clearly possess about 2/3rds of its body weight in the upper extremities. It was obvious that the subject was predominantly bipedal by its build, though its movements on the ground just prior appeared agile, fluid and effortless. The subject's legs were fairly long but not particularly bulky in relationship to the massive torso above the waist as the bulk appeared from the waist up into just these massive shoulders & traps with no visible neck and what appeared to be from behind-- a smallish-rounder head (no discernable sagittal crest). The arm length was astonishing in that they looked \"exaggerated\" and appeared to hang as low as the subjects knees and possibly even further. A matter of fact, my guess would have its fingertips if completely extended (large hands seemed almost fisted) reach mid-to top calves. That impression was slightly thrown off a bit by the discovery the next day in daylight where it appeared the left foot had stepped over a small foot deep berm (while subject's back to me) just beyond the 10-15 yard window the subject stayed in during the whole encounter. The physical impression beyond that small berm, visually appeared to match the distance the subject was from me the night before and was also in wet thick pine-needle duff after raining all night. After about 40-45 seconds of just staring at this basically, glowing live \"statue,\" I had an extremely difficult decision to make--either continue watching the subject until it departs or attempt to document it by taking the imager from my eye, run back and notify Cliff to set-up for recording capability while praying the subject wouldn't leave in the process. I chose the latter, and it was one of the most difficult but unregrettable things I've done in my life. The last image I have of this subject was seeing it in that \"departing\" position (never saw it leave or even move again, just stood there glowing through the imager). I immediately ran towards Cliff, who was still at the back of his truck and was just screaming at him words I don't recall but must have been obvious as he moved very quickly in what I needed him to do. To my chagrin, looking back from where I came, the guitar playing had stopped and I could here a variety of scattering voices from my party and movement, including two people with headlamps on totally oblivious to what was happening, while walking up the small berm and into the line of sight between where I stood opposed to the subject during the encounter. In a panic, and without much of an explanation other then \"I just saw one, get back,\" I attempted to pull everybody back into the congregation area and continue with what they were doing minutes earlier. I had to physically pull some people back who began curiously looking down that pathway behind the congregation area. I knew Cliff was moving quickly and within minutes, saw him fully geared, running quickly back down the path towards where I last witnessed the subject standing. For the few minutes he was back there, my heart was racing from adrenalin & I was still cautiously optimistic Cliff would maybe catch the subject loitering or even departing. Unfortunately, after about 5 minutes he came back & looked at me shaking his head. About an hour later, close to 1:00 AM, Paul G. (WA-BFRO), walked back to the spot so we could interpret actual distance of the subject from my positioning during the encounter. As I saw him walk back to the initial tree it was behind, I yelled, \"stop,\" and he estimated the distance using his own steps at about 150 ft (50 yds). (After returning to this exact area the weekend of September 17-20th 2009, through exact measurement we determined that I first witnessed the subject at around 50 yds with a slight right to left angle, but worked my way up to only 33 yds from the subject with a line of sight from right to left-opposite ends of pathway). Seeing him stand there made my jaw drop as I know Paul is 6'3 & 170lbs, and it was a shock to see him \"fully clothed\" & realize the size discrepancy between both he and the subject. I'd estimate the subject at 4-7 inches taller, but even conservatively estimating its size in comparison, it was about 3 times the total body mass of Paul G. Even with the depth perception issue of this particular proprietary unit I was experienced with, I knew the subject was big once it was in the clear with its back to me, but was shocked how much thicker and oddly proportioned it was compared to Paul. I've always been great estimating people's height and poor estimating people's weight, but by comparing Paul within one hour after and the encounter so fresh in my mind, I'd estimate the subject I saw as being close to 7 ft (maybe 6'9 or 6'8) and between 475, to as much as 575 lbs. As I said earlier, the next day in daylight, what looked like a foot impression dug into heavy, wet duff was first noticed by Jamie J. and looked to be about where the subject had its back to me and left leg slightly forward. Except for the placement, it was unimpressive. Although there was heavy overnight rain, Jamie also found where the ground had been disturbed in several places where the subject had been transitioning on the ground. All of this surface was non-conducive substrate for any kind of attempted casting however and made up of wet, rain-soaked, pine needles. (to see the type of ground cover & me reenacting the subject's movements see second to last picture) It should also be mentioned that 10-15 minutes after the encounter, a female WA-BFRO member thought she was paralleled while walking away from our camp with her boyfriend on the primary vehicle road. Another CA member later heard heavy footfalls several hours later about 30 yds from where I witnessed the subject, and in the early morning hours of about 3:30-4 AM, in a heavy rain, two of us in separate tents heard large (powerful) bipedal footfalls outside our tents (confirmed next day) followed by what sounded like guttural \"doe-like\" grunts. Outside of my tent was a stationed 250D Raytheon thermal imager facing down the pathway of the encounter, but the subject never came close to breaching that pathway (was well behind opposite side of tent) & would've made little difference if it had as the battery life for that unit does not exceed 2 to 2 1/2 hours. Six of us also stayed in the camp one more night (August 19, 2009) and the night was uneventful around camp. But undetermined vocalizations (possibly barred owl) came from the ridge behind us (several miles away) well into the morning. \"RE-CREATION\" picture links in sequence below: (Note)--All \"Re-Creations\" were done taking a digital color picture of the immediate sighting location & the roughly 15-yard window the subject remained in the whole encounter, making it black & white to give a generic \"thermal effect.\" The subject was colored in using whiteout and should not be gaged by recurring size in each individual re-creation as my artwork has limitations. The idea was to give the reader/viewer a general impressionist view focusing on the various subject positioning I recall & a general idea of how the subject visually appeared to me. All re-creations were completed by me within two to three weeks after the encounter (late August to early September 2007)          Link to Canadian artist Brian Cundle's poster rendition of the sighting event: http://northamericanbigfoot.blogspot.com/2010/09/brian-cundle.html ------------------------------------------------------------------------------- More details, potential insight & subjective interpretations from my perspective regarding the subject during the encounter. --At no time did I hear or see the subject vocalizing in any manner ---From the time I first saw the subject behind the tree until I took that imager off my eye while it was in a \"frozen\" but \"departing\" position, the subject remained within about a 10-15-yard window during the whole estimated two-plus minutes of the encounter. --Although it's probable based on time and location, I'm not 100% certain that the \"step, branch break,\" down the trail 5-10 minutes before the encounter can be attributed to the subject I actually witnessed. --I'm certain that without using the thermal imager out of curiosity and boredom, myself nor anyone else in my party would've ever known one of these animals was there. Considering the circumference of the actual camp and where I witnessed the subject, it was strategically positioned far enough back to having no chance of being noticed on a quarter moon night under heavy tree cover. (see camp layout map) --With the unnerved reaction by the subject to my loud whispers and finger-snapping with noisy companions between our line of sight, I believe I saw obvious visual evidence of acute & possibly directional hearing ability of the subject. Furthermore, I believe and it's just my opinion, that the subject never could clearly see me (by never seeming to lock-in visually) but knew my exact presence at all times, maybe either through sound or my likely subconscious, nervous footsteps trying to position myself for better views. -- For as much as I could see, I'm certain I missed a lot when the subject was \"grounded.\" Some of the transitioning was so rapid that it was indiscernible during brief intervals in the encounter & can't properly be described. Much of what couldn't be made out in the rapid transitional movements (like when the subject appeared unnerved) was in-between the subject's distinct positioning I clearly recall. Furthermore, during some other brief intervals, partial ground vegetation blockage was also a factor. --At no time was the encounter a scary experience. If anything, it was very intensely \"surreal\" watching \"one\" through an imager as I have so many other humans & Pacific Northwest animals. Part of the absent fear likely also stemmed from the clear visual distance contrast from the subject and myself and being psychologically comforted that so many of my companions were nearby. --Although you can't interpret actual hair from 30-50 yards with this thermal unit, there did seem to be some hair shade (as have some other large mammals I've seen from a similar distance on certain nights) and the subject was undoubtedly void of any clothing. From 50 yds that night while doing the comparison and measuring the subject's distance from me, Paul G's clothing could be easily discerned through the unit as he wore a winter wardrobe with a checkered flannel, vest and beanie. (Note Paul G was measured and compared from roughly 50 yards when he stood at subject's initial positioning and his clothing was easily discernible, the majority of where I watched the subject was about 33 yards). --I saw nothing indicating the subject witnessed was a female (not extremely wide hips, no discernible breasts etc…) and based on size/behavior, it's my opinion the subject was likely a young adult male. ---Based on the agile, effortless movements of the subject both on the ground and standing up behind the tree in the beginning of the encounter, coupled with its profile appearance, I fully believe I saw a more \"ape-like animal\" being then my preconceived notion of what a sasquatch might appear like or actually be. --One month after the sighting, a local friend informed me that a boy scout master he knew personally & his troop had had a late afternoon sighting around 4:00 PM on August 19th (the day after my encounter) about 3-5 miles as the crow flies up-country from our camp location near a small lake. Coincidentally, our camp experienced nothing unusual our last night (August 19th). Several months later, the same friend also stated that he'd driven by our camp location and saw several hunters butchering and skinning elk right in broad daylight. Not uncommon during hunting season in that location I've been told. --The area continues to be a hot area as one of our WA-BFRO researchers had an almost identical but more brief & distant thermal sighting with the same X200xp unit, 1/4 of a mile from this location about 10 months later. On that expedition, several people reported much of the stealth & dexterous behavior I'd witnessed the previous August and emailed or called to inform me upon returning home.",
  "classification": "Class A",
  "county": "Yakima",
  "state": "Washington",
  "latitude": 46.85,
  "longitude": -121.25,
  "location": "-121.25,46.85",
  "location_details": "Withheld",
  "temperature_high": 70.46,
  "temperature_mid": 62.3,
  "temperature_low": 54.14,
  "dew_point": 50.34,
  "humidity": 0.69,
  "cloud_cover": 0.48,
  "moon_phase": 0.19,
  "precip_intensity": 0.0031,
  "precip_probability": 0.7,
  "precip_type": "rain",
  "pressure": 1011.38,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 9.06,
  "wind_bearing": 258,
  "wind_speed": 4.09
}