{
  "id": "7907",
  "title": "Family has encounters on private, hunting land in Red River - Sulphur River corridor.",
  "date": "2004-01-30",
  "timestamp": 1075420800,
  "observed": "In October 2000, I began hunting on my wife's family land.The land had sat idle for at least ten years. When I began hunting the land, the deer and hog population was quite high. I took quite a few animals with nothing out of the ordinary taking place. Oct 2001: I started filling my feeders and noticed deer every time I entered the property.Strange things started to take place on the first day of season. At the time I didn't think much about it. On opening day, (evening) I was hunting in my stand that was closest to the creek.(I would later find this was close to the bigfoot's nest area). My dad and I had been whispering at my stand. He left to walk to his stand (100 yards off). Shortly after he left, all wildlife sounds stopped. I then heard a large tree crash to my right (north). I then heard what sounded like a buck hitting his horns (scraping) on a tree. The animal then made a loud blowing noise.I didn't think this unusual. I then heard an animal moving through the dense trees(going from north to south to my dad's stand) I never saw it. It went in the direction of my dad's stand. At one point, it turned and started back in my direction. It then ran out of the woods(going east) to the fire road. At no point did I ever see what the animal was. My dad said that he heard it come up behind him. It then turned and went back in my direction. All season, there was an eerie feeling felt by all that hunted the place. There are two roads running through the place. Both travel north/south and cross a dry creek. All strange activity would happen across the creek between the two roads.Squirrels would start barking on the creek and then complete silence. Later in the season, my wife was hunting with me. I left her in her stand (on the 1st road) and I walked down and crossed the creek to hunt. When I arrived to get her (dusk), she was in shock and crying. She said that something big had walked up close behind her. She turned to see what it was and the animal fled. She said it moved to her right and crossed the road. She heard it run and jump the small creek. After it landed on the other side, it growled at her. She also stated that it had a horrible smell. I had never mentioned anything to her about bigfoot (smell sounds).It is my belief that this is what she had contact with. The last week of deer season, my dad and I were hunting off the second road. We had got in the woods late, so I walked in about 30 feet (off the road) and sat on a stump. About 75 yards down, I heard a squirrel barking in a very strange way. I then heard three large tree breaks. Shortly after, I heard movement to my left in the thicket. Within a few minutes, I heard strange noises coming from the road behind me. Within a few seconds I heard very heavy footsteps on the road. The road is soft silt (water runoff). Part of it was exposed dirt, part covered in dry leaves.The footsteps were in the dry leaves. I turned to see a large red creature walking on two legs. I couldn't see the entire animal at one time due to the trees along the road. I would estimate the animal at seven feet tall, long thick arms, thick chest, long red hair (the color of an Irish Setter dog). It appeared to be a large ape. The animal was in no hurry and I assume, had no idea I was sitting there. I stood up and turned to face the animal. I leveled my shotgun at it (for protection), and called my dad on the walkie talkie. As soon as I spoke, the animal let out a low short scream and broke into a run down the road.I have never seen an animal move that fast. I'm quite sure that it never saw me,as I scared it by speaking. My dad arrived and I told him what had taken place. We looked on the road and found two sixteen inch long foot prints in the soft silt. My dad advised that he heard the animal come through the thicket between us, but didn't see anything. At the time, I was a member of the Texas Bigfoot Research Center. I called and reported the incident. The next day, myself and several members searched the area. Across the creek (from one of my stands), an area was located that appeared to be a bedding area. An old 16 inch track was found in the bedding area. The next summer, I was taking a TBRC member to the bedding area when we came across a nest constructed of tree limbs. It was constructed on the north side of the tree. Several limbs (north side only) were broken off the ceder tree and laid aginst it in an \"A\" frame type leanto. There were additional branches that had to have come from other trees. The \"nest\" was about 4 feet tall. It did not show to have recent usage (winter nest?) About eight feet away,another ceder tree showed to have branches broken down touching the ground. This tree showed recent usage under the tree. Both trees were within fifty feet of the first bedding area found after my sighting. No one has access to this part of the place. It is very remote. 2002: Again a strange feeling was felt by all that hunted on the place.It seemed as long as we (hunted off the first road) did not cross the creek we were not bothered. Anytime we hunted off the second road we had unusual things happen(vocal,trees breaking). My wife and I crossed the creek and hunted from a fire road overlooking a creek. Weeks later, we came back to hunt the same spot. We had hunted in a stand of 3 trees together. When we came back, there was a ceder tree (pulled up roots and all) that had been thrown into the trees we had been hunting. The oddest thing about it is this area is nothing but hardwoods. The ceder tree was pulled up from somewhere else. This again, was within a short distance from the nest area. The last week of season, my wife, friend, his young son, and I were hunting the 1st road. My wife, the boy, and I crossed the creek to hunt. My friend took one of my stands. We left the boy on the road where I could watch him. the wife and I  walked in about 50 yards and sat on the creek. About 30 minutes before dusk, a loud, low roar was heard down the creek (between the 2 roads). It was so loud it just seemed to vibrate my chest. Something was heard walking around but couldn't be seen. It scared the boy so bad he got up and moved. Not seeing him, I got up to go find him. At this point, we decided to end the hunt. 2003: A friend and I went to the property to plant green patches for the deer to eat. I decided to cross the creek and plant one near where I had a feeder. This feeder is a gravity feeder made from PVC pipe. It has a large Y pipe on the bottom (held to the tree by a rubber bungie on the bottom and rope on the top). We found the lower Y pipe had been removed. No damage was done to the feeder. It was if the pipe had been twisted enough to break the glue. The rubber bungie was hung on a tree limb (7 feet off the ground) by the hook. Several old tracks were found behind the tree.They had been stepped in several times. There was no way to tell the length of them. What could be seen, indicated the size around 16 inches.The missing section of pipe was located about 50 feet away in some ceders. The camo paint had been scratched off in long straight lines. As would be seen if someone used their fingernails. I had taken a camcorder with me, and recorded what was found. All during deer season, one of my bucket feeders was constantly being taken apart. The bottom was being unscrewed, and the parts found scattered down the creek.This is a free hanging feeder.It takes two people to screw the bottom on (very tight). Opening weekend, another track was found on the second road where I had my sighting (seen by two other people). My friend, his son, and I hunted the second road by the creek. After coming out that evening, they both said they heard tree branches being broken after they returned to the truck. I was inside the truck and didn't hear anything. Nothing else occured this season. We inspected the nest and the area around it. No other signs were seen. My friend suggested that he didn't have that strange feeling out there anymore. It could be that after four years the creature moved on. The game population has been depleted/scarce with the arrival of this animal. Since its arrival, only one animal has been harvested in three years. A large 300lb boar was taken the last day of season this year.",
  "classification": "Class A",
  "county": "Fannin",
  "state": "Texas",
  "latitude": 33.61666,
  "longitude": -95.90694,
  "location": "-95.90694,33.61666",
  "location_details": "6 miles north of Honey Grove I would like to leave this as the only online listed location to the property.",
  "temperature_high": 46.78,
  "temperature_mid": 38.195,
  "temperature_low": 29.61,
  "dew_point": 26.9,
  "humidity": 0.74,
  "cloud_cover": 0.63,
  "moon_phase": 0.29,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.66,
  "summary": "Mostly cloudy until afternoon.",
  "uv_index": 2,
  "visibility": 9.16,
  "wind_bearing": 359,
  "wind_speed": 6.27
}