{
  "id": "47115",
  "title": "Hiker near Stevens Pass alarmed by very close and loud vocalizations of unknown origin",
  "date": "2014-10-21",
  "timestamp": 1413849600,
  "observed": "I had gotten up from sleeping to go to the bathroom, my dog came with me and was standing next to me.  I stood there a moment longer enjoying the peace when I heard a sound like an air raid siren. It stretched for 3 or 4 seconds and was followed immediately by 3 whoops.  My dog and I were both staring quietly for about 10 minutes and heard nothing else.  After hearing the sound I used my flashlight to search 180 degrees in the direction of the sound.  My dog was with me, he has a strong prey drive though he obeys very well, he heard it and did not move a muscle only stared in the exact direction that the sound came from.  This animal was within 70 feet of me so it was clear and fairly loud (as loud as an amplified siren we use at work).  I went up the following week to look for footprints but I believe it had rained too hard, I did find some but they were too skinny and only about 13 inches long.  I'm not a believer but am very intrigued as the only thing it sounds like is one of the sounds on your site.  Note most of the sounds on your site I find hard to believe.  Maybe someone can help me eliminate bigfoot from the possible list.",
  "classification": "Class B",
  "county": "Snohomish",
  "state": "Washington",
  "latitude": 47.82636,
  "longitude": -121.1057,
  "location": "-121.1057,47.82636",
  "location_details": "Lake Janus off the PCT north of highway 2 at lake campsite",
  "temperature_high": 59.86,
  "temperature_mid": 56.86,
  "temperature_low": 53.86,
  "dew_point": 47.9,
  "humidity": 0.75,
  "cloud_cover": 0.22,
  "moon_phase": 0.93,
  "precip_intensity": 0.0047,
  "precip_probability": 0.49,
  "precip_type": "rain",
  "pressure": 1011.31,
  "summary": "Partly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 2,
  "visibility": 9.08,
  "wind_bearing": 163,
  "wind_speed": 8.48
}