{
  "id": "23460",
  "title": "Husband and wife hear possible vocalizations on Harstine Island",
  "date": "2008-03-12",
  "timestamp": 1205280000,
  "observed": "My husband and I had just arrived at our cabin on Harstine Island and were unpacking the car.I cam out of the cabin and heard what I thought was a howl at first. I stopped to listen. after the next vocalization I said to my husband it's Bigfoot and he stopped to listen. We could tell they were coming from far away. Maybe 1/2 mile to a mile south of us. We did not feel threatened or scared at the time. The sounds were deep. Something between a roar and screem. They had a very deep growly under tone. In between sounds my husband was disagreeing with me. He suggested it was an elk or coyote. Our dogs both became clingy and started whining, so I had to bring them inside so we could hear. When I came out I started counting how long the sounds were. I counted 5 seconds. My husband said that while I was in the house there was one about 3 seconds longer or about 8 seconds. The sounds were deep but some of them changed pitch going even lower midway through. What ever was making the sounds had much larger lung capacity that even a big man. That is what finally convinced my husband it had to be a big foot. All other animal calls we have heard go higher rather than lower. The sounds contined for about 5 minutes. The next night my husband tried to recreate the sounds at the beach and couldn't even come close to the deep pitch or that length. His comment was that what ever made it was not human.",
  "classification": "Class B",
  "county": "Mason",
  "state": "Washington",
  "latitude": 47.28435,
  "longitude": -122.8665,
  "location": "-122.8665,47.28435",
  "location_details": "We were in Hartstene Point. The gated community at the north tip of the island. The sound was coming from the south. We guessed it was 1/2 mile to 1 mile away based on where the gated community starts. It sounded like it could have been right down on the beach or up above on the high bluff.",
  "temperature_high": 49.09,
  "temperature_mid": 44.96,
  "temperature_low": 40.83,
  "dew_point": 33.28,
  "humidity": 0.75,
  "cloud_cover": 0.73,
  "moon_phase": 0.19,
  "precip_intensity": 0.0028,
  "precip_probability": 0.81,
  "precip_type": "rain",
  "pressure": 1021.12,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 9.54,
  "wind_bearing": 56,
  "wind_speed": 1.31
}