{
  "id": "50678",
  "title": "Marines on a training mission have a possible night encounter on Fort Lewis",
  "date": "1997-06-24",
  "timestamp": 867110400,
  "observed": "While serving in the Marine Corps I was stationed at Puget Sound Naval Shipyard on the USS Carl Vinson. We went to Ft. Lewis Washington to conduct some day and night patrols. I remember the exact day because we listened to the Mike Tyson fight on the radio earlier in the day while in the field where he bit off Holyfields ear. While at Ft. Lewis during a night patrol we got off of the path we were supposed to be on and ended up in some deep brush that was thick and hard to get through. I was the point man on the patrol and carrying a SAW which is a fully automatic machine gun and it was loaded with blanks. While busting through the brush I encountered something that was very big and shaped like you would think bigfoot would be shaped but only saw it in the dark with no lights except for the moon. This large thing and myself were within probably ten feet of each other and it scared us so badly that I opened fire on it with the SAW and the blank rounds to run it off. It ran through the brush on two legs taking huge steps each time and busted through the brush like it was nothing and disappeared over the hill in seconds. Ever since this day I have always known that it was a bigfoot that I saw that day. This was in 1997 before computers and google so I had heard rumors afterwards that Washington was a hot spot for bigfoots. I never knew until now when I ran into this website that there is more sightings of bigfoot in that area than anywhere else in the US. I googled to see what county Ft. Lewis was in and was very surprised when reading through the stories from that county that there was several other sightings on the base such as mine. I don't tell many people this story unless they talk about bigfoot first because as you know most people who have not encountered something like this themselves will not believe you anyways.",
  "classification": "Class B",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 46.958,
  "longitude": -122.6755,
  "location": "-122.6755,46.958",
  "location_details": "FT. Lewis",
  "temperature_high": 67.32,
  "temperature_mid": 58.015,
  "temperature_low": 48.71,
  "dew_point": 47.44,
  "humidity": 0.72,
  "cloud_cover": 0.44,
  "moon_phase": 0.64,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1022.7,
  "summary": "Partly cloudy until evening.",
  "uv_index": 6,
  "visibility": 8.86,
  "wind_bearing": 350,
  "wind_speed": 2.08
}