{
  "id": "7537",
  "title": "Sasquatch crosses road in Coast Range in front of car",
  "date": "2003-12-08",
  "timestamp": 1070841600,
  "observed": "I was driving from Portland to Lincoln city to retrieve my work bag that I had left in Lincoln City over the weekend. I left Portland at 3 am and had only had coffee and donuts to eat; there were not many other cars on the road at all, none that were going in a westerly direction that were within sight of me and only about 2 cars passed me between Spirit Mountain Casino and the site were I had my sighting. I was driving about 55 mph and had my bright lights on  and had just came over a rise in the road shortly after you start down the back side of Murphy Hill summit. As I crested the rise out in the distance I saw what I thought at the time was a deer on the left shoulder of the road about 200 yards out from me.  I slowed down to 40 mph or so because I didn't want it to jump in front of me or if there were other deer in the area I might spook them into the road. As I got within 75 yards the object began to move across the road from left to right, that is, when I saw that it was not a deer and I thought it might be a bear which I have seen cross a road before but this was way different. The object was hunched over slightly and was on two legs and cleared the road in about 4 steps. The best way to describe the color was dark brown to black and I would guess the hair to be 4 or 5 inches. The arms looked to come down to mid thigh area. I did not see the face except for there seemed to be a deer-like shine coming from the face area. The height was about 7ft + as it disappeared over the edge of the road to the right. I was about 50 yards away by this time. I was starting to feel pretty weird like this was something I had never seen. Hard to explain the feeling as I passed the spot where it went over the bank I tried to look over and see where it had gone. I was going about 25 mph now as I went about 20 yards past the spot and stopped I then reversed my car to the spot where I had seen it go over the bank. I stopped my car and left the engine running I had my window rolled down slightly for air flow as I was driving. When I stopped I could smell a musty type smell not real bad but strong enough to notice. I could hear some movement in the brush but not a lot because of the car noise and the fact that my window was only down 2 or three inches on the left side when the object was now on my right.  I had a really strong feeling that I was being watched; every hair on my body was rigid, I had goose bumps over my whole body I have them now as I write about this, not as bad but the chills. I decided then that it would be a really good time to leave so I drove off as fast as my Metro would go I made it to Lincoln City at 6 am and had about 10 cars pass me going east on hwy 18 in that time.When I got there I went to my girlfriend's to get my bag and was going to come right back to Portland to work. Instead I stayed until 9 am then left to go back to Portland. As I drove by the spot I thought about stopping but decided against it.  I know the area well though because I helped a lady who had rolled her car off the road in the same are many years ago. The bank in the are is about 7 ft down on both sides and is swampy in some places. I lived in Lincoln City for many years and have spent time in the woods alone and with others and have never felt or seen anything like this  I don’t know what to make of it except for it being Bigfoot. No bear walks on its back legs like this. If you want to see the spot I can take you there just let me know also I drive this stretch of road 2 times sometimes more a week.",
  "classification": "Class A",
  "county": "Polk",
  "state": "Oregon",
  "latitude": 45.0608,
  "longitude": -123.694,
  "location": "-123.694,45.0608",
  "location_details": "About 1/4 mile west of Murphy Hill summit in coast range on a long straightaway",
  "temperature_high": 48.97,
  "temperature_mid": 45.16,
  "temperature_low": 41.35,
  "dew_point": 42.32,
  "humidity": 0.91,
  "cloud_cover": 0.75,
  "moon_phase": 0.49,
  "precip_intensity": 0.0025,
  "precip_probability": 0.86,
  "precip_type": "rain",
  "pressure": 1020.7,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 8.32,
  "wind_bearing": 135,
  "wind_speed": 2.28
}