{
  "id": "17326",
  "title": "Recollection of a college outing interrupted by possible vocalizations and rocks thrown near Rawley Springs",
  "date": "1995-11-18",
  "timestamp": 816652800,
  "observed": "In college, my social club would go camping twice a year for a bonding event w/ our new members.  We would go in Late November after the Thanksgiving Holiday and in Early April. A group of about 40-50 of us would set up a campsite w/ a large bonfire and we would spend most of the night in the woods just doing \"guy\" things like drinking and telling stories.  Invariably we'd get louder as the night went on, but it was a very remote area, not suitable for camping or any type of excursion.  We camped at the bottom of a large, steep descent that was a very dangerous rocky climb down. Once we left the cars, even in full moonlight, the trees would be so thick it was pitch black and nearly impossible to see our way down so we were equipped w/ flashlights at all times. All three incidents occurred in the same area, in the fall of 1994 and Spring and Fall of 1995.  The most unnerving occurred in the Fall of 1995 and caused most of our members to go home early because most feared we'd be shot at by hunters. We observed, audibly, not visually, rock throwing and very strange howling noises that got closer and closer until we quieted down, then the noises seemed to abate somewhat. On the night in the fall of 1995, we camped next to a small stream that ran down the mountain and could hear rocks being tossed into it downstream.  We all assumed it was some of our guys since usually someone would wander off in hopes of scaring us.  This night though, it kept occurring so we sent out some of our guys to make sure we had accounted for everyone, and we had.  We had to keep a head count because we took as few cars as possible and didn't want to leave anyone stranded.  Once we were all accounted for the noises got louder and closer and it was unmistakably the large rocks that dominated the hillside being tossed into each other and into the stream. We all fell silent and the few hunters in the group told us it might be a buck just wandering the stream but then we heard a loud continuous wailing sound that no one could identify for certain.  We all, despite our intoxication and testosterone levels, got very very quiet and tried communicating back in hopes it was a hunter who was just lost.  As we called out into the night, more rocks were thrown and more odd noises occurred.  There were long wails, or howls and the occasional grunt, similar to what a large Ape sounds like when agitated.  Whatever or whoever it was, was agitated and was definitely attempting to frighten us.  After some time had passed, most of our guys decided they wanted no part of what we thought was a few hunters out to scare us, so most left. About 10-15 of us remained through dawn, knowing that running wildly in the dark would be more dangerous than fending off some drunk.  We remained far, far quieter and heard more rocks being tossed in our direction, along with a few grunts but only intermittently and they seemed to grow more distant as the night wore on. On the previous two trips, I didn't stay the entire night but on each one, we heard the same odd cries and rocks being tossed nearby at other rocks and trees.  We ALWAYS chalked it up to hunters trying to scare the college kids away but no one EVER replied and the screams and cries we heard were definitely NOT from a dog.  The fall of 95 trip was one that is most clear in my mind and the one that scared a big group of burly guys into heading home at around 2AM instead of staying the entire night as we usually did. It wasn't until recently when my friend Randy told me about a BFRO expo in that region of VA that I even considered it being a bigfoot.  It had always been just a scary night in the black woods of West Virginia, but once he sent me a howl captured by a BFRO researcher, I had chills up and down my spine when I heard it. Let me add that I am the worlds' biggest skeptic and have routinely dismissed all Bigfoot talk as fantasy.  I don't know what it was out there, but after reading about the rock throwing, the grunts and growls, the expo in VA/WVa and hearing that chilling howl sound byte, my brain tells me it had all the earmarks of a Bigfoot sighting.  It was eerie recounting it for Randy because each tell-tale question he asked me, I apparently answered in such a way that he was sure it was a Bigfoot sighting.  I am in no way convinced, but the circumstantial evidence is overwhelming.",
  "classification": "Class B",
  "county": "Rockingham",
  "state": "Virginia",
  "latitude": 38.54602,
  "longitude": -79.16096,
  "location": "-79.16096,38.54602",
  "location_details": "On google maps, go to 38.546017,-79.160957 and you'll be in the general area.  We rode from Harrisonburg, took 33 West and headed south on Skidmore Fork road.  It was south of Rte 33 towards Reddish Knob.",
  "temperature_high": 48.84,
  "temperature_mid": 41.485,
  "temperature_low": 34.13,
  "dew_point": 30.78,
  "humidity": 0.67,
  "cloud_cover": 0.82,
  "moon_phase": 0.86,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.76,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 2,
  "visibility": 9.64,
  "wind_bearing": 208,
  "wind_speed": 5.04
}