{
  "id": "24731",
  "title": "Brief sighting by motorist on Rt. 80 just west of the town of Clearfield",
  "date": "2008-09-13",
  "timestamp": 1221264000,
  "observed": "I was driving west on I-80 at 65 MPH, in the right lane with cruise control set at 65. We were returning from a wedding in NY. We had been in a an area of mountainous/hilly forest close to road. The country started to open up with some farmland. My wife dozed and I was rather lost in thought. I diverted my sight to about 30 degrees to the right and was startled to see something that got my attention and kept my attention until about 60 degrees to the right. It passed quickly out of view because of the speed of the vehicle and a bank and some foliage obscuring the view. The road is two lane, one way and I could not return to the area without backing a long distance. There was no other traffic in sight at the time. What I saw was a figure, only from about what I would assume was midway from between the elbows and wrist upward. The figure was what I think of as being the wrong color, it was the color of a kraft paper bag except slightly more reddish. ( seemed the wrong color from reports I have read). It was long hair covered and I could not see a face. It was not moving during the approx. 3 seconds that I was able to view it. It was in front of some woods, not dense, standing about 150 feet away on the other side of a strip of narrow, fallow, farm field. It seemed to be facing the highway although I could not see a face. I assumed the field had high growth in it as I only saw the upper portion.It was only the upper body and head with the hair obscuring any sign of a neck.I could not estimate size but it was stocky. Among my reactions, I was imaging something or someone had put up a mannikin. I rethought that, as there did not seem to be habitation nearby and a mannikin would likely have been a full figure to get maximum startle value. I know I saw something that I can accurately describe and draw a rather accurate picture. ( I am a retired industrial designer ) From the briefness of the sighting I can only say what I saw  and think that this sighting would only be of value if there were other sightings in the area. When I saw the figure a strong chill went down my spine that lasted several moments. This sort of thing is not in my normal experience. I have been an instrument and glider pilot for 48 years and am rather used to making quick, fairly accurate observations in relation to that. I also have been trying to convince myself that I did not see anything. It was unsettling.",
  "classification": "Class A",
  "county": "Clearfield",
  "state": "Pennsylvania",
  "latitude": 41.12782,
  "longitude": -78.5826,
  "location": "-78.5826,41.12782",
  "location_details": "Westbound lanes of I-80 approximately 15 miles west of the town of Clearfield.",
  "temperature_high": 72.33,
  "temperature_mid": 70.325,
  "temperature_low": 68.32,
  "dew_point": 66.26,
  "humidity": 0.91,
  "cloud_cover": 0.83,
  "moon_phase": 0.44,
  "precip_intensity": 0.007,
  "precip_probability": 0.88,
  "precip_type": "rain",
  "pressure": 1013.97,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 5.18,
  "wind_bearing": 217,
  "wind_speed": 5.16
}