{
  "id": "27197",
  "title": "Adolescent child has early morning sighting near Chatsworth",
  "date": "2010-01-12",
  "timestamp": 1263254400,
  "observed": "IT WAS A COLD TUESDAY MORNING WHEN I WAS GOING OUT TO GET MY TWO DOGS TO PUT THEM IN THE KENNEL BEFORE I WENT OUT. I WAS STANDING ON THE FIRST STEP UP TO THE DOOR OUT BACK. I COULD SEE RIGHT OVER MY MUCH LARGER KENNEL. THIS LARGER KENNEL WAS AT LEAST 6 FEET TALL. ONE OF MY DOGS HAD JUST CAME IN. I WAS LOOKING FOR THE OTHER DOG.I WAS YELLING HIS NAME. RIGHT IN FRONT OF THE LARGER KENNEL WAS A BUILDING A LITTLE BIT SHORTER THAN THE KENNEL. I COULD ONLY SEE THE TOP OF THE KENNEL. I KEPT YELLING THE DOG'S NAME. I LOOKED OVER THE KENNEL TO SEE IF I COULD SEE THE DOG COMING. THAT'S WHEN I SAW A LARGE BROWN HAIRY CREATURE.I COULD SEE ABOUT HALF OF IT'S HEAD, DUE TO THE CAGE PART OF THE KENNEL.IT HAD VERY LONG REDDISH BROWN HAIR GOING FROM IT'S FORHEAD DOWN AS FAR AS I COULD SEE. IT HAD SHORT LIGHTER BROWN HAIR ON WHAT I COULD SEE OF IT'S FACE. IT HAD AN ARM THAT WAS ABOUT 3 FEET LONG. IT HAD SHORT LIGHTER BROWN HAIR ON IT'S HANDS JUST LIKE IT'S FACE.IT HAD LONGER REDDISH BROWN HAIR FROM IT'S WRIST ALL THE WAY DOWN IT'S ARM. IT HAD A POINTY EAR. I KNOW MOST SUPPOSEDLY SEEN BIGFOOT SIGHTINGS DON'T HAVE POINTY EARS, BUT IT'S WHAT I SAW. IT HAD TO BE 7 FEET TALL BECAUSE IT WAS TALLER THAN THE KENNEL. I HEARD IT LAND AS IF IT HAD JUMPED UP IN THE AIR AND THEN LANDED ON SOMETHING.I HEARD 4 THUMPS, AS IF IT LANDED ON IT'S KNEES FIRST AND THEN IT'S HANDS. I SHUT THE DOOR AND RAN BACK IN. THEN ABOUT 2 OR 3 DAYS LATER I WAS WALKING OUT TO MY CAR AND I HEARD SOMETHING MAKE A NOISE. IT SOUNDED LIKE A GRUNT OR GROWL.IT WAS IN THE SAME AREA THAT I HAD SEEN IT LAST TIME.WHERE I LIVE, THERE AREN'T ANY BROWN BEARS. NOTHING ELSE COULD HAVE BEEN 7 FEET TALL OR THE SAME COLOR IT WAS.THIS HAS LED ME TO BELIEVE THAT THERE IS SOMETHING LIVING IN THE WOODS BEHIND MY HOUSE.",
  "classification": "Class A",
  "county": "Murray",
  "state": "Georgia",
  "latitude": 34.8243,
  "longitude": -84.72352,
  "location": "-84.72352,34.8243",
  "location_details": "IT WAS REMOTLY CLOSE TO THE WOODS.",
  "temperature_high": 35.9,
  "temperature_mid": 27.425,
  "temperature_low": 18.95,
  "dew_point": 20.85,
  "humidity": 0.65,
  "cloud_cover": 0.51,
  "moon_phase": 0.92,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1026.01,
  "summary": "Mostly cloudy until afternoon.",
  "uv_index": 2,
  "visibility": 9.98,
  "wind_bearing": 335,
  "wind_speed": 6.69
}