{
  "id": "97",
  "title": "Hunter sees footprints near Alturas",
  "date": "1992-10-01",
  "timestamp": 717897600,
  "observed": "I think it was 1992 when this happened. The only people I told were my dad and uncle who were deer hunting with me at the time. I had left our camp before sunrise so I would be deep into the woods when the sun came up. I had just come out of the tree line into a clearing when I got a feeling something was watching me, I thought it was probably just deer but as I went across the clearing out into the open I felt really strange like something just glaring at me. I walked east into the sun and wind to the edge of the bank where there was still paches of snow on the ground because this was early October in X3B deer hunting zone. That's when I saw half a foot print in the snow.  It looked like the heal of a human foot only this one was about 8 inches wide. Then around 6 feet towards the edge of the bank was the front half of another print with five toes only they were big around like a man's bare foot would have been after the snow melted around it, but they were not from a man and the tracks were fresh. I looked over the edge of the bank and the side was all flat rock shail that looked like it had been recently disturbed. About 100 yards down was thick timber and as I looked down into it I felt like something was looking right up at me. I felt chills big time right then and felt like I needed to get away from there. Thats all that happend but I really think there was something down there that either saw me or heard me at least half a mile away because I was hunting with the wind in my face.",
  "classification": "Class B",
  "county": "Modoc",
  "state": "California",
  "latitude": 41.72278,
  "longitude": -120.3292,
  "location": "-120.3292,41.72278",
  "location_details": "Go east from Alturas on 395,turn right at Davis Creek, turn left when the dirt roads cross, about five miles north on that road start walking east till you reach the top and can see the feilds of Nevada.",
  "temperature_high": 75.19,
  "temperature_mid": 60.455,
  "temperature_low": 45.72,
  "dew_point": 38.08,
  "humidity": 0.5,
  "cloud_cover": 0.28,
  "moon_phase": 0.19,
  "precip_intensity": 0.0083,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1011.45,
  "summary": "Breezy in the afternoon and rain starting in the afternoon, continuing until evening.",
  "uv_index": 4,
  "visibility": 8.94,
  "wind_bearing": 186,
  "wind_speed": 6.92
}