{
  "id": "24442",
  "title": "Woman remembers witnessing a tall hairy figure in the Pocono Mountains",
  "date": "2008-08-15",
  "timestamp": 1218758400,
  "observed": "It was late at night.  We had a St. Bernard that loved to take long drives.  We decided to take a drive in the Pocono Mountains of PA. We would take familiar roads, then usually find a woodsy road to cut off on.  That night, I believe we were in the Bushkill Falls area (which should be in Monroe County).  We were on a narrow two-lane road in a heavily wooded area.  We approached an intersection with no stop signs.  We actually stopped to look at a map.  All of a sudden, a very tall figure crossed right in front of our car.  We were shocked!  It must have been at least 7ft.+ tall, long arms, hairy body, ape-like appearance, very slender.  It walked completely upright and just crossed over to the other side of the road.  There was another car that approached this small intersection--that car also saw it, because he stopped the car--remember, this was a back road with no stop sign.  Shortly after we had seen this creature, there was an article in the local newspaper about sightings in the state of PA.  I cut out the article and saved it, placing it in a book for safe keeping.  After awhile, we moved and the book with the article disappeared.   I tried to contact \"The Morning Call\", but you had to check out their archives to get any information.",
  "classification": "Class A",
  "county": "Monroe",
  "state": "Pennsylvania",
  "latitude": 41.115,
  "longitude": -75.205,
  "location": "-75.205,41.115",
  "location_details": "",
  "temperature_high": 75.95,
  "temperature_mid": 66.43,
  "temperature_low": 56.91,
  "dew_point": 60.26,
  "humidity": 0.81,
  "cloud_cover": 0.59,
  "moon_phase": 0.46,
  "precip_intensity": 0.0027,
  "precip_probability": 0.32,
  "precip_type": "rain",
  "pressure": 1014.67,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 7.37,
  "wind_bearing": 214,
  "wind_speed": 0.26
}