{
  "id": "4103",
  "title": "Daytime sighting on Route 17 near Church View",
  "date": "1978-08-01",
  "timestamp": 270777600,
  "observed": "This incident has been bothering me for 25 years.  And I'm glad I found your sight a few years ago. In 1978, my girlfriend (now my wife) and I were driving back from Virginia Beach back to Baltimore on Route 17.  As I was driving over one hill, I noticed a dead animal in the road, on the slower lane about a half a mile ahead.  It appeared to be a large dead dog. As I approached it, I had to change lanes and started to notice a smell that reminded me of muck we use to pull out of the creek near where I grew up.  The odor got stronger and I thought it was an unusual smell for a dead animal, which now appeared to be the size and color of a german shephard. As I drove around the animal, I watched it so I would not accidentally hit it as I went by (it straddled the lane markers a bit).  I also noticed out of the corner of my eye, what I thought was a little old black man, crouching in the woods behind a leafy branch, waiting for me to pass by. The edge of the woods was about 10 yards away, although I can't be sure of the exact distance.  My immediate thought was that he was coming out to get his poor dog that got run over.  So I curiously watched him in my rear view mirror.  What I saw surpirised me. Since the car had a loose rear view mirror, I held it as still as I could to see the action.  The figure came out of the woods, certainly bigger than I had thought it would have been.  But what amazed me was that it reached the middle of the road in three strides.  It looked down at the dead animal just as another car was coming over the crest behind me. It stood in a crouch, with its hands well below its knees, sort of in a monkey like position.  It appeared startled as it jerked its head looking towards the oncoming car, I saw what looked like two long furry ears (possibly dread-lock type hair) swing around, following its head.  My first impression was that it looked like one of those old aviator hats with the long \"ear pieces\" but with hair. As soon as it was startled by the other car, it turned and took another two and a half steps back into the woods.  What amazed me was the length of the stride. My then-girlfriend asked me what was the matter.  She said I looked like I saw a ghost.  For some reason, I reacted like I just saw something I couldn't explain, and started to to get physically shaken. We stopped a few minutes later at a roadside store in Jamaica, VA and bought a soda to sooth my nerves.  That's when I realized that I might have seen an animal and not a man.  To this day, I can not tell you exactly what I saw.  But it was definitely NOT what I originally thought it was. The combination of the rancid odor, the long quick strides it took, the \"floppy\" ears, the size (certainly bigger than an old man), and its color (black/dark brown)  now makes me wonder if I saw a sasquatch. Now, in looking at the map, I notice that that part of Rt 17 goes through a swampy, desolate area.",
  "classification": "Class A",
  "county": "Middlesex",
  "state": "Virginia",
  "latitude": 37.72693,
  "longitude": -76.6658,
  "location": "-76.6658,37.72693",
  "location_details": "The sighting occurred just north of a crest in the road, where you could not see the trough until you had actually gotten on top of the crest.  The road rose again, but not quite as steep as it was going downhill.  The sighting took place on the downside of the hill, almost towards the bottom.",
  "temperature_high": 84.74,
  "temperature_mid": 79.435,
  "temperature_low": 74.13,
  "dew_point": 73.39,
  "humidity": 0.86,
  "cloud_cover": 0.9,
  "moon_phase": 0.92,
  "precip_intensity": 0.0475,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1016.06,
  "summary": "Heavy rain in the evening.",
  "uv_index": 6,
  "visibility": 4.94,
  "wind_bearing": 65,
  "wind_speed": 0.64
}