{
  "id": "24882",
  "title": "Four campers have nighttime visitation and then a visual observation of a sasquatch near Estacada",
  "date": "2008-08-10",
  "timestamp": 1218326400,
  "observed": "Near the end of August, this year 2008 a couple of friends and I went camping/Bigfoot hunting around the upper Collawash River in the Oregon Cascade Range east of Estacada with the intensions of finding a spot I had been told about by a guide on a whitewater rafting trip I had taken with my brother in 2006. Unfortunately, when we got to our destination, I was the only one in our group that wanted to look for Bigfoot. Disappointed but not dissuaded, I tried to keep the rest of the group (2 guys and 1 girl) at least somewhat interested in the Bigfoot search, to little avail. The first night we camped (under much protest) quite a way into the bush and away from the overcrowded camp grounds where everyone felt more comfortable.  We followed an old logging road until it ended at a very secluded spot atop a ridge and maybe 250 to 350 yards directly south of the clear cut power line running east/west. The first night was interesting as we continued to hear distinct wood knocking; they started at around 11:00pm. Most were far off and very fast, 4 to 7 quick, sharp cracks directly east of us that would echo across the valley only to be answered from another direction farther south and then north but at first they were pretty far off. Everyone thought they were gunshots but this was a really dark night and these sounds were coming from pretty deep in the thick forest accessed only by not well traveled logging roads and from at least 3 different sources that for the life of me, sounded like they were communicating so I ruled out gunshots. These sounds continued to get closer to our campsite as the night wore on. At one point, maybe 12:30 or 1:00am the group wanted to drive over to the power lines, where the trees weren’t so thick and you could see for several miles, I decided to stay at camp and hope for something to happen. Almost immediately after everyone left, I started hearing sticks breaking from the direction they had driven out on and everything got real quiet. Now I’m from Montana and have spent many a night camped alone in far more rugged mountains than I was in now and have experienced most of the wildlife at least partially up close and personal that our American forests have to offer but I gotta tell you, I got a little spooked while they were gone! I did what any self respecting outdoors man would do and…put a lot more wood on the fire! I didn’t hear anything at that time that sounded too bizarre but I was glad when everyone got back. My buddy asked me if I was knocking rocks together while they were gone. I told him I hadn’t and asked what they heard. He said that they were out looking at the valley from the top of the road we came in on, about 250 to 350yards away and they all heard distinct knocking coming from the direction of our camp, he said it sounded like rock on rock. Later after everyone had gone to their tents I again decided to stay up. At around 3:30am I heard a very low grumble with a huff followed by what sounded like a lot of breath being pushed out and very close to the fire, maybe 30ft. At first I thought it was a bird or something, then, almost immediately another answered the first from across the clearing we were camped in directly behind me. I put my flashlight on where I heard the sound coming from and it would stop. 10 min later it would start up again. I don’t know why I didn’t get anyone up to listen with me but I didn’t. This went on for about an hour, until the sun started to brighten the sky and you could see a lot better. I never heard walking or anymore sticks breaking but those grunting noises were definitely close and there was at least 2 of whatever was making them. It wasn’t until on our way home that my buddy told me that he had heard the grunts too and, I love this, he was too scared to get up and investigate. The next day we went looking for another campground. I didn’t want to leave but I was definitely the minority on the subject. As we were driving down, I believe was FR43, my buddy and I in his rig and his friends behind us in theirs, something very big ran across the road about 150yrds in front of us. It was dark brown or black and uniform in color and at least 8ft to 9ft tall and moving like a freight train, it was huge! We only saw it for maybe a second before it tore into the trees running from the right to the left. My skeptical buddy looked at me and said “Did you see that!” I had my video camera in my lap but there was no way I could have gotten a shot of this thing, it was really moving! We stopped where we thought it crossed the road and you could see quite clearly where something had came down the incline on the right side of the road, we didn't smell anything. We got out and I climbed the small incline that it had come down to investigate and after 30 min or so found a barefoot track 18” long x 7½” wide and got video of it. I can send you the video and have other stories of the area as well. We did have material to cast the print but since it was in the mossy ground that covers most of the Oregon forest my buddy refused to cast the print claiming that we wouldn’t get anything from it. I was furious but it was his stuff and I learned the hard way to pack your own gear!",
  "classification": "Class A",
  "county": "Clackamas",
  "state": "Oregon",
  "latitude": 44.95023,
  "longitude": -122.2347,
  "location": "-122.2347,44.95023",
  "location_details": "I am a little fuzzy as to the exact details but i do know that we took 224 through Estacada and continued east for at least another hour then ended up on I believe FR 43. Although after that we took the bagby hot springs road and several logging roads later found our first campsite at the end of one of these logging roads.",
  "temperature_high": 82.99,
  "temperature_mid": 70.135,
  "temperature_low": 57.28,
  "dew_point": 50.68,
  "humidity": 0.63,
  "cloud_cover": 0.59,
  "moon_phase": 0.31,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.33,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 6,
  "visibility": 9.97,
  "wind_bearing": 303,
  "wind_speed": 2.69
}