{
  "id": "6992",
  "title": "Large bipedal creature passes child's window near Ft.Myers",
  "date": "2004-02-17",
  "timestamp": 1076976000,
  "observed": "In 1963 I was nine years old and living in North Fort Myers, Lee County, Florida. In the weeks before this happened to me, there were several sightings of bigfoot reported in the newspaper. One of the sightings had taken place in a wooded area not far from where I lived. Our house was on the corner of Estate Drive and another street I can't remember, near a canal.  We lived a block away from U.S. 41. On the corner was a street light that usually lit up my bedroom, which I shared with my younger sister and my grandmother. It was around 10pm, and I was in bed, trying to go to sleep. I was startled by some heavy footsteps outside on the grass and as I turned to the window I saw a huge shadow pass by as I continued hearing the footsteps. Whatever it was walked right past my window with a human-like walk. I couldn't make out what it was but it was not any four-legged animal, such as a cow.  This thing walked on two feet and was taller than a man. Then I heard a low pitched but quite loud moan that just scared the heck out of me.  I was not asleep (as my parents later asked) because I sat up straight in bed and seeing that my sister and my grandma were sound asleep, I ran out of my room and jumped into bed with my mother and father sobbing and shaking. I know that I heard and saw bigfoot's shadow.  I had never before, nor never after had an experience like that one.  I will never forget it. At school, when I mentioned what had happened, several kids had stories of sightings, but of course, kids will make up stuff like that.",
  "classification": "Class B",
  "county": "Lee",
  "state": "Florida",
  "latitude": 26.6685,
  "longitude": -81.8768,
  "location": "-81.8768,26.6685",
  "location_details": "I don't have directions to that area but I did a search and found Estate Drive in North Fort Myers, so it's not difficult to find.",
  "temperature_high": 62.66,
  "temperature_mid": 53.98,
  "temperature_low": 45.3,
  "dew_point": 50.12,
  "humidity": 0.76,
  "cloud_cover": 0.42,
  "moon_phase": 0.91,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1025.13,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 6,
  "visibility": 9.62,
  "wind_bearing": 335,
  "wind_speed": 8.55
}