{
  "id": "1750",
  "title": "Large furry head about 12\" by 18\" looked in the back door.",
  "date": "1993-09-15",
  "timestamp": 748051200,
  "observed": "In late Aug or early Sep 1993, about 1000 to 1100 pm, an unidentified large furry head (filled roughly 75% of the window measuring 20\" by 30\", so estimate the head size at about 12\" by 18\") looked in the back door of my wife's sister's house.  My wife, her sister, me, my daughter, and sister-in-law's daughter, all saw it.  We hadn't realized what we had seen at first.  When we saw it, we quickly let out their big dog and went outside where I immediately stepped into a big pile of fresh scat (looked and had texture similar to bear scat) and the area smelled sort of like a skunk was around the area.  The night was warm and no jackets were needed.  I don't remember much moon-light because it was very dark outside the glow of the small porch light.  The animal head we saw looked sort of like a primates, a large head with 4-6 inches of long silvery or gray hair but I don't recall much detail of the nose or mouth at the time, only a huge head that filled the window of the door. It looked in for only about three seconds, until we all had looked back at it and it apparently left.  It would have had to bend over to look in the window, since it was on the porch and the window is at the standard height.  I didn't think to look into the trees, but the odor was still very present.  We looked around, the girls yelling as if to scare away the intruder saying they would call the police.  I knew, after stepping in the scat, it was an animal and after gathering my thoughts, felt it better to get the family inside.  Also because the scat pile was fairly large, 6-7 inches diameter and about 3 inches high, thought it was a large animal but also knew from the head it was large.  My father in law is 225 lbs., 5' 10\" and his head was only half as big as this.  We didn't see or hear anything else.  I didn't think to get a sample of the scat or look for footprints.",
  "classification": "Class A",
  "county": "Clark",
  "state": "Ohio",
  "latitude": 39.92104,
  "longitude": -83.95184,
  "location": "-83.95184,39.92104",
  "location_details": "Donnels Creek runs north and south, paralleling North Hampton Rd.  (edited)",
  "temperature_high": 67.45,
  "temperature_mid": 59.545,
  "temperature_low": 51.64,
  "dew_point": 57.21,
  "humidity": 0.75,
  "cloud_cover": 0.84,
  "moon_phase": 0.98,
  "precip_intensity": 0.0114,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1017.96,
  "summary": "Rain in the morning.",
  "uv_index": 4,
  "visibility": 7.8,
  "wind_bearing": 338,
  "wind_speed": 4.54
}