{
  "id": "8944",
  "title": "Mini-bike rider has afternoon encounter near Fulton",
  "date": "1978-06-20",
  "timestamp": 267148800,
  "observed": "Me and several friends were taking turns riding a mini bike. We would take off from an alley behind the feed mill in Fulton. We would ride back towards the old train coal loading area. There was a wide path that ran alongside the railroad tracks. When it was my turn I jumped on the mini bike and rode down the alley through the coal loading area and onto the wide path that ran alongside the railroad tracks. There was an old switch and sign located just to the right of the path. When I got to the switch I tried to turn the mini bike around but there wasn't enough room. I was crosswise in the middle of the path with the mini bike facing the railroad tracks to the East. On the other side of the tracks there was an embankment that rose about three or four feet high. The embankment was maybe 20 feet from me and covered sparsely with small trees and saplings. I was getting off the mini bike to finish turning it around in the path when I saw movement on the embankment almost directly in front of me. The hair on the back of my neck stood up and I froze. I was staring into the eyes of a creature like I had never seen before. I could plainly see the creature’s eyes and face. It had watery looking black eyes. They were very shiny. It was 8 or 9 feet tall and covered with a reddish brown fur. The fur was thick but not long. Its face wasn't completely covered with hair. Around the eye and nose and upper cheeks I could see its skin. Its skin looked kinda bluish to me, or maybe an off color gray. Its chest was really wide and appeared quite muscular. It just stood there with its hand on the trunk of a tree. The other hand was holding a branch back out of the way, like it had been coming down off the embankment but stopped when it saw me. It clearly had a hand that looked like ours but covered with the thick fur. I couldn't see the palms of its hands only the backs and fingers. I noticed that its arms looked extremely long and made the creature look kinda ape-like in that respect. Its lower torso and legs were covered with fur except for some areas on its thighs and knees. I couldn't tell whether it was male or female, I remember having the distinct impression that it was a he though. So there I was standing beside an idling mini bike, and there he was standing on the embankment. We were staring at each other, then it kinda wrinkled up its nose and its eyes narrowed. The spell was broken and I was scared as hell. I thought it was going to come get me. I gunned the throttle on the mini bike and tried to jump on it as it finished its turn on the path. I didn't make it on the mini bike and ran beside it all the way back to where my friends were, with the throttle wide open. When I got to where my friends were waiting I dropped the mini bike and ran all the way home. My friends came over to see what was wrong. They said I looked like I had seen a ghost and had never seen anybody run that fast before. I told them I had seen a giant monster back at the coal loader and thought it was going to try to get me. We talked about it a couple times over the years, but I had pretty much forgotten it until I came across this web site.",
  "classification": "Class A",
  "county": "Morrow",
  "state": "Ohio",
  "latitude": 40.46339,
  "longitude": -82.82576,
  "location": "-82.82576,40.46339",
  "location_details": "Across from the intersection of Main Street and High Street there's an old grain elevator (it's now a thrift shop). Follow the trail and about 200 yards back you come to the old coal loader area.  Towards the back of the coal loader area is where the old switch and sign were. The old railroad bed is still there but the train tracks are gone.",
  "temperature_high": 82.6,
  "temperature_mid": 75.3,
  "temperature_low": 68,
  "dew_point": 61.45,
  "humidity": 0.7,
  "cloud_cover": 0.4,
  "moon_phase": 0.48,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.71,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 8,
  "visibility": 6.59,
  "wind_bearing": 173,
  "wind_speed": 5.24
}