{
  "id": "11998",
  "title": "Woman in parked car has nighttime sighting along the Ohio River",
  "date": "1996-11-15",
  "timestamp": 848016000,
  "observed": "I was a commercial fisherman for 8 years and me and my dad fished the Ohio River from Cairo, to West Virginia. The sighting was at Uniontown dam, at Uniontown, Ky. My mother come to pick us up around 1 or 2 am. and she seen it cross the road in front of her in the headlights, she said \"it walked right in front of the lights and turned its head and looked towards the truck, never stopped just slowly walking across the road about 50 ft. in front on the truck, she said it was about 9 or 10 ft tall and went in a strip of woods on the river bank. When we got there she was shaking all over and had all the doors locked and windows rolled up. She would not come pick us up there without a gun in the truck after that. Me and my father heard sounds on a island below the dam where we fished for weeks after that at night when we were fishing. Sounds like \"a large animal walking through brush on 2 legs, stomping trough the water in the back of the chute where we were fishing, the water was about 4 feet deep and the animal was walking on 2 legs. It had to be tall to be stomping trough the water the way it was. We could hear it breaking logs when it stepped on them and pretty good size logs from the sound it made and no deer or anything else is going to do that.  ",
  "classification": "Class A",
  "county": "Union",
  "state": "Kentucky",
  "latitude": 37.75972,
  "longitude": -87.96917,
  "location": "-87.96917,37.75972",
  "location_details": "Right below Uniontown Dam on the Ky bank. There is a dike just below the dam, the sighting happened there.",
  "temperature_high": 50.31,
  "temperature_mid": 46.77,
  "temperature_low": 43.23,
  "dew_point": 28.51,
  "humidity": 0.65,
  "cloud_cover": 0.34,
  "moon_phase": 0.16,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1031.73,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 2,
  "visibility": 9.62,
  "wind_bearing": 106,
  "wind_speed": 9.13
}