{
  "id": "26201",
  "title": "Family reports numerous incidents since 2000",
  "date": "2000-06-01",
  "timestamp": 959817600,
  "observed": "We have had several encounters with this creature. We used to have it living in the back of our woods near the swamp, but since clearing of land further back from other neighbors, it has moved to the other side of the forest. It still frequents the area. Run-ins still occur and have now for years. And now, there is a young with the mother. I really do not know what to say but the most important thing to me is trying to protect this animal, aka Bigfoot. This creature has not harmed anyone, is shy, but is really not afraid of people. I am hoping that someone here will help me out in determining the next step I could take. I DO NOT WANT THIS ANIMAL TO BE HARMED IN ANY WAY POSSIBLE OR REMOVED FROM ITS HABITAT. IT IS NOT A THREAT TO ANYONE OR ANYTHING!! There have been too many occasions to name that just proved to me and others that we have a family living close by. Seen, heard, smelled, footprints, etc. I would like to somehow get help from the govenment to protect this creature so no harm could come to it from anyone and that no one would try to hunt it down just for the money and fame. That is the only reason I am not giving the location of where all this is occurring. I am a registered nurse. I care about my job and reputation but I would rather have a \"rep of being crazy\" than ever having any harm done to this creature. Please respond with some help to point me in the right direction to help secure this animal's well-being and safety. Please. Thank you for your time and I await anxiously for your response.",
  "classification": "Class A",
  "county": "Elbert",
  "state": "Georgia",
  "latitude": 34.06705,
  "longitude": -82.86789,
  "location": "-82.86789,34.06705",
  "location_details": "",
  "temperature_high": 90.66,
  "temperature_mid": 78.15,
  "temperature_low": 65.64,
  "dew_point": 58.01,
  "humidity": 0.57,
  "cloud_cover": 0,
  "moon_phase": 0.96,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.68,
  "summary": "Clear throughout the day.",
  "uv_index": 12,
  "visibility": 9.07,
  "wind_bearing": 252,
  "wind_speed": 3.06
}