{
  "id": "22865",
  "title": "Hairy creature seen watching a college party on Butt Mountain",
  "date": "1990-08-11",
  "timestamp": 650332800,
  "observed": "My girlfriend had come to town for the weekend, and we had gone up to the abandoned fire tower on Butt Mountain to go hiking and camping for the weekend.  We arrived there early on a Saturday morning, and set up our tent and did some exploring around the campsite, since it was her first time there.  I had been to this site camping earlier in the Spring with some other friends.  When we got back to the campsite, we found that a group of students from Va. Tech had arrived and had set up their tents on the other side of the clearing from us. We spent the afternoon exploring below the cliffs to the west of our campsite.  There were some openings in the cliff face there, and we had noticed that they were full of trash dumped from the campground area above.  We had seen quite a few deer in the area, but no signs of anything bigger. Around 5 or 6 we came back to our tent and started to make something for dinner. We had brought some italian sausages and where cooking those on our camp stove. While my girlfriend was cooking, I was watching the now drunk college students goofing off below the cliffs around the opening I had mentioned before.  As I was watching them, I noticed some movement in the trees across the gap.  I just caught a glimpse of something dark moving down the hill thru the trees.  Thinking it was a bear, I moved further behind the bush beside me, so I could watch it without being seen. It seemed to take forever moving down the hill. I would keep thinking it had gone off in another direction, then  would see a dark patch in the break in the trees. Finally it walked into a larger break in the trees, and was walking on two legs.  Thats when I realized I was seeing a Bigfoot. It had not noticed me thru the bush in front of me, its attention seemed to be on the noisy college students below me on the cliff, and it was blocked from their view by the trees and bushes.  The creature seemed to be a dark brown color, but it was in the shade of the trees, so I could not be 100% certain of its color.  It was covered with long hair.  I could see hair maybe 4 or 5 inches long hanging from its left arm clearly.  The face area looked dark, but less hairly, kind of like a thin beard in places.  I was probably 100 to 125 yards away, but I would guess the height was around 6 and half feet by the height of the bush beside it. Its body was wide at the shoulders like a football player with shoulder pads on. The body was muscular but tapered in size from down towards the waist and hips. As the creature was watching the campers, it squatted down and was moving side to side, like it was peeking thru openings in the bushes and trees trying to follow the action of the campers.  Several times, it seemed to raise its head as if to sniff the air.  I watched the creature watching the campers for probably 3 to 4 minutes, then it must have realized I was there, and it turned to look towards me.  When it turned, I could see it had no neck, and had to turn its entire upper body towards me.  As soon as it saw me, it froze for maybe 5 to 10 seconds. At this point I could see the eyes were very dark and large looking. The nose looked more flattened than a human nose, but not exactly like an ape. The face seemed egg shaped, with strong looking jaws. I could not see much detail in the mouth or lip area. After this, the creature moved behind some bushes and was blocked from my view, so I moved out from behind the tree I was at, and moved forward some.  I was hoping to get another glimpse of it, but only managed to see patches of something dark thru breaks in the trees as it headed back up the hill on the other side. About this time, my girlfriend came up behind me and asked where the bear went.  She had only caught a glimpse of something dark and figure I was just watching a bear. She wanted to know if it might come back that night and bother us.  Since I didn't want to scare her, I didn't tell her that it wasn't a bear until the next day after we had packed the car and headed down the mountain. I didn't hear anything around the campsite that night, except the students camping nearby, and they were up most of the night partying. I guess I should tell you. Until I moved from Va. 3 years ago, I had spent most of my free time in the woods, camping or hiking. I grew up exploring the wilderness on my own and also with the boy scouts.  I have a Masters in Biology, and am well aware of what bear and all the other native animals to this area look like.",
  "classification": "Class A",
  "county": "Giles",
  "state": "Virginia",
  "latitude": 37.3557,
  "longitude": -80.5378,
  "location": "-80.5378,37.3557",
  "location_details": "This was on Butt Mountain in Gile County Va.  Its not very far from the Mountain Lake Resort where they filmed the movie \"Dirty Dancing\".  There was an abandoned fire tower at the site back then.",
  "temperature_high": 79.9,
  "temperature_mid": 69.895,
  "temperature_low": 59.89,
  "dew_point": 61.27,
  "humidity": 0.77,
  "cloud_cover": 0.55,
  "moon_phase": 0.67,
  "precip_intensity": 0.0177,
  "precip_probability": 0.61,
  "precip_type": "rain",
  "pressure": 1018.94,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 8,
  "visibility": 6.01,
  "wind_bearing": 289,
  "wind_speed": 4.04
}