{
  "id": "57103",
  "title": "LEO has a daylight sighting at a ranch outside Grapeland",
  "date": "2017-03-15",
  "timestamp": 1489536000,
  "observed": "It was Thanksgiving 2007 in Houston County Texas. Outside of Grapeland Texas, on a private ranch. My brother-in-law asked if I wanted to go with him and my father-in-law to the private ranch that he managed and check the hog traps he had set. They had been overrun with them for a while and he had caught 20 in the past weeks. I said yes, and we were off, it was mid day and still bright and clear. We were in my brother-in-laws truck he was driving, me in the middle, and my father-in-law at the passenger side. When we got to the gate of the property, my FIL got out and opened the gate and we pulled thru and waited for him to close the gate and get in. As soon as he got in, we slowly started to pull forward...Then, from our left out of the pine thicket came this HUGE thing, about 8 1/2 to 9ft tall,and very dark brown almost black hair 3 to 4 inch long. Huge chest and shoulders, long arms and no neck,it ran with incredible speed..in 3 long strides it covered from the trees across the road in front of us and into the right side tree line which is 30 ft.  and then over a fence onto another mans property which is part of ELKHART CREEK and flows to the Trinity River. It made no sound. And we had our windows down.This creature was clearly seen by all 3 of us and we just sat there for awhile to gather our wits...Then I started laughing..I wasn't scared. Just shocked..I said \"What do Yall think that was\"? They said, You KNOW WHAT IT WAS...AINT NO BEAR! They both swore they would never mention it to anyone.. they were afraid people would think they are nuts and they would lose their jobs..I am A retired Police officer and didn't care... It has changed my life. My BIL then said \"Well that explains what tore up my big Hog Trap!!",
  "classification": "Class A",
  "county": "Houston",
  "state": "Texas",
  "latitude": 31.55668,
  "longitude": -95.38226,
  "location": "-95.38226,31.55668",
  "location_details": "NE of Grapleand toward REDTOWN on county RD ..I cant remember the number 140 maybe...it was behind the Vulcraft Plant.",
  "temperature_high": 63.47,
  "temperature_mid": 56.415,
  "temperature_low": 49.36,
  "dew_point": 41.31,
  "humidity": 0.66,
  "cloud_cover": 0.05,
  "moon_phase": 0.6,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1026.51,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 9.98,
  "wind_bearing": 89,
  "wind_speed": 5.49
}