{
  "id": "17011",
  "title": "Man describes teenage incident -- possible intimidation approach at 2 AM  in Coral Springs, at the edge of the Everglades.",
  "date": "2007-04-19",
  "timestamp": 1176940800,
  "observed": "Back in 1985-86 my family relocated to Coral Springs from Miami before the Sawgrass Express way was built. We lived so close to the Glades my friends and I used to ride our skateboards to the levy and watch the Everglades burn (at that time, some firebug had set quite a blaze). On some mornings we'd wake to cars and yards covered in ash. Needless to say, a lot of wildlife began to migrate closer to our neighborhood i.e.,deer,alligators, whatever. One night we pitched a tent in my friends back yard approx.  50 yrds from a canal that separated us from an apartment complex and across from that was the beginning of the everglades. The fires had been raging for weeks and people in the area were reporting missing pets, some of which were inside 6 foot privacy fences. We used to run between houses to cut through to go home. This night in particular, before we called it quits, we played a bit of hide and seek. I remeber hiding under a window box behind a bush and got spotted by an unmarked police car. We really thought we were in trouble, but the police were looking for a person that had been peeping in windows. We assured the police we weren't the perps and went on about our business and went to the tent. 3 kids in a tent don't sleep well, so we were having fun cracking jokes and noticed a sound coming from across the canal approx 100 yrds away. Something was slamming the dumpster lids in the complex across the way and making low deep sounds, grunts. These were tall dumpsters. You'd have to get a boost to lift the lid. We got real quiet trying to listen to figure what it could be. At first we figured a cow got loose and possibly was bumping into the dumpster. But, it became evident that wasn't so. One of the kids I was with turned on a flashlight and started making shadow puppets with his E.T. stuffed animal. Then the thing from across the canal took notice of us for the first time. The grunts were still audible but with what I would say is with a hint of curiosity. We got quiet and real concerned putting 2 and 2 together. Could this be what the police were looking for? The steps grew closer and closer. I remember we tried to figure if it was a quadraped or biped. When the steps finally stopped, the breathing grew louder, then SPLASH!!! Whatever it was was 50 yrds from us and coming right in our direction. We sprinted for the house waking up my friend's family. They were woken by 3 screaming kids at 2a.m. exclaiming something is out there. His dad grabbed his shotgun, turned on the flood lights.  He went out to look around and found the tent was demolished and covered in water. I swear I could feel this thing  right around the corner in the shadows looking right at us. We did not let his father investigate further until morning and couldn't beleive the tent had been moved from its postion. I have no doubt had we stayed in that tent this story would be much different, if at all. I am 35 now and have never forgotten that night.",
  "classification": "Class B",
  "county": "Broward",
  "state": "Florida",
  "latitude": 26.28516,
  "longitude": -80.27977,
  "location": "-80.27977,26.28516",
  "location_details": "it is in the story",
  "temperature_high": 80.38,
  "temperature_mid": 73.345,
  "temperature_low": 66.31,
  "dew_point": 58.94,
  "humidity": 0.63,
  "cloud_cover": 0.18,
  "moon_phase": 0.08,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1008.14,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 10,
  "visibility": 9.87,
  "wind_bearing": 308,
  "wind_speed": 6.63
}