{
  "id": "927",
  "title": "Campers hear loud animal \"roars\", from inside the treeline of a clear-cut",
  "date": "1975-08-10",
  "timestamp": 176860800,
  "observed": "We heard a strange sound the summer of 1975 on the Little Wenatchee River near Rainy Creek. My mother had come to visit and we took her to a replanted clear-cut at the base of Mt. Howard (SE of the bridge that crosses the Little Wenatchee River). The clear-cut was about 300 to 350 yards in diameter. We were going to camp near its base. We also had my mother’s dog ’Lady’ with us and its scent may have brought about the confrontation. We heard a very loud roar coming from the other side of the cut. The creature was hiding in the tall timber out of view. Imagine a very, very deep voiced man making a rough sounding lion roar. Imagine that he has a microphone, amplifier, and good speakers: that is what it sounded like. I thought it might be a black bear and so I fired my 357 revolver into the air 3 times to scare it off (generally I have found that enough to warn off a bear, especially in areas where they are hunted). But I was immediately shocked to find that instead of running the beast roared louder in rage and more rapidly: Raaaa! Raaaaa! Raaaaaaa! My 357 seemed to me to shrink to the size of a BB gun, and we threw everything in the car and left. I have heard lions at the zoo roar, but this was louder and more like something you would hear in a 1950s monster movie. I was young in those days and I didn’t desire to go up an see the beast making that noise, but now that I am older and realize the real destination of life, I wish I had.",
  "classification": "Class B",
  "county": "Chelan",
  "state": "Washington",
  "latitude": 47.8498,
  "longitude": -120.9591,
  "location": "-120.9591,47.8498",
  "location_details": "Washington State, south side of Little Wenatchee River on the lower slope of Mount Howard; on a logging road in a newly replanted clear-cut, just east of the Rainy Creek bridge.",
  "temperature_high": 71.48,
  "temperature_mid": 62.855,
  "temperature_low": 54.23,
  "dew_point": 49.6,
  "humidity": 0.63,
  "cloud_cover": 0.41,
  "moon_phase": 0.12,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.52,
  "summary": "Partly cloudy until evening.",
  "uv_index": 5,
  "visibility": 9.61,
  "wind_bearing": 281,
  "wind_speed": 5.4
}