{
  "id": "23367",
  "title": "Hunter has a close but brief encounter in a hazelnut bog near Middle River",
  "date": "1978-11-04",
  "timestamp": 278985600,
  "observed": "I was hunting for Whitetailed deer through the forests and swamps of Northwestern Minnesota.  As I entered another peice of woods after crossing a swamp I jumped a deer.  It ran off a few jumps and stopped.  I raised my gun and fired.  Misfire!  Off the deer went into the woods along with the confidence I had in my weapon and ammunition.  I proceded through the heavy underbrush until I came into a clearing.  As I entered the clearing I glanced left then right.  On my left I saw a \"man\" hunch his shoulders, duck his head and turn away from me.  As I looked right I realized I had seen the figure of a man on my left.  When I turned back I saw the back of a dark head and shoulders disappear into the hazelnut brush.  I then realized that any man out in the woods on opening day of deer season would have been wearing an orange hat and coat, while this one was clad in dark brown/black.  I was certain what I had seen was a bigfoot.  I thought about looking for tracks, then remembered my gun had just let me down while trying to shoot a deer, so I made tracks in the opposite direction of this creature.  I returned to our hunting shack in this area many times but never went back to that part of the swamp.  In the many trips back to Middle River and NW MN I never saw anything like this again.",
  "classification": "Class B",
  "county": "Marshall",
  "state": "Minnesota",
  "latitude": 48.52579,
  "longitude": -96.28425,
  "location": "-96.28425,48.52579",
  "location_details": "This took place in the aspen woods about 15 road miles NW of Middle River MN.  Just N/NE of an area known as Nelson's Slew.  It was a Wildlife Management Area of the MN Dept. of Natural Recourses.",
  "temperature_high": 56.62,
  "temperature_mid": 47.81,
  "temperature_low": 39,
  "dew_point": 30.56,
  "humidity": 0.65,
  "cloud_cover": 0.72,
  "moon_phase": 0.14,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1009.54,
  "summary": "Mostly cloudy throughout the day and breezy starting in the afternoon.",
  "uv_index": 1,
  "visibility": 9.62,
  "wind_bearing": 175,
  "wind_speed": 9.28
}