{
  "id": "937",
  "title": "Witnesses hear odd, loud vocalization while in the forest traveling on a logging road",
  "date": "1985-06-28",
  "timestamp": 488764800,
  "observed": "We were out shooting clay pigeons and plinking up on a logging road. We were on the east side of the divide heading towards Lost Lake if I recall. It was in June or July of 1985. We had pissed our dads off for some reason and they told us to get out of the back of their truck to walk. As the truck rounded the corner and the dust subsided, it happened. We heard the rustling of trees and shrubs about 10 yards downhill of us. Then the most guttural, loud, and high pitched yell erupted from the trees below. We hunt all of the time and have never heard anything like that. To this day we cannot pin it down to any known animal in this region. It wasn't an elk as it didn't bugle. It wasn't the cry of a mountain lion, and certainly wasn't a bear. The sheer decibel level of the sound indicated to me that it was a rather large animal. We looked at each other and ran to that truck about a mile away. We never looked back, we were too scared. An interesting thing happened about five months ago. I rented a bigfoot documentary which had a recording some campers had made in Washington State somewhere in the summer of 1971. Too my astonishment, the recording was a duplicate of the spine trembling cry that we had heard. My brother and friend couldn't believe it when I called them right away to let them listen. It was eerie. Let me know if you need more details.",
  "classification": "Class B",
  "county": "Clark",
  "state": "Washington",
  "latitude": 45.69,
  "longitude": -122.3353,
  "location": "-122.3353,45.69",
  "location_details": "Near Lost Lake, headwaters of Washougal River and Rock Creek.",
  "temperature_high": 76.19,
  "temperature_mid": 64.585,
  "temperature_low": 52.98,
  "dew_point": 43.66,
  "humidity": 0.56,
  "cloud_cover": 0.23,
  "moon_phase": 0.37,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.52,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 9,
  "visibility": 9.87,
  "wind_bearing": 309,
  "wind_speed": 4.58
}