{
  "id": "14427",
  "title": "",
  "date": "",
  "observed": "I had two different encounters with in a week apart, within a mile of each other. I used to take walks in the afternoons when I would get off of work. There was an old logging road that made a loop about 3 miles around in the woods across from my house. It was about 3 thirty or so when I set off this day. I always carried a little 22 pistol with me in case I came across any snakes. My grandmothers two dogs also always went with me on these walks. We had turned off the main grade and gone maybe a quarter of a mile into the woods when we started down through the slough. The logging road cut between to little swamps. There was alot of scrub oaks and low growing trees just before it opened up into the swamps. I had just cleared the scrub oaks and came into the clearing when I noticed the change. It was like everything in the woods had vanished. The birds stopped singing, I mean it was quiet. I broke out in a cold sweet and the hair on the back of my neck stood up like I had just been shot. Like when you know you are being watched. I glanced down at the dogs and both of them had come to a stop like they were frozen in place. The hair on both of them was standing straight up. They were looking off to the right of me but neither one of them so much as growled. It may sound funny but it seemed like on cue the wind picked up and I caught a smell that I really cant describe. I looked to my right, and about fifty or sixty yards up the hill I could make out the shape of something very big , standing between a couple of oak trees, and some other brush. I stood there for about thirty seconds or so trying to figure out what it was before it moved. It reached out and grabbed two of the oak trees and started shaking them back and forth. Then I heard something like I have never heard before in my life. It didnt sound like an animal growling or a person screaming, but kind of a mix of both. The next thing I knew I had reached for my pistol, looked down and both dogs were gone. I decide that it was time for me to leave at that point and made my way very quickly back to the house. The next encounter happened about 5 days later on the other side of the main grade. I had just left the house from having lunch and going back to work. I was riding a four wheeler at the time and we had a lot of trails cut out through the woods that we rode on. I had just come out of the woods and onto a pig trail just up from what we called bathtub springs. The pig trail turns into a main grade about a quarter of a mile from where I came out on it. I started towards the main grade when I noticed something very large and brown running through the woods about 20 to 25 yards to my left. It kept up with me as I rode about 15 mph, for at least 20 seconds. I saw it sling something in a side ways motion, like throwing a frisbee. I was just about to the main grade when I realized something had hit me in the chest. I didn't stop until I got out to the main paved road. When I did stop to see what had hit me, I saw that it was a rabbit that had been turned inside out. It was several years before I worked up the courage to go back into those woods. A lot of people may not believe me, but those that know me, know that I grew up in those woods hunting, trapping, fishing, and camping out. I have walked up on and been stalked by Florida panthers and wild hogs, but I have never had that feeling of truly being scared until these to encounters.",
  "classification": "Class A",
  "county": "Suwannee",
  "state": "Florida",
  "location_details": "(Exact location omitted per witness' request.)",
  "summary": ""
}