{
  "id": "3647",
  "title": "",
  "date": "",
  "observed": "I have had two occasions to observe an unkown creature in the wood's of western pennsylvania. The first was in the fall of 1986 as a teenager I was parking in a desolate location called Hell's Hollow about 1/2mile away from a boy scout camp. I was only pulled off the road enough not to block traffic because I did not want to get stuck in the muddy lane. While we were sitting there talking a figure of large proportion walked past the front of the truck. I would guess about 7 to 8 ft tall and about 300 to 400lbs. All I saw was a large dark-brown biped about three feet in front of the truck. It ignored us totally and was gone into the thick brush. It was dark and no further observation was made. I hit the key and split, the girl I was with evidently did not see this because she was clueless as to why I made such a hasty retreat.            The second sighting occurred in the fall of 1988 in the early fall while hunting in the same area.  Actually we parked in the same place. We crossed the small creek at the bottom of the hollow and proceded west up the next hillside which is very steep. We separated to better our chances of seeing squirrels. I walked about 1/4 miles north along the ridge and sat down. After sitting there for about two hours I had seen nothing. I went back down the hill to find my friend.  As I hit the bottom of the hill and started across the creek I could see my friend looking my way.  As I got to him he just kept looking past me. I thought he had seen something to shoot at and turned.   All we saw was a dark brown or black long haired creature running up the steepest part of the hill. It took me about 3 to 7 minutes to cover that hill on less sloping ground walking down hill. This thing ran up it in about 15 to 20 seconds. (I know I would have to climb the slope and maybe need a rope to just get up it.)  It ran sort of apelike on all fours pulling its way up with the front paws. The guy I was hunting with doesn't believe in bigfoot and says it must have been a bear. Bear are around this area but are very rare. And bears don't run in such a manner as this did.",
  "classification": "Class A",
  "county": "Mercer",
  "state": "Pennsylvania",
  "location_details": "Site is located west of Greenville 5 miles on rt 358 and left on Hell's Hollow road.",
  "summary": ""
}