{
  "id": "9765",
  "title": "Motorist and children have daylight sighting near Burns Flat.",
  "date": "1973-09-28",
  "timestamp": 118022400,
  "observed": "My two children and I were returning from Altus,  Oklahoma to Burns Flat, Oklahoma in the fall of 1973 when a very large black man-like creature crossed the highway moving from west to east. I was driving and my son (age 11) was sitting in the front seat beside me and my daughter (age 12) was sitting in the back seat leaning forward between the driver and passenger seat. It was a clear sunny day about 3 PM and there was a lull in the conversation. It was quiet in the car, we did not have the radio on and all three of us were happened to be looking straight ahead. I noticed a movement on the left side of the road and was amazed to see a what I percieved to be a very large black man-like creature rise from a squatting position and run across the two lane highway about 30 yards ahead. It ran across the highway, covering the distance in only three steps, I estimate the creature to have been at least 8 feet tall, it glanced briefly in the direction of the car and I instictively applied the brake so as not to hit it. It ran into the bar ditch on the east side of the road and ducked into some brush and large bushes between the ditch and the barbed wire fence. It had hair that looked rather silky as it ran, I remember seeing the hair move as it ran. The hair did not appear to be stiff like an animals hair but more soft and shiny. Both children saw it too and said \"What was that, mama?\" I said I didn't know, they wanted me to stop the car, but I was frightened that my children and I could be harmed by something I had never seen before in my life. I didn't tell anyone what I had seen and cautioned the children not to say anything either.",
  "classification": "Class A",
  "county": "Washita",
  "state": "Oklahoma",
  "latitude": 35.3011,
  "longitude": -99.1702,
  "location": "-99.1702,35.3011",
  "location_details": "The creature crossed from one cattle pasture to another, it may have been leaving a pond on the east side of the highway.",
  "temperature_high": 72.55,
  "temperature_mid": 63.225,
  "temperature_low": 53.9,
  "dew_point": 50.86,
  "humidity": 0.73,
  "cloud_cover": 0.16,
  "moon_phase": 0.07,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1017.29,
  "summary": "Partly cloudy starting in the afternoon.",
  "uv_index": 6,
  "visibility": 10,
  "wind_bearing": 263,
  "wind_speed": 8.15
}