{
  "id": "48086",
  "title": "Motorist observes large ape-like creature in her headlights on Old Cartersville Rd. near Dallas",
  "date": "2011-10-19",
  "timestamp": 1318982400,
  "observed": "I was driving on Old Cartersville road towards HWY 61 just past the chicken farm but before the pond.  I had my 13 year old son with me. I saw what I thought was a bear crouched down on the right side of the road. I turned to tell my son to look at the bear. My son was in the back seat. Before I could turn back around all the way. I noticed it stood up on two legs. My son was asking what it was. Then I noticed it was over 7 foot 6 inches tall covered in long black hair. It was burley! It was all of 500-600 pounds. It was no more than 20-30 yards outside our truck window.  It was so large I could see its muscles in its legs (thighs). Its head appeared to sit on its shoulders like it had no neck. The head looked like it came to a point. It looked like a bipedal ape! It had something white in its hand! That's when it registered it had hands and not claws. The arms were longer than any human arms. They seemed to stretch closer to the knee area. When it walked the knees worked perfectly. It did not have a bow legged affect. Which made it seem human but it looked like an ape. It started to move towards the road walking on two legs. My lights stayed on it. It seemed to want out of my lights. When it walked for the road it was headed in the path of my truck. I was on a small curve. So my lights followed it. I hit my fog lights & it turned back from the direction it came. It picked up speed and started to run still on two legs. I could see the foot falls & the thigh muscles bounce. Also saw butt muscles flex all under the hair. It started moving so fast the white thing in its hand was almost a blur. The next day, I returned to the area. Where it ran off into the woods was uphill. I thought it was flat as fast as it was moving. The house close by had chicken coops with white and brown chickens in it.",
  "classification": "Class A",
  "county": "Paulding",
  "state": "Georgia",
  "latitude": 33.94979,
  "longitude": -84.82338,
  "location": "-84.82338,33.94979",
  "location_details": "",
  "temperature_high": 49.88,
  "temperature_mid": 47.29,
  "temperature_low": 44.7,
  "dew_point": 39.06,
  "humidity": 0.84,
  "cloud_cover": 0.96,
  "moon_phase": 0.74,
  "precip_intensity": 0.0289,
  "precip_probability": 0.91,
  "precip_type": "rain",
  "pressure": 1001.74,
  "summary": "Mixed precipitation (1–2 in. of snow) in the morning.",
  "uv_index": 3,
  "visibility": 8.41,
  "wind_bearing": 283,
  "wind_speed": 8.19
}