{
  "id": "38361",
  "title": "",
  "date": "",
  "observed": "I know that after 13 years it might be a little late in reporting this but I did report this but heard nothing back from anyone. This report although old is still as vivid as the day it happened. November 1999 during the Wisconsin 9 day gun hunt for deer in Oneida County in the small rural area of Sugar Camp at the Consolidated Paper land just East of Sugar Camp. Time of day was around 9:30, it was cold that day with temps in the lower teens, it was however sunny and quite comfortable in the sun. I was in a tree stand in some new growth pines when I spotted a Buck of considerable size through the thick underbrush. Not wanting to take a shot and missing, I saw that the buck was heading towards my son about 100 yards away. After 10 minutes or so I got down from my stand and walked over to where I saw the buck and indeed there were tracks so I followed them which led me across a logging road only 50 yards from my sons stand. When I reached the logging road I called on the radio to him to see if he saw anything run across and he stated he did not. I told him I was going to continue to track this buck and to keep his eyes open. I then entered a very dense part of the woods and even though it was sunny it was surprisingly dark in this dense area. I then looked ahead and realized it was also absent of any snow and was still mossy looking. I lost the tracks but I continued to walk deeper into this interesting area. I walked about a 100 yds down a slope to a creek bottom that still had running water which I found odd. At the bottom I found some deadfall to rest by and I lit up a smoke, as I sat there I got this strange feeling something was watching me, as I looked around a disgusting smell came over me and every hair on my body was at full attention. Before I continue you need to know that I was raised in the Northern part of Minnesota and it wasn’t uncommon to be in the woods either day or night. I have never been afraid of the woods and do not have any problem when it is dark. I have been startled in the woods but never scared to death. Scared and fearful is what I felt that day. I am not one to pull both my pistol out and unsafe my rifle but that is exactly what I did, I snuffed my smoke and I started walking back out of there when the smell became so harsh and it felt that something was so close but I could not see it. I need to also mention that I heard nothing. As I continued up the slope I found myself running instead of walking and I was ready to fire my weapons at anything that moved. When I reached the top of the hill and broke out of the thick woods onto the logging road my son saw me and was scared because he didn’t know what scared the hell out of me. When I reached the top there was still a faint smell in the air but soon subsided. The time of day was now 10:30 AM and I was done hunting for the day. I then hooked up with my hunting buddys and we all decided to call it a day as they saw how upset I was. Arriving at the bar for some much needed beverages an older guy over heard us talking about my incident and came over to catch all the details. Upon learning where this happened his only words were I know where you were and I will never go back, he then walked away without sharing anything else. This concludes my report, I realize it’s not much but there have been other incidents in the same general area that my buddys have talked about. Thank you,",
  "classification": "Class B",
  "county": "Oneida",
  "state": "Wisconsin",
  "location_details": "State Hwy 17 North to Rolling Acres Rd",
  "summary": ""
}