{
  "id": "13492",
  "title": "Family describes incidents in Pisgah Nat. Forest ;  NC-06 Exped notes",
  "date": "2005-07-05",
  "timestamp": 1120521600,
  "observed": "[Editor's Note: The observation described below is Class B. The Class A observation was told by family members during the course of the on site interview. See the *investigator's comments* section of this report. The two men who had the Class A sighting do not care to type it up themselves. Their incident is so closely connected with this Class B submission from this family, that it should be combined. The men's incident is clearly Class A, so the *combined* report should show a Class A ranking. There will not be a separate report for their incident.] It was a damp July night around 10:00 and we were staying at my Grandpa's house.  My family and I had a fire going outside.  We were all sitting around it talking.  It rained all day so the night seemed darker than usual.  The house is set on thirty wooded acres with a creek about twenty-five feet away.  There aren't many houses on this mountain due to the fact that it runs with the Pisgah National Forest. I went in the house to get the cd player.  It was a very still night.  We listened to a few songs; when we decided to play the Sierra Sounds cd with bigfoot recordings on it.  As we listened to the cd we all became jumpy and the feeling of someone was watching us came over us.  We then started hearing sounds of what sounded like saplings being broken up above us; higher up in the mountain.  We just laughed it all off as nerves.  Then we heard what sounded like a tree about ten inches around being broke then slide down the mountain at us.  All us became scared and ran to the porch of the house for protection.  When I seen my cousin run I knew it had to be something.  He is in his late thirties and has grown up in the mountains.  He is familiar with the animals sounds and the layout of the mountain.  I don't know if it was anything or not, but it sure scared the heck out of us.",
  "classification": "Class A",
  "county": "Madison",
  "state": "North Carolina",
  "latitude": 35.892,
  "longitude": -82.829,
  "location": "-82.829,35.892",
  "location_details": "Edited out per request of witness and family.",
  "temperature_high": 83.57,
  "temperature_mid": 75.75,
  "temperature_low": 67.93,
  "dew_point": 68.11,
  "humidity": 0.79,
  "cloud_cover": 0.54,
  "moon_phase": 0.97,
  "precip_intensity": 0.0146,
  "precip_probability": 0.76,
  "precip_type": "rain",
  "pressure": 1016.83,
  "summary": "Light rain in the afternoon.",
  "uv_index": 9,
  "visibility": 6.57,
  "wind_bearing": 238,
  "wind_speed": 4.57
}