{
  "id": "475",
  "title": "Rock hunters watch tall upright figure along Lake Superior near Newberry",
  "date": "2005-07-15",
  "timestamp": 1121385600,
  "observed": "To begin with, I'm not sure what I saw, but it was something I couldn't identify, so I thought this might be the right forum to approach it. During the summer of 1993, my brother and I were looking for Lake Superior Agates along the shore of Lake Superior about 3-4 miles west of the mouth of the Two-Hearted River.  It was mid-afternoon on a windy and overcast day.  When looking for agates you spend much of your time looking at the ground, but occasionally stand up to stretch your back and  look down the beach.  It was during one of these times I noticed a figure some 300-500 yards down the beach standing at the tree line in the direction from which we'd been walking.  My first instinct was that it was another agate hunter and I voiced this to my brother stating that we now had \"competition\". As I watch the figure I noticed that it did not bend over (which is typical of agate hunters) nor did it move from its position at the tree line. It was at this time I realized the stature of the figure when I compared it to the nearby pines.  I then asked my brother to retrieve my binoculars from by day pack on my back, because that was the \"tallest person\" I'd ever seen and wanted to take a closer look. I also thought I might be catching a rare glimpse of a bear.  Instead of handing me the binoculars, by brother observed the figure through them first.  When I asked him if it was a man, he said he couldn't tell, but it was \"a man-like figure\".  He then gave me the binoculars to get my opinion.  On looking at the figure through the glasses it was magnified considerably, though I could discern no color variations.  The figure was completely black.  I observed the figure walk from the tree line to the shoreline a number of times, but could not distinguish what it was doing exactly.  At one point the figure began walking towards us and made both my brother and myself quite nervous.  By this time we realized we may be seeing something extraordinary.  The figure cut another 100 yards between us in a very short period of time, but still no discernable color variations where you would expect to find them.  At this point, I observed the figure bend down and pick up a beach rock and toss it into the lake (underhand).  It was at this point when I decided it was a man and told my brother this based solely on the fact that it tossed a rock into the lake.  This seemed to satisfy both of us and we continued our rock hunting ignoring any subsequent activities of the figure. In retrospect, I believe we were so quick to identify the figure as human because we had to return to camp in the same direction and the alternative to the figure being human was unacceptable.  We did not look for prints on our way back nor did we discuss the incident until some days later (there was no reason to do these things, because we had resigned ourselves to identify the figure as human).  A few days later, we were conveying the story to a relative jokingly referring to it as our \"bigfoot story\".  When our relative asked us \"why wouldn't a bigfoot throw rocks\", we realized we may have identified it as human too quickly and unfortunately may have missed more detailed identification through the investigation of footprints.",
  "classification": "Class B",
  "county": "Luce",
  "state": "Michigan",
  "latitude": 46.71195,
  "longitude": -85.38834,
  "location": "-85.38834,46.71195",
  "location_details": "End of County Road 412, about 3-4 miles west of the mouth of the Two-Hearted River",
  "temperature_high": 82.16,
  "temperature_mid": 73.25,
  "temperature_low": 64.34,
  "dew_point": 60.12,
  "humidity": 0.69,
  "cloud_cover": 0.07,
  "moon_phase": 0.29,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.87,
  "summary": "Clear throughout the day.",
  "uv_index": 8,
  "visibility": 9.44,
  "wind_bearing": 121,
  "wind_speed": 2.81
}