{
  "id": "13411",
  "title": "Man recalls a nighttime sighting while viewing the city lights in Chataqua Park",
  "date": "1995-11-01",
  "timestamp": 815184000,
  "observed": "I live in Denver, Colorado and I may have seen a bigfoot when I was in college in Boulder, Colorado several years ago. This occurred in November 1995. I was a freshman college student in Boulder, Colorado, and I used to like hiking in Chataqua Park nearby, which is higher than the rest of Boulder and faces the city. One night I was in Chataqua Park at about 11pm. It was cold and I was standing in my coat, looking down at the city lights. Suddenly, I heard a rustling sound and turned toward it. That's when I saw a large figure that was silhouetted against the city lights. It looked like a very large, hairy, naked person with a powerful build, broad shoulders, and a relatively small, pointed or bullet-shaped head. It spotted me, which made me afraid of being attacked, but instead it began running toward the cover of the trees. Its running gait was unlike that of any person I had seen. It was a kind of hunched-over, loping gait. Nevertheless, the figure moved quickly and disappeared behind a tree. That was all I saw of the figure. I have always considered this a possible bigfoot sighting.",
  "classification": "Class A",
  "county": "Boulder",
  "state": "Colorado",
  "latitude": 40.00817,
  "longitude": -105.298,
  "location": "-105.298,40.00817",
  "location_details": "The location was in Chataqua Park near the campus of the University of Colorado at Boulder. To reach Chataqua Park, just drive west on Baseline Road from the CU Boulder campus. You will drive up a short but fairly steep hill, and the park will be on your left side and clearly labled.",
  "temperature_high": 26.01,
  "temperature_mid": 17.325,
  "temperature_low": 8.64,
  "dew_point": 22.69,
  "humidity": 0.91,
  "cloud_cover": 1,
  "moon_phase": 0.32,
  "precip_intensity": 0.0019,
  "precip_probability": 1,
  "precip_type": "snow",
  "pressure": 1016.26,
  "summary": "Overcast throughout the day.",
  "uv_index": 2,
  "visibility": 3.85,
  "wind_bearing": 20,
  "wind_speed": 8.75
}