{
  "id": "6534",
  "title": "",
  "date": "",
  "observed": "I was just a young boy then staying at my grandfather's farm in the summer time.  I slept up in the attic at night with my uncle Donnie who was helping my grandfather with his dairy farm.  We had just laid down when my uncle Donnie got right back up and headed downstairs.  I was on my stomach looking East out the window. (We had two windows in the attic for ventilation.  One was on the west and the other was on the east end.) We had a small brooder house just east of the farm house.  I also was looking out over the kitchen roof which was actually an add on to an old house porch.  Suddenly a \"man\" walked out in the open from just north of the brooder shed as a truck pulled into the driveway.  At the same time a truck pulled into the drive way. The driveway came up the hill (the one lane gravel road ran north to south) to the east and then curved toward the north (to the kitchen area).  The headlights glanced or lit up the creature.  Three things I noticed.  First the hair, face, or body did not shine or reflect any light.  The creature was very dark.  This could be one reason big foot is difficult to spot or see in wooded areas.  Secondly, I realized it did not look like a man because the arms were abnormally long.  Just like a man the arms were swinging, but closer to the knees than the ordinary person.  Height appeared close to that of a normal adult male.  I would say under six foot tall but not under five foot tall.  The head was fairly rounded. The creature dashed off to the west, and quite frankly I was petrified with fear.  My uncle Donnied liked to scare me with \"Boogie Man\" stories, and I had just seen my first real live one. A little later the truck left and my uncle Donnie came up.  I told him I had seen somebody outside by the shed.  He went back downstairs, told my grandfather, and they grabbed their shotguns and searched around the house, and then drove the old ford pick-up up and down the road several times with flash lights.  They did not see or find anyone.",
  "classification": "Class A",
  "county": "Spencer",
  "state": "Indiana",
  "location_details": "As you travel south on highway 131 from Gentryville, you will hit a curve that turns east from an intersetion with a highway that comes from boonville, IN.  At a sharp curve back to the south towards Chrisney, IN, you turn off to the east and follow a one lane country road east to an T intersection with a another country road.  You will be about 1/4 mile off 131.  Then you turn left on this gravel road and head north.  You will see the old barn and farmhouse just to your right.  Today a cell tower stands on the property which makes it easy to spot and identify.",
  "summary": ""
}