{
  "id": "33764",
  "title": "Daylight sighting by a retired Wildlife Officer outside Ocala",
  "date": "2012-02-21",
  "timestamp": 1329782400,
  "observed": "On February 21, 2012 at aprox 2:55pm while traveling on a back county heavily wooded road in Ocala Florida, I observed an animal coming out of the woods on the South side of the road heading North. From this distance I first thought this was a bear coming across the road, however I did notice that the way this animal carried himself did not appear to be a bear. The animal was walking on all fours but appeared to be larger in the front of his body but lower in the hind end, much unlike a bear. He seemed to be bobbing up and down and seemed to me that it was injured. As I approached closer I could see that he was walking on the knuckles of his front arms, appearance was dark brown shaggy coat, not like smooth sheen coat or  fur that would be on a Florida black bear. As the animal approached the edge of pavement, he then stood up on it's hind legs with a slight curvature and legs bent, he then crossed the road on its hind legs arms swaying or swinging (longer appearance of arms as that of a primate)as I approach closer to the animal and start to slow my vehicle down, this animal turned its head and glanced partially, (matter of factly). At this point I could tell there were no ears such that a bear would have and knew it definitely was not a Florida black. The upper body was massive and as it went down to the hind quarters got increasing smaller. I would estimate that this animal would be 7ft aprox. weight would be around 400 lbs (my best guess).I could not tell what the hind feet looked like due to the amount of hair but I did note that they were longer than that of a bear. As he neared the edge of opposite side of the road he then returned to walk on all fours and as he entered the edge of the wooded area he stood upright again placing right arm on a pine tree, looked over at me and at this i was at a stand still in my vehicle, I could see a full face. Distance from the animal was 50-60ft away.I could tell that he had more of a round shaped eyes, from this distance they appeared to be dark in color with a lighter color of hair around eyes (short and greyish brown, older in  appearance) same hair color would be around the side of face and what would be the area where the ears would be. The nose appeared to be shorter than that of a bear but different than an ape, didn't have a larger lower lip or chin. the area where the mouth and nose is was short hair and skin appearance.I could also see that the long hair on the arms did not go all the way to the hand area. Hands seemed from that distance to have five fingers much like that of a primate would have. At this point he entered the wooded area and was out of sight.",
  "classification": "Class A",
  "county": "Marion",
  "state": "Florida",
  "latitude": 29.16722,
  "longitude": -82.01917,
  "location": "-82.01917,29.16722",
  "location_details": "",
  "temperature_high": 72.13,
  "temperature_mid": 62.91,
  "temperature_low": 53.69,
  "dew_point": 49.65,
  "humidity": 0.71,
  "cloud_cover": 0.19,
  "moon_phase": 0.99,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1022.51,
  "summary": "Partly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 5,
  "visibility": 9.84,
  "wind_bearing": 98,
  "wind_speed": 1.52
}