{
  "id": "1283",
  "title": " Heard and then chased by creature",
  "date": "1992-02-15",
  "timestamp": 698112000,
  "observed": "I never saw it,...But I heard it and it was an experience I will never forget as long as I live! I was living at The Everglades Institue (on Loop Road, across from that old gas station that is where the road used to get really bad). This where the old town of Pinecrest used to be located in the thirties.  Al Capone ran a speakeasy and gambling joint in the area at that time.  I was walking on the path that makes its way around the pond at E.I.  There were five geodesic dome cabins around the pond.  It was just after 10 PM.  My cabin was number three. It was pitch dark out, with no moon, and there was twisted jungle and you can imagine that kind of plant growth if you've been to the Glades. I became aware of something way off to my right of the path I was walking to my cabin I heard scattered footfall noises.  Twigs breaking.  I didn't think anything of it.  There are deer all over the place there, so it was no big deal to me at first. However, when I stopped to listen.  The noises stopped. I would start to walk and they would resume.  Each time I would begin to walk, and the noises resumed BUT MUCH CLOSER EACH TIME. I still get goosebumps thinking about it. DEER DON'T DO THAT!  They prance away, they don't come closer! Now what still amazes me, and what was most peculiar about was happening to me then was:  How can anything move so quickly through that undergrowth,...  I mean, you know, it didn't make sense.  And no person could pull a trick like that, you'd poke your eye out on a sharp branch. After the third time I had stopped,...and resumed walking, the noise was very close. Less than twenty feet away I remembered thinking to myself.  I also had noticed the noises of the footfalls were widely spaced apart,...parallel but yet on an intersecting tract. I yelled at it like you would yell at a rogue dog that was menacing you, all the while walking that much faster,...In a couple seconds I realized this wasn't working and that's when I panicked and ran as fast as I could back the way I had come. It was only 300 feet back to a clearing behind the director's mobile home trailer, and I know I covered the distance faster than any Phys. Ed experience that I might have had in High School but it followed me so closley I could hear its breathing and it was coming from above my head and twenty feet or so in back of me. I never looked behind me, and as I hit the clearing I was sure it was going to take me down. But I guess the light scared it from the trailer at the other end of the clearing.  The field wasn't lit up,...but I became relieved as I became aware it was dropping back,...and at one point it ran back into the woods loudly and the scattered noises it made in the thicket were just a few and then nothing, no sound.I felt it was watching me from just out of sight. I told the director and he went out with his .44 magnum,...and shot off a few rounds. It took an hour for me just to go back outside, so maybe it left while he was dismissing the incident over his theory it was a jaguarundi, or someone's pet cougar that got away, and went wild. Big cats growl, and this thing that breathed like it did was no cat.  This thing was a foot taller than a man because the breathing noises I had heard were definately well above my head and I'm 6 feet tall! What I experienced that night was many, many, many more times frightening,...than you can ever imagine.  My only real regret was that I didn't have a shared experience with a friend who could vouch for what happened. I did not feel this creature is benevolent, or passive like you might read about in other stories.  Maybe that is because the area of the occurrence is close to an overflowing human population that might have disgusted the creature toward man in some way during its life.  Maybe it was wounded, or molested in some way.  I would have to say this \"thing\" was  definitely NOT friendly! It was stalking me no doubt.",
  "classification": "Class B",
  "county": "Monroe",
  "state": "Florida",
  "latitude": 25.782,
  "longitude": -81.07385,
  "location": "-81.07385,25.782",
  "location_details": "Take US 41 (Tamiami Trail,...is known as S.W. 8th St.) out of Miami forty miles.  Take a left onto Loop Road at the Forty Mile Bend,...proceed 12 miles west on Loop Road.  The remains of Everglades Institute are on your right over the other side Of a cattle gate.  Opposite side is an ancient gas station (pumps are still standing I believe),...The pond is located 500 feet into the property (13 acres) which now is owned by the park service.  Talk to Larry Muldoon, he lives in the area and sometimes camps mear the pond.  Tell him John sent you.  He isn't real \"keen\" on people,...but he probably will let you look around the pond if you tell him about the story you read and your interest in the creature.  He has some personal experiences of his own.",
  "temperature_high": 80.16,
  "temperature_mid": 70.845,
  "temperature_low": 61.53,
  "dew_point": 63.26,
  "humidity": 0.73,
  "cloud_cover": 0.35,
  "moon_phase": 0.4,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1018.88,
  "summary": "Partly cloudy throughout the day and breezy in the morning.",
  "uv_index": 6,
  "visibility": 8.75,
  "wind_bearing": 150,
  "wind_speed": 8.14
}