{
  "id": "25257",
  "title": "ATV riders find possible tracks outside Evarts",
  "date": "2008-10-15",
  "timestamp": 1224028800,
  "observed": "In October 2008 we went on a 4 wheeler trip to Harlan county,  in eastern Kentucky near the Big Black Mountain area, we do this several times each year. My friend,  (Ricky)  also brought along 2 of his friends who were visiting him from Florida. Let me add here that these 2 men are also great hunters, and trackers as is \"Ricky\" which is how they became friends in the first place....   Now on to the story...............  On the 2nd morning of our ride we were off the regular riding trails, and into some very thick forested area, and sometimes you could say we were not even on a trail at all. We rounded a small hill which headed down  into a large valley, and across from us on the opposite hillside, in the direction we were heading to stood up a large Black Bear. To say the least we were very excited, and we immediately sped up to try to get a closer look at him before he ran away.  It was plain to see that what little trail we were trying to follow would take us right up the hillside where the Bear was heading, so off we went as fast as we could go.  When we reached the top of the hill, the Bear was already gone into the deep woods, and could no longer be seen.   We stopped our 4 wheelers, and sat there getting ready to talk about what we had just seen, when one of the guys from Florida said \"well look at this fella's\" Let me also add here that it had rained the day before we arrived so there were many places along the trails that still had water in the old 4 wheeler tracks, and lots of fresh mud.........  So right there in the middle of the trail was a set of very large foot prints,  heading along the trail, on up the mountain, but not along the path the Bear had just taken.  I knew immediately what I was seeing from the many Bigfoot tracks I have seen on web-sites, from books, and even TV programs, but I didn't know what to say, so I waited.   The other man from Florida said, ( you know what that looks like? ) no one said anything, so he went on and said  ( that's one of them Bigfoot prints ) I almost fell off my 4 wheeler, I said (do you really think so?)  he said (sure , if you hunt as much as we do back in Florida, its not unusual to see them on occasion)  I can't begin to tell you how relieved I was to hear them say this, as I have always been very discreet with my belief in Bigfoot's existence, and as a Pastor/Minister you have to be so careful around people.   Now for the real shocker..........   I looked at my friend \"Ricky\" and said (well Rick, what do you think?)  and he looked me straight in the eye and said, ( I know they exist I've seen one before )   I literally jumped off my 4 wheeler and said ( you got to be kidding me )  We then both learned that although we had been friends for all these years, we had never talked about Bigfoot to each other, and now I find out that he once saw one, needless to say I was blown away from this revelation.   I want to leave that story for another post, later.  some added info on this story...... ( there were a total of 4 tracks (2 left and 2 right footprints) , going in a straight line right up the middle of the trail.  Each print was around 4 to 5 inches wide, and at least 14 to 15 inches long, from toe to heel.   ( I want to add here that the prints gave the impression that they looked longer because of the up-hill climb, and the slippery mud)  but this is just my impression from first looking at the tracks. Each track had 1 Big Toe, and there were sometimes 3 other toe's, and on one track there was 4 toe's, or what looked like the slight imprint of a 4th toe.    The length of the stride was somewhere near 4 1/2  to 5 feet...... This is only a guess, because none of us had a ruler, or tape measure.     ",
  "classification": "Class B",
  "county": "Harlan",
  "state": "Kentucky",
  "latitude": 36.89771,
  "longitude": -83.16293,
  "location": "-83.16293,36.89771",
  "location_details": "Follow the railroad tracks East out of town and take Nance Lane North",
  "temperature_high": 80.96,
  "temperature_mid": 70.29,
  "temperature_low": 59.62,
  "dew_point": 56.45,
  "humidity": 0.75,
  "cloud_cover": 0.15,
  "moon_phase": 0.53,
  "precip_intensity": 0.0007,
  "precip_probability": 0.48,
  "precip_type": "rain",
  "pressure": 1021.29,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 4,
  "visibility": 8.72,
  "wind_bearing": 233,
  "wind_speed": 3.54
}