{
  "id": "799",
  "title": "Person fishing recounts story of his encounter with a large, bipedal creature that was wading in the water",
  "date": "1978-04-15",
  "timestamp": 261446400,
  "observed": "The main sighting, as I wish to refer to it here, took place in Limestone county along Elk Creek. It occurred in the spring of 1978 or 79. I cannot seem to recall eactly since it has been many years ago. I'm in my early 30's now but, at the time of the sighting I was 13 or 14. I was on an annual family visit to my Grandparents place in Athens. We had gone out to \"the River\" for a few days. I can't recall what day it was but I do remember that is was in the early afternoon. I was a typical kid then so naturally I was doing kid stuff. I had a Frog gig and I was downat the boathouse pier throwing it into the shallow water trying to randomly hit something in the water. ( I did nail a Crappie but, I did not hurt it bad so I let it go). At the end of the slew was a swampy area. This area started approx. 175 to 250 yards from my Grandparents cabin. It was shallow water and several hardwood trees such as Oak or Dogwood, for example, growing within the swamp. The swamp went back perhaps a few miles. (No one in my family nor myself, except maybe my Grandfather, had ventured too far into that swamp). Along the sloping bank from the cabin to the swamp were 3 other cabins with piers. Across from the cabins is a gentle sloping pasture, next to it are a couple of cabins and boathouses. It seems that every time I was at the boathouse and I looked across the water there were always cows in the pasture. However, that day I just let the Crappy go and I happened to look out toward the swamp. As i did I noticed something emerge from the swamp, next to and below the pasture fence about 50 feet, and wade into the water of the slew. It was dark in color, black I think,( this I know because it was a sunny day), it stood upright. It had waded into the water \"knee\" deep. I did not really pay attention at first thinking it was a Bear. However, I looked again a few seconds later and soon realized it was not a bear. It was tall, approx. 8 or 9 feet, well built, and very hairy. I could not make out any facial features due  to the distance, I did not notice a neck and the head was round shaped. The animal proceeded to look both ways, it then bent over at the waist and took its left arm and swung it into the water. I noticed the splash. The animal did this twice. It then stood up and looked straight in my direction. It stood there a few seconds then turned around and walked back into the swamp just like a person would. I stood there and just of shrugged my shoulders and went back to messing around. About 3 or 4 minutes later I looked back toward the swamp again and the creature came back out from the same spot that it had before. It waded \"knee\" deep into the water once again and did the exact same thing over that it had done before, including looking my direction once again. It then turned around and wandered back into the swamp in the same area it had come out of. It did not come back out again, for I stayed at the pier for about another hour and I keep looking that-a-way several times. To this day I am convinced that it was trying to catch fish. I never felt I was in any danger even though it was an odd experience. However, being at that age I did not want to go outside alone after dark for any reason including to use the bathroom. ( The cabin bathroom was in the basement and one had to get to it by going outside). It took me a few years too be comfortable there at night. In regards to that sighting there was something I noticed, there were no cattle to be seen in the pasture at the time of the sighting! The funny side to all this is that I had carried a pair of binoculars down to the pier with me and left them sitting next to me on the upper rail. Not once did it occur to me to pick them up and use them! A side note Two weeks earlier two boys had found large human like footprints in that region somewhere as reported in a local newspaper. About ten years ago my Grandmother sold the place. However, I was in Athens a couple of years ago so I drove out to \"the River\" too see the old place. No one was there so I took the liberty of walking downto the pier and boathouse. Except for a new paint job on the cabin and a refurbished boathouse nothing had changed over the years. The slew and swamp were still the same. I remained for an hour picking up fossils since the water was down, it being late summer. During that brief time I looked toward the swamp periodically remembering, wondering, and well, kind of hoping.",
  "classification": "Class A",
  "county": "Limestone",
  "state": "Alabama",
  "latitude": 34.92855,
  "longitude": -87.1105,
  "location": "-87.1105,34.92855",
  "location_details": "The main sighting report I leave here happened in Limestone Co. Alabama along a slew of the Tennessee River named Elk Creek, Approx. 12 miles (northwest, I think) from Athens. The other lesser sighting or encounters I list are all from the southeast Alabama area. They are from Coffee, Geneva, Henry and Pike Counties.",
  "temperature_high": 76.3,
  "temperature_mid": 63.215,
  "temperature_low": 50.13,
  "dew_point": 42.51,
  "humidity": 0.54,
  "cloud_cover": 0.5,
  "moon_phase": 0.26,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.32,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 9.02,
  "wind_bearing": 63,
  "wind_speed": 2.7
}