{
  "id": "45851",
  "title": "Motorist observes a large biped crossing US-33 at night near Plattsburg",
  "date": "2014-07-11",
  "timestamp": 1405036800,
  "observed": "As I was traveling South Bound on US 33 approximately 5 miles from US 116 near Plattsburg MO on Friday July 11th 2014 at 11:48 pm, I witnessed a sizable creature cross the roadway from West to East jump the fence in pass into the corn. I was nearing the rounding of a sharp curve in the road which features a gully that empties into a creek, that then empties into an outer portion of the Little Platte River. The area is a mixture of farmland, which is primarily corn or soybean ground, some cow pastures and a mixture of  trees, gully's, and waterways which flow into the river. As I entered the curve my eyes caught a a large shadow as it crossed the road 50 yards in front of me. My initial reaction to this was oh a deer, there are probably more so I hit the brakes a slowed slightly. In the time it took me to blink my eyes and reopen them the shadow had passed completely across the roadway and was at the edge of the ditch, as the distance between us closed and more of the light from the headlights illuminated the shadow. I was able to get a better view of what I was dealing with. What I had thought was a deer was in fact much larger, and upright. As the light caught the side of the creature it made an extremely agile motion which consisted of two steps from the edge of the ditch to the fence line. In the same motion the creature placed its left hand on the top wire of the fence, jumped and cleared the fence with both feet and disappeared into the corn. Description: Height: 7' to 7 1/2' it was very tall Width: Unknown, my view was a complete side profile view Depth: 24\"-30\" easy maybe more Hair: shaggy light red/brown. The hair length on the body, at least the portions I was able to see varied, some portions were longer others shorter. Reminds me of how the hair is on my Golden Retriever in a way. The creature was very stout and the weight had to have been 350-400 lbs. possibly more. I did not get a view of the creature's head or face at all, the face was a complete shadow the entire time and even with the light from the headlights there was no eye glow. The feet and legs were all but blocked from view as well either from the lack of light or from the vegetation once it was in the ditch. The portion I got the best view of was the left arm as it braced the top wire of the fence and made its jump over.  The arm was very large and hair covered, the hair appeared to be longer above the elbow than it was below, with the hair on the hand being the shortest.",
  "classification": "Class A",
  "county": "Clinton",
  "state": "Missouri",
  "latitude": 39.60238,
  "longitude": -94.40015,
  "location": "-94.40015,39.60238",
  "location_details": "I could provide the approximate location again but there are no real distinguishing landmarks which make this area of the roadway stand out from the rest of the surroundings.",
  "temperature_high": 87.91,
  "temperature_mid": 81.4,
  "temperature_low": 74.89,
  "dew_point": 68.65,
  "humidity": 0.74,
  "cloud_cover": 0.13,
  "moon_phase": 0.47,
  "precip_intensity": 0.0005,
  "precip_probability": 0.16,
  "precip_type": "rain",
  "pressure": 1016.17,
  "summary": "Partly cloudy in the morning and humid throughout the day.",
  "uv_index": 9,
  "visibility": 9.94,
  "wind_bearing": 174,
  "wind_speed": 8.17
}