{
  "id": "16580",
  "title": "Afternoon road-crossing sighting by motorist on RT 61 near Concho",
  "date": "2006-10-26",
  "timestamp": 1161820800,
  "observed": "My name is Dr. XXXXXXXXXXX I'm a chiropractor. One afternoon a few weeks back, I was on my way from Show Low, AZ to a ranch past Concho, AZ to work with a horse.  I'm certified in animal skeletal adjusting (chiropractic for animals.) Between the Y in the highway and Concho, about 6 miles outside of Concho, at about 2:30 PM, on a clear, sunny day (Oct. 26, 2006), I saw something come up onto the road about a half mile in front of me.  At first, I thought it might be a very large dog as it initially was coming up onto the road, but as it fully entered the highway, I could see that it stood straight up, to a height about as tall as a road sign, maybe 6 or 7 feet?  It had long, dark brown hair from top to bottom and stood absoulutely straight up, no slouch, no forward bending at all. It ran across the road from my right toward my left and remained fully standing as it ran off into the brush.  The full incident took maybe 10 seconds. The area I live in is plentiful with big animals - elk, deer, bear, big cats.  Many of my patients come to see me for injuries after auto encounters with these big animals.  I've had some very close calls myself.  During the 12 1/2 years I've lived here I've seen several animals I had never seen in the wild before.  Each one, including a coaty mundi, were immediately recognizable.  My far vision is incredibley good. It is my habit to drive hypervigilant for animals here. I'm quite familiar with bear movements since they are pretty well a nuisance to locals and spotted often here.  It's the only other local animal that could have possibly fit the description as far as fur, color and standing height.  However, bear do not stand straight up to run across a road.  In fact, they don't stand straight up.  When they stand, they sort of hunch and hang their front paws.  This did no such thing. Immediately, I was very confused because I thought it looked like how a sasquach is described, but I didn't believe there might be any such thing as sasquach/bigfoot in Arizona of all places.  The Pacific Northwest, maybe, but Arizona?   It was beyond my conception. Since then, my wife and I have been looking for information on the web and have discovered that there have been sightings in this area for years by the White Mountain Apaches, who are generally pretty closed mouthed about it. In retrospect, I realize I should have stopped and searched for tangible evidence, but I had an appointment and didn't want to be late. I am fully convinced of what I saw and confident in my observation capacities.",
  "classification": "Class A",
  "county": "Apache",
  "state": "Arizona",
  "latitude": 34.325,
  "longitude": -109.64,
  "location": "-109.64,34.325",
  "location_details": "Coming down off a slight rise.  The sides of the road were low, you would have to climb up onto the highway.  There were lots of junipers about 10 to 15 tall on both sides of the road.  I failed to get a road marker.  It happened so fast and I was so unprepared.",
  "temperature_high": 55.25,
  "temperature_mid": 42.445,
  "temperature_low": 29.64,
  "dew_point": 26.74,
  "humidity": 0.58,
  "cloud_cover": 0.07,
  "moon_phase": 0.15,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1021.52,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 10,
  "wind_bearing": 313,
  "wind_speed": 5.77
}