{
  "id": "30063",
  "title": "Man recalls nighttime encounter near DeQueen",
  "date": "1989-10-14",
  "timestamp": 624326400,
  "observed": "Let me start by saying that I hesitate to tell my story to you but I need to.  When I moved to DeQueen, Arkansas in 1987 I was told about a story of a \"wildman\" that some of the locals called this thing described as a big, hairy, wild man.  A girl that I knew swore that while parked out in the country it came up behind her car and bounced it up and down by putting hands on the trunk.  She was terrified.  About 2 miles from where she said that happened, I had an experience myself. It was very isolated and in an area of deep woods, prior to Weyerhouser coming in and clearcutting a lot of the forest.  Some logging had been done, and some of the pine trees were growing back and were 8 to 10 feet tall. My friend and I were about 18 years old and went out to this place which was on an old logging road that went out into the woods about 1/2 mile and just had a turn around spot.  It was a very rough road that you had to go slowly down, especially in my car.  I would typically drive with my foot on the brake to get in there. Me and my friend went out there to talk because his girlfriend was pregnant and he didn't know what to do.  There was a full moon that night.  I got out and went to the back of the car to urinate.  Thats when I heard the footsteps.  Something was walking through the woods, obviously on two legs.  The noise of the steps was weird because I could hear each step so loud.  I remember thinking that is a two legged something going \"step, step, step\".  It seemed to be quite a ways away from the sounds I heard, like maybe 60 yards.  But, as it approached, the heavy footfalls became obvious that it was not a deer.  It was walking on two legs.  Then, I saw it moving thru the trees.  It was like a huge man.  It stopped about 20 yards from me and looked at me over the top of the pine trees.  I could see the big black eyes shining in the moonlight and the head.  It was a large head and I didn't stay for long.  I had a primal \"fight or flight\" experience and a dose of adrenaline that I didn't know was possible.  Scared me so bad I didn't even get my pants zipped up before I jumped in my car, started it, and floored it.  I nearly drug my oil pan off going out on this road about 35 mph.  My friend thought I had lost my mind.  When I hit the paved road, my car spun halfway around.  I regained control and floored it again.  I couldn't even tell him until we were a few miles down the road. I went back the next day with my older brother with guns and a tape measure and showed him the spot.  The trees where I saw this thing were 9 and 10  feet tall.  His head was just over the top of the trees and the lower face was at the top.  I never went back there at night and didn't talk about it for a long time. I know in my heart that it was a bigfoot.  I know without a doubt that I heard him, saw him thru the pines walking for about 10 seconds, and then he stopped and stared at me.  I could see the shape easily because it was a full moon.  I'm not exactly sure on the date that I submitted.  It was approximately October of 1989.  He was like a big man walking behind those trees.  I remember seeing the arms swinging and the two legs moving.  There was no smell and the eyes didn't glow red--just black shiny eyeballs.  Big eyes too.  I never went back after my brother and I went back the next day.",
  "classification": "Class B",
  "county": "Sevier",
  "state": "Arkansas",
  "latitude": 34.08204,
  "longitude": -94.3457,
  "location": "-94.3457,34.08204",
  "location_details": "It was a place that the road was blocked off by the police by a barrier because the high school kids were going out there to party.  It was about halfway between DeQueen and DeQueen lake.",
  "temperature_high": 83.73,
  "temperature_mid": 72.12,
  "temperature_low": 60.51,
  "dew_point": 57.48,
  "humidity": 0.65,
  "cloud_cover": 0.06,
  "moon_phase": 0.49,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.63,
  "summary": "Clear throughout the day.",
  "uv_index": 5,
  "visibility": 8.59,
  "wind_bearing": 163,
  "wind_speed": 6.25
}