{
  "id": "40645",
  "title": "Memory told of observing a hairy biped close to Civil War fortifications near Fort Lee",
  "date": "1981-09-19",
  "timestamp": 369705600,
  "observed": "During early fall of 1981 when I was in 9th grade, several of my friends and I were playing war in the woods of the Petersburg National Battlefield.  We rode our bikes to one of the wooded fortifications next to a stream.  That was our base where we parked our bikes.  We would form teams and on this day throw pebbles for a kill when you found someone. So one team would wait three minutes while the other team hid.  During one of our breaks I was busting some softball sized rocks against each other in the stream to see the crystals inside.  After we were done, near sunset, we started riding back to the base housing and I remembered the rocks and decided I wanted to go back and get some of the chips.  So two of my friends and I doubled back and coasted downhill and then up the embankment.  We stopped at the top and upon looking down at the stream saw what looked like a black bear in the stream where I had left the rocks.  When it stood up on two legs, turned around and looked at us we all started screaming because it was not at bear at all.  Though we were 40 feet apart we did not see a face, but the smell was like road kill.  It then ran on two feet without making any sound that I could hear north along the stream faster than we could have rode our bikes.  We rode back toward the base and gathered older kids playing basketball and went back searching armed with sticks, rocks, and mop poles.  No tracks or other signs beyond a few more turned over rocks in the stream were found.  We decided it was either a Bigfoot or some advanced all over hair ghillie battle suit with six million dollar man powered legs.",
  "classification": "Class A",
  "county": "Prince George",
  "state": "Virginia",
  "latitude": 37.248,
  "longitude": -77.354,
  "location": "-77.354,37.248",
  "location_details": "If you are going toward Hopewell from Petersburg on 36 there is a circular \"subdivision\" across from the gates on the left.  At the time, the basketball courts are on the northwest side and the trail into the woods runs northeast kind of parallel to 36.  The stream starts at the subdivision and runs through the woods below the earthen walls toward the northwest.  I could provide you GPS coordinates if that helped.  I can still see the area on google maps though I now live in Florida",
  "temperature_high": 69.14,
  "temperature_mid": 61.305,
  "temperature_low": 53.47,
  "dew_point": 48.7,
  "humidity": 0.66,
  "cloud_cover": 0.39,
  "moon_phase": 0.7,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.1,
  "summary": "Partly cloudy until evening.",
  "uv_index": 5,
  "visibility": 8.13,
  "wind_bearing": 279,
  "wind_speed": 8.59
}