{
  "id": "25454",
  "title": "Man remembers observing creature taking food while camping near Manchester",
  "date": "1984-08-01",
  "timestamp": 460166400,
  "observed": "My sighting happened while camping a mile into the woods where several reports were told to me in southeastern Indiana.  I saw the creature from behind and the side while it was squating down and eating our food that we had tied up in a tree, about 12 to 15 feet up.  The night was a very clear, hot summer night, with a 3/4 full moon.  The encounter started with hearing vocalizations from off in the distance that moved closer to our camp sight.  The woods were dark and the only visuals we had were from the light of our fire.  we could hear heavy foot falls the closer the creature got to us and we heard splashing as it rounded a pond that was at the bottom of the trail, down the hill from us.  With this, the five of us freaked and ran into our tent to hide.  We could hear branches breaking along the path from the pond as the heavy foot falls got closer.  With that we heard a loud SNAP which we belive was the branch breaking where our food was tied up.  The pillow case it was in was shreaded and we heard the unmistakeable sound of plastic bags being ripped apart and crunching as it ate our chips and doritos.  I heard the sound of what I can only describe as an aluminum can being torn apart.  With that, my curiousity got the best of me and I raised up from my kneeling position to peek out the tent window.  About ten feet away from the tent, this huge dark hairy creature was squatting licking out my can of bean dip.  When it had finished, it casually tossed it into the weeds, poked through the remains of the chips, stood up and walked on up the trail, over the hill.  i would estimated this thing to be about seven to eight foot tall, very muscullar build, large powerful thighs and arms, covered in dark brown/black hair.  It's head was set into it's shoulder muscles kind of like a gorilla.  Also, it had a gamey smell to it, kind of like a really dirty, wet dog.  At dawn we investigated the area and found the bean dip can just torn open.  The branch that held our food had been pulled down and the pillow case was in shreds.  As we packed up to leave, some guys came down from the top of the hill where they had been staying in an old cabin.  They asked us if we had been messing around their sight because all of their gear and food had been raided in the night.  We told them the same thing hit us earlier in the night.  With that, we packed up and left post haste.",
  "classification": "Class A",
  "county": "Dearborn",
  "state": "Indiana",
  "latitude": 39.17295,
  "longitude": -84.971,
  "location": "-84.971,39.17295",
  "location_details": "",
  "temperature_high": 81.73,
  "temperature_mid": 76.78,
  "temperature_low": 71.83,
  "dew_point": 67.82,
  "humidity": 0.77,
  "cloud_cover": 0.83,
  "moon_phase": 0.16,
  "precip_intensity": 0.0075,
  "precip_probability": 0.62,
  "precip_type": "rain",
  "pressure": 1018.89,
  "summary": "Rain in the afternoon.",
  "uv_index": 6,
  "visibility": 8.75,
  "wind_bearing": 180,
  "wind_speed": 4.58
}