{
  "id": "4808",
  "title": "Road trip pit stop in the woods",
  "date": "2002-08-04",
  "timestamp": 1028419200,
  "observed": "Hi there, i don`t know if this is of any intrest or help to you but i just wanted to tell it anyway. I´m a 23 year old german/american who just came back visiting my uncle in Spokane, WA. I live in Stuttgart, Germany. On August 2nd i visited my cousin who lives in Bellingham, WA. My partner on this trip was my uncles American-Staffordshire \"Kane\". We had a nice weekend in Bellingham and so on. We drove back on August 4th at about 7-7:30PM. We took Interstate 5 and then Highway 20 cause i wanted to drive through Skagit Valley and the N.Cascade NP. At about 9PM i had to loosen my water(hopefully u know what i mean). We were just about by a River of which i don`t exactly know the name. I pulled over to the side and what happened then has changed my thinking of the world a lot. I got out of the car looking for relief and all of a sudden \"Kane\" started growling like i never heard him before(the window on his side was rolled down a little). It was almost dark so i looked over around but couldn`t see anything, so i thought maybe a deer or something. I went on with my buisness and then \"Kane\" totally flipped out(Barking and everything), so i looked around and saw something real big jumping over the streets with like 2 steps and then vanishing in the woods(It was about 30yards away). Since i`m a courageus youngster from a relative big city(Stuttgart has about 700000) i decided to check it out. So i got \"Kane\" on the leash and we walked to that position and after about 20yards the dog stopped, pressing out all his muscle and started growling. I tried to pull him with me but he wouldn`t move a inch. I had a little flashlight with and pointed towards the woods but couldn`t see anything. Then i realized this awful smell(smelled like ferrets but much more intense). The dog then started backing up and i thought it was time to get outta here! We were back at the car when all of a sudden the bushes and trees behind us started cracking and bursting towards us. We got in the car and hit the gas. The reason i´m writing you is this: I´m not supersticous at all, Am.-Staff`s are courageus dogs and i never seen a probably 6`5\" man running across a street vanishing in the woods in my life! I haven`t told no one about this and probably wont, `cause they`ll think i`m crazy. But since that day i believe that there are somethings on this earth which man can`t explain. Hope i didn`t waste your time. Thankfully G. R.",
  "classification": "Class A",
  "county": "Whatcom",
  "state": "Washington",
  "latitude": 48.53944,
  "longitude": -121.745,
  "location": "-121.745,48.53944",
  "location_details": "About 10-15Miles into North Cascade National Park. Route from Bellingham to Spokane. Near a bigger river.",
  "temperature_high": 63,
  "temperature_mid": 58.605,
  "temperature_low": 54.21,
  "dew_point": 51.89,
  "humidity": 0.79,
  "cloud_cover": 0.8,
  "moon_phase": 0.86,
  "precip_intensity": 0.0104,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1017.01,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 5,
  "visibility": 9.16,
  "wind_bearing": 189,
  "wind_speed": 5.67
}