{
  "id": "35218",
  "title": "Possible incidents at Bear Island Campground in Big Cypress National Preserve",
  "date": "2012-03-11",
  "timestamp": 1331424000,
  "observed": "Sunday, March 11, 2012 shortly past midnight. We were camping in a primitive campsite at Bear Island, Big Cypress Preserve in Collier County Florida. This campsite is off of ORV trails, meaning only off-road vehicles with permits may enter this area. It was a warm evening after a late afternoon rain shower. We had a camp fire burning, there were five of us at camp that night along with two Jeeps parked away from campsite. After sitting near the campsite I wanted to retrieve my charging cell phone from my Jeep. As i walked away from the camp and into the darkness of the night, I reached my Jeep, as I was opening the door, I had a feeling someone was watching me. I looked to my left and about 15' into the woods I saw a pair of glowing yellow, human shaped eyes staring back at me. I am 6'6\" tall, and these eyes were level with me, possibly a few inches upward. I could feel the eyes staring into mine, and I watched them blink, slow and deliberate, just like a human. The overwhelming odor was undeniable it smelled like a combination of skunk and wet dog. Every hair on my body stood up right, I had instant goosebumps from my head to toe, and every instinct told me to flee. Without hesitation I quickly returned to the campfire.....Telling everyone what I had just witnessed, and assuring them I was not joking, I gathered a spotlight and a companion and walked over to check it out, without a sound we crept up, and heard nothing. Shining the light into the woods we did not see any signs of an animal, no deer, no bear, no low branches for an owl to be perched on, just a bare spot in the woods where the eyes were coming from. I have watched shows where people talk of Bigfoot sightings, and I always question them. I say I would have chased that thing through the woods with a camera and a flashlight. but now I understand, when you do see something like this, its a combination of shock, fear, and instinct. I would not write in with this sighting if I didn't feel in my gut, and in my mind what I saw, was not something that SHOULD have been in those woods.I was reassured of my feelings this past weekend when we returned to camp in the same spot. We camped in the same location this past weekend. April 28th-29th 2012. Pink jeep number 7, Bear Island Campground, Big Cypress Preserve. This encounter however was not visual, but audible. We had a campfire, there were five of us sitting there. It was approx 10:15, when I playfully made a loud and long howl (Call) into the woods. However we all were astounded when I almost Instantly got a response. The howl, was not a coyote, it was not an owl, or a bear. And it was not a human playing along. The direction the sound came from, was also the direction I had seen the eyes in the woods previously. It is dense woods with no campsites, or foot access. Forward an hour in the future. Me and my daughter and wife are in our tent. My two friends are already asleep in theirs, staked out next to mine. The back of both of our tents are facing the opposite woods that we had heard the howl from. After being in our tents and laying down with the lights out. We were startled, by the loudest crashing sound coming from the woods behind us. It sounded like something just grabbed a tree, snapped it, and smacked part of it against itself. The sound was followed by a few footsteps, then silence. It was so loud and an unexpected sound it awoke the two friends in the tent next to us with a \"what the heck was that? \". My daughter was the first to notice the odor that was suddenly lingering. Her and my wife compared it to skunk, i thought it smelled more like wet dog, urine smell. Very similar to the odor I noticed previously with the eye incident. I did scout the area where we heard the noise, but could not see anything. No fallen trees, and no obvious damage from where I could access. It did start to rain in the area early in the am. So when we woke up, it had been raining for sometime.Making it harder to notice anything out of place. Am I 100% positive I saw Skunk Ape? No, but I am 100% positive there is something down here, and it could be just that. I do think some further investigation would be very beneficial.",
  "classification": "Class B",
  "county": "Collier",
  "state": "Florida",
  "latitude": 25.889,
  "longitude": -81.3215,
  "location": "-81.3215,25.889",
  "location_details": "Pink campsite #7 , Bear Island, Big Cypress Preserve, Collier County, FL",
  "temperature_high": 86.61,
  "temperature_mid": 75.4,
  "temperature_low": 64.19,
  "dew_point": 63.55,
  "humidity": 0.75,
  "cloud_cover": 0.53,
  "moon_phase": 0.62,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1022.92,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 8,
  "visibility": 9.7,
  "wind_bearing": 87,
  "wind_speed": 4.59
}