{
  "id": "23760",
  "title": "Memory told of possible vocalizations and rocks thrown at Lake Kinkaid.",
  "date": "1978-04-02",
  "timestamp": 260323200,
  "observed": "In 1978 I went fishing with a friend in his boat which was an 18 ft aluminum fishing boat to Lake Kinkaid, southwestern Ill. We trolled around the banks of the lake all morning and all day fishing for smallmouth bass till just before dark. Then my friend says lets cruise around awhile at speed. We cruised around for awhile then to a large cove across from the dam and stopped approximately 50 meters from shore. Then we both witnessed something on a rocky (where brush was so thick people didn't walk) brushy cliff shaking the trees very violently making grunting sounds about at least 60 meters away, but we could not see what was shaking the trees. I was thinking to myself it would have to be a huge buck with antlers just crashing the trees. But then from that place a huge rock was thrown at us and landed 15 feet from the boat with a giant splash. From the size of the splash this rock was at least 5 to 10 pounds. my friend said what the heck was that!!! We both knew this rock was thrown many times further then any olympic shotputter could have thrown and NO HUMAN could have thrown a rock that size that far. Then more shaking of trees and another huge rock was thrown at us coming very close to the boat. My friend says lets get the hell out of here and started the motor and we took off. My friend has since passed away in early 2008.",
  "classification": "Class B",
  "county": "Jackson",
  "state": "Illinois",
  "latitude": 37.78048,
  "longitude": -89.45728,
  "location": "-89.45728,37.78048",
  "location_details": "",
  "temperature_high": 74.02,
  "temperature_mid": 68.69,
  "temperature_low": 63.36,
  "dew_point": 53.41,
  "humidity": 0.67,
  "cloud_cover": 0.9,
  "moon_phase": 0.83,
  "precip_intensity": 0.0037,
  "precip_probability": 0.59,
  "precip_type": "rain",
  "pressure": 1014.92,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 8.46,
  "wind_bearing": 158,
  "wind_speed": 7.58
}