{
  "id": "10863",
  "title": "Two young men have a sighting while tending a campfire near Cardington.",
  "date": "2005-01-13",
  "timestamp": 1105574400,
  "observed": "My friend  lives outside of Cardington. It was about 6:00 P.M. when I got to his house and we decided to build a small camp fire just for the sake of fun. He lives right next to a small wooded cliff that follows a tiny  river. Right behind his house next to the cliff that leads into the small woods is his security light that stays on all night. It was about 9:40 P.M. that night and we had a really good camp fire going when he said “we are just about out of wood… do you think you could take the flash light and pick up some small twigs to keep this fire going.” At the time I really didn’t think anything of it and being a hunter and all I’m not scared of going into a woods at night. So, I said “sure” and took the flash-light and proceeded down a cut path on the face of the hilly cliff. The first step I took heading down that hill I will never forget for the rest of my life. As I took my first step onto the path I saw a massive black object/thing at the bottom of the cliff in a wall of weeds taller than me. Now, I’m about 6’ 1” and this black thing was a good 8 feet in height or taller. The weeds at the bottom were it stood are a good 7’ in height or longer themselves. With said, I just stood there froze in fear asking the same question in my head ‘what the hell is it?’ As I stood there it just moved side to side like a large animal studying it’s pray for the kill. At that time it looked up at me with its red eyes and that is when my heart dropped to the bottom of my small intestine. The red eyes on this thing glowed off the security-light at the top of the cliff and I was just scared shitless. After about two minutes of just standing their motionless, I finally managed to move my arm in a backwards motion to touch my friend on the shoulder. When I did that Josh said “what” and turned towards me where he got a fearful look at this thing as well. He then yield “shit” and took off for the door to his house leaving me just standing their thinking ‘o-shit he just left me hear by myself with this thing.’ About that time this large bear/human looking thing just took off running in a mad run for the riverside; crossing it towards the field on the other side. When that happened I took off towards the house door as I fell over myself just turning around. As for what I seen that night I really can’t say. But I do know one thing and that is it was no person or animal I’ve ever seen. I would also just like to add that later this past week myself, my friend, and some college friends took a walk down into the woods in the middle of the night where we discovered and photographed three large footprints coming up out of the river bed.",
  "classification": "Class A",
  "county": "Morrow",
  "state": "Ohio",
  "latitude": 40.50945,
  "longitude": -82.87663,
  "location": "-82.87663,40.50945",
  "location_details": "Just outside Cardington.",
  "temperature_high": 63.92,
  "temperature_mid": 43.965,
  "temperature_low": 24.01,
  "dew_point": 46.26,
  "humidity": 0.76,
  "cloud_cover": 0.59,
  "moon_phase": 0.12,
  "precip_intensity": 0.0178,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1007.43,
  "summary": "Breezy until afternoon and rain starting in the afternoon.",
  "uv_index": 1,
  "visibility": 8.55,
  "wind_bearing": 200,
  "wind_speed": 10.78
}