{
  "id": "11946",
  "title": "Footprints and vocalizations culminate in a brief sighting for a family living near Savannah.",
  "date": "2003-04-07",
  "timestamp": 1049673600,
  "observed": "The first incident for me happened in late winter 2003 around the end of February or early March. I had an exchange student living with me and my family and she had a snow day so we headed outside that day. Since she rarely gets to see snow I thought it would be a treat to walk around and play in the snow. I told her we would take a short walk into the pine grove behind us even though it is not our land, I figured it wouldn't hurt for her to take some pictures of the trees. As we were walking I was struck at the fact that I couldn't find her any animal tracks. I just figured it was new snow and the tracks had been covered up. As we walked I was really surprised how quiet it was. Again thinking the new snow had something to do with it. There are a lot of crows in the woods but that day they made no sound. As we walked we did come along some tracks. I asked her what did she think made those knowing what I was thinking; I wanted to hear what she had to say first. She said it looked exactly like some one was walking around barefoot. She asked me what kind of animal has footprints like a human. I thought about bear but have studied bear print pictures and these were very long and narrow. The fact that there were only two also eliminated the bear. There was no overlapping of prints. The space between them was really far as well. I am not tall but I didn't even come close to stretching my stride that far. We followed the footprints and they had stopped and looked as if they squatted down. Just the toes were showing which consisted of the five toes. We looked up and the tracks stopped just inside the woods looking towards the back of my husband’s shop. That kind of freaked us both out. The footprints started to turn and walk up the fence post in the direction they had come. My exchange student wanted to follow but I said no way. She even had a camera with her and we didn’t even think to get a picture. On Spring break in April of that same year my daughter and I decided to go hiking in the late afternoon, in our other neighbor’s woods across the street after getting permission. They have about 400 acres of woods and we had never been in it before. When we went in we were both surprised how rugged and diverse the landscape was. There was a swamp on the property as well as high cliffs. We had walked for a very long time trying to stay near the river. When I slipped down a very steep incline we both heard a very loud deep growling in the thick underbrush on the other side of the river. It was too dense for us to see what had made the scary noise and I told my daughter to run as I knew there was no way I was getting back up the hill with a bad knee. She came down anyways and we heard it growl again but this time farther away. We headed back home after that as it was getting late. Curiosity got the best of us and we headed back the next afternoon taking along our exchange student. As soon as we entered the woods we heard the growl. We couldn’t see it this time either. We kept walking for a long time but never heard it again. We went the next afternoon including my husband this time but we didn’t hear anything. There were only two things we saw strange that day; one was as we were cutting across a field headed for home several turkeys came running fast from the woods just ahead of us followed by a couple of deer. My husband said we must have spooked them and I said if that were the case why did they come our way and not head into the woods? The other thing that was odd was a medium size log was placed over the entrance to the path we had been taking on those earlier afternoons. I asked the neighbors if they had placed it there and they said no. The following evening at my home I had to let my dog out at 10pm before we went to be. I had turned on the smaller porch lights that didn’t illuminate the yard as well as a big street light we have. When I stepped out the door to get my dog that wouldn’t come in I smelled the worse B.O. smell I have ever smelled. I got my dog and something to the left of me caught my eye. It was some kind of creature near the corner of the house and it looked as if it were squatting down. I could see it had very long reddish hair and I really couldn’t fathom what it was. It never even looked my way just stood motionless. I ran to get everyone else to see it. When they came out they couldn’t believe what they smelled. It filled the entire yard and was very thick. No one else got to see this thing because it was gone. We also kept hearing something knock on a tree 3 times several evenings after that night of the smell. The following weekend I and my daughter plus two of her male friends went to check out the neighbors woods once again. We walked for sometime but saw nothing and headed back walking in a field next to the woods. I looked down and saw what appeared to be a large footprint that was human in appearance. I called the others and my daughter’s friend put his foot next to it. His shoe size was fifteen and this barefoot was much larger. We saw several that were walking on only two feet and had a very large stride, much larger than any of us could ever make. I remembered to use my camera that I had brought and I have a good picture of the print you could see it even more clearly in person then even the photo shows. I am reporting this because strange things have been going on for some time around here. I was just messing around with my spotlight scanning the fence row behind the house other night and a huge low growl happened again. I figured we were going to once again have a strange summer. My son told me a few years back that he and his friend had seen a very tall hairy creature salvaging in the back of my husband’s truck near the shop late one evening. He said he thought when it stood up that it appeared to be between 7 and 8 feet tall. Of course I figured he was just pulling my leg but now that I have seen strange things I believe he saw something as well.",
  "classification": "Class B",
  "county": "Ashland",
  "state": "Ohio",
  "latitude": 40.99562,
  "longitude": -82.38627,
  "location": "-82.38627,40.99562",
  "location_details": "",
  "temperature_high": 40.14,
  "temperature_mid": 36.935,
  "temperature_low": 33.73,
  "dew_point": 34.47,
  "humidity": 0.92,
  "cloud_cover": 0.98,
  "moon_phase": 0.18,
  "precip_intensity": 0.0177,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1020.73,
  "summary": "Rain until afternoon.",
  "uv_index": 4,
  "visibility": 4.97,
  "wind_bearing": 72,
  "wind_speed": 11.78
}