{
  "id": "40019",
  "title": "Possible daylight encounter after after initiating calls in Twelve Mile Swamp",
  "date": "2013-02-23",
  "timestamp": 1361577600,
  "observed": "Just last Saturday, February, 23rd, I was in Twelve Mile Swamp Conservation Area which is just north of the St. Augustine, FL Airport, bordered on the north by International Golf Parkway and running from Rte 1 on the east border to Rte 95 on the west. I had driven about 3 miles from Rte 1 west bound on International Golf Parkway to a trail entrance. I drove southward about 1.5 miles into the area then east about 1 mile when the road I was on ended at a cross road where several large pieces of logging machinery were parked. I had been knocking, hooting, whistling, talking for about 45 minutes out in the open, right in this intersection when I heard sticks breaking from something walking towards me in the woods. As it got nearer I heard several heavy, bipedal footsteps, almost stomping, coming very close to the wood line bordering the road. Then loud thrashing and intentionally loud moving about from just within the treeline, in the trees and behind 6 foot reeds/brush just on the other side of the drainage ditch between the road and woods. The noise was only 20 yards from me but I couldn't see anything as I stood on the edge of the road and peered in. Whatever it was, was very big and it sounded as if it was about to break into the open. I could not smell anything, nor had I felt I had been being watched. It approached quickly and with determination. I became nervous and walked back to my car about 50 ft. behind me. I was so sure something would break through the brush that I got in my car and turned it around for a possible quick getaway, back the way I had come. When I got out quickly and walked back to near the noise it was gone. I remained probably an hour trying to draw whatever it was back, but nothing. The reeds/brush were fairly thick but not super thick like a line of Palmetto. I was confused as to why I couldn't see anything or even brush moving. But the noise was loud and obvious and very close. Something was upset about my presence.",
  "classification": "Class B",
  "county": "St. Johns",
  "state": "Florida",
  "latitude": 29.96828,
  "longitude": -81.4048,
  "location": "-81.4048,29.96828",
  "location_details": "",
  "temperature_high": 82.16,
  "temperature_mid": 72.305,
  "temperature_low": 62.45,
  "dew_point": 64.18,
  "humidity": 0.76,
  "cloud_cover": 0.64,
  "moon_phase": 0.43,
  "precip_intensity": 0.0098,
  "precip_probability": 0.82,
  "precip_type": "rain",
  "pressure": 1014.21,
  "summary": "Rain starting in the evening.",
  "uv_index": 5,
  "visibility": 9.1,
  "wind_bearing": 227,
  "wind_speed": 7.35
}