{
  "id": "14404",
  "title": "Several sightings and strange occurences near a residence west of Goodwine",
  "date": "2003-09-06",
  "timestamp": 1062806400,
  "observed": "The first sighting was in late Sept to early October of 2003. I apologize for not remembering the date exactly. In the small town of Goodwine, IL on the west side. It was cool weather, clear skies, about 55 to 45 degrees F. The sun had just set and my kids and I had been collecting fire wood for a bonfire from the woods behind our property. I sent them and the dog inside to get ready for dinner. I went back to get a few more pieces of wood. I didn't have a flash light with me at the time and it was starting to get pretty hard to see so I went back to the house and as I walked down the road (which is a dead end road), I got within about 150, 200 feet of the house and that's when this big large dark thing appeared in front of me. It scarred me pretty good not because of its size but it was about 5 to 10 feet from me. It blocked the light from the house and the buildings across the street from our home. it quickly moved to the south into the grass and disappeared. This lasted a good 10 seconds. I then promptly made my way to the house. After a while I told the kids to stay inside and made my way to where it was. I couldn't see any thing nor did I find any sign of that there was any thing there. A few days later my wife said that she saw something out there in about the same location so I went out side and check things out I made my to edge of the property and didn't see anything but I did hear a sound like a hollow log or rail road ties being hit or dropped on each other in the distance. As I went towards the sound it got louder then went away. On my way back going down the same road in about the same place a dark figure looked like it was crouching in the tall grass along the road. I looked at it and continued to walk by it. It never moved nor did I hear any noise. The next morning I noted that the place that I saw this dark figure the night before the grass looked like a deer bed (matted down like when deer bed down in tall grass to sleep) and you could see where it pushed down the grass to leave. My wife told me that she had seen similar things out there in the same area and closer to the house after the two that I saw. Then after a few month of seeing nothing, it was a afternoon full sun and it was a mild day, my wife and I where siting at the kitchen table when a dark figure about 6 foot maybe shorter went down the drive towards the road. I at first thought that my eyes where playing tricks on me so I didn't say anything. Then my wife said did you see that? I replied the dark figure out in the drive. She said yeah. After that she saw another one close to the tree in the front yard by the drive at night with the flood lights on in about the same area where we saw the one in the day light. For note there is a wooded area right across from the house. I have never seen anything like this before nor did I believe that there was anything out there like this. I am a avid sportsmen and backpacker. I have hiked all over and never seen nor heard anything. I have also gone out at night and never came across anything like this.",
  "classification": "Class A",
  "county": "Iroquois",
  "state": "Illinois",
  "latitude": 40.34057,
  "longitude": -87.47077,
  "location": "-87.47077,40.34057",
  "location_details": "West side of town.",
  "temperature_high": 77.44,
  "temperature_mid": 65.42,
  "temperature_low": 53.4,
  "dew_point": 53.38,
  "humidity": 0.73,
  "cloud_cover": 0.03,
  "moon_phase": 0.37,
  "precip_intensity": 0.0005,
  "precip_probability": 0.3,
  "precip_type": "rain",
  "pressure": 1020.38,
  "summary": "Clear throughout the day.",
  "uv_index": 7,
  "visibility": 9.45,
  "wind_bearing": 87,
  "wind_speed": 1.65
}