{
  "id": "15211",
  "title": "",
  "date": "",
  "observed": "This just happened at 2:00 a.m. this morning and I got on this website to submit it as soon as I got home from the mountains.  I need help getting this recording off of my voice activated dictation tape recorder.  Windows Sound Recorder is just not doing the job. I submitted a previous report #1027 for an incident in Arizona in September of 2000.  The reason I even mention the previous incident was that the camcorder I was using then did not record the sounds we heard so I purchased a Bionic Ear so I wouldn't miss an opportunity in the future and in this case it proved itself invaluable. My 16 year old son and I took a camping trip into the High Uintah mountains of Utah to go camping to escape the triple digit temperatures expected for today in the lower elevations.  Our original intent was to camp at designated campsites either at Trial Lake or Lake Washington but both campsites were full and since it was starting to get dark I decided to just find a spot off a road somewhere and set up camp.  The paved road we were on ended and we stayed on the dirt road until we found a spot adjacent to Trident Lake at about the 9700 foot level that had thick, forest surrounded meadows on both sides of the road with the lower meadow encompassing Trident Lake. We set up in the trees next to a flat, three foot high by about eight foot diameter boulder that we used as a table, just off the dirt road.  My GPS unit marks our site at 40 deg 38' 57\" North by 110 deg 57' 51\" West but Google Earth put us at 40 deg 38'57.69\" North by 110 deg 57' 49.25\" West.  We set up camp a little distance from other people who had gotten there before us, some to the north, south and a relatively large encampment at the southern end of the large upper meadow to the west of the road.  The Bionic Ear is a parabolic sound reflector with a sensitive microphone attached to it with outputs to headphones and to a recording device.  My recording device is one of those inexpensive GE Auto Voice Tape Recording machines used in meetings to record what goes on during a meeting.  I had it all hooked up, not really expecting to even use it, but at 2:00 a.m. I was violently jolted awake by a voluminous, echoing, sonar like scream and it continued as I scrambled to turn everything on.  I twisted on the rheostat knob on the Bionic Ear and in my initial fumbling with the recorder I inadvertently hit the Stop/Eject button which opened the tape door and ejected the tape.  Cursing myself, I slammed the tape back in and hit the record button and out of the five screams that I heard (not counting what it took to wake me) I managed to record the final two screams. On the tape you can hear the screams with the dog in the adjacent campsite doing some woofs but it was subdued and not barking like I would have expected.  After the second scream, my son tries to make some sounds and you can hear me on the tape telling him to \"shut up\" because I didn't want anything interfering with this recording.  The sound was emanating from the upper meadow to the west and it was resounding off of the trees and surrounding hillsides which you can make out in the recording.  I didn't put the earphones on because I didn't need to, it was so loud, but the earphones started a feedback with the Bionic Ear after the screams had stopped so I had to move the headphones to a position on either side of my neck to stop the feedback.  I stayed awake for a while afterwards and there was no sound, not even from the other campers for about five minutes then I could hear conversations but not the content.  I could hear tree limbs breaking about half an hour after the screams and that is when I turned on the camcorder to find out what time it was and it was reading 2:38 a.m. Saturday, July 15, 2006.  When it was light I went to the other campers with the recording and several of them were not fooled into thinking that it might have been a lone coyote or something but they were initially loathe to come right out and say what they were thinking about it.  One of them said it sounded like a monster and then I said \"You think it might have been Bigfoot?\" to which I got a relieved \"Yes!\"  They were very glad that I had gotten that recording because they were starting to doubt what it was they heard.  The campers at the southern end of the West meadow said the sound came from the northern end of the meadow in the trees and they thought it was a coyote, but when you hear the tape, you know that it was not a coyote.  I lived on a 700 acre ranch for several years and we heard coyotes just about every night and this was no coyote unless it was the size of a buffalo.  The people who thought it was a coyote said their own dogs did not make a peep during the screams even though they usually would and those same dogs barked at me when I came to ask these people about the sounds.  My son also informed me later that he had been hearing the sounds before I woke up to record them but he didn't want to wake me.",
  "classification": "Class B",
  "county": "Summit",
  "state": "Utah",
  "location_details": "My GPS unit marks our site at 40 deg 38' 57\" North by 110 deg 57' 51\" West but Google Earth put us at 40 deg 38'57.69\" North by 110 deg 57' 49.25\" West.",
  "summary": ""
}