{
  "id": "30154",
  "title": "Turkey hunters hear possible howl and bipedal steps approach their camp near Brandywine",
  "date": "2010-11-01",
  "timestamp": 1288569600,
  "observed": "I had identified through the VA game finder website that Rockingham county (VA) was a good area for turkey hunting.  The spot I chose allowed us to park at a campsite (WV) and hike into the woods around 7-8 miles to the hunting spot (VA).  Let me start by saying that I was never into and never followed Bigfoot.  I know the story of course but never payed any real attention to it until I came home from the trip. We arrived at the campground late.  There was only 1 other camper there with a RV.  We started into the woods around 5pm.  The terrain is extremely rugged and steep.  As we were hiking we noticed that it was very quiet.  Not a single bird call, or anything.  It was an eerie feeling.  We set up camp about 3 miles on the path that led up to the observation tower (High Knob).  We had dinner and got into the tent around 9-10 pm.  Around 11-12 pm my brother and I heard a very odd howl, it lasted for around 10 seconds.  It was not a dog or bear or anything I had heard before.  I thought it was strange but assured my brother it was nothing.  Around 2 pm my friend woke me up and pointed at his ear, signaling me to listen.  I paused and listened.  To me I heard what sounded like someone  slowly walking up to our tent, choosing their steps very carefully.  I whispered to him its a deer to calm his nerves.  But all three of us listened as the steps got closer.  The steps were heavy but slow.  My brother said to me \"Get the shotgun.\"  But not in a whisper.  The steps stopped and sounded like they went the other direction.  I got out of the tent and saw nothing, it was too dark.  The next morning we continued up the hill.  At the top of hill .5 mile from where we camped there was a large pile of feces with acorns in it.  Possibly bear, not sure.  My brother was in poor psychical condition and could not continue so we decided to leave. When I got home I decided to see if i could find an animal call matching the sound we had heard.  I looked up a lot of different animals, from cougars to foxes.  Nothing matched.  Until I found a bigfoot website with sound recordings.  The first one I clicked was it.  I called my brother on the phone and said recognize this?  Played the recording and he said \"Hell yeah, that's what we heard in the woods.\" I've done a lot of research on Bigfoot since that trip and I'll be going back there this November, I'll try and do a few calls or knocks and see what happens.",
  "classification": "Class B",
  "county": "Pendleton",
  "state": "West Virginia",
  "latitude": 38.57502,
  "longitude": -79.18524,
  "location": "-79.18524,38.57502",
  "location_details": "Go west on 33 from VA to the WV side, first campground on the left before Brandywine.",
  "temperature_high": 52.72,
  "temperature_mid": 41.275,
  "temperature_low": 29.83,
  "dew_point": 31.12,
  "humidity": 0.69,
  "cloud_cover": 0.03,
  "moon_phase": 0.83,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1027.37,
  "summary": "Clear throughout the day.",
  "uv_index": 3,
  "visibility": 9.97,
  "wind_bearing": 17,
  "wind_speed": 2.48
}