{
  "id": "8717",
  "title": "Snowmobilers have daylight sighting near Ashburnham",
  "date": "1977-12-17",
  "timestamp": 251164800,
  "observed": "I'd like to make a report, however it was years ago but I remember every part pretty well. I told a few folks about this over the years and they think I was nuts. But doesn't matter what they think. I was close enough to know what it was. I would say about less than 50 ft. Right in the middle of a fire road. In December 1977, my dad, uncle and my dad's other friends and myself went up to the cabin owned by a hunters club in Gardner, Mass. We went to spend the night, cook food and my dad and his friends like to play cards after eating supper. Myself and a friend used the snowmobile with a sled attached to the back, we took turns driving the ski doo around and the other would stand on the foot rest on the sled. The area was in northern central Massachusetts, very close to New Hampshire boarder. The cabin is in Ashburnham Mass. It's about 2.5 miles up a fire road called Old Colony Road. I remember it was a snowy winter that year. The area where we saw this thing was right on the edge of a swamp, old train tracks run right thru the area and crosses the fire road that we used to get to the cabin. It was about 4 p.m. or so, it was just getting a little dark. My friend and I left the cabin with the snowmobile, he was driving first and I was on the foot rest on the sled. We left and came up to the swamp, crossed over the tracks and headed down the road about 50 ft or so. It was getting a little late and we decided to not go to far so we turned the sled around on the road. Had to pick it up because of the narrowness of the road. Once we turned it around it was my turn to drive. So now were facing the tracks and the swamp is on both sides of the road. the road goes right thru the swamp and the tracks cross right by the edge of the swamp. At this point I looked behind me to see if my friend was on the sled and holding on, when I looked up I saw this creature walking on 2 legs like a human. He crossed right by the tracks at the edge of the swamp and crossed the road right in front of us. I remember it looking at us and I remember the arms swing clearly. Just like the pictures I have seen from your site. Very similar. Anyway, I remember the its size, that's what was scarey, so large, I'd say about 7to 9 ft high, weight about 400 to 500 pounds. At least for something that size it would most likely be heavy. I know the woods there well. I've spent years in the military and hunt every year. I have been trained in tracking and survival in the woods so I know what I am saying and what I saw. But the thing took about 2 steps and he was across the road. All black hair, didn't notice any smells, but I can tell you this. I won't forget that day ever. It was cold anyway and with no breeze the smell of it wouldn't travel far. My friend was shocked. He won't even mention it when I see him these days. He told one person and they treated him like he was on drugs. So thats why I never wanted to tell to many people. I wanted to say something about it now because I just say a program on TV the other night about bigfoot and the Kiamichi Mountians, I think in Oklahoma or somewhere out there. I remember one other thing that might be relevant. That being noises I have been hearing over the years in the woods there. Something like a crying sound but so load it almost seemed as if it were close by. I think it was a ways away because when we heard the sounds it was late, about midnight. We sit by the fireplace outside the cabin sometimes late cooking steak or deer meat on the grill. Behind the cabin is a huge swamp area that goes up to Route 12 in Ashburnham, Mass. The swamp is down a bit behind the cabin. We find moose droppings back there and lots of tree scraps from deer. I beleive there passing thru that area at times. Those sounds I heard were never heard there before and I don't hear them now when I go up there. Every now and then they seem to come back, but only when were outside sitting by the fire. Strange indeed. These woods go far as well and you could easily travel them and end up in New Hampshire or further without seeing a house. As time goes by and the more I read about what other folks saw and the similarities between each story I'm more wanting to do some of my own investigating, but its very scary out there at night, especially for me. I carry a loaded .44 when I'm up there just because I have seen this thing up close enough to know what it was. No doubt in my mind.",
  "classification": "Class A",
  "county": "Worcester",
  "state": "Massachusetts",
  "latitude": 42.6688,
  "longitude": -71.9023,
  "location": "-71.9023,42.6688",
  "location_details": "Traveling northerly direction, crossing a swampy area and old train track beds that pass thru New Hampshire north.",
  "temperature_high": 37.91,
  "temperature_mid": 28.655,
  "temperature_low": 19.4,
  "dew_point": 16.71,
  "humidity": 0.57,
  "cloud_cover": 0.09,
  "moon_phase": 0.25,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.49,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 1,
  "visibility": 9.45,
  "wind_bearing": 323,
  "wind_speed": 7.69
}