{
  "id": "29315",
  "title": "",
  "date": "",
  "observed": "November 15-19.  Witness: James Scott. HUNTING. Heard:  During the night (whole trip) -Heard what appeared to be loud squirrel barks and trees being knocked down during the middle of the night. -Something running around the tent.  (Thought it was coyotes chasing three wild kittens that were hanging around the campground.) -Something was moving the items around in the back of Scott’s pick-up truck. -Tree Knocks in the night coming from three different locations around the lake (first just one knock bouncing back and forth then two knocks). -On the third night I was growled at while placing the park camping fee registration in the box. -Constant sounds of something dropping heavy objects in the lake. During the night and while hunting -Heard constant “what appeared to be owl hoots” coming from different locations around the lake.  These hoot sounds followed us where ever we hunted. -On the morning we were packing up our camp site an old man stopped his truck next to our site and spoke with us about different topics.  During the conversation he stopped abruptly and pointed to the forest next to us and said he saw a man walk in the forest wearing all black.  This area is all marsh and difficult to walk.  When I looked I didn’t see anything.  Saw:  Discovered while hunting an elaborate curious landscaping in a forested area near a dam that sits adjacent to two lakes.  It appeared in this landscaping well gardened plant on rotting or decayed trees.  One pile of trees contained a pile of seeds neatly arranged in the open on top surface of one the trees. - There was also a vine of thorns (like a fence) circling one area containing a growth of plants on an arranged pile of decaying trees (similar to Bermuda lawn grass).  The plants were well groomed and did not match the other trees that contained only moss. -One large slanted tree held the same plant growth and appeared to cover half of the tree.  This plant growth was not located on any other trees in the immediate area. -A canvass three tree structure that stood seven feet high and was interwoven at the top of the structure. -The place reminded me of a well cared for garden. -A stream with muddy banks split the forested areas between the two lakes in observation.  On one side of the banks were several sets of what appeared to be human hand prints leaving out of the water.  The arrangement of the prints appeared to emulate that the position of its body is in the water and the trunk of the body was supported by the arms as it was searching the embankment.  All of the prints appeared to possess an inch to two inch pointed claws.  No foot prints were discovered at all.  No evidence of any animal leaving the waters edge. -In the night-I shined a flash light and observed two very large and round “orange” eyes in the forest near our tent.  The eyes were situated about six feet above the ground.  These eyes moved several times during the period that I shined my light.  I measured the distance the following morning by comparing the height of the eyes to a tree that was near the spot. -Other observations include a bedding area that appeared to contain at one time two animals five to six feet in length.  The area was in a tall grass space within a heavily forested area.  Both places appeared to be something that was sleeping in a fetal position.  Next to the bedding area was a four inch wide by six inch tall make shift lean to that contained at one time a small fire.  The charred items within the lean to were small branches and dried grass. December 6-10, 2010.  Witness: Chris  HUNTING First night: (Sunday) -Chris and I were the only campers in the campground. -While using the outhouse, I heard hooting from across the lake, an animal next to the outhouse responded to the hooting by responding with a chimp rant changing tone to what resembled a samurai chatter, then ending in a deep guttural sound.  (The event reminded me of a kid telling his mom, “I am here at the campground!”)  Something opened and closed the door on the female side of the outhouse.  I immediately called Chris to come toward the outhouse. -Placed three apples on an empty campsite's picnic table as a lure.  The apples were never touched. -Shined my flash light into the adjacent forest and located two very large eyes in the forest.  They appeared to be six feet above the ground.  The set of eyes changed from two eyes to one eye as the figure appeared to turn and walk toward the lake. -About an hour into retiring for the evening.  Someone appeared to be fanning our extinguished camp fire.  I heard the wood that was left in the fire pit being moved around in the pit.  I heard the occasional clinking of the wood against the metal barrier. -I saw what appeared to be a kitten lifted and placed against the tent.  The paws were off the ground and not on the tent siding “too high above the ground.” All - -- All night something was unzipping and zipping the tent. -Someone was dropping heavy objects into the lake all night. -Heard what appeared to be a very big squirrel run around the tent in deep leaves all night. -Knocking throughout the night once on a metal sign or something. Following morning: (Monday) -Back window of my GMC Envoy “mud splattered” with a “Z” form and a palm print.  No finger prints. -Because I was kept up all night - I mimicked several times loudly a hysterical laugh and owl hoots to tease the animal who kept me awake all night. -Park attendant told us that a previous camper told him that, “you have Sasquatches in these forests.” -On other side of lake - saw a black figure run into the campground that appeared to come out of the lake. -Hunted near a concrete damn on the lake.  Heard some animal crying Maaaw-Maaaw-Maaaw.  Sounded like a bear cub but more like a southern country boy. -At dusk, while heading toward the outhouse, Chris heard an animal mimic my hysterical laugh in the woods next to the outhouse. -Dusk to late night I heard an animal constantly running in the woods.  Sounded like a very large squirrel. -Rock thrown at new campers twice when they left to buy beer.  The sound of the rocks hitting the trees and camping gear were a large audible crack. -When the new campers placed firewood in their pit, the wood lit up immediately. Their site had been empty for over 48 hours. -Owl hooting sounds all night.  Not exactly like owls really sound. -Heavy objects being thrown in the water all night. -Someone was tapping our coleman lantern glass cover that was 6 feet off the ground hanging on a metal pole. -Playing with tent zipper all night again. -Running around tent in leaves. -Around (0400am) I was awakened by three quick, heavy and deep exhales right outside of tent next to me. Tuesday: (duck hunters) Started duck taping the zipper inside the tent. - I again mimicked a hysterical laugh and owl hoot to tease the animal who kept me awake all night. -Come duck hunters who came in late at night said they saw eyes in the far corner of lake, while they were hunting in the early morning. -The duck hunters said something was hitting their camper truck during the night, they believed it was coyotes. -I was growled at in the night placing money into the payment box again, like I was in November. -Was growled at on the far side of the lake while looking for an entry point into a heavily wooded section of the forest. -On the same ‘far side of the lake’ I noticed several tin cans of food scattered along a five foot stretch along the path.  Upon further examination of one of the tin cans I noticed several tooth punctures into the can on both the lid and sides of the can.  “U” shaped like a large human bite.  The teeth marks “itself” were circular and large in form and shape like a dog/canine teeth would leave. -Chris and I found an orange ball cap on the trail on our return trip back to the campsite.  There wasn’t one on the way into the woods.  Chris and I asked all campers - no one admitted ownership. -Heard the Maaw-Maaw again in the woods around the campground. -At night I heard a car honk its horn on the main road outside of the campground - when the car horn ceased, I heard “beep-beep” in the woods.  Sounded like the voice characterization of the road runner on the cartoons. -Dusk to late night I heard an animal constantly running in the woods.  Sounded like a very large squirrel. -Early in the morning heard noises around my vehicle.  Activate automatic locks on my car, activating the vehicle to honk its horn.  Something then appeared to run across our campsite. Wednesday: (eight foot) -Chris saw an eight foot Bigfoot fifty yards from the tent.  Just stood there swaying side to side at his hip.  Chris said the shoulders were broad and had a “V” shape starting from his shoulders and ending at his waist.  I stood next to the tree the following morning.  Chris said the head was as high as the branch that stood eight feet off the ground. -New campers set a tent right next to the tree where the Bigfoot was seen. -Something threw a rock at Chris and me while we were around the fire.  The rock hit an exhausted fire ash pile next to the fire pit. -Hunters next to us claimed to have seen a person in all black through his rifle scope, stand up and walk into heavily a wooded area.  The person in black was well over 200 yards away. -It rained all night - our camp site smelled like a wet dog. -Something was dragging a stick on the sides of our tent, occasionally tapping the stick like a drum beat against the siding of the tent. -Had to use port-a potty in the tent - when the lid of the potty hit the vinyl of the tent heard foot steps advance toward our tent, stop right outside the tent, and appeared to adjust its weight.  (Seemed like the animal was curious to hear what was going on inside the tent).  I seen no images against the tent.  Too dark. -No running animal sounds in the leaves this night. Thursday: (On all fours) -Around 0400am in the morning some animal was throwing around stuff in the back of the truck owned by the campers in the site next to us.  Something then pounded on the sides of the truck like a drum.  I heard one of two hunters stir inside their tent and yell, “you dirty Indians!” -Saw a large human foot print in a gravel sandy bank while hunting a fire break during the day.  The foot print was three inches larger than my 9” boot. -At dusk saw a pair of large vertical eyes at the base of the tree where Chris saw the eight foot Bigfoot.  The eyes moved behind the tree.  I turned off the flash light and turned it back on and saw a Bigfoot running on all fours from the tree where I saw the eyes to moving in a direction toward the lake.  The Bigfoot appeared to have a strange shape to it.  The head in reference to its back appeared totally straight.  The head was constantly affixed in one position - looking directly at the ground as it moved forward.   The body appeared slender and I could distinctly see the shape and muscle tone of the shoulders and legs.  It looked human but the head had a large crown and its eyes were large and black.  The mouth was very close to the chin and the lips appeared to be very straight.  I could distinctly see the skin through the hair.  It appeared to be grayish pink. -More hooting and water splashes. Friday: -In the mornings I normally stored my car keys to the GMC in the vehicles gas cap access area.  On this particular day when exiting the tent to cook breakfast, I noticed that the gas cap compartment door was open.",
  "classification": "Class A",
  "county": "Fannin",
  "state": "Texas",
  "location_details": "Please contact me prior to posting.",
  "summary": ""
}