{
  "id": "46604",
  "title": "Driver notices \"Something out of Place\" along Hwy. 42 near Paisley",
  "date": "2014-08-15",
  "timestamp": 1408060800,
  "observed": "The date was Fri., Aug. 15th, 2014. I had arrived on Amtrak from Kissimmee to Deland an hour late which made it 3:40 pm. I waited ten minutes for my luggage, then left the station to take CR42 West to Lady Lake. It was between 4 and 4:30 pm while I was driving that I noticed something running on someone's farm land. There were cows gathered in a pasture near the house. The creature was running in their direction but at a long even stride. I was probably about 150 yds away on the highway. It was brown/black in color and was the same all over. The stride was long, maybe about 3 1/2 to 4 ft. between steps. The creature looked at least 6' ft tall. It was the first thing I thought of as it was on two legs and all the other animals were on four. It looked out of place. No one else was around as far as I could see. The creature was running along the fence line. Which should be mentioned is that CR42 runs the southern edge of the Ocala National Forest where sightings have been seen. On Sept. 4th I had to pick up tickets in Deland for a trip. I took the same road but passed the farm because of traffic behind me. I wanted to photograph the area but couldn't.",
  "classification": "Class B",
  "county": "Lake",
  "state": "Florida",
  "latitude": 29.97454,
  "longitude": -81.55172,
  "location": "-81.55172,29.97454",
  "location_details": "I was going west of 42 after coming off Hwy 44 over the St. John's River Bridge.",
  "temperature_high": 85.57,
  "temperature_mid": 79.6,
  "temperature_low": 73.63,
  "dew_point": 73.82,
  "humidity": 0.85,
  "cloud_cover": 0.15,
  "moon_phase": 0.68,
  "precip_intensity": 0.0003,
  "precip_probability": 0.23,
  "precip_type": "rain",
  "pressure": 1015.83,
  "summary": "Humid throughout the day and partly cloudy until afternoon.",
  "uv_index": 9,
  "visibility": 9.39,
  "wind_bearing": 211,
  "wind_speed": 3.25
}