{
  "id": "10095",
  "title": "Large truck halts in front of sasquatch on I-84",
  "date": "1985-12-15",
  "timestamp": 503452800,
  "observed": "I just found your site and do not remember all the details of my sighting but here is the best I can remember of the night I saw something on Cabbage Hill in Oregon; It was December of 1985, right around Christmas. I was driving a truck and trailer going back to Texas from Portland, OR. My co-driver was asleep when I saw it cross the highway (I-84) on top of Cabbage Hill at about 1:30 a.m. I came around a small curve and it looked as surprised as I was. I stopped with it in my headlights and it stopped right in front of me as I almost hit it (about 2 feet from it) and sat and watched it stare at me through the windshield. I was driving a 1984 Peterbilt, long-nosed tractor, which as I recall the top of the hood is about 6 1/2 ft from the ground to the top. This creature was head and shoulders above the top of the hood as it looked at me look back. It was blondish-brown in color, had bright yellowish-red eyes and was not as mean looking as some have told in the TV shows that try to scare you about it. It had some hair but was not as hairy as a bear. I thought at first, it might be a bear that has been losing its hair. It had very human-like features, like a nose that seemed to me as large but human-like. It's mouth was formed like a human's but its teeth were a bit longer but not like fangs. It's belly button was long and deep, it had an inny. It walked like an old man with a back ache, kind of bent slightly forward and stiff. Its arms were longer than a man's but it didn't look like a gorilla with arms too long for its body. I remember thinking to myself that this must be some sort of mutant bear or something. It seemed mad that I was invading its space, it straightened upright and slapped the top of the hood right above the radiator with open hands like it was warning me to leave it alone. I woke my co-driver but he only saw it as it ran into the woods away from the highway where I sat wishing I had a camera to take a picture to show everyone this thing I had seen. I often looked for it the next few years as I drove through this area but never again saw it or anything like it. I would love to know if this creature has been seen by any other drivers that would be willing to have a composite drawing done to see if we could identify it better.",
  "classification": "Class A",
  "county": "Umatilla",
  "state": "Oregon",
  "latitude": 45.5789,
  "longitude": -118.6016,
  "location": "-118.6016,45.5789",
  "location_details": "Top of Cabbage Hill, east bound lanes, I cannot remember the mile marker.",
  "temperature_high": 25.35,
  "temperature_mid": 20.475,
  "temperature_low": 15.6,
  "dew_point": 14.05,
  "humidity": 0.82,
  "cloud_cover": 0.76,
  "moon_phase": 0.14,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1034.77,
  "summary": "Foggy overnight.",
  "uv_index": 1,
  "visibility": 3.67,
  "wind_bearing": 126,
  "wind_speed": 1.52
}