{
  "id": "9204",
  "title": "While scouting, hunter hears morning vocalization west of Scappoose",
  "date": "2004-08-06",
  "timestamp": 1091750400,
  "observed": "On the morning of August 6th, at approximately 6:30am, at a location off Dutch Canyon road in Scappoose, while pre-season scouting, I was observing several deer, 4 bucks and 2 does. While watching the deer for approximately 15 minutes, I watched all six deer look towards the east into a tree line about 1000 meters from my location and the location of the deer. Within 30 seconds of watching the deer look over a bellowing scream came out of the wood line.  I knew exactly what it was from my prior reports from the Salmonberry area. In was on queue with the Ohio recordings.  The scream started at a low tone and progressively and increasingly became louder until it became a loud type of moaning growl. The deer at that point became intensely agitated, their tails went up and they took off heading west into an adjacent tree line about 300 meters from my location.  They did not stop for anything or anybody.  At that time, I focused my binoculars on the tree line that the scream came from and waited, and observed for almost 2 hours with no physical sighting.  I have gone up several days now with nothing further to report.  Being that the season opens up this coming weekend I will keep an eye on the area and animal behavior for anything out of the ordinary.",
  "classification": "Class B",
  "county": "Columbia",
  "state": "Oregon",
  "latitude": 45.7492,
  "longitude": -122.9546,
  "location": "-122.9546,45.7492",
  "location_details": "Dutch Canyon Road west of Scappoose.",
  "temperature_high": 76.31,
  "temperature_mid": 66.89,
  "temperature_low": 57.47,
  "dew_point": 55.65,
  "humidity": 0.77,
  "cloud_cover": 0.69,
  "moon_phase": 0.71,
  "precip_intensity": 0.0081,
  "precip_probability": 0.95,
  "precip_type": "rain",
  "pressure": 1014.31,
  "summary": "Light rain in the morning.",
  "uv_index": 4,
  "visibility": 9.49,
  "wind_bearing": 186,
  "wind_speed": 6.02
}