{
  "id": "2199",
  "title": "",
  "date": "",
  "observed": "Well, I think it was 1977. I was squatting in the woods out by a little lake road of Mendocino, California. I've spent most of my life in the woods of California or Maine. Even had resident pet black bears that would come to the open dump at the back of the property. One night, I'm laying in my tent. I don't remember if it was late (2 am) and I woke up, or if it was earlier in the night (say 11 pm) and I was just going to sleep. Through the woods (about fifty yards away is my guess) the stomping and crashing of smaller trees started going on. It was loud. I was surprised at first and a little afraid because I was squatting illegally on state property. With my familiarity of the noises of the night in the woods, I listened carefully to try to determine or identify what was making the noise. My first assessment was that it was bi-ped ... not a bear or a deer. Realizing this scared me the most. Understanding the force necessary to cause the destructive sounds I was listening to scared me even further. I don't know if profanity is allowed or acceptable, but i was more effing afraid than I could ever remember, praying that what I was listening to wouldn't start moving towards my tent. The noise sounded like a two-legged monster crashing through the woods hastily as if trying to make quick time CRASH CRASH CRASH CRASH !!! It was then I realized that I heard a dog (or two, I don't remember) barking in pursuit. Gratefully, the noise was not coming towards me and I suspected that whatever was moving so quickly and violently through the woods was trying to elude the dog(s). I think this whole event lasted about 30 seconds and then the crashing stopped. Then the next scariest thing happened. The dog barked a few more times and then it made that sound dogs make when they are brutally injured. After that, I did not hear a single damned thing except the fear white-noise inside my head. You know ... I worked as a split-maker for a year on LP land in Mendocino County and as a timber operator for about five years east of Fort Bragg and Mendocino. I worked alone very often. I was surprised to read a post on this website wherein the person who wrote it also said they often felt (and somehow knew) they were not alone when in the woods. I would turn off my chainsaw now and then and I could \"feel\" something watching me. The last strange thing I would share with you about the 22 years of my life 2 - 12 miles east of Fort Bragg in the woods is the frequent discovery of disemboweled animals. Simply that ... disemboweled ... the rest of the animal intact. What an eclectic mix we are in the wonderful County of Mendocino. Please keep as anonymous as possible and do not publish my telephone number. Thank you. Regards to you and yours during this part of the year and the upcoming new year. ********************************************************************** I forgot to follow up on the morning after this encounter. I found what would be considered normal damage made by a large creature thrashing through the woods. No obvious signs that it was or wasn't Sasquatch. No obvious signs that the dogs had been killed or maimed. I moved my tent to be sure.",
  "classification": "Class B",
  "county": "Mendocino",
  "state": "California",
  "location_details": "",
  "summary": ""
}