{
  "id": "751",
  "title": "Hunter describes described being stalked near Minot",
  "date": "2000-04-21",
  "timestamp": 956275200,
  "observed": "While this incident occurred a long time ago, it may be ofsome use, as I have never heard of any such sighting in North Dakota. Whilecoming back from a hunting trip outside of Minot, North Dakota in aroundthe third week of April, in 1962, a friend of mine and I were followedby a creature as we returned in the direction of the trailer park in whichwe lived. (My father was working for the Department of the Air Force onthe Missile site Installations at the time.) After walking back from somedistance out on the prairie, I had the distinct feeling that someone orsomething was following us. Eventually I became so uncomfortable that Idid look over my right shoulder and saw at a distance of about 50 yardsor so, what I thought at first was a great ape. I cannot describe to youwhat I felt at that moment. It fixed me with it's eyes and stood up onit's hind legs when it saw that it had been seen. As all I had was a singleshot .22, shooting it was out of the question. I got a real good closelook, long black shiny hair, oily looking, and it rose from all fours onto it's hind feet.(I am certain it had followed us for some time). Verytall. No hair on the face above it's nose or the palms of it's hands. Longarms. Very malevolent expression conveyed to me. I cannot overemphasizethis. It began to move in our direction. (I was with a partner). Both ofus ran as fast as we could. We didn't look back after this.",
  "classification": "Class A",
  "county": "Ward",
  "state": "North Dakota",
  "latitude": 48.25422,
  "longitude": -101.3166,
  "location": "-101.3166,48.25422",
  "location_details": "Ward County, Just outside of a the Minuteman Trailer Park,outside of Minot, North Dakota.",
  "temperature_high": 79.1,
  "temperature_mid": 59.085,
  "temperature_low": 39.07,
  "dew_point": 30.46,
  "humidity": 0.31,
  "cloud_cover": 0.3,
  "moon_phase": 0.6,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1011.97,
  "summary": "Partly cloudy until evening.",
  "uv_index": 5,
  "visibility": 9.48,
  "wind_bearing": 235,
  "wind_speed": 9.79
}