{
  "id": "41981",
  "title": "Campers awakened by possible late-night screams north of Woods Canyon Lake",
  "date": "2013-08-22",
  "timestamp": 1377129600,
  "observed": "My Wife and I went up to the Mogollon Rim north of Woods Canyon Lake to camp for two days. We took our two small dogs with us. I thought if we went during the week there wouldn't be many people there and I was right. We set up camp in the rain at about 2pm. It rained till about 6pm we saw no one just these big trucks going back in forth on the road till about 5pm. It was very dark and we were trying to start a fire but everything was wet and all we had was a dull ax to chop wood. I believe we were being very noise hacking at the dead wood we were trying to cut to size for our fire. After we got the fire going we cook our dinner and ate. It was very quiet no sound at all then we saw a large full moon rising from the east it lit up the sky. We decided to go to bed around 10pm I put some more wood on the camp fire hoping it would burn all night. As we were in our tent the moon was like a big night light then we fell asleep. At about 3:10am I woke up to a sound that was unlike anything I have ever heard both our dogs sat up and were very still. It was like as if someone was screaming thru a loud PA system it was very clear. I woke my wife so she could hear the sound but it had stop then again it started we were both laying there trying to figure out what could be large in size that would make a sound so loud and long it was echoing in the canyon to the north of us. Then it stop it must of lasted about 5 to 10 min at the most. We stayed in our tent for about a 1/2hr but we both needed to GO if you know what I mean. So we put our shoes on I grab my wife's 9mm and we stepped out of our tent we could see all around us because of the full moon light. After taking care of business we went back into our tent and went to bed. I wont lie it was hard to me to fall asleep. The next morning after breakfast I took one of our dogs out for a walk in the direction the screams came from and saw nothing but about 200yard in the same direction I found what looked to be a possible shelter made from dead trees about 12 to 15 feet long and 4 to 5\" in diameter. they were set up standing like a teepee there was one tree laying on the ground next to the structure I tried to lift it and found it was so heavy that I don't think two large men could pick it up much less stand it up like the rest. One other thing I saw was the trees were saw cut but there were no tree stumps around so the trees had to be carried there from else where. If someone did this for fun they had to work hard to do this and I cant see why. The first night we were there no one was camping any where near us but the second day we were there some campers set up about 1/2 mile to the north on the other side of the canyon. That night our dogs were on edge looking out away from camp and growling my wife said she could hear something large moving around in the woods to the west of us but when shining a spot light in that direction she didn't see anything. I put some more wood on our fire then we went to bed. The next morning we got up and made breakfast took our time cleaning up our camp site then packed and left for home.",
  "classification": "Class B",
  "county": "Coconino",
  "state": "Arizona",
  "latitude": 34.24228,
  "longitude": -110.5712,
  "location": "-110.5712,34.24228",
  "location_details": "The specific camp site location is  withheld.",
  "temperature_high": 82.45,
  "temperature_mid": 70.57,
  "temperature_low": 58.69,
  "dew_point": 50.95,
  "humidity": 0.51,
  "cloud_cover": 0.01,
  "moon_phase": 0.57,
  "precip_intensity": 0.0032,
  "precip_probability": 0.34,
  "precip_type": "rain",
  "pressure": 1013.24,
  "summary": "Clear throughout the day.",
  "uv_index": 12,
  "visibility": 9.3,
  "wind_bearing": 220,
  "wind_speed": 0.75
}