{
  "id": "2229",
  "title": "",
  "date": "",
  "observed": "I remember the day like if it was yesterday. It was my first Boy Scout Summer Camp and I was 12 years old. We had traveled from Long Beach, CA, on a Saturday, the day before the other troops where to arrive. Our scout troop was through our church and we didn't like to travel on Sunday. When we arrived at the camp we discovered that the camp staff had all went to Big Bear, CA, to a party so we where the ONLY scouts in the campground. We went down to our assigned campsite and set up camp. It was approx. 11:00 p.m. when we first heard the screams. We were all gathered around the outdoor stove telling jokes and stories when we heard the first scream. It started out like a wolf howl but ended like a man's scream. It stopped the crickets from chirping! Our scoutmaster came out of his tent to listen as well. Then we heard it again. It sounded like it came from about 1 mile south of our campground. Needless to say we were pretty scared. We all went to sleep about 12:00 a.m. At about 1:00 a.m. my buddy Kenny woke we up and told me that there was something moving around in the bushes and trees next to our campground. We all woke up and Kenny got up and walked over to where the rustling was coming from. He then shined his flashlight into the area north of our campground. And there it was! A Sasquatch was standing in the tree line looking at us. We all broke out yelling and screaming. It was about 6-7ft. tall and had brown hair all over except the face. It had a very short neck and long arms going down to the knees. It's eyes reflected the flashlight's beam like a rabbit's would; the eyes shone red. It turned and with long steps walked northeast from the area then up a steep wooded hill and out of sight. One of the guys actually pissed his pants from fright!",
  "classification": "Class A",
  "county": "San Bernardino",
  "state": "California",
  "location_details": "Camp Taquitz, Scout Camp, near Barton Flats, San Bernardino National Forest, San Bernardino County, California.",
  "summary": ""
}