{
  "id": "23983",
  "title": "",
  "date": "",
  "observed": "I was coming home from my girlfriend's house around 12:00 a.m. or 12:30 a.m. I was a junior or senior in high school (2002/2003) at the time. My house is situated outside of a small town in Henderson County, Illinois. My girlfriend's house is located outside of a small town about 12 miles from mine. I was about 1/2 a mile away from my house going down a large rural hill when I casually saw about 15-20 cows grazing and sleeping along a treeline. They all had the same white eyes on all the same level. I then noticed about 3-4 feet above a row of cows 2 menacing yellow eyes. It seemed to look very strange to me, and I had a high powered flash light in my car. I backed my car up, and opened my car door. As soon as I opened my car door, the eyes moved about 4-6 feet to \"its\" right in a very quick instant. I knew this was no raccoon or opossum, and I decided to jump in my car and take off. As soon as I pulled in my drive way, I took out my large flashlight and decided to walk down the road with my very large part grand mastiff/st. bernard. Within walking 150-200 feet down the road my large dog started to growl, but did not run after whatever it was growling at. My dog chases anything that comes around the house, as he has no natural predator out there, and loves to chase off coyotes from the surrounding fields by my parent's house. I tried to move the flashlight towards the direction of the barking, but I saw nothing. I walked back to my house, still looking back, but saw nothing else. My dog just followed myself home. I will never forget those yellow eyes, and I have told other people my story, and I'd even heard of few people that have heard strange things late at night. The only somewhat large wild animals in this area are coyotes, and thats it. No bears or wolves are found in this part of the country (Illinois). As with our county, there was word when I was in grade school of a few bobcats being released in the northern part of the county, but this was no bobcat.",
  "classification": "Class B",
  "county": "Henderson",
  "state": "Illinois",
  "location_details": "Heavily wooded terrain, with an old train tressel about 2 miles in the back of the woods. Rural, paved road runs over a creek, and woods are on both sides. As a younger child, my friends and I would explore them all the time, but never heard or saw anything strange. My dad still likes to take his dogs on walks in that area.",
  "summary": ""
}