{
  "id": "11252",
  "title": "Teenagers have nighttime sighting of animal near Milltown.",
  "date": "1986-09-27",
  "timestamp": 528163200,
  "observed": "It was was around fall of 1986,I and my friends were 16 years of age. My friend had a relative visiting from the big city life of Florida, so me having a crush on her. Me and my friend took her for a ride out in the country back roads so I could mengal and get to know her. It was kind of the Dukes of Hazard atmosphere on a dirt road for miles going to a lake. There was a hill on the left side with alot of trees and pasture on the right side with a barbwire fence. I was driving a little old ford ranger pick-up truck with a stick shift in the middle. She was in the middle and my friend was on the passenger side. Me being a teenage boy thinking it would be cool to scare her (thinking that will make her like me.) I turned the head lights off and when I looked up I saw it walking across the road a distance ahead of us toward the pasture. The girl went balistic screaming and climbing all around making it hard for me to get to the lights. That was the only time I saw it because I was struggling for the lights looking down. I did see it for about 5 seconds and I was traveling at about 40 mph. I was totaly stunned by what I saw and my friend was trying to get her to come down, she just kept on screaming. When she did stop she kept on crying asking us over and over if we seen it. When she told us what she seen it was the exact same thing that I saw. My friend told her she was crazy until I told him I saw it too. After that we skipped the lake and didn't go back for about a year and a half. It is still like a film in my mind today.",
  "classification": "Class B",
  "county": "Sebastian",
  "state": "Arkansas",
  "latitude": 35.1759,
  "longitude": -94.0679,
  "location": "-94.0679,35.1759",
  "location_details": "We were heading east toward Booneville Lake.",
  "temperature_high": 89.49,
  "temperature_mid": 80.265,
  "temperature_low": 71.04,
  "dew_point": 68.95,
  "humidity": 0.72,
  "cloud_cover": 0.55,
  "moon_phase": 0.8,
  "precip_intensity": 0.0035,
  "precip_probability": 0.17,
  "precip_type": "rain",
  "pressure": 1016.57,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 5,
  "visibility": 9.14,
  "wind_bearing": 190,
  "wind_speed": 6.08
}