{
  "id": "1563",
  "title": "",
  "date": "",
  "observed": "THE PATTERSON / GIMLIN FOOTAGE The Patterson/Gimlin footage is a short piece of 16mm film obtained by Roger Patterson and Robert Gimlin in 1967. It was obtained in the remote canyon of Bluff Creek, California, very close to the border of Del Norte County and Humboldt County. Both Patterson and Gimlin lived near Yakima, Washington. Patterson had been trying to obtain film footage of a bigfoot for many years. During the period he had also written a book entitled, \"Do Abominable Snowmen of America Really Exist?\" He hoped some decent film footage would help answer that question. In this book he calls attention to the unusually large amount of testimonial and circumstantial evidence pointing to the existence of large, forest-dwelling primate species in North America. Bob Gimlin, a highly experienced outdoorsman, was a close friend of Patterson. He accompanied Patterson on several horsepacking expeditions in pursuit of film footage. Equipped with a 16mm hand-held Kodak movie camera, the two set out in October, 1967 for a horsepacking trip in northwest California. Their search focused on the Bluff Creek area, because a number of tracks had been found there in prior years while logging roads were being built. Road construction workers had noticed large human-like footprints on the soft exposed soil of the new roads. The tracks were first reported to the press by . A local newspaper reporter came up with the name \"Bigfoot\" to describe the maker of the largest tracks. Tracks of six different individuals were repeatedly found on the new logging roads. The sizes ranged from 12.25 inches long to 17 inches long. In the early afternoon of October 20, 1967 as Patterson and Gimlin, on horseback, followed a trail in the creek bottom, they spotted a bigfoot apparently drinking from the creek. Patterson's horse reared in alarm as the bigfoot stood up and began to walk away. Both the horse and Patterson fell to the ground, with Patterson briefly pinned by the fallen horse. Patterson quickly worked himself free and grabbed his hand-held movie camera. While running toward the retreating bigfoot, Patterson shot 24 feet of film. Gimlin sat ready with his rifle in hand. Not wanting another spooked confrontation with this bigfoot, Patterson and Gimlin decided not to pursue it into the forest. At that point they felt they had the footage they came for anyway. After the footage was brought back to town and developed, a handful of investigators from the US and Canada returned to the film site and measured the tracks and other objects to help accurately gauge the size of the figure in the footage. The calculations suggested a height of 7 foot, 3.5 inches. The footprints were 14.5 inches long by 6 inches wide.",
  "classification": "Class A",
  "county": "Del Norte",
  "state": "California",
  "location_details": "",
  "summary": ""
}