{
  "id": "23291",
  "title": "Possible sighting at the base of Mount Timpanogos (west side of the mountain)",
  "date": "1998-01-31",
  "timestamp": 886204800,
  "observed": "My parents live at the base of Mount Timpanogos in Utah county.  Right in front of Timpanogos sits another mountain called Baldy.  We call it baldy because there are no pines or aspens on the front side of it. All the pines sit on the north side of the mountain, but everywhere else is very dense brush and very tall.  The only way to walk through it is on a game trail and even then you still get all scraped up. This incident happened in my backyard on a winter night around 10 - 10:30 in around 1998 when I was about 14 years old.  At this time there were not too many houses around and we have about 5 acres in the backyard up against the mountain.  Behind the five acres was nothing until you hit the city of Pleasant Grove.  Now, there are new houses all the way back.  In the winters there are always deer, elk, and cougars back there.  We've even had bighorn sheep come down that far too. My family and I were in the basement playing ping-pong.  We have a walk out basement sliding door that goes out into the back yard.  Right out the back door we have a small area of cement to play basketball and right off the side of that there is a ravine that slopes down off the back side for a 100 feet or so and its thick with acorn trees and other trees. Our neighbors fence between our property and theirs runs on the property line down to the bottom of the ravine….. anyway…. On this night I let my yellow lab out the back door cause he was scratching to go out and I thought he had to go to the bathroom or something.  As soon as I let him out he stopped and turned to his left and faced towards the neighbors fence and freaked out. He was a very protective dog but I have never seen him so protective in my entire life.  Its hard to describe because you would just have to be there. The moon was full and setting in the sky to the side where the neighbors fence is. I wondered what he was barking at because if it was a cat or another animal he would have gone after it, but he stayed in the same spot and even backed up a little bit.  So I knew it was most likely a human being by the way he was acting.  I turned on the back light and stepped out to look over at what ever he was barking at.  I didn’t see anything at first because the light made it hard to see, but then I noticed what it was he was barking at.  The moon was directly behind whatever it was and overhead so it created a silhouette and right on the fence line, which is only 20 to 30 ft. away, I could see the shape of half its head sitting above the top of the fence.  I just remember thinking… wow that’s a tall person wearing a beanie.  The shape of the head made me think that someone was wearing a beanie and it made the head shape a perfect oval. I had my little brother who is 2 years younger then me come stick his head out to see and he came over and said, “Oh, I see it.” I didn’t even think to try and talk to the person, even though they were chillin in our back yard. For some reason I knew it wouldn’t answer or something… It didn’t even cross my mind to talk and ask what they were doing back there. It lasted about a minute or two and then I saw the silhouette drop its head a little bit and turn towards the ravine and walk down into the trees.  When I saw it do that I tried to listen to its footsteps but heard absolutely nothing walking down into the trees. I have always believed it was a bigfoot. We are avid hunters and bow hunters, and spend tons of time in the mountains.  My father has a few different friends that have seen a  bigfoot or had experiences, but my Dad thinks its all a joke. I don’t though.  He even makes fun that I believe in something like that.  I don’t know what it was that my brother and I saw that winter evening but I know that Im 6’3” and that fence I'm talking about is as tall and even a little taller than I am.  I lived in that house for 20 years. My parents still live there, and there was nobody in their neighborhood or that area at that time who was that tall.",
  "classification": "Class B",
  "county": "Utah",
  "state": "Utah",
  "latitude": 40.34937,
  "longitude": -111.6956,
  "location": "-111.6956,40.34937",
  "location_details": "in the observed part",
  "temperature_high": 43.67,
  "temperature_mid": 34.1,
  "temperature_low": 24.53,
  "dew_point": 28.85,
  "humidity": 0.82,
  "cloud_cover": 0.44,
  "moon_phase": 0.13,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.77,
  "summary": "Mostly cloudy until afternoon.",
  "uv_index": 2,
  "visibility": 8.57,
  "wind_bearing": 260,
  "wind_speed": 1.43
}