{
  "id": "10918",
  "title": "Hunter has early morning encounter 8 miles north of Riverdale",
  "date": "2005-12-10",
  "timestamp": 1134172800,
  "observed": "I don't know what I saw, but I have been hunting the woods of New Jersey for over 16 years, and I have never come across a thing like this. I got to my tree stand just before light as I do every time I hunt the mornings.  It was the rut, when bucks chase does to mate.  So the woods had a musky ordor to it.  But this was a smell that was differnt than the smell of deer urine.  This smell was more strong and foul. I hunted the morning but didn't see a deer.  Around 10 oclock I called my buddy who already got down that I was getting down.  He told me he was going to get breakfest.  So I got down and slowly hunted back to the truck.  I took the long way back on an old logging trail.  As I hit the logging trail that strong ordor came back.  I thought that maybe I should knock an arrow.  As I began to knock the arrow I felt that a deer stepped out onto the trail, but it wasn't a deer, I don't know what it was it wasn't a bear either. It looked at me , stopped for a second and turned back and walked back from where it came from.  It was about seven or eight feet tall about four or five hundred pounds may be more with long dark hair and short brown hair on his neck and head.  I paused for a second thinking may be this was a joke be played on me, but my buddy said he left to get food and he is no where near as big as the thing I just saw.  I called my buddy but our phones were out of range.  I ran out of the woods in the opposite direction as the thing. I thew my bow and nap sack of so I could run faster.  We later went back with a farmer who new the land better and also brought his 12 gauge. We didn't find anything when we went back. The ground was too hard and leafy for obvious tracks.",
  "classification": "Class A",
  "county": "Passaic",
  "state": "New Jersey",
  "latitude": 41.08335,
  "longitude": -74.321,
  "location": "-74.321,41.08335",
  "location_details": "Little mountaininess very rocky",
  "temperature_high": 32.94,
  "temperature_mid": 26.31,
  "temperature_low": 19.68,
  "dew_point": 19.71,
  "humidity": 0.72,
  "cloud_cover": 0.17,
  "moon_phase": 0.33,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1015.79,
  "summary": "Partly cloudy in the afternoon.",
  "uv_index": 1,
  "visibility": 9.41,
  "wind_bearing": 234,
  "wind_speed": 7.04
}