{
  "id": "35706",
  "title": "Camper has two late night encounters in North Cascades",
  "date": "2011-09-01",
  "timestamp": 1314835200,
  "observed": "On September 1st, 2011 I was camping up in the beautiful Cascade Mountains of Washington State with my friend Dave (my name is Dave as well). We got there early on Thursday to get the spot we wanted. It was for us the start of the Labor Day weekend. We had set up camp and drove up an old logging road to get our firewood for the night. There is a bridge close to our campsite. We had supper and relaxed around the campfire. At about 10:30 that night I decided to grab a flashlight and go looking around the area across the bridge. I really had not planned on looking for Bigfoot as I was busy with the logistics of putting this camping trip together. I am a true believer in Sasquatch, and read Bigfoot stories all the time(ask my wife). As I cleared the bridge there is a dead-end road on the right that goes down for about a quarter mile or so. I know this because I have been down there. The road is gated at the top with a pipe gate. In the middle of the gate is a red reflector. I could not see the reflector because something was standing in front of it. I had shined my just regular flashlight, with about ¾ battery power down this road. What I did see was a pair of big yellow eyes, looking back at me. I FROZE. I remember thinking: Oh My GOD! I noticed that the right eye was much brighter than the left eye. I thought that perhaps there was some hair hanging down over the inside of the left eye. Or maybe it had an injury. I then noticed how far apart the eyes were. And how high up from the ground they were. Actually they were roughly even with mine, but the road there sloped down a bit. About four feet or more! I’m 5’8” on a good day. This “thing” would have towered over me! The creature was either dark brown or black, as I could not make out any body or head features at all. Just those yellow eyes. There was no odor at all. The air was perfectly still. It made no noise either. I processed all this very quickly. If it would have growled at me it would have been laundry time! We stared at each other for maybe 10-12 seconds. It seemed to kind of lean side to side a little. Without moving its feet. Then the eyes dropped down a little and made a big circle. Pause. Then another circle same as the first. Like an owl, only way bigger. I thought that he had put his hands on his knees maybe. Kind of like I have seen on TV of apes moving.It looked at me for 3 more seconds and I lost it. Not knowing what this thing was going to do next, I took off running to the middle of the bridge and spun around. Every hair on my body was standing up. It did not follow me. I was not surprised. But I was also very happy. I was panting. Mostly from adrenaline, I think! I hustled back to camp and told Dave what happened. I said “Let’s go back over there. “Grab your camera” (a digital with a strong flash and video+audio). I was very excited. I knew that this could be a chance of a lifetime to get this thing on film. You have to understand that in my mind, there was nothing else that this creature could be than a REAL Sasquatch. I completely believe it to this day. Anyways, Dave Cannot find his camera. After we looked for a couple of minutes or so I get pissed and said, or words to the effect “Let’s go while this thing is still in the same county”! So we get to the bridge and walk fast at first, then slow way down being quiet. I whispered “ You watch the left side and I’ll watch this side. We’ll try to get both flashlights on it at the same time”. Dave’s flashlight was about the same as mine). It wasn’t in front of the gate anymore. That didn’t surprise me. What I did see was the red reflector. I did not even know it was even there the 1st time. But there it was. It would have stuck out like a sore thumb! It was blocked by the Bigfoot.On Dave’s side was a pull-out. It was empty. (The next night some people ‘Camped’ there). I told Dave “Shine your light up the road”. There HE was! On my side walking slowly towards us. He had the exact same eyes. The left one was messed up, just like the 1st time! Dave and I were about 10-12 feet apart. I said “Dave, THERE HE IS! Do you see him? He’s coming Dave! There he is!”. Both of our lights had shined on this things face at the same time. Only for like 3 seconds or so. But it lit his head up!  The head did not look pointed to me, like many people have reported. It was really BIG though. I was slowly backing up as I watched it walking towards us. “Don’t you see it ?” “No” he says. I was backing up slowly out of fear as I’m watching the eyes move up and down rhythmically. . Well, it turns out that Dave can’t see much in bright sunlight.  At night he is basically following the sound of your voice. So he can’t find his camera at the critical time; and I have no witness to this incidence, even though he was right there with me! I love the guy. But FU$%! So I get scared and take off running to the middle of the bridge again, with Dave behind me. The only reason he is running is because I was. You ever hear the joke about never going Grizzly Bear hunting with a friend who can out-run you? Well I out-weight Dave and he had trouble keeping up!   It was HUGE!  Also, although the road was going up hill, it was very straight and flat. I was familiar with this stretch of road, having camped there many times. And this gave me a great idea of how tall this thing was. When I say it was pushing ten feet tall, I feel confident that this is an accurate judgment of its true height. And there were NO tree branches there at all to justify an owl sitting on a limb. If it was an owl, it would have to be 10 feet tall. So we quickly get back to camp. Dave of course, finds his camera. Under his sleeping bag. We jumped into the van and shot across the bridge. Of course we could not find him. I knew he was just inside the trees on one side or the other. It was as dark as the inside of a Buffalo on a moon-less night. The next morning I walked across the bridge to the top of the road on the right. I walked up to the pipe gate and stood there. Right exactly where HE stood. I paced it off, and it was roughly 45 yards to where I stood when I first spotted him. Boy, I sure will bring a massive candle power flashlight next time! And have a camera ready as well. But you get your chances when they happen. I was not prepared! One thing I haven’t mentioned. At the time this all happened, I had truly forgotten that in my tent were my two guns. I had my 9mm, plus a 12 gauge sawed-off double barreled shotgun(side by side and barely legal) loaded with 00 BUCK. It had never occurred to me to shoot this guy. I had completely forgotten that I was heavily armed! When he was walking down the road towards us, he, in retrospect, was just kind of shooing us away I think. I think of him as being a gentle giant! He very easily could have run us down and killed us. I feel blessed that they are out there. He did not harass us or threaten us in any way. Other than just leisurely walking towards us and scaring the CRAP out of me!I will go back there this summer,more prepared for sure. STOP!!!!!! - I haven’t told anyone yet, except for now. I also have a Class B report that happened back in 1975, up it Whatcom County near the Canadian border. This encounter was truly TERRIFIYING! Scared all 3 of us, plus the Big German Shepard ( who PEED himself) that  we had with us in a remote cabin. Ask me about that Story!! Thank you for having this site for us to tell our Bigfoot Stories. God bless and keep up the good work! ",
  "classification": "Class A",
  "county": "Snohomish",
  "state": "Washington",
  "latitude": 48.03114,
  "longitude": -121.6708,
  "location": "-121.6708,48.03114",
  "location_details": "This was in the northern Cascade Mountains. It would be too easy for people who have been there to figure out. And I DO NOT want that to happen. I will explain.I think you will understand.",
  "temperature_high": 66.76,
  "temperature_mid": 60.22,
  "temperature_low": 53.68,
  "dew_point": 48.61,
  "humidity": 0.76,
  "cloud_cover": 0.41,
  "moon_phase": 0.14,
  "precip_intensity": 0.0001,
  "precip_probability": 0.12,
  "precip_type": "rain",
  "pressure": 1021.49,
  "summary": "Partly cloudy throughout the day.",
  "uv_index": 4,
  "visibility": 8.53,
  "wind_bearing": 242,
  "wind_speed": 2.19
}