{
  "id": "4094",
  "title": "Late night encounter near Benton",
  "date": "1994-10-15",
  "timestamp": 782179200,
  "observed": "I previously sent you an e-mail of this experience, but it occurred in the fall of 1994. We had just moved into our home here and the deer were always coming up to our back fence and causing these little wimp dogs of mine to go into cardiac arrest, esp. at night when I was trying to go to sleep. So I was in the habit of taking a small rifle and shooting a round into the trees to frighen the deer away and shut the dogs up. One night I decided to take my single shot, break-over 410 into the woods on trail to really scare them away. So carrying a flashlight, the gun (broke open , 1 round loaded) and two more rounds, I went off into the woods. About 30 yds into them, I heard movement to my right at about one o'clock, shining my light at the brush, I saw the thing standing stock still. I could tell it was about 7ft. and it was half again as broad across the shoulders as me. I'm 6'1'' and 300lbs so I'm not a little fella by any means, but I was next to this thing. It had a brownish- orange long fur over what I could see of it\"s body and it's face was dark. My light reflected in it's eyes like an animal.  At that time it grunted and made to move towards me. Being a redneck, the first thing I did was to close the gun, aim and fire. I know I didn't miss because he was only about 30 to 35ft away and I saw fur fly. It yelled and began to move towards again and began to walk backwards, reloading the gun and never taking the light off of it. I fired again, not missing and he really started move on me , so I did this one more time, this time firing one handed. I turned and ran from the woods to my house. My wife was on the back porch when I came out of the woods and I yelled for her to get my 8mm rifle. She met me with it, I spun around, fully expectng to see this thing on me. It wasn't there. I could here it running through the woods, which isn't easy with all of the under growth here. It let out a long loud \"warbeling\" yell that reminded me of sounds yo might hear at the primate house at the zoo.",
  "classification": "Class A",
  "county": "Saline",
  "state": "Arkansas",
  "latitude": 34.56444,
  "longitude": -92.58667,
  "location": "-92.58667,34.56444",
  "location_details": "Wooded hilltop near cell towers",
  "temperature_high": 66.52,
  "temperature_mid": 64.335,
  "temperature_low": 62.15,
  "dew_point": 59.46,
  "humidity": 0.9,
  "cloud_cover": 0.94,
  "moon_phase": 0.38,
  "precip_intensity": 0.0117,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1015.93,
  "summary": "Rain in the morning.",
  "uv_index": 3,
  "visibility": 5.57,
  "wind_bearing": 109,
  "wind_speed": 6.55
}