{
  "id": "7117",
  "title": "Hunter sees bigfoot cross road behind him west of Nile, WA",
  "date": "2003-11-07",
  "timestamp": 1068163200,
  "observed": "I was traveling west on road 1502 (which is graveled) looking for a campsite for bow season. I glanced in my rearview mirror and saw a very large upright creature step to the middle of the road. I immediatly slowed down and quickly glanced around for a safe spot to pull over and there wasn't one I looked back over my shoulder through my canopy window and saw that the creature was still standing in the middle of the road. There was still a lot of dust in the air from where I had passed and all I could make out was that What I was looking at was very tall maybe (7 to 8 feet) and broad it also was very dark in color. The arms appeared to be held out slightly from the sides and reached to about mid thigh. when I reached a full stop the creature seemed to pivot on its left leg while swinging its arms turned to the left and took one step to the opposite side of the road and disapeared from view. When I looked at the area where it crossed I was unable to discern any tracks in the gravel that I could definately say were footprints. The area where the creature went off the road is very steep and rocky. I would not want to try going down it without ropes and I doubt if what I saw was another hunter out scouting since the hill ends in a cliff just a few hundred yards down.",
  "classification": "Class A",
  "county": "Yakima",
  "state": "Washington",
  "latitude": 46.80505,
  "longitude": -121.0909,
  "location": "-121.0909,46.80505",
  "location_details": "From hwy 410 turn off at the wood shed go back to road 1500 follow it till you see a sign saying McDaniel lake thiis will be road 1502 once you cross the Rattlesnake river bridge you will go about a half of a mile and you will make a hairpin turn you will travel uphill for about 3/10 more of a mile and make a curve to the right you will come out into the open and the hillside will start to fall off to your left this is where I saw the creature. It evidently came down the hill from the right heading in a north to south direction.",
  "temperature_high": 43.91,
  "temperature_mid": 39.985,
  "temperature_low": 36.06,
  "dew_point": 23.85,
  "humidity": 0.69,
  "cloud_cover": 0.6,
  "moon_phase": 0.46,
  "precip_intensity": 0.0001,
  "precip_probability": 0.12,
  "precip_type": "rain",
  "pressure": 1021.18,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 9.59,
  "wind_bearing": 11,
  "wind_speed": 2.53
}