{
  "id": "15125",
  "title": "Various late night vocalizations heard on a property near Flagstaff.",
  "date": "2006-07-03",
  "timestamp": 1151884800,
  "observed": "On this particular night I was awakened by a commotion outside my bedroom window.  It sounded like animals fighting.  There are many wild animal species in the forest where I live including racoons, skunks, foxes, and elk, but also domestic animals like dogs and cats.  I assumed the noise was coming from some of these animals.  After I sat up in my bed, the noise stopped.  I lay back down, and after several minutes I heard some very peculiar noises.  First, there was a series of \"whoops\" that sounded like a cross between a monkey's whoop and a whistle.  They seemed to be coming from different locations within about a 50 foot radius.  They were neither particularly loud, nor soft.  It sounded to me like 2 or 3 individuals.  Trying to come up with a rational candidate for the type of animal, I imagined it might be some sort of large migratory bird.  This is when I heard the second type of sound, something like a pig grunting but different.  It seemed as if there were articulation in the grunting.  It is difficult to describe, but it made my blood run cold.  The grunting seemed to come from only one animal, and was clearly audible.  This went on for perhaps a minute.  The area was then illuminated by a passing car and all sounds immediatley ceased.  Several minutes later I heard a loud \"crack\" from a large branch being broken in the woods at the edge of my yard.  I did not get out of bed or attempt to look outside as I was still quite frankly scared from the creepy nature of the grunting.  The next morning I looked around the immediate area of my yard, but found no indication of what may have made the sounds.",
  "classification": "Class B",
  "county": "Coconino",
  "state": "Arizona",
  "latitude": 35.09,
  "longitude": -111.7,
  "location": "-111.7,35.09",
  "location_details": "[Editor's note: Witness requested us not to publish the directions.]",
  "temperature_high": 86.19,
  "temperature_mid": 72.87,
  "temperature_low": 59.55,
  "dew_point": 47.49,
  "humidity": 0.43,
  "cloud_cover": 0.27,
  "moon_phase": 0.25,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.95,
  "summary": "Partly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 13,
  "visibility": 10,
  "wind_bearing": 235,
  "wind_speed": 4.22
}