{
  "id": "821",
  "title": "",
  "date": "",
  "observed": "Newspaper article : Idaho Statesman (Boise); November 22, 1981 BIGFOOT BLAMED FOR TROUBLE NEAR EAST MICHIGAN TOWN Yale, Mich. (UPI) - Cindy Barone says it's not the torn- down fences of the barn doors that have been ripped off at the hinges, nor is it the high-pitched screaming her family often hears at night. \"It's the unknown that scares us,\" she said. \"If I knew what it was I could deal with it.\" The rural St. Clair County woman is referring to a large, hairy creature that she and her family are convinced is a Sasquatch, or Bigfoot - a creature that is said to walk on two legs and roam wooded areas from Maine to Washington. While there is no documented proof of the existence of Bigfoot, films have been made that supposedly show the creature fleeing into a forest. The Barones' latest encounter with the beast came Friday evening at their east Michigan farm, when daughters Tina, 13 and Roxanne, 12, went out to the barn to check on their animals. Tina said the horses were spooked and when she reached for the light switch in the pitch-black barn she felt some fur. \"At first I thought it was a goat or something, so I took my glove off and I touched it again,\" she said. But she said the beast stood two feet above her, glaring down with bright red eyes. Tina said she didn't know what the animal was. \"I have no idea,\" she said. \"All I know is that its fur was about one inch thick and all matted and dirty.\" Wayne King, the founder and head of the Michigan-Canadian Bigfoot Information Center, said this is the first report in which a human has made physical contact with a Sasquatch. Mrs. barone, 33, said the family's first encounter with the animal came in September. Since then fences have been torn down a number of times and animals spook frequently, she said. -------------------------------------------------------------------------------- The Detroit News-Sunday, November 22, 1981 Hairy, red-eyed A ‘BIGFOOT' IN THUMB? BY Ann Cohen News Staff Writer Cindy Barone isn't sure she wants to call the creature, \"Bigfoot.\" But something big, hairy and red -eyed has frightened her family three times since September. Something out there roaming the farm fields of Michigan's Thumb area is emitting high-pitched screams by night. \"It's the unknown that scares us,\" says Mrs. Barone, whose family last encountered the creature Friday night at their farm home near Yale in St. Clair County. Tina Barone, 13, said she and her sister, Roxanne, 12, went to the barn to do chores. \"Roxanne was scared to go into the barn because she'd heard noises before,\" Tina said. \"I said I would go in first, so I reached in for the light. \"I felt fur. \"At first I thought it was a goat or something, so I took my glove off and I touched it again. \"It didn't look like anything. It was tall with red eyes and big and black and furry and stood on two legs. It had a deep growl.\" Tina told Roxanne to run back to the house. \"It scared me so bad I just had to run.\" Roxanne said. \"I just can't put what it looked like into any kind of form.\" Tina said she turned and began to walk slowly from the barn but \"it started walking out behind me and I started running.\" The creature never tried to harm her, Tina said. \"It let me touch him when I took my glove off, \" she said. \"The horses were running around, they were spooked. But it was just curious, whatever it is.\" The girl's cousin David, 18, got his 16-gauge shotgun to scare the creature away. \"When it stood there and looked at me, it didn't know what to do and I didn't either,\" said Barone. \"It's unbelievable.  Its big. \"It was some kind of animal but I can't describe what. It was about 6 feet; 6 or 7 feet 6. I didn't shoot to kill, I just shot in the air to scare it away. It ran into the woods, making a funny noise. \"It was standing on two feet and had real long arms-between a bear and an ape, that's what I think.  I've never seen a Bigfoot, so I have no idea if it was one of those.\" Mrs. Barone, 33, said their first encounter with the animal came in September, when her neighbors' barn door was ripped off at the hinges. \"I've had fences torn down and grain barrels dumped over and eaten,\" she said.  She said her dogs have raced off into the dark, barking at an unknown intruder, and their farm animals have been spooked by some unknown predator many times. Mrs. Barone said the family is frustrated by the unwillingness of many people, including the local sheriff to take her story seriously. Mrs. Barone did file a report of the Friday incident with the sheriff's department but the report contains no mention of her daughter actually seeing an animal. \"There was nothing in our report to indicate this,\" said a department spokeswoman, who speculated that Tina actually felt a raccoon or other small, friendly creature. But Tina is sure she did not feel a typical barnyard animal.  \"From now on, I'm going to take the camera when I'm doing barn chores in case I see him again, because no one believes us,\" she said. A mysterious creature- called a Sasquatch, or Bigfoot- that walks on two legs and roams wooded areas from coast to coast has been reported many times from coast to coast. While there is no documented proof of the existence of Bigfoot, films have been made that reportedly show the creature fleeing into a forest and footprints and other evidence have been uncovered which has led many people to believe the creatures do exist. \"I don't know what it is but I do know it is something,\" Mrs. Barone said.",
  "classification": "Class A",
  "county": "St. Clair",
  "state": "Michigan",
  "location_details": "",
  "summary": ""
}