{
  "id": "3400",
  "title": "Two experienced hunters see bigfoot, throw rock at it, and watch it turn and walk into timber",
  "date": "1992-01-01",
  "timestamp": 694224000,
  "observed": "This happened on a day outing with a good friend and hunting partner of mine. It was around 9:00 am or so that my friend called me to see if I was doing anything. I was not, he told me he wanted to go up to the mountains for the day and do something and asked if I would like to go. I did so I got my stuff ready while he was on his way over to pick me up; all I grabbed was my boots and a .22 pistol, which was also what he was bringing (a .22 pistol). Anyway, on our way from my house, since we really didn't have any set plans on where we were going, I suggested that we go up to this rancher's place that we often hunted so we could look for antler drop offs while we walked along plinking with our pistols. We pulled up to the rancher's house but no one was home to tell we were going up on the hill, so we drove past his 400 acres to the next place, a 200 acre unoccupied place that we also had ongoing permission to hunt etc. So we began there at the east end of that place and worked our way through the woods all the way back to the first place. We decided to go ahead up the hill through this place where a trail starts and runs about 1/3 of the way up the side of the hill, the entire length of the ridge, and eventually comes out about 3 1/2 miles later on a logging road above Elbe. Our plan was to hit the logging road and walk down the road to the r/r tracks and follow them back to the truck. We, however, realized as we plinked that about 1/2 way along this trail that we would not have enough time left before dark to make it all the way to the logging road before dark let alone all the way back to the truck from there. But we knew if we cut straight down the mountain right where we were that we would make it to the valley below before dark. So we got started down through the heavy second growth and after about 45 min of fighting our way a long ways through thick tangling ferns and underbrush, we finally came out to a small group of clear cuts on the hill above another ranch. This was bad because these people never let anyone trespass on their land. But since we didn't have any other choice to get off the mountain before dark and since it was almost dark now we decided to go down the logging road very quietly as not to get caught on their land (this small road system is their own private operation and none of these roads go far or are connected to any other roads) to the valley below. As we quietly proceeded down this road we were half way through the last small clear-cut, it was just about dark, you could still see in the clear-cut and a long ways down the road, but not at all past the timber's edge. We were walking side by side; I was on the left, when I saw something out of place ahead and on the left. I immediately thought that it looked like a bigfoot standing there. We were about 100 yards away on the road from being straight across from it. I hadn't said anything yet, we just kept walking, angling closer as the road came closer to its location until we were straight across from it, about 80 yards away. The whole time I had not taken my eyes off it as we walked and I hadn't said anything yet because I thought it was going to turn out to be a stump or something (like when you see a burnt stump and it looks like a bear or something). That's when I stopped; I realized it was not a stump, I could see its arms, legs, and even some detail of it face. My friend stopped when I did. I was going to point this out to him, however when I stopped and looked at him he was already looking at it himself and said, and I quote, \"it can't be!\" We both just stood there for a minute, then my friend bends over, picks up a rock and throws it at it. He did think it must have been a stump until then. As soon as the rock landed this (and its still hard to say) bigfoot did not jump or run or seem scared at all, it just turned towards the dark timber behind it and walked into the forest. Please note that I am an avid hunter. I have hunted and harvested many animals including bears on this very hill. I've hunted from Alaska to Montana. I've taken many bears, even some at close range with my bow. I am very aware what all the animals look like and I am 100% sure this was a bigfoot. Before this, even with all the hunting and hiking that I have done, I never came across any tracks or other sign that I could not identify as normal forest animals, so up until this I thought that is was just a myth. Also, this is important as to the exact date, which I'm sorry I can't remember, but about a week later on our local news someone found tracks down by the river in this area. If that information could be found you would have a close date. The news said something like this: \"Bigfoot tracks found crossing the Nisqually River near Mt Rainer,\" and they showed photos of the spot but did not say exactly where, but by the size of the river in the photos they showed it looked very close to where we were.",
  "classification": "Class A",
  "county": "Pierce",
  "state": "Washington",
  "latitude": 46.766,
  "longitude": -122.1652,
  "location": "-122.1652,46.766",
  "location_details": "about 2 miles east of elbe on north side of state hwy 706 mt hwy",
  "temperature_high": 42.67,
  "temperature_mid": 41.89,
  "temperature_low": 41.11,
  "dew_point": 36.5,
  "humidity": 0.89,
  "cloud_cover": 0.9,
  "moon_phase": 0.9,
  "precip_intensity": 0.0137,
  "precip_probability": 0.84,
  "precip_type": "rain",
  "pressure": 1018.12,
  "summary": "Rain starting in the evening.",
  "uv_index": 1,
  "visibility": 7.35,
  "wind_bearing": 170,
  "wind_speed": 6.26
}