{
  "id": "2942",
  "title": "Brothers hear late night howl in Mammoth Lakes",
  "date": "2001-05-01",
  "timestamp": 988675200,
  "observed": "I was in Mammoth Lakes, Ca. on a weekend trip playing softball. It was a Sunday night. My roommate, my brother and myself were the only ones to stay that night. It was around 1:30 in the morning, when my dog woke me up. She was whining and pacing in the tent. I was trying to calm her down when I heard this sound. I am a serious bigfoot believer and visit the BFRO site often. The sound I heard, which I recognized immediately, was exactly like the HOWL recordings on the BFRO website. When I heard this howl, I instantly sat up. I listened for about 20 or 30 seconds when my brother suddenly sat up and said \"what the hell is that?\". I said I wasn't sure because I didn't want to sound crazy by saying it was bigfoot. The howl went on for another minute or so. When it was over, my brother said \"I have never heard a noise like that. What was that?\" That's when I told him I think we just heard bigfoot. I have since played the recording of the HOWL back to my brother, and he agrees that is what we heard. My roommate never woke up so he never heard it. The entire time the howl was going on, my dog was really freaking out. I know in my heart, I heard bigfoot that night.",
  "classification": "Class B",
  "county": "Mono",
  "state": "California",
  "latitude": 37.65028,
  "longitude": -118.9592,
  "location": "-118.9592,37.65028",
  "location_details": "As you get off highway 395 to go to Mammoth Lakes, you will come to a stop light. Right before the stoplight, there is a campground on the right called Shady Rest Campground. We were in the group campground area.",
  "temperature_high": 82.25,
  "temperature_mid": 65.75,
  "temperature_low": 49.25,
  "dew_point": 36.34,
  "humidity": 0.37,
  "cloud_cover": 0.05,
  "moon_phase": 0.29,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1013.94,
  "summary": "Clear throughout the day.",
  "uv_index": 13,
  "visibility": 9.88,
  "wind_bearing": 312,
  "wind_speed": 8.93
}