{
  "id": "14271",
  "title": "Possible tracks noticed by hunters in the Everglades outside Everglades City",
  "date": "1975-09-01",
  "timestamp": 178761600,
  "observed": "My father along w/ brothers Eric and Mark at a young age were hunting in the Florida Everglades w/ two friends of the family, Ronnie and George. It was a \"boys\" trip out. I was approx. 13 yrs, old. I can approximate my age because my family started building a second home behind ours in 1972. It took 3 yrs to build and these \"friends of the family\" were hired by my father to assist in the project. I was born in 1962 and towards the end of the project, this trip took place. Aprox. in the fall of 1975. Anyway, we drove to a secluded area of the Everglades. Later I was told we were 17 miles away from any paved road. Us \"adults\" we went out with .22 rifles (my first time), after parking in what we call now \"BFP\" at about 6PM.  Ask anybody in South Florida and they know what I mean by \"BFP\" [Bureau of Fire Prevention land??]. Way out in the middle of NOWHERE. We tracked through waist high vegetation growth when we reached a clearing and continued in a horizontal line towards a tree line approx. 100 yards away. We suppossedly were hunting for rabbits but never saw one. As we approached the tree line we came upon a recently dried out water hole. Here is where I spotted the tracks. There were at least 17\" in length. Two half prints and one full print in the mud going into the brushline. The brush on the otherside was thrashed. I recall that we left that area not longer after that. It basically ended our trip. I feel now with what I know, it was a skunk ape. I will swear on the bible on this experience and I have only Eric to back my story. Marc was only 10 and remembers nothing and my dad has passed away. I will take a lie detector test on this event.",
  "classification": "Class B",
  "county": "Collier",
  "state": "Florida",
  "latitude": 26.0645,
  "longitude": -81.3615,
  "location": "-81.3615,26.0645",
  "location_details": "I am not sure if I got the correct highway or even the county (it may be the county south of dade). We grew up in Miami Springs and we took 2hr trips to the Everglades to the south.",
  "temperature_high": 86.06,
  "temperature_mid": 80.855,
  "temperature_low": 75.65,
  "dew_point": 74,
  "humidity": 0.81,
  "cloud_cover": 0.6,
  "moon_phase": 0.84,
  "precip_intensity": 0.0013,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1014.53,
  "summary": "Humid and mostly cloudy throughout the day.",
  "uv_index": 7,
  "visibility": 8.87,
  "wind_bearing": 56,
  "wind_speed": 0.77
}