{
  "id": "562",
  "title": "Hunting party reports frightening vocalization",
  "date": "1990-11-10",
  "timestamp": 658195200,
  "observed": "After, reviewing the Lincoln, Montana incident near Stonewall Mountain. I decided to write you the following report. About 8-10 years ago 6 (six) of us were hunting south of Indian Meadows trailhead. We were basically hunting across the rough and timbered area in pairs. Brad and I heard the noise in the distance. It sounded like a high pitched scream related to a rusty gate being opened slowly. There was wind and unsettled weather. It was in the afternoon! Later we learned that the others in our group also heard it, even closer to them. Steve and Miles had their wives with them as we combed the varying terrain searching for Elk. Everyone had highpowered hunting rifles. Steve and Germaine apparently got together with Miles and Cheri and decided to take the first main game trails out of the area. Steve was an avid bear hunter and was very disturbed about what he heard. Brad and I continued the hunt, really not getting the full impact of the sound effects. I heard the sound one other time in the same area. Miles and I were hunting elk with the bow and arrow and I had something come into my calling and never had the opportunity to see it close to the same area. No one had a visual on the animal. No tracks visible even at times when the snow was on the ground. We have all heard stories about creatures crossing the roadway early in the morning, other sightings and very rank smells in undergrowth areas. In relation to our hearing the vocalization, Miles spoke to me on the telephone on day about a television program about Big Foot and someone that had a recorded soundtrack of a believed big foot scream or call. Miles indicated that his wife came from her place of rest in the other room and stated, What was that noise? Miles replied to her, that was a recorded sound of a presumed big foot or Sasquatch. Cheri replied, \"That is the sound we heard hunting across from your Dad's house. Miles' dad's house is one of the last homes before you reach the wilderness boundary. The area you have documented near Stonewall Mountain is very close to this area. I hope this information supports believed big foot sightings in this area. Much of the area is being logged and areas of dense canopy cover are dwindling as we speak for this area.",
  "classification": "Class B",
  "county": "Lewis And Clark",
  "state": "Montana",
  "latitude": 47.07954,
  "longitude": -112.5649,
  "location": "-112.5649,47.07954",
  "location_details": "The area was a large section of land between the Indian Meadows USFS Trailhead, Copper Creek and Landers Fork Drainages. I believe the USGS 7.5 minute quadrangle maps list an Elk Tail Park and show an airstrip. The occurrence took place 1/2 to 1 mi west or nw of that strip on my estimate.",
  "temperature_high": 60.26,
  "temperature_mid": 49.125,
  "temperature_low": 37.99,
  "dew_point": 31.51,
  "humidity": 0.44,
  "cloud_cover": 0.75,
  "moon_phase": 0.79,
  "precip_intensity": 0.0001,
  "precip_probability": 0.14,
  "precip_type": "rain",
  "pressure": 1016.74,
  "summary": "Mostly cloudy throughout the day.",
  "uv_index": 1,
  "visibility": 10,
  "wind_bearing": 234,
  "wind_speed": 12.19
}