{
  "id": "23120",
  "title": "Father and daughter have daytime sighting in the Ocala National Forest",
  "date": "2006-07-15",
  "timestamp": 1152921600,
  "observed": "My father and I were riding south in our car down forest road 65, in the Ocala National Forest.  We were nearing the point where 65 intersects with forest road 90.  The road is sandy and white, and as we were moving along we noticed a figure up in the distance, silhouetted against the white sandy road that was going up hill.  We were a good distance away, and we initially thought it must be a man, but there was no campground in that area, and besides in July, it is extremely hot out there.  The figure did not appear to be carrying anything, like a hiker would.  There is a trail about a mile or two from this area, but the trail crosses the road a good bit south of where we were.  Anyway as we got closer the figure just seemed to be all dark colored with hair.  It was on the side of the road and as we approached it crossed the road to the other side.  It did not appear to be as big as I would have imagined, but was probably about 5 to 6 ft tall.  When our car got to the point where we had seen it cross into the woods, we stopped and looked, it was just thick piney woods, and we were both really kind of in shock about all of this.  It was a few hours later I realized we should have looked for tracks. What we saw was most definitely not a bear, because this creature walked on two legs for the whole sighting, besides we have seen many bears out there, and we know what they look like.",
  "classification": "Class A",
  "county": "Marion",
  "state": "Florida",
  "latitude": 29.3143,
  "longitude": -81.7268,
  "location": "-81.7268,29.3143",
  "location_details": "",
  "temperature_high": 91.08,
  "temperature_mid": 83.47,
  "temperature_low": 75.86,
  "dew_point": 72.61,
  "humidity": 0.72,
  "cloud_cover": 0.18,
  "moon_phase": 0.67,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1019.63,
  "summary": "Humid throughout the day and partly cloudy in the afternoon.",
  "uv_index": 10,
  "visibility": 9.63,
  "wind_bearing": 177,
  "wind_speed": 4.01
}