{
  "id": "5342",
  "title": "Fisherman finds footprint near Witts Springs.",
  "date": "2002-10-30",
  "timestamp": 1035936000,
  "observed": "I was in the Arkansas Ozarks this fall just touring around checking out different streams to fish. I had gone into the Richland Creek area and parked in the primitive campground. I was alone and didn't see anyone else here at that time. Anyway I found a trail and took it heading downstream from the campground. I had read that there were bears in the area so I really payed attention to my surroundings. It had rained the night before leaving the trail wet and it seemed that no one had been on the trail that day due to the lack of footprints. I left the trail two or three times to climb down into the creek to fish. It was very rocky terrain. I had gone about a mile down from the camground on the trail. When I got down into the creek I noticied a small area of very small gravel about 5 by 10 feet on the edge of the creek and decided to look for animal tracks. I saw four round prints in a small group that were not very detailed in the soft gravel. Then I saw a very large, 18 inches or more, print looking very much like a foot right on the edge of the water a few feet away from the other prints. This \"footprint\" was about 4 inches deep and full of water. It lacked any detail in the gravel except that it had very definite, entire edges and was shaped like a human foot. Well, I reached for my camera to shoot it, then I laughed to myself thinking people would think I was crazy. I mean at the time I did think it was funny and I discounted it on the spot. I did look around for more prints but the rest of the creek bed in the immediate area was solid rock. I had a long drive ahead that day and blew it off. It wasn't until I got back home to Dallas that I really had to stop and wonder about what I had seen. I felt like an idiot for not photographing it! I haven't been able to come up with a logical explaination for it such as an animal digging or a tipped over rock. Nothing. I told a few friends about it. I guess some people considered me sane still. My older brother seems to think I've been in the outdoors enough to know what I'm looking at. Who knows?",
  "classification": "Class B",
  "county": "Searcy",
  "state": "Arkansas",
  "latitude": 35.8019,
  "longitude": -92.943,
  "location": "-92.943,35.8019",
  "location_details": "",
  "temperature_high": 55.88,
  "temperature_mid": 49.125,
  "temperature_low": 42.37,
  "dew_point": 47.79,
  "humidity": 0.86,
  "cloud_cover": 0.97,
  "moon_phase": 0.81,
  "precip_intensity": 0.0006,
  "precip_probability": 0.55,
  "precip_type": "rain",
  "pressure": 1017.48,
  "summary": "Overcast throughout the day.",
  "uv_index": 2,
  "visibility": 8.05,
  "wind_bearing": 333,
  "wind_speed": 2.85
}