{
  "id": "28678",
  "title": "Man recalls a possible up-close nighttime encounter on Gilchrist Island",
  "date": "1961-03-18",
  "timestamp": -277430400,
  "observed": "In March 1961 The Boy Scout troop I belonged to was camped on Gilchrist Island in Lake Tsala Apopka Citrus County, FL. near Hernando City. The days activities included hiking, swimming, camp craft, night games, and finally on Saturday night the ever popular campfire.  The campout was very exhilerating and when lights out came all found it easy to fall asleep. As Jr assistant scoutmaster it was my responsibility to make sure everyone was in their tents and secure for the night.  As a boy of 17 years of age this position was one of importance and was not looked upon lightly. The days duties were completed about 11:30pm. I walked for approx.  15 minutes from the campsite, down a  moon-lit path without a flashlight to take my evening constitutional. The return trip was uneventful and it seemed unusually quiet for a location normally filled with the sounds of frogs, crickets and occasional bump in the night. I decided to take a shortcut through the forest to bypass a bend in the trail and came into a clearing with what appeared to be a stump. I reached a distance of about 6 feet from the object when it stood up. The creature was 5-6 feet tall weighing about 200-300 pounds. I was 6 feet 1 inch tall and weighed 120 pounds. The figure in front of me was much broader than I with very long and heavy arms. The moon light source was behind the creature, so consequently eyes or facial features were not discernable. The light revealed a body glistening with long hair. What seemed to be an eternity but was only a few seconds we stared at each other and then he was gone. The creature ran with a long, fast, heavy stride as it crashed through the palmettos until it could be heard no more. The campsite was still when I returned. Frightened, I went to wake up the Scoutmaster, and he suggested a good nights rest and all would be well in the morning.",
  "classification": "Class B",
  "county": "Citrus",
  "state": "Florida",
  "latitude": 28.90854,
  "longitude": -82.34611,
  "location": "-82.34611,28.90854",
  "location_details": "Hernando City Rt 41, turn East on Parsons Point Rd; south on N Lake front Drive to fish camp before the dead end for launch point to Island.",
  "temperature_high": 83.01,
  "temperature_mid": 74.395,
  "temperature_low": 65.78,
  "dew_point": 64.43,
  "humidity": 0.78,
  "cloud_cover": 0.77,
  "moon_phase": 0.07,
  "precip_intensity": 0.0004,
  "precip_probability": 1,
  "precip_type": "rain",
  "pressure": 1019.1,
  "summary": "Mostly cloudy throughout the day and breezy starting in the evening.",
  "uv_index": 6,
  "visibility": 8.81,
  "wind_bearing": 141,
  "wind_speed": 8.41
}