{
  "id": "17957",
  "title": "Mother and son experience multiple incidents in the Sautee-Nacoochee Valley",
  "date": "2007-02-15",
  "timestamp": 1171497600,
  "observed": "In Sept.2006 my 18 year old son and a friend were camping out off of hwy 255 in Habersham Co. (next to the National Forrest and right beside WhiteCo.) They were frightened and run off by howls and growls they swore were not human. High pitched Ape like sounds then VERY LOW long growls. The horses were huddled in a \"defensive\" stance then at the high pitched sound would run as if they were stampeeding. The boys said they could hear something walking near them but when ever they looked out nothing was there. The next week I went to feed alone and NONE of the 7 dogs that live there would go to the pasture with me. THIS WAS TOTALLY OUT OF CHARACTOR! I could hear something following along beside me but each time I stopped to look it was as if a flash of dark just ran by. I wasn't scared, but I KNOW something was there. January 2007 8 of us went to the barn late at night we heard the sounds the boys had heard and all people and dogs were accounted for inside the barn. While we were in there one old horse that stays in at night was in his stall and he would NOT calm down for anything, not even food! He circled in his stall yelling for 45mins. While he was doing that 2 of us were in a stall with an other horse and something hit the outside of the barn right at that stall. This happened 4 or 5 times until some of us went to look. NOTHING WAS THERE! It was very dark and my son started throwing horseshoe in the direction of the noise. He threw 5 one at a time. We heard 3 hit the ground or trees or bushes, 2 NEVER HIT ANYTHING, BUT WE HEARD GRUNTS RIGHT AFTER HE THEW THEM! Febuary 15,2007 my friend Cathy and I have been on several websites looking for clues as to what we are dealing with. We have found 3 foot prints, these are NOT \"giant size\", but they are much larger than human. There are 2 different Areas that look as if something large has been bedding down there. There are trees that look like the markings of territory shown on some of the web sites. One of the most increddible things we have found is an area by a little stream where an oak tree was down, still fresh, and some of the bark had been shreded and appeared to have been chewed. The gorund around it was totally dry, but the \"chewed\" bark was slimmy wet, like spit. I brought some home and put it in a baggie and today it is STILL moist! It looks as if spit bubbles are in it. After picking this up and heading back out of the woods we knew something was following us. We heard the high pitched howls, sticks beating together and trees and bushes moving. Still we could not see anything. HOwever I told her to take 3 stepps together and stop with out talking, we did BUT WHAT EVER WAS FOLLOWING US DID NOT!! Then we REALLY got some vocals. We don't wish this any harm, but we do want to know what is there. We are planning to stay out in the woods near this site This up coming weekend. We would love to have a pro with us!",
  "classification": "Class B",
  "county": "Habersham",
  "state": "Georgia",
  "latitude": 34.71425,
  "longitude": -83.62215,
  "location": "-83.62215,34.71425",
  "location_details": "This is only 10 to 15 miles away from another site in Helen. Both which back up to the National Forrest.",
  "temperature_high": 40.74,
  "temperature_mid": 32.065,
  "temperature_low": 23.39,
  "dew_point": 13.93,
  "humidity": 0.51,
  "cloud_cover": 0.28,
  "moon_phase": 0.93,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1016.6,
  "summary": "Partly cloudy in the morning.",
  "uv_index": 5,
  "visibility": 9.89,
  "wind_bearing": 312,
  "wind_speed": 4.96
}