{
  "id": "24568",
  "title": "Multiple witness sighting at Rattlesnake Lake",
  "date": "2000-08-14",
  "timestamp": 966211200,
  "observed": "In the Summer of 2000 I took a friend up to Rattlesnake Lake in North Bend, WA.  It was a clear night, full moon which makes for a breath taking view of Rattlesnake Ridge.  This was before all the development was done so we pulled his truck into a clearing (to the left of the main road as you come up on the lake.) We parked and climbed in the bed of the truck.  I would say 15 mins later we heard a rustle in the bushes.  When we turned to look there was a very large animal of some sort.  It was taller then the average black bear and stood like a man.  We litterly sat there froze for a good 2 minutes.  It would turn to the left and walk 3-4 large steps, stop and face our direction.  A few seconds later it would do the same to the right. I would say it was a good 40 yards from us and a good 15 yards from the tree line. It stood 7+ feet tall, long arms, covered in what seemed to be dark hair and walked like a human as it paced.  It was dark and too far away to see its face. Finally my friend slowly grabed my arm and asked me what the hell that was?!  I replied that i had no idea, but it is freaking HUGE!  We both jumped out of the bed of the truck throwing his spare tire on top of our blankets and made a mad dash for the cab. As he drove away I watched out the back window and it just stood there.  To this day i wish he has turned a full circle and shined his lights at it so we could have gotten a better look. I grew up in the Snoqualmie/North Bend area and spent many summer nights a days at that lake and in the woods. My friend was a hunter and in the military. There was no way it was an animal from this area... I didn't tell anyone about this for years and when i finally did they all laughed at me like I was a nut case.  But i know what i saw and i know the fear that i felt.  That paralyzing fear and dread...",
  "classification": "Class A",
  "county": "King",
  "state": "Washington",
  "latitude": 47.43534,
  "longitude": -121.7666,
  "location": "-121.7666,47.43534",
  "location_details": "As you drive up to the lake there was a clearing that was surrounded by wooded area on 2 sides of the clearing... it might be parking now or part of a bike trail...",
  "temperature_high": 68.04,
  "temperature_mid": 59.085,
  "temperature_low": 50.13,
  "dew_point": 47.94,
  "humidity": 0.7,
  "cloud_cover": 0.32,
  "moon_phase": 0.48,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1020.36,
  "summary": "Partly cloudy until afternoon.",
  "uv_index": 5,
  "visibility": 9.21,
  "wind_bearing": 234,
  "wind_speed": 2.91
}