{
  "id": "9867",
  "title": "Deer hunters have morning encounter on hunting lease",
  "date": "2004-11-26",
  "timestamp": 1101427200,
  "observed": "I climbed out of my deer stand at about 9:30 because we had to look for a deer my cousin had shot late the evening before that we could not find because of the thick brush and darkness. Well I cut thru the brush, down across the creek and got about 200-300 yards from my cousin's stand when I heard my Uncle yell something at me. I couldn't hear what he said so I yelled back for him to keep talking so I could get his direction. I got about 100 yard from him. I couldn't see him yet but I could hear him. He said there's a gorilla over here in the tree looking at me. I told him he was crazy. He said there really is, come and look. So when I got to him he said it again. I asked him was he drinking in his stand. He said no come around here and look. So we walked from down below my cousin's stand around to the side of it in the oat patch. I looked up in the tree he showed me with my binoculars and I saw something but I couldn't tell what it was because my binoculars are small and one side is kind of messed up. So I used my rifle scope. At between 100-150 yards away I had my cross hairs right on its chest. It had orange-brown hair all over its body except around its eyes and mouth area. It stood straight up in the fork of the tree with it arms down to its side. It didn't look like a gorilla. It was about 6ft tall but it was hard to tell [for sure] at that distance. I told my Uncle let's walk over there and see what it does. So we got about 75 yards from it and I looked down and then back up and it was gone. We walked over by the tree that it was in and the only tracks I found was where something landed real heavy on its heels and seemed to walk heavy on the heels. The smell was the worst the I ever smelled. We looked down through the woods to a line of oak trees and saw two figures in the trees about 300yards out moving around. Oh I forgot to tell you my Uncle said that there was what seemed like a female on the branch over the male but when I got there it was gone. We watched them for about 20 minutes and then went back down to get the deer which I did find on the way up from the creek. We kept an eye out for what ever it was and the male did come back to the tree and then left as we where pulling the deer up to the road. Everybody thinks we're crazy but I don't care I know I saw something I've never seen in the zoo or in the woods before. Maybe next time I'll have pictures with my new spycam.",
  "classification": "Class A",
  "county": "Rusk",
  "state": "Texas",
  "latitude": 32.01667,
  "longitude": -94.68333,
  "location": "-94.68333,32.01667",
  "location_details": "",
  "temperature_high": 67.9,
  "temperature_mid": 61.935,
  "temperature_low": 55.97,
  "dew_point": 49.34,
  "humidity": 0.76,
  "cloud_cover": 0.55,
  "moon_phase": 0.49,
  "precip_intensity": 0.0008,
  "precip_probability": 0.48,
  "precip_type": "rain",
  "pressure": 1012.45,
  "summary": "Mostly cloudy throughout the day and breezy in the afternoon.",
  "uv_index": 2,
  "visibility": 9.12,
  "wind_bearing": 164,
  "wind_speed": 11.16
}