{
  "id": "1760",
  "title": "Bowhunter sees large figure near Cameron Pass",
  "date": "1996-09-20",
  "timestamp": 843177600,
  "observed": "I believe it was in September of 1995 or 1996 and a friend and myself were up elk hunting during archery season. The area we were in was a few miles north of Colorado Highway 14 and a few miles west of Cameron pass. It was a parcel of Colorado state forest service land that had just recently been opened to hunting. It was aprox. 8:00am and we were moving north through the trees on the east side of a fairly large clear cut. It had just snowed that morning, so our movements were fairly quiet. I was using a diaphram call trying to imitate a cow elk in estrus (a series of higher pitched squeals and mews). As we were moving along I was warching off to our west to see if I could spot any movement in the aspen on the uphill slope on the west side of the clear cut. It was then that I saw movement, a large figure stood up from a short bit of growth. At first I thought that it might be another hunter, but as I looked closer I could see no weapon that it could be hunting with and the size seemed to be to large for a person. I stopped movnig at that point and watched it, it stood and looked in our direction for about 30 seconds and then turned and started walking up into the dense stand of aspen on the hillside. The thing that really sticks in my mind is the way that it swung its whole upper body as it turned to leave, it is almost like it used the momentum from the turning of its upper body to make its whole body turn to leave. At that point I mentioned it to my partner and all he said was that it was probably another hunter, I might mention that he is the type of person that does not believe that anyting out of the ordinary might actually exist. It was only after I mentioned it to him that I raised the binoculars that were hanging around my neck and scanned the hillside for anymore signs of movement. I scanned the hillside for about five minutes and was unable to pick up any movement. We never checked the far side of the meadow where I first saw it because my partner was worried that if we broke out of the trees that we might spook any game that might be in the area. Also because he believed that it was another hunter he did not wish to investigate the area that I had seen it. All I know is that what ever I saw was not a person and was not a bear (I have seen those go up on two legs before), I only know that I am not sure what it was I saw. It was a year or two later and my wife and I were looking at a bigfoot page on the net and found recordings of what is believed to be a bigfoot. When we heard it she mentioned that the sound I make on the call when hunting sounds very similar to the sound that was recorded. I don't if this could have contributed to seeing what I saw or not, maybe it was trying to figure out what we were. I still plan to head back up to that area on horseback and spend a little time eventually, although I doubt that I would be fortunate enough to see that same sight again.",
  "classification": "Class A",
  "county": "Jackson",
  "state": "Colorado",
  "latitude": 40.54167,
  "longitude": -105.9333,
  "location": "-105.9333,40.54167",
  "location_details": "It was a couple of miles north of the first access to the Colorado State forest land as you travel west over Cameron pass. I would rather that you did not post the exact directions as I would rather not have a horde of people going up in that area spooking everything in sight. Though I would be more than happy to help any responsible researcher in finding the loacation.",
  "temperature_high": 63.73,
  "temperature_mid": 51.855,
  "temperature_low": 39.98,
  "dew_point": 31.72,
  "humidity": 0.51,
  "cloud_cover": 0.56,
  "moon_phase": 0.26,
  "precip_intensity": 0,
  "precip_probability": 0,
  "pressure": 1014.06,
  "summary": "Mostly cloudy until evening.",
  "uv_index": 5,
  "visibility": 9.95,
  "wind_bearing": 274,
  "wind_speed": 6.41
}