{
  "id": "15615",
  "title": "Creature seen walking across pasture in daylight north of Grand Island",
  "date": "2008-08-15",
  "timestamp": 1218758400,
  "observed": "I was looking around on the internet last night and ran onto to your site and it brought back a memory of something that happened to me when I was around 18 years old. The best I can recall was that it was around 1979. So I thought I would go ahead and report it just incase someone else has also reported this. I have told several people about this but most just think I'm crazy but I know what I saw. It was a very cold winter morning (maybe December 1979 or January 1980), I lived on a farm. We had a long driveway and the mail box was at the end of the driverway. Just west of the mail box was a long shelterbelt with lots of trees. I went down to get the mail and pulled up to the mail box in my pickup when something caught my eye walking in the field so I pulled up to see better. What I saw was a large man like thing walking south in the field toward the sherlterbelt. It was approx. 1/4 mile west of me and approx. 10 to 20 yards north of the shelterbelt. I saw it for about 10 to 12 seconds is all. I remember it being dark brown with long hair. The wind was blowing fairly hard out of the north and I remember seeing the hair on it's arms and face blowing toward the front of it because the wind was at it's back. I also remember it having long arms and it took big steps. It kind of turned it's head and looked a little toward me and then walked a little faster and disappeared in the trees. I know it wasn't a man because no one would have been walking out there on such a cold morning. I had a high power rifle with a scope in my pickup but didn't have time to even pick it up and look through the scope at it. I wanted to go out there and look for tracks but I was afraid to. There was snow on the gound maybe about a foot worth. This field was a paster that it was walking in. The shelterbelt consisted of large old cottonwood trees and some pine trees. Well that's about it.",
  "classification": "Class A",
  "county": "Howard",
  "state": "Nebraska",
  "latitude": 41.55099,
  "longitude": -98.22576,
  "location": "-98.22576,41.55099",
  "location_details": "1 mile west of Hwy 281 on Hwy 58 and .5 south on gravel road.",
  "temperature_high": 80.28,
  "temperature_mid": 68.24,
  "temperature_low": 56.2,
  "dew_point": 60.42,
  "humidity": 0.72,
  "cloud_cover": 0.19,
  "moon_phase": 0.46,
  "precip_intensity": 0.0001,
  "precip_probability": 0.11,
  "precip_type": "rain",
  "pressure": 1020.26,
  "summary": "Partly cloudy starting in the afternoon, continuing until evening.",
  "uv_index": 7,
  "visibility": 9.8,
  "wind_bearing": 48,
  "wind_speed": 4.95
}