{
  "reportId": "15107",
  "title": "Possible vocalizations heard by a farmer near Max Meadows",
  "date": "2003-10-23",
  "observed": "At approximately 10 pm one night, my wife and I returned home from a shopping trip. Upon opening the car door and stepping into the gravel driveway I heard a distinct and loud vocalization. It wasn't a howl, not a growl, nothing I had heard before which is what caught my attention. At 31 years old now, 28 then, I had spent my life in the outdoors, locally and abroad. I have never heard anything to match this. My wife asked me what it was and I had to admit I didn't know, but perhaps it was a big cat. But it didn't sound like a cat, and the only cats in the area that are known as 'big' would be bobcats, a big one being 18-29 lbs. I walked inside the house, cutting on the rear porch light, and walked through the house to the front deck where I walked back outside, cutting on the front deck light. I stood at the end of the deck facing east and listened intently. The 'cries' were coming from a ridge in a large woodlot across the railroad tracks behind our house. Our house is situated on 10 acres, and the rear property boundary is the railroad. At that time the nearest house to us, a couple of hundred yards to the east was uninhabited, but the next houses up and across the railroad tracks were. Between cries, I realized I could hear leaves rustling loudly as though two feet were shuffling through them in large strides. When the leaves stopped making noise, an agitated cry was heard. This went on for a minute or two, then the noises came from closer to the neighboring houses, then it started going in the other direction. I probably listened for ten minutes total, until could no longer hear the leaves moving, and howls were coming from farther away. It was mid fall and cold, the sky was clear, no traffic on the road in front of my house which intersects with the railroad maybe a quarter mile down the road. I have labored under the impression that the cries came from some kind of cat, but after listening to the Ohio recording, the cries I heard were frightfully akin to the howls on that recording. They were shorter and sounded more agitated as though something was making the 'issuer' of the cries mad. The large woodlot across the tracks is semi-surrounded by a loose assortment of houses in a neighborhood, which could be easily walked through unseen in the dark. Everything else for surrounding areas is farm pasture and mountain, in fact one mile from my house to the east starts a gravel road running across a mountain into the next county. My inside dogs were whining and agitated, but never offered to bark, then, they rarely do. However neighborhood dogs could be heard barking in the distance, beagles I know for sure and a German Shepherd.",
  "classification": "Class B",
  "county": "Wythe",
  "state": "Virginia",
  "location": "-80.8797,37.00085",
  "location_details": "Peppers Ferry Road near Max Meadows, VA"
}