{
  "reportId": "8038",
  "title": "Near Lake Texoma and Hagerman Wildlife Refuge, ongoing activity near family home.",
  "date": "2004-02-19",
  "observed": "I do not know the exact year. It must have been spring or early summer. A storm was coming in and it was at night. Our landlord kept two old horses on the pasture. Somehow they had gotten out and my father and his friend were trying to find them. They had drove off in my dad's jeep (toward the tree of Lebenon). I was standing on the front porch watching them drive off when I felt something eerie, I guess. I turned toward the pasture and there was this tall, lean, lanky, hairy mannish thing coming toward me. I called quietly to my younger sister because I was terrified. It's eyes never left mine even when my sister came onto the porch. I could not speak or breathe but my sister was making a whimpering noise, it still held my gaze. It came to the fence and put it's hand onto the top. I was awestruck that the lower part of his chest was the same height as the top of the iron fence. The fence is at least four to five feet tall. He towered over it. My dad was returning down the road and the headlights of the jeep drew me out of my fixation. I glanced at the jeep for only a second and when I turned back, the creature was half way down the pasture in one second, then disappeared into thin air. When my father came back home after finding the horses I questioned him on if he saw anything and he did not. My younger sisters were both crying and my dad was angry saying I was frightening them on purpose. I am shaking now just remembering about it's eyes. I was never supposed to speak about it again after many lectures from my father. I lived in that house until 1996, all through my high school years. After that incident, not sure how long after, I felt something watching me in my bedroom to a point that it drew me to the window. I could not see it clearly but along the tree line on by the far fence it was there watching me, I could make out it's massive shadow but could not make out its features. I shut my shades and went into another room, for I was not to talk of such nonsense. I never went out at night by myself again. I got chills for no apparent reason and felt watched often.",
  "classification": "Class A",
  "county": "Grayson",
  "state": "Texas",
  "location": "-96.78917,33.71472",
  "location_details": ""
}