{
  "reportId": "22431",
  "title": "Forestry workers report possbile encounter along the Klamath River near Orleans",
  "date": "1997-08-23",
  "observed": "I have two distinct incidences from 1997 and 1998 in the Klamath National Forest. The incident from 1997 was more of a Class B incident on the Klamath River directly off of Hwy 96. The incident in 1998 was during a solo backpacking trip in the Marble Mountain Wilderness where I hiked over 95 miles by myself. In 1997, I was working in the field conducting a survey to the National Forest users about federal land issues. It was an internship, and my field partner and I spent almost every night outside. The night of the incident was late summer, the second week of August. We had conducted the survey at a fishing and camping campground on the Klamath River and decided to go find our own camp for the night. We chose an undeveloped site just downhill from Hwy 96 that had nice sand bars along the Klamath River adjacent to a parking and picnic area. The parking area was situated between the river and the Hwy and was downhill from the hwy. The road and the river run parallel to each other here. Ben, my field partner, parked the car, and we grabbed our sleeping bags and a few items and went to crash for the night on the sand bars. Late that night, probably around midnight, we woke up to a large creature walking, actually limping, like a step, drag of foot, step, drag of foot, along the hillside below the road and above the river and us. It sounded like Eigor, but was definitely a two legged creature. We thought it was a person. It was limping along this slope that was covered in about 12 inches of oak leaf duff and the drag of the second (possibly injured) foot was loud through these leaves. Ben asked me if I could hear it, or was I awake. I said yes. I jumped out of my sleeping bag and grabbed a light and a knife. I shined the light up to the hill but could see nothing, and the movement on the hill stopped when I shined the light. I sat in my bag firmly gripping the knife with the light off. It continued to walk along the hillside coming closer to us. Suddenly, it reached a point on the hill directly above us and let out a gnarling, gutteral yelp. Not a scream, but a cry for help. Over and over again, this gnarled inward drone was very loud and continuous. Honestly, Ben and I could see nothing, and just sat there frozen. Waiting. We must have sat there waiting for over an hour, and the creature did the same. It was about 30 feet up the hill from us. Again, in honesty, Ben and I were not scared, and somehow, we both fell asleep. I think I relaxed finally, and just waited, and somehow fell asleep. I awoke some 20 minutes later to a huge splash in the river directly below the sand bars we were sleeping on. Across the river, the next day we could see nothing. No tracks in the sand, no tracks in the leaves, no nothing. We both agreed that it was not a bear, not a cougar, not even a human. There was only one explanation and it was sasquatch. In 1998, actually, I'm going to submit this one on the next one, because I think I'm close to 20 minutes. Sara",
  "classification": "Class B",
  "county": "Siskiyou",
  "state": "California",
  "location": "-123.292,41.23598",
  "location_details": "Parking and picnic area directly off Hwy 96 where the hwy runs parallel to the Klamath River. At the north end of the Klamath National Forest."
}