{
  "reportId": "24102",
  "title": "",
  "date": "",
  "observed": "When I was just a small boy, my mother and father would tell us kids a story which they had truly experienced when they were a young couple just starting out in life.  They were married in the year 1932.  Shortly there after, they went with their friends, another couple of their age group to a logging camp.  This logging camp was several cabins where two couples stayed per cabin.  The men would leave and go logging during the day.  Then, they returned at evening.  It all started one Saturday night.  The men came in from work and decided to go to town to have a good time, leaving their wives behind.  My mother told me that the other couple had only been married for a short period of time; their names were Frank and Lucy G********.  Lucy was extremely jealous and was afraid that someone would steal her husband, Frank.  It was almost dark when the men left for town.  Lucy was setting on the backporch steps, her arms wrapped around her knees, her head buried into her arms crying.  It was at this point that a curious, hairy man like beast came up to her.  Lucy screamed; the creature fled.  She was the only person in the camp that saw the monster.  She told her story and all the rest of the camp had big laugh.  My mother said “But it wasn’t long that they all got to see it.”  My mother and dad said they seen it several times.  Dad said it would come out about dusk.  Dad said he would park his old truck about 200’or so from the cabin.   And the thing, (mom and dad didn’t know what to call it, “this thing” they would call it) would come out of the woods and dad said it would put its elbow on the bed of his truck and rest his chin in his hand.  Mom and dad said it was bigger that a man and had hair all over its body.  They said it looked something like a gorilla.  Dad said it look a little like it didn’t have a head, its head was down in its shoulders.  They said it would run up right and very fast; dad said the dogs would chase it sometimes and it would just out run the dogs quickly.  Dad would say “Those dogs could chase down a rabbit but they couldn’t keep up with that thing.”  My mom said that some of the men were going to shoot it but my dad said that he would not let them.  My dad said “It looked too much like a human.  My mom and dad would confirm what each other would say. I was about nine or ten when I first heard the story.  After I become an adult I would ask them about it, and they would tell me again.  My dad was not a joker or didn’t kid around he took life serious, he became a Baptist Minster at an young age.  He past away in 1985, my mother in 2004.  they both were God fearing people.   The legacy they leave behind is my proof of this story authenticity. My mother and father had told me this story before I had heard of Big Foot, Abominable Snowman, or Sasquatch and I don’t believe they had heard of such neither.",
  "classification": "Class B",
  "county": "Buchanan",
  "state": "Missouri",
  "location_details": "logging area"
}