{
  "reportId": "12156",
  "title": "Bicyclist hears vocalization, wood knocks and sees tree shaking",
  "date": "2005-06-21",
  "observed": "On June 21, 2005, I started a solo bicycle tour from Salem, Oregon that would take me east up into the Mount Hood National Forest, Warm Springs Indian Reservation, Old Mckenzie Pass Hwy just west of Sisters, and then loop back to Salem. On this trip I would have 2 encounters that are up to discussion as to what they were. Let me just start by saying I'm recently a believer in Bigfoot. For several months I've been reading the case histories on the BFRO website, and frankly, I knew that the areas I'd be riding in were prime Bigfoot country. Let me also add that I had no desire to have any kind of Bigfoot encounter because I'm on a bike, I'm alone, I carry no weapon for defense, I'm often camping miles from anywhere, and I scare easily. Well, on Friday June 24th, I was up near Detroit Dam at about 9pm, and was setting up my tent. I was about a 1/2 mile from the boat marina along  what's called the upper arm of Detroit Lake, off Hwy 46, which is fed be the Breitenbush River. So its now about 9:45pm, I'm in the tent just listening to the night sounds, like the flow of the water, the leaves blowing a little in the trees, kind of just getting acclimated to where I was camping, when suddenly I hear this tremendous scream that shook me and filled me with dread. It came from about a mile away, sounded a little higher than middle pitched, like a scream a human might produce more so then an animal, but absolutely could not because of its loudness. This scream lasted about 4 to 5 seconds. It reverberated off the mountainsides in the area. What's more creepy is I was aware that a fisherman had reported to the BFRO a while back of an audible encounter. After the trip I looked it up, its #689, and sure enough this scream came from the area of the first report. I was roughly on the Northeast side of Detroit Lake, and Hoover campground is about a mile further east and south of me. Anyway, this is what I heard; it was definitely a scream and not a howl or a whoop, and frankly, if I had not heard recorded Bigfoot sounds previously, I don't think I would of known what to make of it. It was a little like the Puyallup Whoop-Howl of '73, but did not trail off at the end, was even in pitch the whole time, was louder and more like a scream. The second occurence happened on July 3rd. It was about 7:30pm; I was walking my bike along Hwy 242 (Mckenzie Pass Hwy). I was about 7 miles west of Sisters, OR. It was nice clear weather, sunny and early evening. I was walking the bike because I was too tired to ride, and it was too early to make camp. I was noticing how remote this area is. I had passed  earlier a primitive campground called Cold Springs, and was 2 miles west of it. I noticed there were no more pull-outs for cars and didn't see anything or anybody up there. A car would pass about every 15 minutes. There were trees on either side of the road. It was a very pleasent walk. Well, all of a sudden I heard 4 knocks  come from the woods just to my right about 50 feet away, behind a stand of trees and bushes. At first I thought Bigfoot, having heard wood knocking on the internet; I immediately looked at the road ahead to see if it was up, down or level. Being the bike and gear weighed 80 pounds, I would be able to make my escape only if it was down, and it was. I looked back at the area the knocks came from, and now saw one large bush suddenly shake, and then what sounded like a very low animal-like growl coming from it. At first I thought FLEE, but then thought of reports I'd read on BFRO, how people often filled with terror and ran. So I decided not to do that. I stood there and watched to see what was next, trying to act brave, and stood for about 30 seconds and thought- hell I don't really care what's next, I just wanted out, this ain't gonna be the day I investigate Bigfoot, I actually said to myself -  maybe I'd comeback some other day. So I started walking off, and nothing else happened. I camped about 2 miles west from there. I should say to me this did not sound like a woodpecker, which is often high up in the trees, is faster and more in number of strikes, and is higher pitched. What I heard was four knocks, evenly spaced, coming from about ground level, the sound like that of wood on wood. No one was in the area, no development, it being preserved, protected wilderness. So what made that sound?",
  "classification": "Class B",
  "county": "Marion",
  "state": "Oregon",
  "location": "-122.1874,44.699",
  "location_details": "To reach first location, take Hwy 22 for about 48 miles to Detoit, turn north on Hwy 46 and go 1/2 mile. Second location go about 7 miles west from Sisters Oregon on Hwy 242."
}