{
  "reportId": "32227",
  "title": "Man describes possible encounters off Route 41 near Ochopee",
  "date": "2009-08-16",
  "observed": "I have a sighting and other occurences to report. Its been about 3 years now since my friend Dan and I saw it. We were walking along a dirt/road trail along the focka canal system to find a good bass spot, as we were walking I thought I saw large brownish colored legs ahead on the trail. I didnt say anything at first until Dan asked me if I saw that. I was stunned and replied \"Yea, Huge brown legs cross in front of us and he replied \" I thought it was just my eyes\". The sasquatch was in a group of trees next to the canal I guess checking us out. The reason I am saying this is because we heard and saw the branches in front of us russling. We were honestly scared and backed away slowly. Now Dan is a officer in the Navy now working I believe out of Miami. He is a very credible none bs type of person. I myself is a biologist and I am super observent of my surroundings. The only reason why we just saw the legs is because we were looking down in front of us so we didnt step on one of the resident water moccasins. Since then I have been going to the same location to try to see if \"its\" still there and yes \"it\" is. I havent seen it since the first time but I found an area off the trail that had almost like I guess beds?!? Basically it was long saw grass bundled up together and it was obvious something large has sat in it. Also near by I found skelatal remains and hair from a bear that seemed to literally have been ripped in half. I have also spent many nights fishing in the location and near it and have heard undeniable 'calls\" that seem like it came from some sort of primate. Similar to a very deep howler monkey call.  I have a lot of experience with primates from my studies throughout Latin America. Based on that I KNOW it was a primate call. There was another occurence when I was with my friend Chris on Turner River Rd. off Rt.41 South of Ochopee,Fl. We were crawfish hunting after a evening shower and heard some odd noises in the woods across the canal system. Then we smelt a very odd odor I wouldnt say it smelt like rotten eggs like all the other reports but maybe like methane gas. We moved on about 2 miles down the road and was picking more crawfish out of the swamp and heard the same noises followed by the same smell. This occured for another 30 minutes or so and we felt uncomfortable and left. I believe I read that the BFRO went to Florida in 08 on an investigation and I believe it was off Rt.41? I think there is a few key locations that BFRO should check out, 1. Picayune Strand, just outside of Naples, Fl, http://www.fl-dof.com/state_forests/picayune_strand.html, 2. Turner River and Birdon Rds. just south of Ochopee, Fl off Rt. 41 http://www.staynplay.net/florida-tourism-articles/turner-river-road.htm I live in New Jersey but have a condo in Naples,Fl, if BFRO wants to investigate these areas I believe I can find time to come down and show you the exact spots of the occurences. If you have any further questions please contact me I will be more then happy to answer any questions BFRO may have. Please take this seriously, my stories are not bogus, bs statements. I will take a polygraph test if need be. Please contact me back with your thoughts.",
  "classification": "Class B",
  "county": "Collier",
  "state": "Florida",
  "location": "-81.69245,26.1875",
  "location_details": "Picayune Strand- From Naples,Fl: Travel East down Immokalee Rd. turn right onto Randall Blvd follow road approx. 5 miles then turn right onto Everglades Blvd. Follow road approx. another 5 miles go over I-75 via a bridge into the strand turn left down the first street you see then follow road for about 1 mile and turn right down unknown dirt road and you will be at the sighting location. Turner River Rd.- From Naples: Follow Rt.41 south bound for 20-25 miles just past the small town of Ochopee you will Turner River Rd. on you left hand side."
}