{
  "reportId": "1939",
  "title": "Youth's presence startles unknown animal",
  "date": "1965-10-01",
  "observed": "I experienced this incident while living on a military base in North Carolina.  I was approximately 14 or 15 years old at the time, I am fifty now, however the incident is still fresh in my mind.  At that time there was nothing for a young boy to do so my favorite pastime was wandering the military reservation and search for discarded C rations as we never had enough to eat in the house.There was 8 people in my family.  One day I had skipped school to go C ration hunting.  I never will forget that day, it was very warm and sunny, which for North Carolina is not unusual for a fall day.  We used to call it indian summer.  I had been wandering the deeper recesses of the reservation and was quite proud of the fact that not only had I stumbled across old farmsteads that the Marine corps had condemed in order to take the land but had a pretty good supply of discarded C rations.  Realizing it was getting late and I had better get home, I hit a tank trail made by the marines for thier vehicles to use.  I was getting closer to home so I decided to leave the trail and short cut it through the woods.  I knew this particular area and always avoided it because it was known as a pocosin, which in local terms meant an area that is real dense and swampy.  As I made my way in to the pocosin something really seemed out of the ordinary, all day I was used to hearing the sounds of the forest, birds, frogs squirrels chattering and what was great not seeing another human being. Now it was so quiet it didn't seem natural.  Something made me stop and to this very day I am perplexed about this I don't know why because at that age you have no fear as you think you are going to live forever.  I had no fear this time either however I felt that I was being watched.  I have never had this feeling again.  I slowly started to turn my head to the right when I caught a glimpse of brown.  My first thought was oh its only a deer.  I stood stock still and kept looking at the brown patch and it didnt move.  It was in a VERY dense part of the pocosin and my second thought was maybe its not a deer but possibly a discarded marine corps field jacket.  Now that would be a treasure, as I started to go towards the object I seem to hear the crashing of brush first then that brown patch moved, only it moved higher.  I  estimate a height of between 8 and 10 feet.  As it grew in height it also grew broader exposing more of itself.  I never saw its head or any real features other than the long fur because that thing was moving so fast through that pocosin that I was amazed how any animal that size could do that.  The crashing of the branches and underbrush was loud and I all I could do was stand there.  I don't know how long I remained in that position, all I rememeber is the sounds of the forest returned and thats what snapped me back to the present.  I have only recalled this story once and was told never again to repeat it to anyone or go back in those woods.  I have never returned to that area.",
  "classification": "Class A",
  "county": "Onslow",
  "state": "North Carolina",
  "location": "-77.2914,34.6894",
  "location_details": "On the military reservation Camp Lejuene marine corps base approximately 5 miles from Highway 24 in Hubert, North Carolina."
}