{
  "reportId": "32634",
  "title": "Two paranormal investigators find possible evidence at Cumberland Sugar Creek Cemetery",
  "date": "2011-06-28",
  "observed": "[Witness first names have been changed] On Tuesday evening June 28, 2011, I along with fellow paranormal investigator James arrived at the Cumberland Sugar Creek Cemetery in rural Sangamon County near the small town of Glenarm, Illinois a little before 10:00pm. James and I are both paranormal investigators and had previously talked about trying to find the cemetery to check it out for a possible paranormal investigation. Upon finding the location, we decided to do a quick walk through of the cemetery to see if anything of a paranormal nature was occurring and to check out the cemetery's layout. We also had heard from other local paranormal sources that a group of paranormal investigators had been pelted with rocks or dirt clods thrown from the tree line around the cemetery. This occurred less than one week ago and during a paranormal investigation. We had also heard of several recent sightings of large tracks or foot prints in the Covered Bridge area of rural Sangamon County which is not far from the cemetery. James and I both felt that the throwing of stones sounded like classic Squatch activity and because of this we decided to check the tree line around the cemetery to look for possible signs of what may have been throwing the stones at the paranormal group. This is when we found the following. In the Southeast corner of the cemetery property and next to an opening in the fence line, we found a mound of fairly soft clay. As we were looking around the mound of dirt, we noticed what looked like a fairly large foot print. Upon further examining the foot print, it was apparent that whatever had been walking there was barefoot. In the same proximity we discovered two other footprints which were approximately the same size. We estimated the size of the prints to be at least fourteen inches long. The footprints were also barefoot. The tracks were headed away from the cemetery and towards the southeast. Because we had not planned on doing anything more than a walkthrough of the cemetery we did not have our usual camera and lighting equipment with us, so we took several photos of the footprints with James’ cell phone camera. We also noticed that approximately 75 feet or so and to the North of the footprints a fairly good sized tree of maybe 3 to 4 inches in circumference had been snapped and bent over. The tree was located next to but outside of the fence. The area surrounding the cemetery is rural, the cemetery itself has a fence around the rear part of the graveyard however the best that we could tell in the darkness is that it looked like there was an open field to the rear of the cemetery and it appeared that on the other side of the open field there may be more substantial tree coverage. But unfortunately due to the darkness and lack of lighting equipment, we could not determine any further details of the surrounding terrain. We then left the cemetery around 11:00pm.",
  "classification": "Class B",
  "county": "Sangamon",
  "state": "Illinois",
  "location": "-89.6845,39.62",
  "location_details": "Two miles west of Glenarm."
}