{
  "reportId": "17189",
  "title": "Close encounter remembered and possible vocalizations heard and recorded near Minerva",
  "date": "1991-08-15",
  "observed": "August 1991 Stark County, East Canton OH near to US Route 30 It's hard to say where these stories come from. When I was younger I had always read about them with a grain of salt. I mean you never really take anything serious that you read about unknown phenomena, if you haven't experienced it. I think this just added to the surreal experience, in which I am about to finally indulge after all these years, whether anyone ever reads this or not. I was not a Bigfoot enthusiast by nature. As any other person who has shared an experience likewise can tell you, that all changes the moment you are faced with one. It was late August 1991 in a small town called East Canton in Northeast Ohio. I don't have an exact date. That never seemed very important to me at the time.  I know it was during that month. I grew up in East Canton, and knew the surrounding forests quite well, from plenty of hiking time with my dad and friends. It was not a good day. I had an outrageous argument with my girlfriend and simply had to take off for awhile. I decided to take to the woods for the night. I sometimes liked to hike and camp by myself, but it wasn't my style at that time. I had just gotten a used Ford Tempo which instantly changed my life. My days of woodland hiking/camping was over, for now anyway. At that time, I would have preferred to hit the mall or something meaningless like that. Thank God, I didn't. I packed up a small supply of gear to go camping for a night all by my lonesome. I knew exactly where I was going, the spot was perfect. I had camped there before, countless times. About two miles from my parent's house was an endless setting of woods. In these woods was a series of old abandoned coal mines. Above these caves was a gorgeous surrounding of pine trees. I am not sure how they was able to root above these caves, but they made for an absolutely gorgeous setting. Naturally, nothing makes a better bed than pine needles. All I really brought was a blanket to lay on, which was my first mistake. A machete for chopping fire wood and the standard nighttime armor, my trusty flashlight. I always like to travel light and sometimes, later regret it. You start to wish you would have brought a heavier blanket or sleeping bag when it gets cold. My friends, Pete & Joe (names changed, witness' request) came with me to help set up camp. Which there wasn't much to it,  I think they just wanted to hang out. So began the greatest quest of man, starting of the mystical fire. We made a huge clearing of the pine needles so there was no chance of a spark to set it off, and laid rocks around it. We was always really careful about this because we knew the owner of the land and he permitted us to hike or camp there anytime we felt like it. The sun was setting fast. Pete & Joe had to leave because they had to work early in the morning. I was glad. Not that I didn't enjoy company, but I needed to be alone to ponder the things that man does wonder. The fire was going real well. Since it was August, the nights would get very cold. So, fire good. Cold bad. At this point I was finding peace. It was a stressful day and well, needed silence therapy. The wilderness can be intoxicating if you set your attention towards it, and a great way of getting away from everyday problems. Well not this night anyway. At the time I had pop bottle glasses. I mean these suckers were thick. But I had perfect vision through them. Since then I have had lasik (laser correction) surgery and you will read on my purpose for that very soon. So I took my pop bottle glasses, and very carefully laid them very close to my blanket. If you've ever owned glasses and cannot see very well, you will understand, this is an insecurity. A few twigs snapped around me. I'm not going to kid you, when you hear that kind of stuff when you are alone in the deep dark woods, it scares you for a minute. Ultimately, nothing I have not heard before. I then realized it was something small, a little rabbit or squirrel. I was quite comfortable. I fell to sleep very fast. The doors of the unknown were about to be opened. At 3AM I wake with a very startled, uneasy feeling. I know I didn't have a nightmare, but I had a much more intense feeling that I was rudely awakened. Nothing seemed outwardly different with the camp, however, the weird sense was there. I'd felt this peculiar sense before. I am not exaggerating, and I hope that other people that have had the same kind of  experience can relate to this sense. It was the feeling of being watched, on an extreme level. Not your round about chill or alertness, I am talking an intense sensation. That tingly sensation that tells you that you are not alone and danger may be near. This sensation, was like a physical tingling behind my ears. It was like hypersensitivity. I guess like a Spidey-sense, if you will. I know I am not Spider Man, but if I was, this is probably what it would feel like when trouble was ahead. As all of you with glasses would know,  I immediately rush to find them and jam them onto my face. Dead silence. There isn't a cricket chirping, a tree frog singing, or anything. Just cold, dead silence. I however pass it off as a bad dream. Mind you, at this point I still have not heard anything, or understand why I seem to have been rudely awakened. I notice I am freezing. I am very cold and the fire is on its last red coals. I immediately lean over and start blowing on the coals to restart it. That's when it happened. I heard the most blood curdling scream (or shrill) I have ever heard, to this day. It sounded unnatural. This \"scream\" will never be able to be documented on paper by anyone, for anybody to understand it, unless they hear it themselves. It was simply terrifying, and unnerving. The kind of sound that shoots right up your spine and seems to peak through your every nerve. The octave levels of this scream was beyond my comprehension. If I didn't have ears, I still would have heard it. Let me expand more on this heart stopping shrill. Your first animal instinct reaction is two choices. To curl up into a little ball and hope it goes away, which is what I was feeling at the moment. Or flee as fast as you can. Those who ever read this, which will be very few, that have experienced this will know exactly what I am talking about. This scream I imagine will haunt us for the rest of our lives. A quick note on the bizarre side. I also had the instinct to yell back. Don't ask me why. It was one of those feelings I had that I cannot explain.  I did have to suppress myself to keep from yelling back. Maybe some kind of primordial defense mechanism? I'm going into weird territory here, but I felt a connection like that. Maybe someone else has felt the same, or else I am totally nuts? I am particularly interested in why I felt this. The fact is, it was a very surreal situation, and I didn't know how to react. I remember my first thought, and that was \"you've got to be \"%^*#^&\" kidding me.\" Because I have never heard anything like it in all my life. It sounded similar to the apes I would hear in old National Geographic documentaries, but much louder. This was Ohio though, not Africa. And it wasn't just once. This screaming continued in approximately 5-10 second intervals on both ends of my camp. On each end I heard rustling and shrills, as if they were screaming back and forth. I was shocked once again when I seen something thumping across the land. Fear took over. A large two legged something, thumped its way about twenty to thirty feet away through my camp. I say thumped because if you remember, I was sleeping on top of a series of caves, which essentially was like a floor. So I felt every step this creature made.  It didn't swing its arms around like a gorilla, but had features similar, from what I could tell. However, I can 110% guarantee it was no man. It was a moonlit night so I could see that is was very large and hairy. The top of its head reminded me of a gorilla's. It was mostly hair covered with some exceptions much like an orangutan. The hair color looked black, but could have had other colors with it. All dark hair looks black at night, and all hair has many colors that people don't immediately see without observation. It was a side view, so I did not see the eyes.  I wish I could have. I cannot give you a valid height. I did not see the full height, because it was running on a ledge. So I couldn't see below its calves. All I could see is it was massive. I am giving you the best description I can give of what little time I had to observe the creature. He/she didn't pose for me. All I know is it was colossal and I was frightened. My only conclusion at this point was that the ridiculous myth of bigfoot was real. That, or I was losing my mind. I was still hearing the yell from the rear of the camp as well. Which lead me to believe there was two or more. One thing I should mention is I did not smell the stench that so many encounters have mentioned. Perhaps because it was such a still windless night? My only instinct from that noise was, get out. Whatever it was.  It was saying, \"you are not welcome here,\" In its own language. I heeded the warning. I obviously picked the wrong place to sleep. My Dad always taught me not to run from wild animals because they sense the fear.  I grabbed my flashlight, and left everything else sit, and fearfully walked out...very fast. When I was about twenty feet away from the camping area, the continuous screaming ended. The silence was comforting, to an extent. I no longer felt in the immediate danger that I thought I was in initially and I did not hear anything following. When I cleared the woods and hit the road, I ran. I ran the entire distance to my parent's home to what seemed like the hardest haul I ever pulled. My chest hurt from breathing so heavily. I urgently beat on my Mom and Dad's locked door (I did not live there anymore). Mom rushed to the door. Naturally I had to catch my breath, but I eventually was able to recite what I just explained. Soon after, my Dad arrived home from work, and then I told him. This is coming from a nineteen year old kid mind you. They were good parents and listened. I am not so sure they believed me, but they agreed, something traumatic happened to me, to set me in such a disturbed mood. My dad had been Morel mushroom hunting for a few decades or more and had never seen anything like that before. Time has passed. I guess it was time to write all this down. I wanted to write this mainly for myself. I want to remember it as clear as I can. Every detail I recited in this is exactly how I remember it. No exaggerations. I would have through time, discarded this as a mere psychological episode. But I have not finished the story for you. The next day was equally thrilling. I knew that if I mentioned this to too many people it would be devastating. I had to tell someone what happened, and who better to tell than your trusting best friends, right? My two closest friends, once again were Pete & Joe. I explained this to them, and got the truthful expressions from them that I expected. Pete believed me to an extent, I think. But Joe took me for an idiot I think. Since I still was not on speaking terms with my girlfriend, the three of us decided to go camping in the same spot together. I wasn't about to take the day and go back by myself to retrieve my precious bear blanket. The word \"alone\" was not an option at this point and time. Why go back at all you ask? Well, its like this. When a man is alone he is alone. When he is with his buddies, he is an Olympian. Besides, I knew that lightning never strikes more than once in the same place. I mean come on, the chances of this same thing happening again were absurd.  I was concerned but didn't feel like it would happen again. That night, armed for battle, my friends and I headed for the woods once again. Much to my surprise, everything I left untouched. Nothing was out of the ordinary at all. No big fat footprints, no clumpy hair on tree branches, nothing. It was all still very dry from the summer. I've already begun to doubt my sanity. I am a skeptic, and generally believe nothing until I am presented with evidence. That is why we all elected to bring a tape recorder this time. We bought brand new batteries for this really cheap Radio Shack piece of junk recorder and set it up by our camp. Let me tell you a little bit about my friend Joe. Where I pack light, he is opposite. He was a Boy Scout (may have still been at the time, may still be now), and insisted on building his own personal living room right there in the woods. So where last night was blanket and machete, tonight was cot, tents, army gear, pellet guns, hot dogs and chips. Woohoo. Pete was very much like me. We were gung ho and liked testing ourselves with having less. It's not like one night is much of a survival test.  I only explain this to you to maybe get a grip on our personalities a little. So you see we were not Bigfoot enthusiasts on the hunt for the big score. We were casually camping out, as we had done many times before. In fact the previous night rarely entered my mind until God turned the lights out on us.  So here we are, looking straight up into the starry sky through the pines, with full bellies from complimentary snacks from Joe's workplace. Once again a very clear and starry night. Slowly we each dosed off, me being last as usual. I finally got comfortable with my surroundings. I convinced myself that the danger of last night, that still seemed all too familiar, was over. It is back to innocent camping. 3AM on the nose I awoke like clockwork. You ask, how could this be? I asked the same at that very moment, when I looked at my watch. How could this be? I woke once again at the same exact moment from the night before. With that dreaded feeling of unease...again. The fire seemed to be in the exact same condition, the coals slowly fading away. I was very cold again. The silence was unbearable. I looked over and seen Pete was awake too. His eyes the size of quarters. He had a strange look of fear on his blood drained face. I asked what was wrong. He just replied \"I don't know.\" It was a repeat of last night's show, which I did not want to sit through. I knew something had happened yet again, to startle us in this manner. I start blowing on the fire. The scream bursts out just like the night previous. Once again I am in a surreal situation. Over and over I ask myself, how can this be? The scream echoes our wilderness surroundings with great intensity right when I am blowing on the fire, at the exact same time as the night before. I'm sure Bigfoot doesn't have the same synchronized Swiss Army watch strapped to his or her own wrist. So I am not sure why this happened on the nose again. One point I would like to make, is on both nights, I was obviously rudely awaken by the scream, but couldn't remember it because I was coming out of sleep. That's the best I can conclude for waking up with that unease. Pete hits the recorder. We call for Joe. Nothing. We call once again. Finally Pete kicks his cot. Joe snaps angrily. \"I'm awake, I'm awake!\" We ask if he heard the shrill. He says he has been listening as well. Needless to say I felt more comfortable with the situation this time. I knew I had survived the first night and chances of survival again are probably good. I'm not going to BS you though, I was still terrified. Maybe not to the extent that Pete and Joe were. We knew we had to go. The shrills were more prominent. We urge Joe to get up but he replies in a cold dead fear \"I can't move.\" I had really never seen anyone so scared. He really just could not moved. He was paralyzed from fear (to this day he won't admit). We helped to motivate him. There was no sign of a large two legged mammal this time. None of us planned on sticking around to test that theory. Pete grabbed the recorder. Once Joe managed to secure his feet in his boots we started our long trek out of the woods. When we were about twenty feet away from the camp, the horrendous shrills stopped...again. The only thing I take from this was, they just didn't want us there, and once we were apparently leaving, they cut out the scare tactics. It worked. When we got to the trail, I wondered what would have happened had I looked behind us. What would I have seen on that trail if I would have simply turned my head back into that direction? Would I have seen that massive creature staring us down, that I had seen the night before? I have nightmares to this day about this question.  I wish I would have looked back at that time, because it obviously wouldn't have been as horrifying as the unknown. I thought the dreams would stop once I moved out of state, but I still have them. So now my friends believed me. It was a real rush because I really wasn't expecting it to happen twice in one life, much less two days. Pete and Joe both were walking very fast ahead of me and I tried to slow them down. I knew at this point the creatures was probably content with seeing us leave. Since we parked a car closer by this time, my exit was much quicker than the last night's. The next morning we awoke earlier that we should have. I think we maybe topped 2 hours sleep.  The fact is, we were eager to go see the site. Being late teens meant high expectations. The mission was, collect all the evidence we could find on site. Then turn in the cassette tape with our solid proof of Sasquatch calls and collect a million dollars from top paying anthropologists and newspapers all over the world. Of course this is ridiculous, but at that age, it seemed a possibility. In fact is seems people are quicker to believe in making money with get rich overnight schemes than the existence of bigfoot. We enter the woods treating it like a crime scene. The patch of pines looks just as we left it from a distance. No 3 inch deep massive foot prints, because the ground was incredibly dry. No patches of Yak type hair hanging from the trees. And no not even a huge nest where a tribe of Sasquatch decided to have a sleep over. As we got closer we did find some very interesting details. The cooler was hanging open. It had been rummaged through. The hot dogs were untouched (does that tell you anything)?, and the chips were scattered all over the ground. Not at all how we left it. Mind you there was no alcohol or drugs on our camp out, because none of us touched the stuff on excursions. We were too GI Joe for that. We were very conscience campers as far as neatness and tidiness goes. We ran a tight camp. A nifty little piece of evidence was the bread bag. We had two brand new bags  of bread and buns. None of us had any bread the night before. Neither of us had any bread with our dogs. The twisty tie still remained intact. There were no claw marks or reminisce of saliva. The bags had been simply pulled apart as if a human did it. Not a crumb left. We had plenty of footage to rummage through. But we knew it wouldn't be a good idea to play Sasquatch yells out in the middle of the woods, for fear we would call the tribe. Hey, we were nineteen and twenty years old! So when we got back we started the player. To our immediate disliking was our apparent lack of knowledge with audio expertise, the sound was very distorted. In attempt to capture every single noise we cranked the volume as high as it would go when recording. All this did was gather the sound of the motors of the machine running most of all. But there was sound! It was not a complete failure! Immediately the haunting shrills were apparent. I felt the hair raise on the back of my neck, reliving these moments in my mind. We heard ourselves leaving the campsite yapping like the scared kids we were. Our Sasquatch calls were captured. Now what to do? Another surprise hit us about two weeks later. With several attempts to go on another camping excursion, all failed. I am not sure if it's because we were all deep down still recuperating from our last Bigfoot adventure, or if we just were too laid back into our boring small town lives once again. My mom called me at work and mentioned about a Bigfoot researcher being in town and he was on the six o clock news. She taped it on our old clunker Beta machine and I watched it when I got home. Enter Robert Morgan, Anthropologist. Bigfoot hunter. It's just what we needed. I immediately called the news channel and requested Robert Morgan's phone number. Soon after I was in touch with Morgan. He asked if I meet him at his office in the city of Canton. Apparently, there had been many sightings of Sasquatch in this area at this very time which is why he was there. This amazed me, I had no idea. He pointed out to me that there were in fact lots of sightings here and in PA. From that point on I heard stories all over from that area and in Columbiana County. Morgan reviewed the tape & then had Pete and I fill out reports for him. Joe did not come. He was still pretty shaken up to even talk about it. In fact we have not discussed it until just recently. The next step was revisiting the site.  I had ultimately realized I had done all the right things to avoid a confrontation with a Yeti. He combed the site, and between that and our description of what happened,  speculated that we had been involved in a territorial dispute with two or more young males. Us being the dispute. Apparently they liked the pine needle bedding more than we did, and the local water hole. What he said made sense. Fourteen years later, the mystery is still there. What would have happened if I would have had the courage to stay? I don't know or will I ever. I would be joking myself if I thought these days I would have stayed longer. When I close my eyes and imagine that night 11 years ago, the hair still stands on my back. The fear of the unknown always gets the best of me. We had left Robert Morgan with our original sound recording. The next time I tried to call Morgan he had already left the state to do research elsewhere.  I know it wasn't the best recording, but it was our only evidence of this encounter, and clear enough to hear. I was so excited when I heard the Columbiana County recordings because the sounds were so like ours. I recently got back in contact with Robert, and it was nice to hear he did remember us and our recordings. Morgan was extraordinarily helpful then, and even more so now. That day was a special day for me. It showed me scientists aren't the big dogs they make themselves out to be. If there was no mystery in life then it would be too predictable for everybody. It was a day that took a large chunk out of my ordinary life and threw me right into my own X-FILE. It was scary, exciting, mysterious, thrilling and suspenseful all rolled up into one. The skeptic in me sometimes says, I just imagined all this. Like a mass hypnosis or something. It all seemed so real, but couldn't have been. The rational side of me butts in and says, this really happened, no matter how unbelievable the situation was, and my friends were there to witness it. It was amazing, and I would invite it to happen anytime of day or night again. I love the mystery of it, and that there are so many opinions out there, but I know the real truth. It's not a mystery to me at all anymore. Keeping themselves hidden so well that it lights a little flare of rich thought in all of us. These woods people have stayed hidden for as long as they need to be. They have to be really good at it to avoid all the people fighting to get footage with tripwire cameras and such. I walked into those woods as the king, and walked out a far less than that. All out there that have experienced this can relate to the amount of vulnerability associated with this. What I seen and heard was not a Harry And The Hendersons! I didn't get the chance to have smores with it. I'm not saying it was mean either, but damn persistent. No closing comments here. Just a great experience into the unknown, that I can call my own. That's enough for me.",
  "classification": "Class B",
  "county": "Stark",
  "state": "Ohio",
  "location": "-81.27147,40.75079",
  "location_details": ""
}