{
  "reportId": "49467",
  "title": "ATV rider has close encounter at night near Patronville (with an artist's sketch)",
  "date": "2008-09-20",
  "observed": "It's taken me a long time to share this story (about 7 years). My family, friends and I use to ride atv's very often, usually on the weekends. I had the biggest 4 wheeler so I usually stayed in the very back in case someone got into trouble or hung up, there was about 15 atv's. One night we were going through a classified forest called Kramers woods, which is an old growth forest with a tight winding trail and massive trees. As we went around a wet, muddy turn I seen the atv in front of mine, lights reflecting off the water hit something behind a tree that I was approaching. It looked hairy but I wasn't sure. Well, as I approached the tree while turning the atv left the thing (which was on my right) and I locked eyes. I'm 44 now so I would have been 37 at the time. I'm 6' tall 250lbs and rigid, I'm an old country boy and fear no man and could match or best most in strength, but this thing was no man, it was massive and was barely hiding behind this massive tree. It was tight against the tree with both hands flat on it and its chest tight against its hands. what happens next is very strange to me, but I know they are more than just an animal now, when he and I looked at each other we both knew he goofed and got caught in among that chain of atv's, I was instantly terrified but then instantly knew he was as scared as I was and wanted this situation to end. It was like we were in each others head and came to an agreement to just go on. My wife was riding with me so I never reacted because she would have screamed bloody murder if she would have seen it, it was 3 feet from us... I knew it was a male, just knew. He was at least 8 1/2' tall, I was the same height on my 4 wheeler as I was standing, and I looked way up at it. It's funny how small you feel, this thing could have easily have grabbed me, my wife or entire atv and threw us, that's how powerful it looked. I cant put to words how powerful it looked. I have gone online several times to try and see what i saw. Seen the white one on youtube but this one looked more human, people report red triangulated eyes, smelly & long matted coat, this one was none of that. Its coat was brownish orange with 2-3\" straight hair. I could see greyish skin and muscle mass. there is no body builder on the planet with the size muscle mass this thing had. Not much of a neck but its head was huge, its eyes were 2-3 times bigger, but just like ours with whites and pupil. The whites of his eyes I'll never forget because his eyes were what I was stuck on the most, the rest of him was at a glance.  His mouth was very wide (4-5\") with its lips pulled tight from fear (just like us). As I pulled away he took one step and vanished. I was amazed at how he was just gone, that quick.",
  "classification": "Class A",
  "county": "Spencer",
  "state": "Indiana",
  "location": "-87.13843,37.83837",
  "location_details": ""
}