{
  "reportId": "41676",
  "title": "",
  "date": "",
  "observed": "Around 3am I walked outside my parents' home with my Great Dane puppy and through the front gate to my car. As I was walking I heard the neighbors' two German Shepherds barking furiously at something in front of their home in New Lebanon. Their dogs bark at anyone walking by, but I could tell their barking was more serious sounding this time. I stared through the darkness and noticed a silhouette of something huge. My first thought was that maybe a loose horse? Then it came a little farther South on Clayton Rd. and I could clearly see a huge and thick human like shaped silhouette against the other lights from houses. I thought to myself \"Man that is a really big guy and he is running super fast!\" Then I started to think that a normal human man of that size could no way run that fast, then I thought well I've never seen a man that big! Just as my puppy spotted this creature still running South on S. Clayton Rd. about 15 feet from Mile Rd. he started to let out a bark. I stopped him as I was now in intense fear since I was beginning to realize I was standing alone out doors with a huge creature! We then ran back into my parents home and I locked the door behind me. My mother and father came out into their living area and asked me what was I doing and what was going on? I explained. This man like creature that I now refer to as a Bigfoot that from my short distance away to be about 7-8 foot tall and running full speed at about 35mph. My father quickly got his guns and went out into the front yard near my car. A few minutes later after I settled down I followed him. I showed him wear I spotted the Bigfoot and where it had came running from and where I had last seen it. Nearly 40 minutes later my father was still outside looking around and listening to the sounds. Right before I went to leave for the second time around 3:40am my father also claims to have seen a similar creature on two legs where I had last seen it before I came running into their home. He said it was just as I had described it, but it was walking very slowly. There are a lot of open fields and small creeks in our area. I'm not sure a Bigfoot really has the room it might need to survive out here, but I could be wrong. All I can say is that I know it was not a farm animal on the loose and it was too tall and thick to be a man. The head was very large along with its wide thick shoulders. The head and neck was like one thick part as it went down to the shoulders. As it was running I could see the shoulders moving with the upper body. It was like a giant 8 foot ape running down the road on two legs.",
  "classification": "Class B",
  "county": "Montgomery",
  "state": "Ohio",
  "location_details": "Just South of the New Lebanon city limits."
}