{
  "reportId": "6941",
  "title": "Man has encounter at close range for several minutes.",
  "date": "2003-10-21",
  "observed": "This incident occurred in Texas about one year ago.  I know Texans are known for telling tall tales but so help me this is true. While driving down a country road about three miles southeast of Bryson, Texas around 10AM on a bright clear day I noticed what I first thought was large person crossing the road in front of me. I was driving around 30mph. It was about 50 yards in front of my truck. I came to a stop where I thought it had crossed. It crossed from south to north. North was to the left of my truck. I looked to see if I could recognize the person who crossed the road. I grew up in that area and know most of the people who live there. Standing about 50 ft. from my truck was some sort of creature. It was standing and facing me. The creature was about seven to eight feet tall. It had redish brown hair all over its body. You could also see its skin because the hair was thin. Its skin was very pinkish like it was sun burnt. Its hands and feet looked human like but they were very large. Its nose was wide but flat. Its lips were very thin. We looked at each other for a good five min. I had a gun in my truck but never thought of shooting this thing because it looked so human but also ape like. It finally turned and walked into the woods. I sat in my truck shocked at what I had seen. After a little while I got out to see if I could see any foot prints. I did not find any. The ground was too hard to leave any. This creature had to weigh at least 400 lbs. I have never said anything to anyone about this creature before. I didnt want people to think I am crazy but I know what I saw. It was not any animal I have seen in a zoo or anywhere else. We do not have bears in this part of Texas or no apes that I know of.",
  "classification": "Class A",
  "county": "Jack",
  "state": "Texas",
  "location": "-98.35,33.13333",
  "location_details": "East of Bryson, Texas on a dirt road."
}