{
  "reportId": "12510",
  "title": "Vocalizations near Scenic interrupt a camper’s quiet evening",
  "date": "2005-09-12",
  "observed": "Observation: vocalizations. Hello, I am now 48, and my dad was a telegrapher during the 1960's at the former depot at Scenic.  I used to greatly enjoy spending a week at a time at Scenic with him while he was on duty, staying in his trailer near the depot, and it was a wonderful place for a young railroad enthusiast to grow up.  In later years I started an annual tradition of camping at Scenic and spending several days picking huckleberries on Tonga Ridge. On August 24, I had finished picking berries for the day and had returned to Scenic to a little, mostly forgotten camping spot just inside the edge of a dark old-growth forest.  The southern hillside becomes somewhat steep a short distance away.  It was dusk, I was setting up to cook some dinner, and had my Coleman light burning.  A few minutes before this, two or more men in two BNSF vehicles had parked next to the tracks waiting for an eastbound freight to arrive which was having engine trouble coming up the hill (knew this from my scanner).  I could hear them talking in their vehicles.  Suddenly, from what seemed to come from up above the hillside, there was a bizarre two-second-long very loud ascending-frequency swooping cry.  I have perfect pitch so I can tell you it started around 500 Hz and went up to about 800 Hz.  This was followed by  three or four bizarre shrieks of some sort, a little higher, which almost sounded like some kind of goofy laughter, but... I had not read anything seriously about Sasquatch for many years, and had not then ever heard a recording of one, so these sounds did not make any sense.  The only possibility, I thought, was that some practical joker was up there, had seen my camplight, and was trying to spook me.  But there were no other vehicles that I knew of, and there was no reason for anyone to BE up there on that hillside above a forgotten campground.  The intensity of the calls did not make sense, either.  I doubt if a human could have made a call that loud. I went about my business, but as I sat there eating dinner with the light burning I had this very odd feeling that something was watching me.  (I know how silly this all sounds.)  I slept in the car as planned (doors locked).  Next night, camped near the Cascade Tunnel west portal.  On the night of the 26th, camped at the first location again.  Heard nothing, but had that same creepy feeling that something up above was watching everything.  I thought about walking up that hillside to a familiar old waterfall on Surprise Creek, but something told me, \"Not this time.\" As a Christian, I do believe in angelic protection, but after reading dozens of encounter stories in the last couple days, and reading Judy Walter's story from 1970 just tonight, and hearing the audio clips, I don't feel at ease about camping there anymore, unless I do it at the other side of the tracks under the night lights! The difference between what I heard and most of the audio files I have heard: the latter have sounded mostly like ghastly shrieks out of some horror movie.  This was more of a pure tone at first, then the following sounds had other frequencies mixed in.  A very intense sound. I have a question about animal scat.  While picking berries on Tonga Ridge on the 27th, I walked about a thousand feet northwest of the road where people never go, through the trees and brush, looking for a better berry spot, and saw a pile of what I thought was bear scat in an open place.  Now I'm not so sure that's what it was.  It looked similar to human, but about two inches diameter; broken in many segments; well defined, as though not having a high moisture content when deposited, and was black & grey with much fiber content; probably several days old.  I note this because you have another story in this collection about someone seeing the creature on a Foss River forest road, which is the one I go up to get to Tonga Ridge, on F.S. 6830. I'm also wondering now if those skunky smells I encounter now and then while driving across the mountains late at night are always skunk.  ???",
  "classification": "Class B",
  "county": "King",
  "state": "Washington",
  "location": "-121.1544,47.71167",
  "location_details": "Forested campsite  Scenic, WA."
}