{
  "reportId": "12157",
  "title": "Motorist sees hairy biped crossing road by Cuyahoga Valley National Park",
  "date": "2005-07-12",
  "observed": "Well, this is kinda weird because I have been wanting to see a sasquatch for many years now and I believe I had a brief look at one about a week and a half ago. I was driving east on Sagamore Rd. in Sagamore hills Ohio at about 10:33 am to be exact. It was a very Hot muggy day with tempetures in the 90's. As I was driving east on this rd. their is a jogging trail that crosses the road and is actually part of the Cuyahoga Valley National Park system. The trail area was about 100 to 150 yds ahead of me when from the right side of the road I seen a dark figure come out onto the road with such speed that their was no way it could have stopped to look for cars before crossing, this thing was dark brown or black from head to toe. It crossed the road and the open area before the road when I first seen it in 3 strides and it was gone. This thing had the speed of an animal and it held its forearms up high kind of reminds me of the memorial day footage. I also seen a flash of silver or gray color by the forearm and head/face area like it looked my way in the last stride it took. When I first seen it I thought heck it had to be a jogger. The more and more I thought about it I felt that it couldnt have been a jogger for a few reasons, 1 it was 90F + and I couldnt imagine someone dreesed in such dark colors from head to toe, 2nd is the speed this thing had was not humanly possible, if I had blinked my eye I would have missed it, if I would have had a camera I would have missed it anyway because of the speed. 3rd is I am 5'10'' and it took me 5-6 strides just to cross the road in that area which does not include the area that is viewable to the right of the road where the creature first stepped out into.4th is since I have seen this I have driven that road many times to and from work, I have been at about the same distance in my van and have seen joggers cross the road and their arms look like toothpicks compared to what I had seen on that day, as far as guessing a height of the creature I would say it was well over 6ft. but cannot be any more sure than that because their is nothing their to have compared it to but it looked stocky for sure from that distance.",
  "classification": "Class B",
  "county": "Summit",
  "state": "Ohio",
  "location": "-81.57021,41.35208",
  "location_details": "This Rd. is off of St. Rt. 8 obtainable through Northfield Ohio"
}