{
  "reportId": "2820",
  "title": "",
  "date": "",
  "observed": "A creature was observed in dim light at a range of approximately 15 feet. The creature had an observable stature of at least 8 feet, but the head itself was never seen. The creature was illuminated by the peripheral glare of our Mazda Navajo's low beams as my wife was loading the car from the passenger side door. We have photographic evidence of the creature in the form of footprints found along the road side above the campsite which clearly show a difference between an uphill gate and a downhill gate. The creature seemed to walk down, then up a small distance, and then down to cross the road. It left a great variety (about 20 or so) of prints in different positions of locomotion over the terrain. We have photos of this trail as well as closeups of the clearer prints with a measurement reference next to them. The events where as follows: My wife and I were returning to our campsite from dinner at a restaurant in Lewiston at about 10:00 p.m.. As we entered the campground we noticed that our campsite was disturbed. For being a windless night, there was no reason our 8 man dome tent should have been on its side with the contents spilled out on the ground and under the tent itself. We are in the habit of keeping everything in either the car or tent when we leave so there was nothing else to mess up there. Another thing is that the tent was zipped up when we left and now was open. We parked and inspected the area around the sit to see if anything was missing. After everything was accounted for, we decied that it must have been restless teens from the area just having \"fun.\" At this point we decided to pack up and get a hotel room in town. Now this is important; my wife and I had been camping already for about three weeks as we were on a vacation. We had decided early on that if we saw or heard anything (like a bear, etc...) we would just say to the other calmly, \"as fast as you can, please go to the car.\" My wife and I uprighted the tent and she grabbed the pillows and took them to the car as i started to roll up our sleeping bags. After being gone for about a two minutes i heard her say \"Steven, as fast as you can, please just get to the car with the keys!\" She said it calmly but I instantly could tell there was something really wrong with her. I dropped everything and just went to the car, started it and we backed up and drove to the entrance of the campground.. Now this is what she saw. As she was putting the pillows in the backseat of our truck on the passenger side door (the camp was on the drivers side) she saw some movement off in her peripheral vision in the glow of the headlights about 15 feet from her. At first she thought it may have been a deer as we had seen several earlier that day in the area and so she calmly closed the door enough to shut of the interior light and looked at the area of the movement. The creature then appeared to stand up and started to walk away from her direction toward the rivers edge. She only saw it for about 2 secondes but saw a definate human like shape and (mostly its back and left shoulder) and the impression of brown coloring. We also both recall a strong odor in the area that we could smell at times but never paid any attention too. We discussed what happened (she was almost hysterical with fear) and I turned the car around and drove back and around the site with my highbeams on. One feels a slight bit invincible in a big vehicle, even from big animals. We saw nothing, but nevertheless we put everything in the car without even packing it and left. That night we ended up driving to, I believe, Redding which is 30 miles or so away and staying there in a hotel. The next day, we returned with a camera (a Kodak disposable 35mm.) to the site and explored. We have shots of myself standing where it stood with my hand held up at the level she saw its shoulders and lucky enough it was under a major branch of a tree. The propotions of this thing really amazed us when we realized its size next to the tree. It apperantly had approached and squatted at the base of this tree and watched us, and we are sure that it was what had gone through our tent and that we probably had startled it by retuning when we did. After those photos were taken and a search for footprints was given a go ( the earth there was very, very hard and gravelly) we decided to look up by the road as there was a good enbankment running along its length that the thing had to have crossed to get to our site. About a quarter mile up the road toward the damn from our campsite was a trail as plain as day on the hill side. We got complete photos of the trail and several shots of a very clear print near the asphalt itself on level land. it is about 1 inch deep there where i (at 150lbs) did not leave a trace of one myself. Again, we got several photos of this.",
  "classification": "Class A",
  "county": "Trinity",
  "state": "California",
  "location_details": "This incident occurred about 1 mile below the Lewiston river damn in a park service campground that was still closed for the season at the time. This gis about 5 miles up the road from the town of Lewiston, California I remember specifically that there is a fire base camp on the hill above the campsite. I do not remeber the county name, but I can get it for you if you cannot locate it yourself."
}