{
  "reportId": "44166",
  "title": "",
  "date": "",
  "observed": "Our encounter was May 4th 2012 in the Indiana state forestry.  My wife and I were camped out in a campground with the area to ourselves.  All night while cooking and eating and sitting by the fire we kept hearing something large moving behind our camp, but out of sight for the fire.  After bedding down I came out at 2AM to relieve myself.  Standing there I looked over to our SUV and saw something standing on the other side of it.  At first I thought is was a tree until it moved away from the tree and closer to the car and was just standing there swaying back and forth.  Its waist came up to the roof of the car where my shoulders hit and I’m 6 foot.  This put this thing's height at 8-9 feet tall.  I ran and grabbed my LED super bright flash light and shined it right on a large hair covered creature.  It immediately ran by me stepping over the 3.5 foot high road gate like it wasn’t even there and ran behind our tent into the woods.  The creature/being ran so fast I couldn’t keep track on it with my light.  About 30mins to an hour later we heard two loud knocks and several small rocks began hitting out tent.  This went on for about an hour as we set on our cots looking out.  Then one big rock hit with such force that it ripped our tent roof open through the rain fly and this was a brand new Coleman tent used for the first time... and it was a 200 dollar tent! The next morning I found the trail and partial prints of something about 30 feet behind our tent, and the bark on the root of the tree where I thought I saw that figure had been torn off where something stepped on it!  It was a fresh tear as it was still oozing sap that next morning.  So after all that we packed up and came home, wife and I scared to stay another night.  I know that was a squatch in the woods that night... he owes me a tent... and new underwear for us both!",
  "classification": "Class B",
  "county": "Morgan",
  "state": "Indiana",
  "location_details": "Omitted per the witness' request"
}