{
  "reportId": "37553",
  "title": "Multiple childhood interactions recalled by a woman who grew up near Kalamazoo",
  "date": "1974-03-15",
  "observed": "I have several encounters with Sasquatch. I also believe it was the same one both times although the encounters were 10 years apart. The first encounter was when I was in 2nd grade. I was born in 1963 so this was quite a few years ago. I was playing at a school playground in Kalamazoo Michigan. My mother, teachers and other students were also at the playground. The adults were setting up a picnic for the students. It was close to school ending for summer holiday. I wandered off in to a wooded area near the playground. It was a very peaceful and sunny day. I was picking up pine cones, etc. while moving through the woods. I was not paying attention to my surroundings and was looking down at the ground. I was stopped very abruptly when I physically ran into a Sasquatch. It was huge and towered over me holding a large limb from a pine tree open. He was using his right arm to hold the tree branch. I was not afraid because I did not know as a child that this was an unusual thing. I just thought it was natural to see such a thing in the woods. He stood on two legs. His face had expression. First expression was surprise/anger. His face calmed quickly to a gentle, almost observant glance. To see his face I had to turn my head straight up as if looking at the sky. His skin had a tawny reddish hue and his body and face/head was covered in a deep chocolate hair/fur. He stood looking at me for a long time. I did not move. I did not notice any odd odor. He was very quiet and his eyes were very gentle. I sensed he understood I was a child. He turned to his left, releasing the branch of the tree he was holding with his right hand. He walked away from me in long, strong strides. The branch he was holding swung loudly over head. It was a very tall tree and the lowest branch was several feet over my head. My second encounter happened when I was 16 years old (1979?). I was at my family home sitting on the front porch waiting for a friend to pick me up to go out for the evening. It was winter time. There was snow on the ground. This encounter also took place in Kalamazoo, Michigan. I heard a low gutteral growl coming from the side of the house. My parents were not home and it was dark outside. Our house is completely surrounded by woods. I heard large heavy stepping, something with great weight was moving slowly along the house to where I was sitting. I sensed it was a large animal. I stood up and walked off the porch and headed down the driveway towards the neighbor's home. I remember I started to sing softly to myself. The growling/knocking/walking noises stopped. Once I had made it down the driveway my friend pulled up in her car. I could see her looking at something on the side of our house. When I opened the car door I looked back at the house and saw a large figure peeking around the corner of the house. I recognized him as the same creature I had seen when I was a child. With that recognition I did not feel afraid. I felt almost relieved. The next day there were large footprints in the snow coming out of the woods along side my family's house. The footprints traveled to the front of the house, around a dogwood tree and down the front yard. My parents had someone come in to analyze the prints. They were told the prints were not a hoax but made by something/someone very large with much weight. It was winter time and there was deep snow on the ground. The prints were very clear and the snow beneath the print was particularly icy as if heat from the foot itself had melted the snow. I never told my parents about these encounters until a couple of years ago when they finally informed me that they had seen the footprints in the snow back in 79' and called someone to look at them. I am a dancer and choreographer. I grew up not only dancing at the studio but also dancing in my parent's living room that has large windows that look out to the woods in back of the house. I have often felt something was watching me from the woods. I never felt frightened of it though. Maybe because I believe humans are far more frightening that Sasquatch. I am sure I have experienced visits from the same Sasquatch. In a way I feel rather protective of the whole species because I believe he was protective of me growing up.",
  "classification": "Class A",
  "county": "Kalamazoo",
  "state": "Michigan",
  "location": "-85.6885,42.225",
  "location_details": "I would be happy to share location but only if contacted by phone."
}