{
  "reportId": "38765",
  "title": "Recollection of possible encounters at a cemetery in the village of Cuba",
  "date": "1999-07-03",
  "observed": "Some friends and I used to like to scare ourselves silly so we used to walk out past the graveyard in town late at night sometimes.  We had a couple strange experiences in a short period of time.  The first time, there were four of us.  We were out very late, close to 3 AM.  We were telling stories and trying to scare each other as we walked past the graveyard.  At one point we stopped and were standing around talking when one of us noticed a very large object in one of the trees.  After sitting and looking for a couple minutes we pointed a flashlight at the thing.  We didn't see anything clearly, but we didn't have much time.  It dropped out of the tree, maybe 20' or more.  It had been resting on a particularly large branch up in a very large tree.  It was gone so fast it didn't seem possible.  It took off straight to the patch of woods behind the graveyard.  A few hours later, when the sun came up, we went back to the scene.  I have been a hunter and in and out of the woods my whole life and know a thing or two about tracking.  I found impressions in the grass, very large ones.  I tried to match the stride and wasn't able to come close, neither was my friend who is over 6' tall.   Later one friend helped me measure my stride at a dead run and my height and I was able to use algebra to determine that the creature must have been between 7-9' tall. A second night during the same period one friend and I went to go see if we could see it again but we were stopped by a large Rottweiler that was running loose a couple blocks from the graveyard.  It kept corralling us to the center of the street under the light then turning and barking and growling viciously towards the graveyard.  It would not let us go.  It was quite frightening.  I knew the dog and was disturbed by its actions.  It had never acted that way before.  We were unable to go to the graveyard that night to see anything, though we heard some strange noises that night.",
  "classification": "Class B",
  "county": "Fulton",
  "state": "Illinois",
  "location": "-90.19624,40.48724",
  "location_details": "Cuba, IL  cemetery, at and near the edge of town"
}