{
  "reportId": "44437",
  "title": "Possible daytime road crossing within the Sylvania Wilderness Area",
  "date": "2012-07-15",
  "observed": "I was camping at the Clark Lake campground in Sylvania Wilderness and went exploring the backroads of the Ottawa Natl Forest on a Saturday morning.  I thought I'd go explore Langford Lake, Pomeroy Lake, and Moosehead Lake. I was driving toward Langford Lake campground, and I took US-2 from Watersmeet and made a left onto CR 527.  About 1/2 way before I got to Langford Lake Rd., I was shocked to see what looked to be \"a monkey with a bear's body\" right in front of the car.  This \"being\" crossed the road right in front of the car.  If I hadn't have slammed on the brakes, I would have hit it!  It was NOT a bear.  I have seen tens of bears in both rural Michigan and rural Virginia over the past 30 years, some while driving and some while hiking, some even face-to-face.  This was not a bear.  All I kept thinking to myself was \"why is there a monkey in the woods? why is there a monkey in the woods?\".  I was stunned and baffled and my mind just couldn't \"figure it out\".  It was like the very first time (while in rural Virginia) I saw a cougar (up close and personal in our yard).  My mind just couldn't comprehend.  After the being crossed the road, I stopped the car and tried to look for it.  There was a small gully on the left that it must have gone down into; but I couldn't see it.  The brush was thick.  I was stunned.  My mind couldn't make sense of it all.  Here was this being, maybe 5 feet in length, dark black-brown, four-footed, running on all fours (not running like a bear runs, I've seen that too), with its underbelly about 2 feet off the ground.  Long and lean, it seemed to me.  Not running very fast, but brisk.  Of all the funny things in the world, it \"seemed\" to be \"smiling\".  It was not threatening at all.  It seemed very innocent.  No pointed head, eyes brown, not a snout.  Not a furry face.  Looked like a monkey's face.  No tail.  It all happened so fast and I wish I had been able to follow it, once it crossed the road.  This was not a bear cub - I have seen at least a half a dozen of them in my life too - climbing trees in the Adirondacks, crossing roads in central VA.  I am still baffled to this day as to what this being was; although something in my gut tells me that I saw a \"baby bigfoot\".",
  "classification": "Class B",
  "county": "Gogebic",
  "state": "Michigan",
  "location": "-89.5,46.25",
  "location_details": "along CR 527, enroute to Langford Lake campground area"
}