{
  "reportId": "49148",
  "title": "Appalachian Trail Hikers find possible tracks and hear a late night howl near Franklin",
  "date": "2015-06-29",
  "observed": "Shortly after laying down for the night during a backpacking trip in the Nantahala Wilderness, we heard a howl that lasted 10-15 seconds, with a change of tone for the last few seconds. This howl could not have been mistaken for any other animal and sounded very similar to recordings of other howls. In the next 2 hours we both heard random whoops also.  The next day while hiking we came across several very interesting signs along the trail. The first was spotting what looked like a game trail that crossed the hiking trail. Upon closer inspection, the tracks in the well traveled trail clearly were not made by bear or any other four legged animal.  The footprints on the trail had left deep impressions where the heel contacted the ground and footprints much larger than my foot were also seen.  The distance between the tracks was approximately 5 feet on average and the depth of the tracks where the heel had sunk down was 3 plus inches.   The ferns and weeds in the trail that had been pressed down were still green and flat which made me think the tracks had been made within the past couple of days. I followed the trail in both directions for approximately 150 yards and the footprints remained consistent in both directions.  After traveling the hiking trail further down the ridgeline for close to mile I spotted another trail that crossed the hiking trail. The footprints here were identical to what we saw at the first trail. I took pictures to gauge the depth and length of the prints.  I found a stick on this trail that had blood on it.  I regret not keeping it for evidence to see what type of blood it was.  The location of both trails had some similarities: both were located in gaps along the ridgeline and there was an unusually high amount of limbs and trees wedged in tree forks at both sites.  One other strange observation made along the trail was finding 3 large white mushrooms placed upside down near the trails. One of these was on a rock and another was found on the trail while following the footprints.  The area where we found these signs was the direction where we had heard the howl the night before.",
  "classification": "Class B",
  "county": "Macon",
  "state": "North Carolina",
  "location": "-83.52959,30.0326",
  "location_details": "The tracks and trails were on the lower ridge trail 2-3 miles from Standing Indian campground."
}