{
  "reportId": "43952",
  "title": "Fisherman hears possible howl, knocks and has object thrown near him in the Medina River Natural Area",
  "date": "2014-01-22",
  "observed": "This occurred after work. I stopped by the park on my way home to try out some new camping equipment.  There are two entrances to the park; the main entrance off of Hwy 16 and the one I like because it's more wooded off of Applewhite Rd. Some new trails are being made because of some flooding that occurred in the area last year so there are some trees that have been cut down. One of these trails has a wooden fence with a \"No Trespassing\" sign on it. I ignored the sign and made my way to the river. I made a small fire and began fishing. While I was fishing I started to hear loud banging. I turned around to see if i could see what was making the noise but saw no one. We do have Woodpeckers but this was no woodpecker. I thought nothing of it and continued fishing. A few minutes went by and I heard a loud moan. Like a wail. Again, I turned to look around and saw no one. I started thinking, \"Okay, someone has got to be messing with me.\" I kept on fishing when out of the corner of my eye something moved and I heard a very loud splash. I did not see what was thrown into the water near me but it was big. A big rock or log is my guess. It made a giant \"SPLOOSH\". Something threw a BIG something in the water. After that I packed up and made my way back up to the trail. On my way back I heard the wood knocking again and I attempted to reply. I followed the three knocks I heard with three of my own. No reply. The whole time I walked back to my truck I had the feeling I was being watched. I stopped and looked around but saw no one. If someone was there they were well hidden and light on their feet because I didn't even hear footsteps. The area is wooded and there are leaves and branches everywhere so I'm sure I would have heard twigs snapping or leaves rustling if someone was there. When I got back to my truck I saw a jogger and his Lab going for a drink from the broken water fountain. I offered the man some bottled water for him and his dog. He thanked me and I took the opportunity to ask him if he had heard the same knocking or banging I had. He had. He said he and his dog stopped to listen but couldn't figure out where it was coming from. The road/highway divides the park. This man was on one side and I was on the other. This part of the highway doesn't get a lot of traffic so it wasn't traffic I heard. One more thing I think you should know is that this area has a legend called The Donkey Lady. All teenagers in San Antonio know of this legend. It is said if you cross her bridge you will hear her \"hooves\" pounding the road and things will be thrown at you. This legend has been around for many many years. After what happened yesterday,  I'm starting to think Donkey Lady Bridge isn't haunted by a ghost but occupied by something real. I'm not convinced Bigfoot exists because I need to see it but my wife believes and she suggested I report it to you guys. We often go hiking on these trails with our children and she likes to point out, facetiously, Bigfoot nests and food sources. We are an outdoorsy family and we live in the country where at night we hear owls and coyotes and know what predators and their prey live in our area and what noises they make. This was none of those animals.",
  "classification": "Class B",
  "county": "Bexar",
  "state": "Texas",
  "location": "-98.56143,29.26258",
  "location_details": "Incident occurred in the Medina River Natural Area off of Hwy 16."
}