{
  "reportId": "1058",
  "title": "",
  "date": "",
  "observed": "Dear BFRO, I had an interesting and very frightening experience back in 1984. I was backpacking with two friends in the Marble Mountains Wilderness in Siskyou County, Northern California. We were camped by a lake in the southern portion of the wilderness about 20 miles from the Klamath River east of Somes Bar and north of Fork of Salmon. It was just after dusk and we were settling down for the evening, having spent the day hiking and fishing. We heard the sound of a tree limb break about 50 yards from camp. At first we thought we heard a black bear attempting to steal our food, which was in a nearby tree hanging in a bear bag. When we approached the tree, a friend noticed two amber-colored eyes staring at us from the woods up the hill. The eyes were reflecting the light of his flashlight. We watched it and it watched us for about a minute. Assuming it was a bear or deer, I tossed a rock in its direction, hoping to scare it away. The eyes then rose vertically several feet, as if the animal stood up from a crouched position or reared up on its hind legs. Realizing this was a large animal, presumably a bear, we paused a moment and then I threw another rock at it. This time the creature began walking down the hill toward us on its hind legs, taking alarmingly large strides. I am an environmental engineer with a pretty good background in wildlife biology and had encountered bears many times in the past. I had never seen a bear walk on its hind legs like that - down a hill strewn with fallen trees and large rocks. This thing was very agile and moved quickly toward us. Alarmed, we ran back to our campfire to alert another friend. After a minute or two, my buddy again caught the eyes in his flashlight just outside our camp about 30 feet away - just outside the area illuminated by our campfire. The animal then proceeded to observe us for about 3 hours, circling our camp, but always remaining far enough away from the fire that we couldn't clearly see it or photograph it. It took large strides on its hind legs and stood approximately 7 to 8 feet tall, judging by its height relative to trees it stood by. The thing kept circling around watching our every move and would not leave, despite our shouting and noise making. It was extremely unnerving because we were about 12 miles from our car in the middle of a very remote wilderness, in the pitch black darkness of night, with no weapons to defend ourselves. Had this thing attacked, we were more or less defenseless with no help for miles around. Interestingly, it kept its distance and was not really threatening us. It seemed more curious than anything else. I felt more or less like an animal being observed in a zoo exhibit. Usually, a bear will enter your camp and sniff out your food/kitchen. This creature kept its distance and remained walking on its hind legs the whole time, which bears do not do. The animal's demeanor seemed more curious than menacing. The thing never made a sound, which would have helped us identify it or confirm our fears that it was not a bear and was indeed a bigfoot. In desperation, I threw some camping fuel on our fire, which released a huge ball of flame and a blinding flash of light. This must have scared the thing away, because when the fire subsided, it was gone. The next morning we checked for footprints, droppings, and any other sign that could indicate what it was. I suppose the hard, dry ground wasn't suitable because we didn't find any discernable tracks, which was really dissapointing. Thus, I can't prove with photographs or casts of footprints that we really saw a bigfoot, but, aside from a large and very agile bear, I can't explain what it was. This was a really intense experience and is the honest truth! My buddies and I have vowed to return to that lake with battery powered spotlights and better camera equipment again sometime and see if we enconter this creature again. Hopefully, if we are lucky enough to see it (or its offspring) again, we will get photos to prove it. I would very much like to see the scientific community officially identify and recognize this animal as a true North American species. I am no longer a skeptic. I would be happy to answer any further questions, see contact info below.",
  "classification": "Class B",
  "county": "Siskiyou",
  "state": "California",
  "location_details": ""
}