{
  "reportId": "24265",
  "title": "BFRO Investigator obtains first thermal footage (very brief) outside Phillips",
  "date": "2008-07-12",
  "observed": "[From Don Young, a BFRO Investigator in Price County, Wisconsin.] I did a 5 day 4 night camping trip by myself at [a location in Price County]. It was slow at first. I was not picking up anything with the thermal [imager], not even rodents or other animals, as if the woods around me were devoid of life. The 3rd night I had a feeling of being watched so I stayed close to the truck and set up the thermal to watch the tent. Nothing came around the tent. On the 4th night things started to happen. A thrown rock or piece of wood came very close to my tent and hit a tree with a very loud thud-pop. I got out of the tent and panned around with the thermal, which was running already outside the tent. It was on a tripod aimed down a trail off the [dirt road]. It looked like nothing was out there. After about an hour of panning around with the thermal I stood back up and stretched. I aimed the thermal to watch the walking trail, and then I started to go back into the tent when I heard the sounds of brush cracking on both sides of me. This was so close to me that it made the hair on my neck bristle instantly. I started to pan with the thermal again from one side to the other. After what seemed like about a half hour into it, a bright warm blip in the appeared in the background. It was some kind of animal along down the walking trail. It seemed to be on the edge of the trail and low to the ground. After I watched it for a while with the thermal I got the sense that it was watching me, and it was peeking over a clump of brush on the edge of the trail. I watched it for a while, until I accidentally kicked into my bag of cans and garbage.  I also bumped into the tripod when this happened, which jerked the thermal to the right a bit. Then the blip stood up and ran off on two legs, hunched over. I could hear it as it ran away from me to the north. I could hear the brush and its footsteps fading into the distance. As the sound trailed off, all around me the brush started to thrash and snap.  I continued to pan around me but saw nothing. The edge growth was so thick on the sides of this overgrown road that the imager could only see in 10-15 feet or so. Something was back in that brush, on both sides of me. There was two of them, and they both got noisy at the same time as, if trying to get my attention. It seemed like they wanted to get my attention so that I would not follow the one that was walking away. I couldn't see the ones to the side through the thick brush.  I looked for a while, but then gave up trying to see them that way. The other way was to aim the thermal imager at the tent, and set it up to record all night, then go sleep. I went to sleep with the thermal aimed at the tent. I could hear things to the sides of the road for a while. I could only hope they would come closer to the tent. Didn't happen though, so I drove home in the morning to review the footage that I was sure I got. I watched it on the computer when I got home. It looked like a sasquatch to me. It was peeking over brush for a while, and moving strangely, and then running away hunched over, like it was dodging a sniper. It was no bear, or other four-legged animal. It was bipedal and it was agile. When I shot this footage it was almost pitch black outside. There was no moon. So this thing has the ability to run through the dense brush in total darkness, and watch me in total darkness. I got the impression from the video that it had long arms and big hands and very muscular legs. It doesn't look very large. It could be a juvenile. It seems to have that spirit to its movements. The other ones that made the noise around me may have been young ones also. The other cameras (trailcams) I had set up around my camp area picked up nothing. I did not have a light on or any lantern. It was a cold camp. There was no camp fire for the entire stay. The squatches arrived at 1:00 AM on the fourth night or 5th morning, and seemed to be all gone at around 2:30 to 3:00 AM. It was total darkness out there. The trees had a thick canopy over the road. It blocked out any night sky. Without the thermal I could only see darkness.",
  "classification": "Class A",
  "county": "Price",
  "state": "Wisconsin",
  "location": "-90.42001,45.73271",
  "location_details": "[The location is outside Phillips, Wisconsin, not far from the target area of the 2006 expedition.]"
}