{
  "reportId": "21354",
  "title": "Multi-witness road-crossing sighting on Hwy 96 outside Happy Camp",
  "date": "2007-09-11",
  "observed": "I was traveling from San Francisco to visit my daughter, and since the coast was so foggy along highway 1, I went east from Eureka, Ca. to Willow Creek, Ca.  Since I did not want to travel south again to Redding we decided on highway 96 to Yreka, and I-5 as a shortcut. My youngest daughter was with me, and we had driven a long ways and so we gassed up in Willow Creek and decided to continue to drive. It was late and it was a boring uneventful dark drive up this \"Bigfoot Highway 96”, but finally we crossed a bridge on the Klamath River and got to a campground where we finally saw trailers and trucks and people type stuff. The road then goes up a switchback to a ridge for a mile or so, and I slowed my speed down to 25 mph. So, as I got to the ridge, maybe a couple miles from the bridge, I came around this last switchback, and to the right my headlights swept the left embankment and I thought there was a bear coming down the embankment towards the highway. I slowly crept ahead and began to stop as this bear was shuffling down this embankment on two feet, but it was not a bear. I stopped completely and not over one hundred feet in front of me was this thing intent on getting across the road the road in front of me. If I didn't see it on the bank I probably would've hit it, because it was that close. It got to the center line in three long steps and looked at me and then jumped off the road.  I mean from the centerline on its right leg it jumped clear off the pavement and over a two foot embankment and was out of sight. It was not overly tall probably just six feet or a little taller, but extremely was thick maybe in the 300 pound range this thing was built. It was hair not fur and matted and dark brown but with a rusty auburn tint to it. I was extremely close with high beams on, and stopped in the road. It had long arms like a gorilla or something, and it sort of lumbered forward like a gorilla only fast with definite long strides; it had something it was aiming for and when it looked at me it turned its head back straight and this thing jumped off the road like an elk on one leg. It had extremely thick legs and shoulders, and no man could make a jump like that. If I had a video camera in the dash of my car you would have seen the video of your life. I couldn't make out any genitalia it was so hairy I would estimate its body hair like six inches long and matted and dangly, but not so much on its butt or the back of its legs. I could make out the thighs and they were some guns. I was too scared to get out of my car to look over the embankment, that and my daughter was freaked out. Get the heck out of here. I took a picture of the hillside he came down. I can find the exact spot and in fact am on vacation this next week and I got an infrared camera and a motor drive dslr this time, and oh, I ain't getting out of my car without my gun. Don't get me wrong I ain’t a gun freak but I could have rammed this thing with my car the first time. I don't want to hurt anything, but I don't want to get my head ripped off by something just on the other side of the dark roadside either.  This sighting was at 12:55 am and I was wide awake. I checked my odometer from where I saw him it was forty two miles to the next bridge on the river at a small town before I got to the freeway on 96. I am a recreational hunter in my younger years but this isn't something you hunt; this is something you gawk at. Oh and as close as I was the eyes didn't glow. I must have counted 60 deer along that road and I saw eyeballs everywhere in the road along side the road from that ridge to Yreka. This thing didn't have glowing eyes, and I had the high beams on and watched it cross the road and look at me. It didn't have animal eyes that glowed. It struck me that it was going to cross the road and go down to the river and was aware of its purpose like an intelligent being.",
  "classification": "Class A",
  "county": "Siskiyou",
  "state": "California",
  "location": "-123.1668,41.8333",
  "location_details": "The Seiad Valley area of Highway 96!"
}