{
  "reportId": "8696",
  "title": "Nighttime sighting of gray upright animal near Kewanee",
  "date": "1999-09-15",
  "observed": "I was hesitant to even tell my wife about this, when it happened and it has taken me a few years, now, before I felt I could say anything. I didn't want anyone to think I was crazy or seeing things. I spent some time since, reading up on a certain subject. I still don't feel comfortable even putting a title on it. This ocurred in September of 1999, as I was going home after work. My wife and I were buying a home in the country just five miles, north, outside of town. I worked, second shift, at a factory in town. I had been on the second shift position for six years at that time and we got out of there at two in the morning. I made that drive home from work, a lot of times. One has to be careful on those country roads because of deer moving around, and the occasional loose cow. I had encountered lots of different animals on those roads. And, I do know the difference in the many species of animal life in this area. I grew up here and have always spent time in the woods, fishing, and just tracking. I taught my son a little on how to read different animal tracks, such as what the animal is and which direction it's headed, how many were there and possibly how big. Some people don't know that a deer will stand up on its hind legs so that it can see over corn in the fields. However, this special night, I saw something completely out of place. At least for me. I was on the side road that led over Mud Creek and to my house. There are two bends in the road just before you go over the bridge and I am always careful there as that's where deer like to walk through. I've hit a deer before and it's not fun.  I came around the first curve and then there is around two hundred feet of straight road before the curve to the right. My headlights lit up the curve and the fence and corn field. The dead tree trunk had been burned down so at first I wasn't sure what I was looking at on the other side of the fence. I'll do my best to describe (It), because I saw (It) for about five or six seconds as I drove closer to it. I was almost pointed straight at it because of the road. (It) was standing on two legs, leaning on the fence with both upper arms bent. I am six foot two and I put (It) at around seven and a half feet tall. Possibly just a little more than that. Weight may have been 325 to 350 Hard to tell because of hair. The body was very hairy and was greyish. The front looked a little bare in the chest and I couldn't see below it's upper torso because of the fence. There were some vines growing on it. It's just a wire fence that had been there for years. There were some darker areas but the most of it was a grey color. It's head was large and from what I could see of the face it reminded me of how a bulldog looks. The sides of the cheeks hung a bit and the face was not as hairy as the rest of the head. The hair on the body was around four inches long. I got the distinct feeling that I was looking at something that had some age to it. I was almost to the curve when it turned and ran, on two legs, into the cornfield, to the west, which leads to some woods. Up to then it hadn't moved. There was perhaps another 300 feet to the bridge from that curve and by the time I reached it I had goosebumps the size of eggs and my hair, what's left of it, was trying to stand up. And I'm still not going to say what it was. I know what I saw and I know that it still gives me the chills when I remember it. I thought this stuff was supposed to happen to people in the northwest where the forests are. Not here! So, there you are. You can take it for what it's worth. I don't know of anyone else that has seen anything out that way. They may just not want to say anything either.",
  "classification": "Class A",
  "county": "Henry",
  "state": "Illinois",
  "location": "-89.9595,41.30412",
  "location_details": "North of town on Rt. 78 one mile and turn on to Salebarn Rd. west. About three and three quarter miles around curve to 2450 St. North. Road is short and curves and leads over Mud Creek. There it branches."
}