{
  "reportId": "20594",
  "title": "Campers hear possible whoop-howls near Yosemite (Sawmill campground)",
  "date": "2007-07-27",
  "observed": "I used to live in Bishop, CA on the eastern side of the Sierra Nevada mountains.  I have spent lots of time camping, hiking, fishing, and skiing in the Sierra backcountry.  I am familiar with many kinds of animal sounds and signs in the mountains. Last weekend, we were camping at the Sawmill Walk-in Campground on the east side of Yosemite National Park.  After sunset as dusk was deepening, we were sitting around our camp table talking.  From the direction of the forests that line the canyon floor towards Mt. Conness in the west, a series of whoop-howls rang out from the distance and rolled down the canyon.  My sister was talking and immediately stopped, turned around, and said, \"What is that?!\"  The calls continued for a few moments and then ceased.  They sounded most similar to the Snohomish and Puyallup calls on the BFRO website.  When the calls started, all other normal background wildlife noise stopped and didn't resume until several seconds after the calls ceased.  There were no answers to the original call, nor did it repeat. That area of Yosemite is relatively deserted, and the Sawmill Walk-in Campground only has a few sites that are scattered widely.  The trail that runs through the campground eventually leads to the top of Mt. Conness and branches into the back country.  I have never had an experience like this before, but hope I one day have the opportunity to have a visual encounter with one of these animals.",
  "classification": "Class B",
  "county": "Mono",
  "state": "California",
  "location": "-119.2481,37.90613",
  "location_details": "Driving from east to west, one gets on CA Hwy 120 off of I-395 just south of Lee Vining and the road rises steeply towards Yosemite National Park.  After passing lake Ellery on the left, one comes to a right turn at the Saddlebag Lake road.  Following this dirt road for 1.5 miles, one comes to the Sawmill walk-in campground.  We were in site #5."
}