{
  "reportId": "15050",
  "title": "County parks employee's early morning sighting near Rib River",
  "date": "2006-06-25",
  "observed": "I worked for the marathon county parks department as a seasonal summer employee. My job was to go to all the county parks by myself most of the time and do routine park maintenance. I had to do everything from mow grass, to build shelters, and pick up garbage. Parks included were; eau pleine, mission lake, eau claire dells, amco park, cherokee park, big rapids, and man made lake. One early morning around 6am, I left to go to Amco park to clean it up in time for the weekend. Nobody else was with me, or at the park. I arrived around 6:20am. It was warm and pretty foggy at the time. The park was pretty clean so it didn't take long, only about 5-10 minutes to clean and take care of. As I was pulling out of the only road that leads to the road, to my left I saw something standing on the right side of the road up ahead. I stopped the truck, and sat there for about 10 seconds. Whatever this was looked my direction and took off across the road, towards the river, which was only hundred yards away. I sat there for a couple minutes wondering what it was that I think I had just seen. I hunt so I am for damn sure it was not a deer or bear. It was way too big to be a dog, coyote, fox, wolf, etc. It also moved very fast. This thing was big, hairy, and tall, your typical stereotypical sightings. I was at the time too freaked out to take time and check it out where it went. All I know is that it took off my direction behind me, towards the river. Everybody just laughed at me when I told them what I had seen, but the next time I went to that park a week later, no noises, no foot prints, nothing. I should have checked right away, but I was too scared, plus who knows what it was, and if it would come back? Supposedly, people living in that area, have seen something for awhile now, but are weary of saying anything, because you know how people are. They don't want to get teased, or laughed at.",
  "classification": "Class A",
  "county": "Marathon",
  "state": "Wisconsin",
  "location": "-89.9905,45.0902",
  "location_details": "this happened about 100 yards away from Amco park, along the road that passes it. there is a river along the park, and a bridge, which this happened. Amco Park is located on the Rib River in Marathon County."
}