{
  "reportId": "7495",
  "title": "Night time road crossing near Strawberry, Arizona",
  "date": "1983-12-30",
  "observed": "It was between Christmas and New Year's Day 1983 at about 8:00 P.M.  I went to pick up a friend at her parents home for an evening out, about one half miles south of Strawbery, Arizona off of Highway 87. There is a dirt lane that leads between a quarter to a half mile from the highway to their home.  This lane cuts through a ponderosa pine forest. It was on this lane on our way back to the highway that we saw the sasquatch. He entered from out of the woods on our left, crossed the dirt lane in front of us and entered into the woods on our right. Although it was after dark, we were able to see him quite clearly in our headlights. We were moving slowly. I would estimate him to have been about 7 feet tall and to have weighted about 400 pounds.  He was covered in a light colored hair, similar to that of a camel in color. He walked upright on two legs and had the gait of a human, as his arms swung in time with his steps. He never looked directly at us, but continued to look stright ahead and to maintain his stride across the lane.  He did not seem to appear scared or startled by the presence of our car or it's headlights. It was as if he knew that he had time to cross the lane in front of us. His body shape was not like that of a bear. It was proportioned to that of a man of that height and weight, but it had a barrel chest.  My friend and I were both surprised by it, but were not uneasy about it because he did not make any meancing jestures. It seemed like it paid no attention toward us at all. My biggest regret now is that I did not return the next day to look for footprints.  Even though he did not appear meancing, I certainly would not have followed him into the woods.  I've often wondered if he could have possiblely used our headlights on purpose to illuminate his path across the lane. I know that this report is twenty years old, but it is an accurate and true account of what we saw and I hope that it is of some use to you in your research. Strawberry is located on the slope of the Mogollon Rim at an elevation of approximately 5000 feet.  I lived in Pine, Arizona at this time. Strawberry is only two miles away, but increases in elevation by 500 feet. Payson is the nearest town of any size and is 17  miles to the south.  The forest here has the third largest stand of ponderosa pine in the world.",
  "classification": "Class A",
  "county": "Gila",
  "state": "Arizona",
  "location": "-111.5,34.4",
  "location_details": "One quarter mile off of highway 87 at a point one half mile south of Strawberry, Arizona and one and one half mile north of Pine, Arizona. This is a dirt lane heading southwest off of 87."
}