{
  "reportId": "2386",
  "title": "Unusual screams and thrashing sounds heard by 3 fishermen",
  "date": "2000-04-04",
  "observed": "(This is what took place in the spring of 2000 to my husband and two of his friends. He related this story to me last year after returning from a camping trip to Jay OK. This is the first time I have seen him come back frightened from a fishing trip. After accidently discovering your web sight, I was amazed to find out that there had been sightings in the past in the Jay area and felt that their experience could be important because of previous sightings in the Jay area.) April of 2000, myself and two friends went to an area apx 12 miles west of Jay Ok to do some \"gigging\". We set up camp and went out on the boat until about 10pm that night. We came back to camp, cooked and ate supper, and retired for the night in one large tent. About ten minutes after settling in, there were very loud, deep throated, \"banchee\" screams coming from across the creek, which echoed throughout the area. All three of us have hunted and fished all our lives, one of us grew up in Jay, yet none of us had ever heard that sound before. It was extremely frightning to put it mildly. The screaming went on for around 30 minutes, and whatever was screaming seemed to be moving up and down the opposite side of the creek-or there was more than one animal screaming. There was no doubt that the sound was coming from a LARGE animal of some kind. Nobody said a word to each other as the screaming went on. Each scream lasted about 3-4 seconds. Everyone admitted that the screams where totally unknown to them and that it was a very frightening experience. We went gigging the next day also. We retired around the same time, 12pm that night. Again the screaming started, but this time it was coming from behind our tent in a wooded area in front of a bluff. The screaming seemed louder because it was apx. 300 feet away. Again we lay very still, feeling it would be safer to stay in the tent instead of trying to get to the truck. It again lasted around 30 minutes and then fell silent. We left the next day. We just returned from another camping trip to the same area, April 2001. There was no screaming, just alot of thrashing in the brush across the creek, made by something that seemed to be large. We felt pretty uncomfortable as the creek was shallow, around 4 feet, and there was a feeling that whatever was thrashing the brush, could easily come after us in the boat. There were no visual sightings, only the screams in 2000 and the thrashing brush in 2001. If we make the trip next year, I will be bringing a tape recorder.",
  "classification": "Class B",
  "county": "Delaware",
  "state": "Oklahoma",
  "location": "-94.92667,36.4075",
  "location_details": "Creek between Spavinaw and Eucha on land owned by the city of Tulsa Oklahoma."
}