{
  "reportId": "1432",
  "title": "  Someone or something walks by house and peers from around a tree",
  "date": "1976-07-10",
  "observed": "This incident happened a long time ago, and never told too many people about it.  I am a 31 year old Native American, and I was maybe 6 or 7.  I am glad to know that there are people like you who take this seriously.  It was night, and my sister and cousin were playing around on the phone (they would dial our number & hang up the phone so it would ring).  They had music playing (loud), and were just playing around.  The door bell rang, and one of us answered the door, but there was no one at the door.  Well, this happened 2 more times.  We had a little housedog (we also had a st. bernard), and my sister and cousin noticed that the house dog was crouched under a chair in our livingroom.  The last time the door bell rang, we all went outside, and couldn't see no one around (we all stood out on the porch). It was maybe a half hour later, my oldest brother went to the refrigerator.  The rest of us kids were playing in the hallway when he came running down the hallway with his hands to his face, and crying hysterically.  He ran in our parents room and jumped on the bed landing on his stomach.  He was crying pretty bad.  We all kept asking him what was wrong, and he finally told us what he saw.  He said he saw something peeking around the tree, and he said it was motioning to him to like \"come out\".  That's when he freaked out. After about 15 minutes (he calmed down some), there was knocking at the back door, and the way they were knocking, it was like, open the door now!  When we opened the door, a guy who lived a few houses away, came in as white as a sheet, and was shaking pretty bad.  He said he broke down a ways from our place, and when he was walking up the road, he heard something walking in the woods with him.  He didn't know what it was.  He said he was really glad to see our lights on.  Our parents weren't home (mother working; father-didn't know where he was), but we ended up calling our Uncle's, who lived next door to us.  They arrived a few minutes after we called them, and they had their shot guns with them.  They came and talked with the guy that came to our house.  I think one of my uncles took him home.  There was 6 of kids home (one was our cousin).  My uncles went outside to look around, my oldest sister and our cousin wanted to go outside too.  Well, when they opened the back door, our st. bernard, well let me tell you, for the size of those dogs, that dog would not let those girls out, and he even growled at them.  Well my sister and cousin backed up from the door, and as they did that, the st. bernard came running into the house.  Well, my sister and cousin still went outside, and as they were standing by this little trail by the house, they noticed some dark form at the bottom of the hill/trail.  They thought maybe it was a stump, but then the stump moved and turned to look at them.  My cousin said it had red (?) eyes.  They came back inside right away.  Our cousin went out again (back door), and went around the house to the front, and when she got to the corner of our house, she looked up towards my uncles garage, and said she saw something peeking around the garage.  She said she thought it was one of our other cousins, but she noticed this had a cone shaped head as it looked around the garage towards our house.  They ended up putting us kids to bed (3 of us).  My sister and I were pretty scared, and our little brother (he had a crib) didn't really know what was going on.  My sister and I were shaking in bed.  Our brothers crib was right next to the window.  We were really hoping whatever was out there, didn't come to our window.  Well, we did see a big figure go by.  We were just so scared!  It seemed like forever when our parents got home. When they did we told them what happened.  My mother ended up calling a spiritual guide, and he told her that there was probably 3 of those things around the house that night.  He also told her that they were looking for a boy to take.  He said that one of them may have lost one of their own, and came looking for a young boy to replace the one they lost.",
  "classification": "Class B",
  "county": "Barron",
  "state": "Wisconsin",
  "location": "-91.87774,45.5258",
  "location_details": "Approximately seven miles from Cumberland out on HWY 48 is the general location. ."
}