{
  "reportId": "4982",
  "title": "Personal encounter of a camper as well as a history of encounters concerning his family members, dating back 40 years.",
  "date": "1956-01-01",
  "observed": "Several things over many years. When my sister (now 46) was a little girl (5-6 years) growing up on my grandparents farm she was left to entertain  herself quite a bit. This was (is) a very rural setting and no one  thought twice about leaving her in the yard alone. She claims to have  been within a few feet of a \"bigfoot\"  in the yard and when she ran into the farm house she says the creature followed(?). She then hid  behind a couch and watched the creature look around for a short moment then turn and leave. (no one was in the house at the time). She never spoke of this incident to anyone until she was in her 30's. We were back on the farm for a family reunion (1989) and went into the Zaleski State Forest for a drive on the fire roads. We heard this high pitched kind of roar, something  none of us had ever heard before, except my sister. She got kind of panicky and asked if we could leave then. On the way back to the farm she looked at me and said she had heard  that sound before. She told me about her childhood incident and  knowing my sister I could feel the fear in her words. A few years later (1991) one of my uncle's and his family were on the back side of the farm with his family and the tractor, they were out cutting wood and just enjoying the day when they all at the same time caught a whiff of what they described as a pungent, musty smell, strong and nauseating. My uncle told everyone to jump on the wagon and they immediately left the area. To this day he wont say why he rushed off  in such a hurry. My cousins say he just said \"don't look back\". Which brings us to my experience. I have been camping on that hill in southeastern Ohio since I can remember. I have camped alone and with many people. I have never been so scared in my life as I was the  night (summer 95) Mike (my buddy) and I were camping there. We had turned in around midnight and it must have been about 3-4 am when I was awakened by this deep growling grunt that sounded like just a few feet from our tent. The campfire was smoldering really bad and the smoke trail was really thick. It sounded like whatever was out there got a big snootfull of that smoke and was trying to clear its nostrils. The sound was too deep for a Deer and we think if was a bear (there are only a few in this region) it would have come on into camp for food or trouble. I listened for a few minutes before I woke Mike (he is a shoot now, ask questions later kind of guy)  so he could hear also. About the time he was ready to blast out the back of my tent we could  hear the brush rustling as it moved away from us. Later that morning after we woke I was convinced it was a bigfoot and set out to look for tracks, fur, broken sticks, the usual signs. Well I didn't find any bigfoot feet prints but then I didn't find any  sign of deer or bear activity either. Also we didn't notice any odor at the time of the noises either but  our camp fire was at the north side of the tent and the wind was blowing south so all we smelled was campfire smoke and the creatures smell was probably being carried south, away from us. I like the web site. I am on the mailing list. I have read all of the letters you folks have sent me. I was not going to tell of  these incidents until I checked out the sightings by area and saw  that you had some incidences from that area before that turned out to be a hoax. I believe this area of the country would be a good place for a sasquatch. If anyone else has a personal experience from around this area  I would be interested in hearing from them. I would be curious to hear from some \"professionals\" on these incidences",
  "classification": "Class B",
  "county": "Vinton",
  "state": "Ohio",
  "location": "-82.3997,39.25109",
  "location_details": "Vinton County, Ohio. Ten or so miles from McArthur (east). Prattsville to be exact. one mile north of route 50."
}