{
  "reportId": "36671",
  "title": "",
  "date": "",
  "observed": "I took a three day vacation beginning on September the 14th 2012 from Northern Nevada to the Southern Coast of Oregon. I take professional photos for a website I operate and was hoping to get in some great scenic shots before it got to cold and lousy for the rest of the year. My fiance and I were on a hike about six or eight miles above Brookings Oregon, in Curry county. We were on a hiking trail in a densely wooded area following a trail called the loop trail. This trail is about a quarter of a mile past the area called Natural Bridges viewpoint. We had gone down the trail without incident, although it was getting dark and I felt as though we needed to hurry to get back, even though there was no reason to. It was just a feeling like the hairs on the back of my neck had started to stand up. I can't quite explain it, I just suddenly felt uncomfortable. We did not see any other hikers while we were on our way back up the trail, or on the way down. We stopped walking when we heard some loud snaps in the forest around us, like something was breaking tree branches. We looked around, but did not see anything at first. We decided to keep walking, when we saw some bushes about twenty yards ahead of us sway back and forth. We stopped again and were then assaulted by a horrific smell that reminded me of garbage baking in the sun. By then, the nervous feeling I had had intensified and I was really beginning to worry about the onset of fog and the fading light. The forest was misty and it was raining lightly. We were climbing a steep part of the trail and I gave it my best push to get to the end of the trail. As we were finishing the final climb, I turned and looked behind me. I'm not sure why. It was like I knew someone was watching and yet I told myself I was just being silly. When I turned, I saw a head above some tree branches with the rest of the body obscured by the heavy vegetation. The head was covered in Dark, reddish brown fur and was impossibly far from the ground. If this was a man he must have been at least close to eight feet tall. I blinked a couple times convinced I was seeing things. The thing I was looking at did not disappear. Instead it looked at me curiously for a few seconds and then moved out of my view behind a tree. I grabbed my fiance's hand, too afraid to tell him what I had seen because I thought he might go looking for it and then made my way back to our vehicle as fast as I could. I am not crazy. This was not a trick of light or fog. Something very large with the face of an ape was  looking at me. I will never forget it.",
  "classification": "Class A",
  "county": "Curry",
  "state": "Oregon",
  "location_details": "A foot path for hikers just above the natural bridges viewpoint. the trail was called loop trail. on the same path is a trail called coastal trail"
}