{
  "reportId": "8678",
  "title": "Mother and sons have encounter with unidentified \"prowler.\"",
  "date": "2004-05-14",
  "observed": "It was dark, about 8pm. My two sons and I were watching television while eating popcorn. The eldest, age 16 was sitting accross the room, on the loveseat. The youngest, age 8 was sitting next to me on the sofa, we were sharing a bowl of popcorn placed between us. I smelled this horrific stench coming from the window directly behind us.(My family has teased me about having the nose of a hound)so the my 16 yr.old says \"Oh Mom your always smelling something.\" Well, I look around and the smell dissipates,we continue watching television; a few minutes pass, and the stench blows in again. I got up while telling my oldest son to help me pull out the sofa that there is something horrible under it.As he appooached he smells the stench and says\"It'ts a snake\", the youngest moved back, we pulled the couch out and looked all over the entire room and came up with nothing.We notice the breeze blowing the curtain and deside that whatever the source it's outside, and we'll check it out in daylight. The 16 yr old went outside about an hour later. He came back inside for the shotgun.(His Dad has taken him hunting since he was 6 years old, he knows guns and the woods.)He said someone was standing in back, about 6 yards (north )of the house by a railroad tie post, watching the house, and it was one darn big guy. He took the gun and went toward our chicken pen. I heard him yell from about 50 yards or so from our chicken pen to \"call the law.\" I was scared beyond measure for my son not knowing what was happening. I called the sheriff, after about 10 min. my son came back to the house he said the guy stepped over a bobbed wire fence, and jumped over a brush pile while leaving. He'd not had to use the gun. Two sheriff deputies arrived.They shined lights up and down the yard and property and found nothing. My son went to his Grandmothers house to inform her that we had a prowler. She lived about 40 yards northeast of us.He'd been gone about 20 min.when I heard the metal latch of an outside storage building.Someone had gone into the building.Now my youngest son and I were in the house, the eldest knowing I was already spooked would not be lurking about. His Dad was out of town working putting up a gas rig. The question being who had opened the latch?The building is my laundry room and contained my washer, dryer, and deepfreeze. I phoned my mother-in-law, and asked to speak to my son. When he answered the phone I asked if he'd been there the whole time. The answer being yes, I told him someone had entered the laundry building, and to my knowledge hadn't left.He said he would be home after telling him to be careful, I waiting and watched. He was home in two minutes. While we were discussing what to do he yelled what in the **** is that? My 8 yr.old ran into the kitchen, they both had seen a face in the picture window behind the sofa.The eldest said it was hairy and dirty. I called the sheriff again, my son got the shotgun, my youngest son and myself waited behind him sitting on the floor with the lights out. I fully expected some deranged vagabond to jump through the window.While waiting we smelled the stench again as we were only 3 or 4 ft. from the window.Then I knew the scent was coming from this person.Knowing this sent chills up my spine. The deputies arrived and again found nothing, and left.I never associated this event with the bigfoot until reading about other icidents.The stench is what ties it in for me, and the discription my son gave of the face in the window, the way this character acted just wasn't in keeping with anything I've ever known. But the deciding factor for me was about 8 months ago I repeated this story to a friend of ours, retired Oklahoma Highway Patrolman, who hunts with my husband.He said this was out of character for any perp he'd ever seen.As close as I can describe it the scent was a mix between dirty,wet,steamy blue jeans,soiled diapers,and wet, filthy dog. Thats why for years I thought we'd had a deranged, or drugged tramp lurking about, as my husband had found the signs of someone being in the woods round about.",
  "classification": "Class A",
  "county": "Latimer",
  "state": "Oklahoma",
  "location": "-95.26167,34.92333",
  "location_details": ""
}