{
  "reportId": "23018",
  "title": "",
  "date": "",
  "observed": "I was born and raised on the bayou and would crab and fish with my family along the river, the local people would call this area fisher rider road which was along the mouth of the gulf of Mexico. My family and I was living in the town called Lake Charles which was across from West lake that was a industrial area Which led into small towns that was heavily wooded. It was the middle of September A muggy type of day. We lived in a place called Booker T. Washington courts. My mother, sister and I was waiting for my father to return from work late one afternoon. After a couple of hours we became concern I remember my mother being worried. By that time it turned dark and I remembered my mother said that it was 9pm. Finally my father walks thru the door but not empty handed. My father was a avid fisherman and thought that he would surprise his girls with fresh fish. I remembered the wonderful smell that came from that kitchen that night. It got hot so my mother opened the back door. That is when my sister and I had a chance to play, You see we would take turns pushing each other so that we could taking a ride on the screen door. It was a starry night I remembered looking up to take a view of the sky. So I decided to climb up on to the door to take a ride and I looked out to my backyard area where every one would park there cars, and the trash cans would be lineup in a row on the curve in front of cars. About 47-50ft away there was a tree also and remembered it because the leaves would never fall. The light pole was sitting under the tree with it’s bright light that would shine and light up that entire area. Than suddenly I seen what I thought was Tony the tiger walk up to the metal trash can rip the lid off and  savagely dig through the can looking for something. It was a beautiful sight to look upon this 7 1/2ft short red haired, muscular being. My sister and I look at it for about 20 minutes.  I was so happy that Tony had came to visit. but why did he not even turn his head to look at my sister and I. So we continued to look at it what I remember the most was the beautiful red rusty looking hair and its tan face. I only heard the rustling of the garbage the most striking thing that I remember was how long his arm were from the wrist to the hand area the fingers where long that when he was digging in trash he did not have to bent completely over to reach the bottom of the can. So I turned to my mother and said \"Mommy tony the tiger is digging in the trash can. My mother walked up to the door looked out and told us to quickly get away from the door and closed it in a hurry and locked it. It was never mention to my father who was in the next room. The next day we were allowed to go out to play I immediately went to investigate and their was trash thrown all over the place up to 10ft or so. The metal trash can lid was bent also and I though to my self why would Tony do this? This incident has never been discussed and being 5 years old at the time I didn’t think that anyone would believe their was such a thing.",
  "classification": "Class A",
  "county": "Calcasieu Parish",
  "state": "Louisiana",
  "location_details": "Louisiana is sportsman paradise on the bayou. We lived worked and played along the river bottoms and  swam in the Gulf of Mexico. It is rich in all types of wildlife and would be the perfect place for a large animal to live with out being notice."
}