{
  "reportId": "50534",
  "title": "Memory told of rocks thrown as two friends attempt to climb steep hill at Lake of the Ozarks",
  "date": "1973-07-01",
  "observed": "One summer while I was in college, (1973) I was living at the Lake of the Ozarks with my high school friend at a house his father owned near Purvis Point. We were both from Kansas City, so it was a second home for them. I had been at the house many times over the years in High School and college. We had always talked about climbing the log flue which was a long scar in on a steep hillside you could see from the Lighthouse Marina looking east across the main channel as the lake makes the turn around the bend. This would be the closest thing to a mountain climbing adventure that the midwest would offer. One afternoon we took his small aluminum fishing boat over to the base of the flue and as we started getting closer to shore and approaching slowly, I kept hearing little pfft sounds in the water around us. Whenever I would look over I would just see bubbles, but no splash so I thought it was some sort of fish. We pulled up to shore and tied up the boat. The hillside was quite steep but still climbable and fully forested with deciduous trees, but not too dense to make walking a problem. Within a few feet of starting to climb and a few minutes of being there, rocks started falling around us coming down through the trees from up above. We did not know what was above us if there were any roads on the high ridge where people would be. So we started shouting up the hill that we were down there, and stop throwing rocks. The rocks were at first half a fist sized, but started getting larger after that, and soon there were football sized rocks crashing through the trees around us, coming downward from above. We quickly got scared and got back in the boat before we got hit by one, since they were large enough to kill us. The smaller rocks continued to fall in the water around us as we pulled away with one or two landing in the boat. At the time we wrote it off as possibly someone having a whiskey still or marijuana patch they were protecting. Although we could never see any smoke in that area or clearings of any sort. After watching Finding Bigfoot a few years ago and seeing how rock throwing is a common trait of sasquatch,  I emailed my friend who still lives near Kansas City, (I moved to California after College) and told him I think it was a Bigfoot encounter we had. Then last night I saw your show from the Ozarks telling about others having Bigfoot encounters with rock throwing, so I thought I would write to you. I am 60 now, but never forgot it. In the 1970s we had heard of bigfoot, but thought they were only in the Himalayas or Pacific Northwest. There was never any talk of Bigfoot in that area, and in fact I never heard any coyotes while in the Ozarks either.  It is still uninhabited there, although many homes have been built in the area that were not there in the 1970s.",
  "classification": "Class B",
  "county": "Camden",
  "state": "Missouri",
  "location": "-92.79309,38.16811",
  "location_details": "East side of main channel of Lake of the Ozarks"
}