{
  "reportId": "25836",
  "title": "",
  "date": "",
  "observed": "I am 44 yrs old. My husband and I were driving home after a Thanksgiving visit with my family at my mother's farm in SE Iowa near the Missouri border. After leaving the driveway, I noticed something black on all fours to the right of the road along the treeline in the long grassy field. My first reaction was that it was a dog, but I noticed that it had no tail or disernable ears, so my next thought was, is it a bear? It was moving the same direction we were, so as it was moving I was watching it. It wasn't moving very fast, just like a slow lope or trot. I was very confused, because it didn't look like a bear or a dog....so my mind was desperately trying to identify it. It finally turned it's head toward me and I noticed that the hair around the face sort of framed it...although I still could not see a snout like a dog. I immediately thought of a pomeranian type dog that might have hair around it's face and a face that might be flatter than a normal dog.  I said outloud...what is that? And after it turned it's head toward me, I said that is the ugliest dog I have ever seen! However, since the sighting, I have been continually confused about what it was I saw.  So many things did not \"fit\" in my mind of a dog's characterists.  At first I noticed the lack of a tail, and then no ears, but then in recalling the sighting, I also couldn't figure out why the legs of the \"dog\" were so thick, which is when I thought of a bear.  But again, no snout sticking out. And also I could not see its eyes, so my impression is that they were very deep set and close together. After reading the stories on this sight, and seeing the descriptions of Bigfoot, I am pretty sure that is what I saw.  I have not been back to the area where it was to measure exactly how big it might have been.  However, my impression was that is was a juvenile. Perhaps 4-5 ft in body length, maybe 200 lbs. I am only guessing...maybe 6-7 ft stretched out, head to toe? The main reason I now think that I know what it is, is the fact that I could not see a face. The face was completely black and I could see no snout or prominent eyes. When seeing the hair that frames the face of the Bigfoot pictures I have seen, it seems to fit with what I saw and seems to make more sense in my mind than the description of any other animal.  I have frequently spent time at this farm and it is full of white tail deer and farm crops.  I have never heard any strange sounds or seen tracks or smelled anything strange. My mother did say that one year, something ate all the apples off her trees (2). She thought it was the deer that is frequently seen on the property. Also, I grew up on another farm in the same county along the Mississippi river and spent many many hours in the forest on our 100 acre horse farm (1969-1977). I often had to hike into the forest to look for my pony.  I also enjoyed hiking and spent time just walking the trails.  I have never seen anything like this all the time I was growing up.  The only thing strange that ever happened on that farm was that twice when I was riding my pony in the field on the south side of our timber, where I did NOT hike, I heard what sounded like a woman screaming. And a seperate incident of a baby crying.  I told my parents and they assured me that it was a likely a bobcat. The following is from a second report, 26128, that was submitted by the witness. -Steve Moon Follow up:  I have sent in a report recently from SE Iowa. I wanted to follow up with a couple of things.  I grew up in the area, in a couple of different places. One, we lived on a farm along the bluff overlooking the Mississippi River above Montrose, IA.  And second we lived near Shimek Forest in a small town called Primrose, IA.  Also, around 1977-78 we stayed at a cabin along the Des Moines River near Argyle and near my recent sighting. I mention this because I have spent some time in the woods growing up...hiking, horseback riding, camping and sledding in these areas. After some research on your site and reading some books on Bigfoot, I wanted to relate a couple of other strange things that happened when I was growing up in this area...that seem to now fit some of the other descriptions of sounds that were possibly made from a Sasquatch. 1. I am guessing on the year, but probably between 1971-76. I was riding my horse on the Mississippi River bluff property.  We had a field that separated the house from the opposite stretch of timber that made up the 100 acres of our farm.  I seldom rode my horse on that side of the property (South) because the horses were fenced in only on the North side of the property. They do not have access to that area. It must have been Spring, because the field was not grown up yet, as I was riding in the field. I was coming back from riding in the back field and was just entering the front field. I turned my horse left along the South edge of the field. Suddenly, I noticed that I was having problems getting the horse to walk in that direction. Then I heard a scream. It sounded like a woman was being murdered in our timber! It scared me so bad that I immediately went back to the house to tell my mom. She said it was probably a bobcat.  Since then, I have researched bobcat sounds and I have not found any evidence that bobcats make that sort of noise. There was another incident in the same location. But the second time I was in that same vicinity but it sounded like a baby was crying.  It's funny but I remember the separate occasions because I always had the image in my head that there was a woman with a baby living in our woods.  Both times the sounds were very very loud!! 2. I was a little older, I think it was around 1977-78 when we were camping at the cabin on the Des Moines River.  I know it was summer because we were out of school and it was hot.  We were fishing on a sandbar on the Iowa side of the river. I was alone at the time and suddenly heard a crashing noise from the other side of the river...like something really big was crashing through the trees.  It was a very distinct bipedal sound, like one large step, then another, then another.  I started to get really scared and then my stepdad came running up and said, \"What is that?\" I said I didn't know and he went running along the bank to see if he could see what was making the noise. (He was a DNR government employee)  The noise stopped and he came back a short time after that and said it was a beaver slapping its tail on the water. Of course I believed him since he was an \"expert.\" However, what I heard was not a WATER sound. It was a sound of trees being pushed over.  And it was very loud…loud enough to make your adrenaline kick in.  I started to panic because I thought something huge was going to come out of the timber in my direction! Again, I did search the internet looking for the beaver sound justification....I found none. Interestingly though, the sounds do seem comparable to the sounds that other people have reported in encounters with Sasquatch that I have read on this site.  Anyway, I just thought I would add this to my previous report.  I’m sure many; many people have heard things like this and have been told that it was a “typical” sound from a well known and less scary forest animal.",
  "classification": "Class A",
  "county": "Lee",
  "state": "Iowa",
  "location_details": "Hwy 218 South towards Missouri. Take a left on to Argyle Road (a few miles from the Missouri border - which is the Des Moines River). 2-3 miles on the left side of the road along a treeline in a grassy field."
}