{
  "reportId": "4589",
  "title": "",
  "date": "",
  "observed": "First let me state I am a college educated person with two degrees.  One in psychology and one in fine art.  Like many persons who have had this type of unexplained experience, it has made a mark on my psyche that has been permanently etched despite the ridicule poured on me (by persons who in fact were not there). Scientifically one may NOT deny or affirm the existence of a thing about which we have little information.  For instance, in the 1600's if one were to speak of electricity and television they would be deemed mad and a witch.  Now you read this by just such means as were previously thought non-sense.  We know it is fact now.  Some day, I believe, this rare ape will present us with irrefutable evidence of it's existence like being a little too slow in front of a mack truck or something.  Enough of that. Here's why you're reading this... In the winter of 2001 while surfing the net for images of \"western art paintings\" the BFRO web site popped up with Western New York Bigfoot Sightings.  I had to laugh.  You gotta be kidding me.  Then to make it even better there are these \"listen to the bigfoot\" wave/sound files to download.  So curiousity made me do it.  I'm laughing my butt off here.  So I hit play. Suddenly I shut up  -   I am in SHOCK.  My hands began to shake and the adrenaline glands almost blew my head off.  The sound of the \"howl\" is exactly what I encountered one evening the previous September of 2000.  So now I play the other \"scream\" file.  Alright, now I'm disturbed.  That too I heard within 100 yards of my home that same summer, about 5-6 times on different occasions. I never had any thoughts about sasquatch before.  This gave me pause.  It suddenly gave me a flashback of living near the Tonawanda creek in upstate New York and seeing a large (12-15\") barefoot footprint in the snow along the creek/riverbank just upstream of the north pembroke hotel(magadore hilton,ha).  Barefoot in the snow ? What kind of a jerk does that ?  There were, I believe, four of us kids there.  I was about 11 or 12 at the time.  We often played in those woods however that day we had an uneasy feeling and cut our trip very short and went immediately home.  I thought maybe it was a bear track like a hind foot although I knew it was too human.  No one even mentioned Bigfoot, it was not something we ever talked about.  Now that memory is freaky. And there's more.. I now live in the woods and am very comfortable here near Allegeny State Park.  There are literally thousands of acres of forrest surrounding my home.  I am comfortable chasing 350 pound black bears out of my yard, sitting in the woods and having coyotes walk by, hearing screach owls etc.  THIS sound was unlike anything I had ever heard.  Sometimes at the approach of archery season I need to convince disrespectful persons that no tresspassing actually means them.  This night I thought to encounter a coon hunter whose howling dog was moving towards my position down through the valley.  The sound wasn't just right for a baying dog but what else could it be ???  Now at the time this howling started it was probably a mile off (more later) and at dusk/dark. I have the pleasure of having a wolf-dog that is not too much pooch you might say.  Great animal, very mellow even when on walks at night and the coyotes start up yapping less that 100yrs away.  He just looks and say's \"punks\" and moves on - nothing phases him.  This night he was like stone focused on the direction of the loooooong howl.( I get the creeps remembering it).  Never before or since have I seen him in that state even in the presence of black bears.  His ears were fixed and I had to drag him under protest back into my cabin.  I was afraid that he might attack an expensive coon dog when I confronted the 'hunter'.  So now the wolf is in the house and I leash up my german sheperd, grab a spot light and a very serious russian weapon.  I take off in the direction of this howl which I can tell is coming toward me and know there is a field which leads up into the woods near where we should meet.  I get about 80 yrds in that direction and notice that the howling is now going to pass above me in the woods so I redirect my course for a more appropriate intersection point.  Normally my sheperd is pretty bloodthirsty which I do not encourage, just her nature.  Tonight she is cowering between my legs trying to pull me back home to safety.  I'm thinkin' \"wimp dog !!!\" and she's really making me angry.  I am looking for the coon hunter's tell tale spot light in the tree tops or through the woods -nothing.  Meanwhile I have entered into the thick of the woods cresting an embankment of about 35 feet above the road.  Oh Boy !  That aint no dog.  What the ----- weapon's up laser sight on - this is bad.  When you have an attack dog, a nasty weapon with o so many bullets and a spot light (which started to go out, thankyou very much) and you're still scared.  You just make sure the safety is off and focus on that little red dot. The thing was traveling at such a speed through the woods it didn't seem real.  I thought the dog had to be running but when I heard it from around 120 yards away on the same level, NOBODY could convince you it was a dog, wolf, coyote etc. I don't scare easy, that was terror. Still I never thought \"bigfoot\".  In fact I researched all the wolf sounds I could find and none of them matched what I heard the night before.  I thought that is why my critter was so interested. I just chalked it up to a \"maybe wolf\".  A neighbor who is about 85% deaf and a true hermit woodsman (83 years old) asked ME if I heard \"that howling the other night\".  This guy could almost sleep through an atomic bomb. Another fellow who is a Korean war vet who saw too much action also told me about this strange howling he heard two seperate nights.  He stated that he intentionally stayed up one night to see if he could figure out what it was.  He said that he could never figure out the noise or creature that made it.  Understand that this guy has camped out in a tent or camper in these woods for over 15 years.  Frankly he's seen or heard almost everything around here.  Yet another neighbor ask me about the noise.  Her first comment was,\"It seemed a lot louder than it should have.\"  Now know that she owns a kennel and is an accomplished singer musician.  Let's just say she understands acoustics.  Incidentally there is a great deer trail just about where I believe this noisy beast to have traversed the valley.",
  "classification": "Class B",
  "county": "Cattaraugus",
  "state": "New York",
  "location_details": "do not post. near my home"
}