{
  "reportId": "10927",
  "title": "Bow hunter observes animal lying down in the Creve Coeur bottoms.",
  "date": "2005-10-15",
  "observed": "While Bow-hunting in Creve Coeur bottoms, I had been in my stand all day and had no luck. So I got down right before dusk and proceded to stalk along side a trail leading to the river. I had come to a point were the trail turns and runs parelell to the river.When I started around the turn something moved in the corner of my eye off to my right. My first thought was that I was going to scare up a deer, So I drew my Bow and tried to take aim on the area of movement, But what I saw was not a deer. At first, I thought it was a man in camo laying on the ground, That freaked me out, so I let off my Bow. However, I was trying to make out this \"person\" laying on the ground, on thier belly, When it raised up on it's right arm, turned the upper half of it's body, And looked at me. This was no person. It was to dark to see any features, But I could see two legs stretched out behind it, Two arms in front, A large torso, And a head. It seemed to be covered in greyish-brown from head to toe. No visible gear, Which struck me as odd, So I continued to try and figure out what this was. I stared at it, And it at me, When I felt the need to LEAVE. I did not feel threatened, Just that I had to go. As I began to leave and head back toward the levee, I kept thinking about turning back because I could not believe what had happened, But something made me go out of the woods. I have grown up in woods all my life, Have hunted in south-central and eastern  Missouri, And grew up only a few miles from here, But never before have I seen Something I could not explain. If this thing had stood up, It would easy have been a foot or more taller than Me.",
  "classification": "Class A",
  "county": "St. Louis",
  "state": "Missouri",
  "location": "-90.52987,38.69428",
  "location_details": "This area was behind Chesterfield Golf  Club, and bordered up river by St. Louis County Water Works. This area is now fenced off and posted by Missouri Department of Conservation."
}