{
  "reportId": "32251",
  "title": "",
  "date": "",
  "observed": "It’s taken me a long time to write this report because shortly after the incident, I managed to convince myself that it couldn’t have been a bigfoot.  A few months later, a friend had a nearly identical incident at the same location which made me reconsider.  As a mechanical engineer, I am trained in the hard sciences and as such, I am a scientist.  I really don’t believe in something unless there is hard evidence or the scientific community is in agreement.  Since the incident and my friend’s incident I have been doing a lot of research and feel that there is substantial evidence that a forest primate exists in North America.  As a scientist, my previous position was that something could exist but there was not enough evidence to prove it.  I do admit that I have always had an interest in the bigfoot phenomenon and knew some things about it like wood knocking, howls, etc.  I also took a natural anthropology class in college.  My teacher was one of the most famous anthropologist of our time and I learned well about all of the primates, the australopithecines , early hominids and of course gigantopithicus. My point is that I am an intelligent person who had an informed skeptical position concerning the bigfoot phenomenon but has come to believe that the forests are inhabited by either an early hominid or a great ape, or something in between.  I am known for my situational memory and feel that my remembrance of the incident has not diminished.  I have told my story many times and every time I get goose bumps.  It was Aug of 2010.  My wife, brother, father-in-law and I were camping on the Mogollon Rim.  We were in my favorite spot in a remote location of the Apache Sitgreaves Forest that I had been frequenting for about two years.  We were not doing any particular activities like shooting or hunting, we were not riding quads or anything.  It was a two night camping weekend for us and for the most part we were just hiking and relaxing and observing elk.  The oddest thing about this weekend was that there was almost nobody in this area of the forest, a lot of people avoid camping during the monsoon although this weekend was basically dry.  The closest campsite was about 2 miles away.  It was occupied by two older couples whom I had spoke to earlier that day of the incident.  The other notable observation was that it was a pitch black, moonless night in which it must have been overcast because I could only see about 3 to 5 feet.  In retrospect, I cannot imagine these two elderly couples creeping 2 miles into my camp, on foot, without lights, just to disturb us in our sleep.  Also, Arizonans are known for their gun toting, it is never wise to approach someone’s camp unannounced especially in the middle of a pitch black night. I have been an outdoorsman since I can remember and am an accomplished hunter. I am familiar with the Arizona fauna and the sounds they make.  At about 12 AM, I was awoken to the sound of two sticks cracking together near my RV trailer.  The knocking sounded as if somebody had two girthy sticks, maybe about 2 inches in diameter, and they were banging them together at a perfect 2 second interval.  Sometimes the sticks sounded a little different as if a knot had been struck but the timing was never flawed.  Now a lot of people say “well that could be an elk’s antlers or some bird cracking his beak”, but I have never heard a known animal make this sound, let alone in perfect repetition for the duration that I heard it.  But that wasn’t the strangest part; the sound was translating through the forest quickly and without making additional sounds.  The sound was emanating from an area on the backside of my trailer and receding away.  It would then come closer and recede again.  This was happening over and over.  I would say that it was probably about 20 to 30 yards at the closest and went out an additional 50 to 70 yards away.  My campsite was near a primitive road and the sound seemed to parallel the road but I can’t be sure. After lying in bed, listening to this for about 2 minutes, I decided that I needed to do something about this thing that was disturbing my camp.  Familiar with the observance that bigfoots knocked wood, a bigfoot did come to mind instantly, but I felt that as the patriarch, I needed to investigate and protect my family. My family members were all three asleep and I believe there may have been some snoring going on which may have given the creature some comfort to continue doing this.  I was sleeping in my underwear and decided to get dressed.  I got dressed more quietly than ever before or since and I am certain that I made no sound that the creature could hear.  I did not turn on any lights and was absolutely silent, feeling around for my clothes, shoes and pistol. Once dressed, I moved silently to the trailer door, being careful not to shake the trailer or create any noises.  This was actually quite easy because there is a door adjacent to my bed.  I waited until the cracking sound had receded as far away as it sounded like it was going to get.  And remember, the sound was emanating from the opposite side of my trailer.  I slowly opened the door, again careful not to make a noise.  The knocking sound continued. This is the part that freaks me out the most: as soon as I stepped outside, the knocking sound that seemed as far away from me as possible, stopped.  Now perhaps the trailer made a creaking sound when I put my weight on the metal step but I had the distinct feeling that something, another creature, had seen me get out of the trailer.  For some reason the door opening did not cause the sound to stop but when I got out, whatever was creating that cracking sound decided to stop even though it was 70 or 100 yards away.  I had the feeling that if something saw me, it would be beyond the rear of my trailer; the door that I just opened would have blocked the view of me from the front of the trailer.  A position to the rear would have nicely triangulated a view of me and of the wood knocking creature.  In short, I got the distinct impression that there was a second creature serving as lookout. Now the story does not stop there, I had a lousy flashlight (unlit) in one hand and my pistol in the other.  I proceeded around the front of my trailer to the other side.  Once I was on the other side, I was confronted by the pitch black woods in which I was certain that there were a couple of unknown creatures.  Having the distinct feeling that there was something to the rear of my trailer, I shinned the lousy flashlight directly towards the rear.  This only lit up the two very large pine trees that were about twelve feet in front of me.  Shining the flashlight did however elicit a response.  As soon as I shown the light, directly in front of me, but on the other side of the trees, perhaps about 20 to 40 yards away, something let out a “whoop, whoop”.  It was clear, it was distinct and it was amazing.  Before this incident, I had never heard on TV that bigfoot made a “whoop, whoop” sound, so I am certain that this was not in my head.  At that moment, I knew that there was something different from an elk, a bear, an owl, etc that was disturbing my camp.  And I also knew that there was more than one.  I felt that this was an alert call signaling any additional creatures to leave the area. During my time outside of the trailer, I was conscious of the observances that bigfoot is supposed to smell.  I specifically sniffed the air trying to get an indication of a bad smell but never smelled anything.  It was a temperate night, the air was a bit cool, probably in the low 60’s but I didn’t smell anything. Right after the “whoop, whoop”, my wife began to stir, turning on lights and going to the restroom.  I went back around the front of the trailer near the door I exited from and my wife was standing there asking me what was going on.  I told her that “there is something out here, I don’t know what it is, but there is something out here.”  Surprisingly, maybe because I knew they were scared away, I was able to fall asleep shortly thereafter.  My wife told me that before she went back to sleep that she heard a couple of knocks too.  Of, course I had told her what I had heard and it may have been fresh on her mind as she started to fall asleep.  She did wake me to tell me, but I didn’t hear anything and we both fell asleep.  My brother and father -in-law never really woke up during the incident.  I would say the incident lasted about 10 minutes from the moment I first woke up until the “whoop, whoop” was heard. The next day, I searched the road and any sandy areas in the area for footprints.  I am an experienced animal tracker but found no tracks.  As we discussed the event I grabbed two ponderosa pine branches that I thought approximated what I heard.  I cracked them together and it sounded fairly similar.  I experimented with different sizes and materials (oak, aspen and pine).  I felt like 2 inch diameter pine sticks with the bark removed sounded closest to what I had heard. The last week of November that same year, my friend, his dad and brother were staying in my exact same campsite hunting elk.  My friend heard the 2 second wood knocking rhythm translating through the woods just like I had for quite a few minutes.  I believe his dad and brother did not really stir.  He did not go out to confront it and it eventually stopped.",
  "classification": "Class B",
  "county": "Coconino",
  "state": "Arizona",
  "location_details": "I do not wish to divulge the exact location."
}