{
  "reportId": "27472",
  "title": "",
  "date": "",
  "observed": "I had gotten up in the middle of the night to get a drink. After leaving the kitchen, I went to the backdoor to look out the window. There is a road about 100 yards from the back of my house with a dusk to dawn light that is still in the same location today. As I stood there I noticed something start up the bank toward the road from our field. It cleared the road in one stride. I can not give any clear physical dimensions because of the distance and being night, but because of the dusk to dawn light I could tell that it was not a man, it had wide shoulders and long arms, and was hairy. I stood there frozen for a moment, and kept looking to see if it would return. After a few moments, I went back to bed. But this does not end here. The next day I went next door to my great grandmother`s house to check on her. During our conversation, she looked at me and said, \"I started to call you last night\". \"What for\" was my response. \"Someone was standing outside my window around 3:00 AM\". When she said this the hair stood up on my neck. Before I could say anything else, she looked me square in the eye and said, \"He was big. He was as tall as the top of my window\". You need to understand, my great grandmother`s home was built in the late 1800`s, and had the old, four foot tall windows. I stand 6`-3\", and the top of the window (inside the house) was over my head. Outside, from ground level, this person would had to have been close to eight foot tall! I then proceeded outdoors, where I found a large section of grass had been flattened outside her window. There was only one footprint, and it was in the direction it would have been walking to the road. The print was approximately 18\" long, and about 8\" wide. I never told my great grandmother what I saw the night before, and to my knowledge, she never mentioned this to anyone else. This incident is as clear today as it was 28 years ago. I never heard any stories from anyone else in the area. I have kept trying to play this off as a hoax, but it just doesn't make sense. Why would someone go to all that trouble to hoax a sighting for the possibility of being seen by one 88 year old woman?",
  "classification": "Class B",
  "county": "Henry",
  "state": "Virginia",
  "location_details": "Specific directions omitted per the request of the witness."
}