{
  "reportId": "34224",
  "title": "Possible late night encounter outside a home near Pinckard",
  "date": "2011-04-01",
  "observed": "It was April of 2011. My son, daughter-in-law, wife and I had been over at my in-laws having dinner. My son and his wife and their infant son had recently moved in with us. We were in the process of adding a new laundry room and garage on the back side of our house. When we came in from next door my son and his family were ahead of my wife and me by a minute or two. I noticed the lights to the new addition were on and figured that one of them had gone out to retrieve their laundry. I opened the back door and said is anyone out there. I didn’t yell so I thought they might not have heard me. I stepped out on the patio and started walking toward the garage that didn’t have a door hung yet. As I did I saw a dark figure at the back of our SUV. It scared me that there was “someone” in, or had just passed through our garage. Without saying another word I ran back into the house to get my 410 shotgun and let me son know to join me outside. This only took 30 seconds or less. I went back out but this time I was yelling “if there is someone out there you better speak up or I am going to shoot you.” My son joined me and we ran out into the yard both yelling for the person to identify themselves. We circled our house and saw nothing. It had rained earlier in the afternoon and evening and as we came back to re-enter our house confident that what I had seen ran away we noticed footprints on the concrete patio deck. These footprints at first looked like that of foot gloves people that fit each toe like a glove does the hand. But the thing that was conspicuous was the size. They were enormous. Not only long but wide, huge like that of what an NBA star might leave. (I say that because I have a pair of shoes owned by an NBA star that my nephew gave me who is on an NBA coaching staff.) My point, these were very large feet and very wide strides. It then dawned on me how large the figure I saw in the garage had to be. As stated I own an SUV and at the back part of the garage where I saw the figure the concrete starts to slope down from the garage. This figure I saw was head and shoulders over the top of the SUV and he (it) was already on the slope because he was not inside the garage when I saw him. I joked to my son and later to my family; you know that thing I saw that night was big enough to be a Sasquatch. We all laughed because we had not heard of any other Bigfoot sightings in lower Alabama. Then your show comes to television and I go on your site today and learn that there was indeed a Bigfoot sighting on Ft. Rucker back in the 90’s by a solder. I live just five to six miles from the post. I’m not convinced that what I saw should be reported to you but I do know that if it was a person I never want to see them again on a dark night in my yard because they are a very big person. Our house is in a rual country setting in Pinckard, AL with limited neighbors.",
  "classification": "Class B",
  "county": "Dale",
  "state": "Alabama",
  "location": "-85.61766,31.30503",
  "location_details": "I am a pastor and do not want people to doubt me which would in turn damage my ability to minister. I have been in the area over a decade and feel I have credibility here and would do nothing to harm that. Yet I still wanted to report it without publicity."
}