{
  "reportId": "24068",
  "title": "Possible vocalization frightens fisherman from campsite along Conejos River",
  "date": "2008-06-21",
  "observed": "Let me begin this with a brief bit of information about the area.  The South San Juan Wilderness (in the San Juan Mountains of southwestern Colorado) is considered to be Colorado’s wildest corner.  It was in the backcountry of this wilderness in the fall of either 1977 or 1979 (I forget which) that a sow Grizzly Bear was startled and attacked a bow hunter.  He was mauled but managed to kill the bear with an arrow he repeatedly drove into the bear’s chest.  It was thought that the Grizzly had long been extirpated from all of Colorado.  If there are Grizzlies still in Colorado, this is where they are thought to be. I have been hiking, backpacking, camping, and fly-fishing in this area for about six years now, making about 2-3 trips per spring/summer/fall and one of those trips usually includes a backpack into the backcountry.  I am very familiar with the sounds the various animals make in the forests and mountains of the west and of this specific area. On this trip I managed to sneak away for a three day weekend in mid-June with the new lab.  I heard that the Salmon-fly hatch had started and wanted to try to get a piece of the action fly-fishing for big, aggressive trout. I figured I would save myself a few dollars by not camping in the developed Forest Service campsites and enjoy some solitude at the same time.  So I camped in a large series of meadows known as the Trail Creek Primitive Camping area; no water, no services, just camp where you will.  I was about 15 miles from the tiny community of Platoro at the upper end of the Conejos valley and maybe 10-15 miles from the next nearest community of assorted vacation houses known as Rocky Mountain Estates back down the valley.  I did not realize it at the time but this was a remote area even though the dirt road that ran up and down the valley was only about a ½ mile across the meadows from my camping spot.  Behind me by about 50 yards was the edge of a 150’ moderate canyon of the upper section of the Pinnacles run of the Conejos River.  On the other side of the canyon, which is steep but easily crossed by humans, is a huge, expansive mountainside of aspen groves, spruce and fir trees, and mountain meadows.  This is the beginning edge of the South San Juan Wilderness Area. The second evening I had cooked dinner and taken the lab out for a last evening walk around the meadows.  It had been a good day of fishing and we were both tired.  We went to bed in the tent just at dark.  It was a night of an almost full moon.  We both fell asleep quickly. A bit later I awoke and thought I head something outside the tent, probably a deer.  But because I was curious I sat awake for a bit and listened.  After about 10 minutes from out of nowhere I heard this unreal, LOUD, clear, resonant, scream/screech/howl/roar type sound from not too far away.  It sounded maybe 300-400 yards away and like it might have been just across the canyon on the mountainside.  It was like no sound I have ever heard in my life.  It was fairly high-pitched and did not have the rough, gravelly sound that cats have when they roar and call.  It was clear, even crisp, loud, and lasted for about 5-6 seconds.  It seemed to be two parts screaming howl and one part roar, as it had that deep quality but was still high-pitched.  I sat there for a minute stunned, and then realized what it must be. I have read accounts on this website before about the sounds these creatures supposedly make, and this was what came to mind.  (So I guess chance does favor the prepared mind.)  And it was not that far away.  The sound seemed to be coming directly toward me, like it might have been screaming at or towards me or this meadow area where people sometimes camp.  It felt territorial, aggressive, even a little threatening.  Even though I had a .357 loaded with hot hollow points and a strong flashlight, the prospect of encountering some big, hairy “man-thing” outside my tent in the middle of the night, in the middle of nowhere, and alone, was a little more than I wanted to deal with.  I got the dog in the truck and got the hell out of there, with the .357 in my lap.  After a few minutes on the way back down the valley toward an area where I could sleep in peace I sort of had a delayed reaction.  I became unnerved and thought that if I actually see one of these things in the headlights or on the side of the road next to my truck as I passed it I might really lose it.  I was that rattled.  I have lived and backpacked extensively in Montana and in the Canadian Rockies and dealt with the reality of Grizzly bears with no real problem.  But this noise and the creature that most likely made it really freaked me out. After sleeping in the car in the nearest little town of Antonito (I could not find any lodging at 11:30 at night) I went back a little after daybreak to look around and to get ready for another day of fishing.  I ate a cautious breakfast and kept looking around, worried I might actually see one of these things.  But in the daylight I was not quite as unnerved.  I did not find any tracks in the greater area in which I was camping as it was mostly grass, although I did walk around and search for a bit. When I got home I went online and listened to recordings of Mountain Lions and Bobcats, although I know these sounds and have actually seen a Mountain Lion up close in the wild.  The sound was definitely not one of these.  But when I went to this website and listened to some of the recordings I realized it had to be one of these creatures.  This sound was a bit higher in pitch than some of the other recordings, but VERY similar in most other respects. Now I am paranoid and worry that I might not be doing any more backpacking in this beautiful and remote area for fear of running into one of these spooky creatures, especially at night.",
  "classification": "Class B",
  "county": "Conejos",
  "state": "Colorado",
  "location": "-106.4745,37.26505",
  "location_details": "I was in the Trail Creek Primitive Camping Area, just off of FR 250, about 30(?) miles up the Conejos Valley from the turnoff at Horca, CO."
}