{
  "reportId": "1352",
  "title": "Daylight sighting by hikers near Lake Fork, off the Conejos River.",
  "date": "1997-07-13",
  "observed": "I saw with binoculars a group of three hikers and a dog making their way down the Lake Fork Trail toward the Lake Fork Ranch. They were walking at a fairly normal speed. What I would say to be 400 or 500 yards in front of them was a large, black object moving in the same direction--away from the hikers--at a much faster speed. It was not on the trail, but instead in the meadow next to the trail. It seemed as if it was spooked by the hikers. I'd say it was about a half mile from me, and 1000 or so feet downhill, so I couldn't get a really good guage on how big it was. Although, judging its size against the hikers, it was clearly much larger than a man. There is no question that it was bipedal; not once did I see it move quadrapedally. This was definitely not a bear. As it appeared from my vantage point, I don't think the hikers ever had a direct view of this thing. The clearing in which the hikers were was separated from the clearing across which it was running by a tongue of aspens growing down into the valley. I watched for about 5 minutes as it moved away from the hikers, eventually jumping Lake Fork and bearing farther away from the trail and disappearing into the trees on the southern edge of the valley. are there any other reports in this area? I've been going to the Conejos for about 25 years, and have never seen or heard of anything like this.",
  "classification": "Class A",
  "county": "Conejos",
  "state": "Colorado",
  "location": "-106.5123,37.32255",
  "location_details": "Conejos County, Colorado...sighted on Lake Fork of the Conejos, on the Lake Fork foottrail, about half way between Big Lake and Rock Lake...sighting was made from the eastern branch of the Saddle Creek logging road...line-of-sight distance approx 2.5 miles SSE of Platoro, Colorado I was on the logging road, about 0.25 miles lateral and 1,000ft or so vertical distance from the Lake Fork trail when I made the sighting...we were standing on a rocky overlook next to the logging road which allowed a good view of the Lake Fork Valley, including Big Lake and Rock Lake"
}