{
  "reportId": "1325",
  "title": "Fisherman hears heavy breathing ,turns and sees tall man-like creature",
  "date": "1978-07-10",
  "observed": "We had been fishing in the river, standing on sand banks. My companion and I had our dog and he decided to walk South in the river to fish downstream. I continued to fish standing in knee deep water on the East side of the river. It was hot, very hot weather. I heard sounds of deep heavy breathing...a weird sound I cannot really articulate, but it caused me to look up and around. I thought my dog (a Great Dane) who had followed my companion downstream was back panting heavily from running in the river. I realized the sound was coming from behind me. I turned around and saw a tall creature staring at me. I couldn't believe my what I was seeing. He was 100-150 feet West of me standing on the bank beside a tree. I could see his eyes very clearly. They were like a man's. He had hair around him and covering his face and his entire body. He was very tall at least 7 feet and built very athletically. We just stared at each other for several minutes. I had no weapon to protect myself so I just stood very still and so did he. I realized I had to do something. I dropped my fishing pole in the water and started to move sideways slowly downstream where I could barely see the person I had come with. As I did the creature moved very quickily to the next tree Northward, stopped and stared at me. I stopped. I wanted to move closer, but I was too scared. I thought, if I had a gun or something I would move toward it, but then it occurred to me this may be somebody in a suit! I thought it might be my brother. But, in this hot weather? I called out my brother's name, \"is that you? Quit kidding around!\" The creature simply stared at me. We were both curious about each other and I could tell, I don't know how that it was a male creature. Several more minutes passed and I knew I better get out of there. I moved slowly again, sideways and began softly calling to my companion, but he was so far downstream he couldn't hear me. I was afraid now, so I started moving faster to get out of there. The creature moved when I did and he move away from tree to tree and I made my way through the river to my companion. I yelled for him to get up here and told him what I saw. He thought I was crazy. When I finally got him up river to see, the creature was gone. We went up on the bank to look for prints, but I didn't see any, because it was all dry sandy soil. We immediately went home and I told my family, my brother was home and it was obviously not him. My family owned this part of the river for recreation at that time and it has become the family joke. But, I know what happened and I did see bigfoot in Kansas. It wasn't just a siting, but a long hard stare at each other. Of all the pictures I have seen of Bigfoot, there is only 1 that is true. This creature looks like a man, has eyes like a man and even if I would have had a gun, I would never shot it for fear that it would have been a man (a tall one) in some sort of suit.",
  "classification": "Class A",
  "county": "Sedgwick",
  "state": "Kansas",
  "location": "-97.60829,37.52947",
  "location_details": "Ninnescaw River"
}