{
  "reportId": "30673",
  "title": "Family endures confrontation while camping in front yard near Fort Knox",
  "date": "2007-09-15",
  "observed": "We have three episodes at the same location. Four years ago in mid September 2007, we decided to camp on our property which is located in Doe Valley Community.  The community is very special...it is nestled against Fort Knox Reservation and large forested areas.  Doe Valley is a nature reserve where deer, turkey, foxes and numerous other indigenous animals are so tame they will come up to be hand fed.  There is a no hunting restriction on the area which is riddled with caves and creeks.  In fact, the creek which backs up to our property was named by Squire Boone and hunted by the Boone family.  Several abandoned mills here were even built by Abraham Lincoln's father...so the area is very steeped in natural and American history. As we began camping this evening, we noticed that several rocks were rolling on the ground at different points in our night.  I was concerned someone was in the woods throwing stones, but our community is very rural and this would have been something very rare. We had also been hearing what appeared to be a loud howling...a mix between a female screaming and a wolf howl.  Not a fox yelp as we are used to hearing those...but much deeper and louder. The hour grew late, and my children got sleepy...so they decided to retire into the tent.  My one son insisted on using his own dome camping tent and though I am unsure why I was so leary...being in such a safe location.  But, I told him that if he wanted to sleep in his own tent he would have to place it in direct view of our family tent's window so I could keep an eye on him. I went into my own tent after puting the fire out and lay down just to keep warm while I waited for dawn...the time was about 3 a.m. Then suddenly a sound came from outside of the tent in the woods...a sound of cracking and very heavy footsteps through grass. It went WHOOOSH thump WHOOOSH thump WHOOOOSH THUMP and I began to chuckle thinking...here the children waited up to see deer, or raccoons...and they come when we go to bed.  But then the thing walks up to my tent and begans to walk past.  But then I realize...wait...this is walking on only TWO FEET.  I begin to smell the odor of a wet dog mixed with a skunk...or like an elephant pen at the zoo.  Suddenly it BUMPS my tent over and over again as it makes its way past my tent in a direct approach to my son's tent and suddenly my son's ENTIRE f***ing tent came off the ground and is shaken in the air like it was nothing.  It was just shaking it up and down and Cody is screaming NO STOP>>>TURK!!! That is my older son who was 15 at the time.  He was sick and went in to bed because he has a condition which causes muscles to contract when he uses them.  Knowing this thing could not possibly be my son...as the tent is several feet off the ground and something VERY large I know is there because I heard it approach out of these acres of wooods I shout \"CODY IT'S NOT TURK!!!MY GOD!!\" and the thing immeditately throws the tent down and begins to run extremely fast back against my tent which again begins to BUMP BUMP BUMP!  against the side...and then I hear it going back into the woods with the same WHOOSH Thump sound and then the sounds of cracking branches. My son immediately ran to my tent, where we called my husband who was on his way home from his night shift job. Flash forward to this year, mid September 2011...and my son and daughter were outside of our home...and a stench began overcoming them in our two car garage which had both doors fully opened up.  My son came out to find out what was making this horrible odor.  There, in the middle of our yard, not ten feet from where the tent had been four years ago..was an enormous creature, dark fur and hug eyes lit by our porch. My other son comes to me and tells me that this is exactly the same discription of the creature he and his friend came across at our creek.  It was bent over at the edge of the creek and when they came closer...it jumped up on two feet and walked quickly into the woods. .... Now, about fifty years ago...my mother and her mother wound up in the newspaper in Madisonville Ky for a monster which nearly took the door to their rural home off one night.  She saw the monster howling and grunting at the window.  It left marks upon the tree outside their home and the sheriff made a report.  I refused to let my mother tell this story to my children...despite her swearing that it was not a bear.  I am the sort of person who likes to see things before I will believe it...and I thought it a foolish story. But, I am here to tell you...something is migrating through Doe Valley each year...and it is not something I have ever seen in the animal world before.  The natural gentle and plentiful climate here with caves and plenty of unexplored forests...I feel is its perfect home. Now, I am a believer.",
  "classification": "Class A",
  "county": "Meade",
  "state": "Kentucky",
  "location": "-86.11702,37.96027",
  "location_details": ""
}