{
  "reportId": "39382",
  "title": "Frightening encounter experienced on family property outside Naples",
  "date": "2010-04-15",
  "observed": "About this time 2 years ago, two of my friends and I were staying in my dads old trailer right off James Road, Naples Fl. It was around 9:30 p.m., when we started hearing what sounded like wolf howls. The howling become a bit terrifying when we noticed it was getting closer. We then began howling back at it, when we realized we were caught right in between these things communicating. By this time it was already 11:00 p.m., around this time small pebbles began being hurled at us from a distance. It reached such a freaky level when whatever was in the woods just 30 ft. from us was stomping and grunting at us. For some reason at some point we thought for sure it was a prank and began throwing pieces of wood and rocks, when all of a sudden a horrible silence came over us. With none of us wanting to admit we were freaking out, we suddenly mad dashed for the trailer and hid in my dad's room (end of the trailer, pointing to the woods). Trying to play it off we tried sleeping huddled together like a can of sardines. We were overcome by tears and in a frozen like state. Knocking and grunting was all we heard for about an hour, until we gave our position in the trailer when my friend whispered to me to look out the window. For the final time a deep silence overcame outside. I slightly lifted one of the curtain blinds (not sure what their called, but there a series or levers that lift and tilt depending on how you pull or twist the small stick). When I looked out, not fearing due to the fact there were no lights on in the trailer, I saw nothing but what seemed to be my reflection in the glass, I thought I had confirmed it when I tilted my head and my supposed reflection did the same. When I released the blind and was asked what I saw, I told them it was my reflection. I waited about 4 minutes, in which seemed like a millenium, I opened the blinds, I saw nothing but branches and brush. I remember slowly dropping the blind and crying myself to sleep in a way my friends wouldn't hear me. I can't explain why, but whatever was looking back at me through that window could've easily killed me considering the trailer was on an incline and bricks due to the jacks breaking. I would love to go back, which is crazy on my behalf but its alluring. I would submit to a polygraph in a heart beat to get someone out there with me.",
  "classification": "Class B",
  "county": "Collier",
  "state": "Florida",
  "location": "-81.64948,26.03808",
  "location_details": "We started in the back yard then walked a few blocks to the edge of the woods."
}