{
  "reportId": "929",
  "title": "Camper experiences odd odors and sounds, feels presence",
  "date": "1997-05-15",
  "observed": "I was camping once with my wife, two kids and my dog. Everyone had gone to sleep inside the tent. I was sitting outside with my dog watching the embers of our campfire die down. Suddenly a rock seemed to roll down the side of a slight hillside and hit the tent. I couldn't understand how that could be due to the thick trees and brush that surrounded us. Then it happened again. It was pitch dark on a moonless night near the Elwah River. I quickly woke my wife and the two of us grabbed the kids and got inside our car which was parked less that ten feet from our tent. My dog jumped up into my arms and began shaking. We sat in the car for about a half an hour. Finally, I decided to get out of the car. I wanted my dog, who could be fairly aggressive at times, to come with me but he refused to budge. He just kept shaking. I felt compelled to walk a little way from the car. Yet, I also felt foolish to be doing it. Suddenly I seemed to feel the presence of something very tall, something living and man like next to me. We just stood there together for what seemed like a time warp, an unknown moment. I could hear it breathing and could smell an unusual odor that seemed to be surrounding me. It was musky and rather foul. I thought I was imaging everything and then began to walk toward the car but froze in my footsteps when I heard my unseen companion begin walking away from me. I could slightly feel the vibrations of each footstep it made. The time in between each step seemed slightly longer than the time I would need in walking, especially when it appeared that the being was snapping twigs and limbs as it left our area that sounded as though they were fifty to one hundred feet away in a mere matter of two or three seconds. I quietly got back into the car. We turned on the headlights but nothing was around. We waited a little more but there was a certain feeling that we had all experienced that seemed to had vanished. It was replaced by a mutual sense of peace and security. The unusual smell had also drifted away. It is hard to explain. Anyway, we went back to the tent and all cuddled up quietly and went to sleep. My dog's fear also vanished at the same time ours did. I suppose it was my dog's attitude that was the deciding factor for our return to the tent. All went well for the rest of the night. However, we decided to break camp the next day and head somewhere else. There have been reported sighting of the Bigfoot around the Elwah River area from time to time and I am convinced that we were visited by one that night. I am also convinced that I was so close to one that I could have reached out and touched it without any effort at all in that total darkness.",
  "classification": "Class B",
  "county": "Clallam",
  "state": "Washington",
  "location": "-123.5864,48.0281",
  "location_details": ""
}