{
  "reportId": "28668",
  "title": "Man recalls encounter he had as a teenager near Kalkaska",
  "date": "2011-05-23",
  "observed": "I am writing this for my neighbor Bill (not his real name). I interviewed Bill on December 25, 2010, and for additional details two times again. Bill said that when he was a teenager he went with a group of 11 relatives and neighbors from Detroit camping in the upper Lower Peninsula of Michigan. They camped west of Twin Lakes in northern Kalkaska County. The group was made up of several men, about 7 boys (ages 7 to 12 years), and Bill. They arrived on a Friday morning and set up camp about 50 ft from the road and in a spot where no one else had camped. They cleared away the underbrush and built two rings of rocks for their campfires. The two rock rings were about 30 ft apart. It was early Spring because Bill recalled there were still patches of snow on the ground under the trees during this trip. In the early evening, they roasted marshmallows and hotdogs –the children sitting around one campfire and the adults around the other.  From behind where Bill was sitting, a rock was thrown into the campsite. About 15 to 20 minutes later, two more rocks were thrown into the camp in quick succession.  The rocks were about the size of cantaloupes. Each rock landed and rolled only a few feet, suggesting the rocks had been lobbed upwards rather than thrown directly into the camp. The rocks had been thrown from beyond their camp clearing. The edge of the clearing was at least 30 ft away from where the rocks landed.  With the first rock thrown, everyone thought someone from their group had thrown the rock as a prank (perhaps while taking a leak in the forest). But when they looked around and saw that everyone was at the campfires, they realized someone else was throwing the rocks. I asked Bill what their reactions were to the rocks landing in their campsite. Bill said that they were surprised and thought it was weird that someone would or could throw such large rocks but no one was alarmed. Bill said that one of the adults had a firearm in his tent, but did not get up to get it. Early the following morning, Bill got up and drove west towards State Highway 66 in order to buy some supplies. He recalls that he was driving with a learner’s permit, so one of the adults rode with him. The road they were on was a narrow hard dirt road without a maintained, clear shoulder. It was like a fire road or logging road.  Bill had driven about 10 miles west of the campsite when he saw a large animal come out of the forest on the north side of the road. It emerged from the forest on all four limbs until it reached the road. On the road’s edge, it stood up and walked across the road in two steps, the first step was in the middle of the road, the second on the other side. Because the forest edge along the south side of the road was dense, the animal immediately vanished from sight as it reentered the forest. When Bill saw the animal, the sun was behind him and still very low, the trees cast long shadows, and he was about 50 yards from where it crossed the road. So he recalls only that it was bigger than a bear, its hair was darker red than a deer, and he was impressed by the strength or force of its stride. When Bill got to the spot where he had seen the figure cross, he stopped briefly but didn’t get out of the truck because the adult he was with told him to drive on. (The adult had been sleeping when the figure crossed the road and awoke when he stopped the truck.)  Because he was driving with a learner’s permit, he was 15 years old. As such, the year was 1962. He thought about what he had seen during the rest of his trip to the store. He thought what he had seen matched descriptions he had heard or read about sasquatch, but thought sasquatch was only seen in the Pacific Northwest. He had not heard of sightings in Michigan. So when he got to the store, he asked the store owner whether he had heard of any local sasquatch sightings.",
  "classification": "Class A",
  "county": "Kalkaska",
  "state": "Michigan",
  "location": "-85.00165,44.76665",
  "location_details": "west of Twin Lakes in Kalkaska County, probably on Twin Lakes Road NE (based on the Google Earth May 12, 1994 image), east of State Highway 66"
}