{
  "reportId": "26947",
  "title": "Hunter and daughter hear chatter and find possible tracks near Escambia River",
  "date": "2009-11-21",
  "observed": "On Saturday, 11/21/09 I went squirrel hunting in the Escambia River Management Area in Escambia County Florida. I began to walk into the woods at approximately 6:00am. The area I chose to hunt is a section of woods bordering the river. As I was walking, I heard a low, guttural vocalization that sounded almost like a native american dialect, only in a much lower range than most people would speak in. It reminded me of the Samurai chatter that I have heard on your website and others. I heard the sounds for about 10 to 15 seconds, and then once again a few minutes later. On Wednesday, 11/25/09, my oldest daughter and I returned to the area to hunt squirrel. We hiked back into the woods for about a mile, and found a log to sit on amidst several promising looking trees with squirrel nests. On the way into the area, we walked a game trail and smelled that \"wet deer\" smell that you often encounter around white tails. Almost immediately upon arriving, my daughter asked if I heard what she did. I asked her what it sounded like, and she said it sounded like someone walking through the woods. I told her I did hear it, did she think it was a deer, or wild hog, or some other animal. She said \"no daddy, it sounds like a man walking\". I had noticed myself that the steps sounded bipedal. Upon leaving the area, I decided to take the opportunity to show her various signs of wildlife in the area. The game trail goes throught the middle of a small meadow. The meadow contained tracks from deer, wild hog, turkey, armidillo, racoon, etc.. There are many fallen logs in the area from hurricane Ivan a few years ago, and they have become prime locations for grubs to inhabit. This is probably why so many different types of animals are making use of the meadow. One track in particular caught our attention. It was the bare footprint of what appeared to be a large man, toe prints included. My size 13 boot is 16 inches in length, and this print was approximately an inch longer than my bootprint. The print was made in a soft mound around an ant bed. I placed my boot print in the mound as closely as I could. The surrounding ground was too hard for tracks to show. My daughter immediately assumed that it was a bigfoot track. There are stories of \"swamp boogers\" in this area, so it really did not surprise us. I took a photo with my cell phone, which as soon as I can figure out how to download to the computer, I will  be glad to provide. I put a 3\" shotgun shell in the print crossways to show the size. It was about 5\" wide in the heel, and closer to 7\" to 8\" broad just before the toes.r",
  "classification": "Class B",
  "county": "Escambia",
  "state": "Florida",
  "location": "-87.265,30.9725",
  "location_details": "Take U.S. 29 north from Cantonment, Fl. approximately 15 miles. Take first right upon seeing the town of Bogia sign (that's pronounced Bo Jee, but there really is no town there any longer). Go to end of road where camp site and boat ramps are. Hike north along the river following two track that beomes a game trail."
}