{
  "reportId": "5692",
  "title": "Father and son hear vocalizations on Peavine Mt",
  "date": "1970-09-01",
  "observed": "I grew up in Northwestern Nevada along the California border in the foothills of the Sierra's.  My father was a geologist who preferred working and camping in areas that were as sparsely populated as possible.  Between 1970 and 1983 I had a number of encounters in Nevada, California, and Washington states.  I plan to submit them individually in chronological sequence so that I can provide as much detail for researchers as possible. This first encounter occured in 1970 on Peavine Mountain Northwest of Reno, Nevada.  I was ten at the time and tagging along with my father, who was hunting deer.  We were on the Western side of the mountain, close to the California border.  We were between two ridges crossing a meadow on the Western face of the East ridge.  It was about 3:30 PM and the sun was beginning to drop behind the trees on the Western ridge.  There were no clouds and it was still very bright in the meadow, but the shallow draw between the two ridges was heavily shadowed. As my father and I neared the center of the meadow we heard an extended call coming from the West.  We had lived in Kansas until I was eight and the call reminded me of the World War II air raid siren they used for tornado alerts where we used to live.  It began low and relatively quiet and rose in both pitch and volume as it progressed.  It lasted for about fifteen to twenty seconds before rapidly dropping off.  After about ten seconds the call was repeated.  It seemed to me that it was coming from the draw a couple of hundred yards West and downhill from us.  Unlike the tornado siren I was familiar with, it had a mellow, rather than harsh, or mechanical, quality to it. As the second call ended I asked my father what was making the noise.  Annoyed, he told me that it was just the siren from a fire tower and picked up his pace.  That seemed reasonable, and I began looking around at the surrounding high ground for the tower when the call sounded a third time.  It seemed to be coming from the draw and seemed to be moving away from us. I caught up with my father and, being a curious ten-year old, asked him in rapid succession where the tower was and if he smelled any smoke.  He replied that it was on the other side of the far ridge and that they were just testing the siren.  I told him I thought the call was coming from the draw and at that point was told to shut up.  As the call sounded a fourth time, even further away, my father listened to it and then decided to call it a day.  We walked to the jeep and drove home without further incident.",
  "classification": "Class B",
  "county": "Washoe",
  "state": "Nevada",
  "location": "-119.975,39.592",
  "location_details": "The Western face of Peavine Mountain, Northwest of Reno Nevada."
}