{
  "reportId": "3297",
  "title": "Daytime sightings by hunters near Headwaters Ridge in Elliot State Forest",
  "date": "1995-11-14",
  "observed": "First let me begin by saying that I began going hunting with my Dad when I was about 5 years old.  I have spent a great deal of time in the forest.  I have been fortunate to have seen almost every species of animal that we have in the state.  In Alaska I have seen a Kodiak Bear, Caribou, Blue Foxes, Moose.  You name it I have seen it.  On the fourth day of our Elk Hunt on November 14, 1995. It was Overcast, but not raining.  There were 5 people in our hunting party.  The hunt was for 3 point or better bull elk.  I was on a treeline/ridgeline trail that was following both down the edge of a reprod unit that was approximately 15 years old. There was another ridge approximately 50 yards accross from where I was.  It was approximately 40 yards to the bottom of the ravine and an equal distance back up the other side.  I was doing the usual as I made my way down the trail.  Go a few yards stop look and listen.  From the corner of my eye, I spotted some movement off to my right on the next ridge over.  It was about 70 yards as the crow flies at the time I first saw it.  My first thought was that the hunter must have a death wish wearing that color clothes out here.  Then I quickly realized that it was not a man at all. The Bigfoot was walking upright on two feet.  It did not have four legs, but two arms and two legs.  It covered 30 yards distance in a few strides.  I still had not ruled out that it could be a hunter.  By this time it was not more than 45 yards directly accross from where i was kneeled down at.  The Bigfoot stopped in a small patch of the reprod where there weren't any small trees.  But, there was a downed alder tree that made a wishbone shape.   Like a Y.  The alder was laying on the hillside, the bottom of the Y would have been on the left side of my field of vision, the downhill side, the right side of the Y was laying on the ground, and the left side of the Y was up in the air.  Can you picture this? I could clearly see by now that this was not a man, bear or any other animal that I have ever seen before in my life.  Not in pictures, or in person.  I put my little nikon binoculars up on it and watched to see more details of it.  It did not have pointy ears that a bear would have had.  Nor the big square head.  What this Bigfoot did next amazed me, it put one of its big hands on the upper part of the alder.  Then it proceeded to swing it's legs over the alder and sit down on the alder like you or I would sit on a fence rail. Can you picture this?  It now had it's back to me.  Then it sat there, by now I was a little scared.. I knew that this Bigfoot probably had some family somewhere in the vicinity, say 1/4 to 1/2 mile of where we were.  I was pretty scared.  By now I had determined that this Bigfoot was not a man, and I had drawn my Remington Model 721 chambered in .270 Winchester on him to see him through my scope, and for extra security. The scope was a Simmons 3x9 Deerfield II.  I kneeled there on the knob where I was for at least 30 minutes and watched it.  I whistled and made attempts to make the Bigfoot turn and look at me.  I had my finger on the trigger as I watched all this time.  The Bigfoot sat on that alder and his legs were swinging like you or I would swing them on a fence rail.  The Bigfoot was reaching with his arms and picking foliage up, and I presume it was eating it.  I couldn't see for sure because it's back was still to me.  After about 30 minutes I decided that I needed to get going because It was approaching 2:00 pm and would be dark before 4:00 in the trees.  The only way down would have been to walk my ridge down and it would have crossed the trail Bigfoot was on about 100 yards downhill from where I was.  I was about 1 mile down from the beginning of the ridge.  It was a good 4 or 5 miles by road to where the vehichles would be on the bottom.  I turned heel and made my way up the ridge line trail as fast as I could, looking over my shoulder all the while.  Until it was out of my site it remained on that same alder sitting there swinging it's legs.  I walked the mile or so up the ridgeline trail to the old skid road that I broke off of to begin with.  When I got to the gravel road I never turned back.  It was about 4 miles to the bottom flats and I walked at a brisk pace.  I got down to the vehichles around 3:00 and everyone was worried that I didn't come out on the creekbed trail.  I had made this same run numerous times.  One of my hunting partners even shot a 6x6 bull within 50 yards of where I saw and watched the Bigfoot, he shot it the previous year.  November of 1994.  I have been back there to that same spot since then.  I could take you to the exact spot where that Bigfoot was. Since that experience I have seen two different \"footprints\" within a 2 mile radius of where I saw the Bigfoot at.  I was with two other people when I saw them.  I could easily fit my size 10 boot inside the print. with 2-3 inches on the front left and 2 inches on the back so we are talking about a foot like Shaquille O'Neal.  Size 20 at least.  When you respond I will have the exact road names and numbers for you.  If you are wondering credibility because it is so late in the evening.  I was on my way home and my girlfriend asked if I believed in it and why nobody could prove it.  It prompted me to get on the net and look for any sites.  I have never reported this to anyone outside of hunting party and a few close friends.  I can still picture it like it was this afternoon though.  I will never forget what I saw that day. I thank you for your time and look forward to hearing back from you.  This is 100% true and real. ",
  "classification": "Class A",
  "county": "Coos",
  "state": "Oregon",
  "location": "-123.875,43.54165",
  "location_details": "Near Headwaters ridge(8800 road) in Elliot State Forest.  The headwaters drainage basin into the Millicoma river.  Area is accessible from the 9500 road, which is the way we got there that day, via the 1000 line to the 9000 line."
}