{
  "reportId": "11453",
  "title": "Vocalizations and wood knocking in Mark Twain National Forest.",
  "date": "2005-04-15",
  "observed": "I don't know what to think.  I have visited this website many, many times and was impressed by what I have read and the research you do.  I have to add what I have experienced. First a little background on me: I am 60 years old and work for the U.S. Government.  I have been camping for most of my life and was an Adult Boy Scout Leader and Trainer for approx. 20 years.  I have been hunting for over 30 years as well.  I know the animals that inhabit the woods in Missouri. I own 80 fenced acres of private property in the Mark Twain National Forest in Dent County Missouri.  I am bordered on the southeast 40 acres by a farm and on the northwest 40 acres by a farm.  The rest is all National Forest on all sides of my property.  On my property there is a wet weather creek that almost always has a little water in it.  My property is mostly oak forest with about 10 acres of open space that was once used for grazing cattle.  There is a pine foreset on the northeast side where an old logging road is our entrance to the property. I have heard some strange vocalizations since buying the property over 3 years ago.  I have heard the same or similar sounds or \"vocalizations\" on this website.  I know what bobcat, coyote, screech owls, barred owls and most other \"forest animals and birds\" sound like and these vocalizations don't sound like any of these.  I have also heard the banging of wood on trees in the woods around me at night. I was staying overnight at this \"farm/hunting cabin\" of mine on the weekend of 15-17 April 2005.  There was a 3/4 moon out and the nights were very clear and somewhat cool (about 48-52 degrees on Friday & Saturday nights) but I had the window cracked as I like to go to sleep to the \"night sounds\".  I had just gone to bed (about 10:30PM) on Friday night when I heard the \"night sounds\" completely stop.  About 4-5 minutes later I heard an incredibly loud screech or scream come from somewhere close and from the southwest of my \"farm/hunting cabin\" (probably within 200-300 yards at the most).  About 30 seconds later there was an answering vocalization from quite a ways off and to the southeast.  This repeated 4 different times.  Each time the vocalizations got closer together and the one closest to my cabin got farther away towards the southeast.  Between the 2nd and 3rd vocalizations I heard a banging like a board was being smacked against a tree.  There was 3 load bangs from close to me and then three (almost answering) bangs from the vocalization farther away.  After the 4th vocalization (which seemed very close to each other and farther from me) all the vocalizations and tree banging stopped.  About 3-4 minutes later the whippoorwills started in and the \"night sounds\" came back to the woods. On Saturday night it was very much like the night before except there were no vocalizations or tree banging, just the \"night sounds\" ceasing and about 3-4 minutes later the window right next to my bed (on the outside this window is about 4 feet from the ground to the bottom of the window and the window is 2' wide and 3' tall) went completely dark as if something stood outside and blocked out the moon and stars at the window.  This \"blackout\" only lasted for 2-5 seconds. I don't know exactly how long for sure as I was practically holding my breath and trying to be as quiet as possible.  I even reached for my pistol just to be safe.  I had the window slightly open and DID NOT smell anything special like I have read about.  I did smell what smelled like a wet dog and there were no dogs around that weekend.  I should know as I have 2 Labrador Retrievers and a Rottweiler, none of which where with me at the time.  I did go to the door, after the moonlight came back in through the window, and turned on the porch light to see if I could see what had blocked out the moonlight.  There was nothing there and there was not even a cloud in the night sky.  I was alone at the \"farm/hunting cabin\" doing some scouting for the upcoming Turkey season.  The next morning I looked under the window and as much as 10 feet away for any sign of footprints but there was nothing there.  The ground was covered by leaf clutter all around the \"farm/hunting cabin\" and I couldn't find any trace of footprints in the dry  leaves.  I don't know what this was but if someone wants to call me they can",
  "classification": "Class B",
  "county": "Dent",
  "state": "Missouri",
  "location": "-91.41383,37.63169",
  "location_details": "Withheld at witness request."
}