{
  "reportId": "83",
  "title": "Early dawn sighting by hunters near Bass Lake",
  "date": "1988-10-01",
  "observed": "Early in the morning before light my friend and I decided to hike up a ridge and sit down where we could see a lot of area hoping to see a deer that we could bag. We parked in an area just below the ridge where when the sun lightened up enough we could easily hike up to the top in about 20 minutes. As it got light enough to see the top, we noticed someone already on the ridge wearing what seemed to be black of all things. He had no light, and no gun, and we wondered where he came from because we had been camped there for 11 days, and no one had come by that whole time. We watched him dig around in some brush for at least 30 minutes, pausing occasionaly for long periods to just stare in different directions. We joked that it was probably a hunter from L.A. because anyone would be crazy to wear just black during deer, and bear season. Then he began to walk down the hill right for us, now we never left the truck yet, and he would walk a little ways and the stop and look around just as if he was hunting, but with no rifle. He walked just like a human, so at this time there was no reason to think it was anything but a man. After a little while it was getting light enough to see even better, and he was still walking straight for us. When he was about 50 yards away we both at the same time realized we were not watching a man, but this was a Bigfoot! He walks like a man, but he was not a man. He had jet black, shiny fur, with a reddish color around where his eyes were. At this moment I was ready to run clear home in one leap! I had to see this thing up close, and he had not noticed us yet, so I tried to open the door of the truck real easy so he wouldn't notice, but that old ford truck was anything but quiet, and he heard the latch release and took one good look before breaking into a run. I tried to bring the scope up to view him closer, but this guy could really move, and I could not get my eye into the scope before he got behind a tree and nev er came out. It took all the nerve in my body to walk over to the tree, but he was not there he flat disappeared. My friend was hollering the whole time not shoot, and thought I was crazy for trying to go find him, or a track, or something. All I know is I have different kind of respect for the back woods now, and I give a lot of room between me and large objects. I was brought up in these woods camping, and hunting every year and only heard of such things.",
  "classification": "Class A",
  "county": "Madera",
  "state": "California",
  "location": "-119.6436,37.35944",
  "location_details": "The sighting took place at the end of a road leading to a trail head that leads into the back of yosemite park. The road starts 500 ft from Bowler campground going north off of beasore rd."
}