{
  "reportId": "1766",
  "title": "Family finds track and scat pile while hiking southeast of Mt. St. Helens",
  "date": "1998-08-27",
  "observed": "My family and I was visiting a cousin, a minister at a large church in Vancouver, WA, and his family. We went out to do some fishing and scouting for the upcoming elk season. Eventually we stopped at a large meadow to look for sign. As I was cutting back and forth through the meadow I spotted a scat I did not recognize. Nearby, perhaps thirty feet away, I spotted another scat of the same type. As I looked at the second I spotted a third, located fairly close to the second. All the scats appeared to be fresh. The scats were large, about five inches or so in diameter, but not the form or color of any large mammal scat that I knew.  They seemed to be composed of finely ground plant material. As I examined the third scat I suddenly realized that what appeared to be a large, humanlike, footprint was next to the third scat. I started yelling for my cousin. He never did hear me, but I finally saw him and waved him over. When he arrived I pointed to the third scat without saying a word. Before he even came to a stop he said, \"I don't know what it is.\" Then I pointed to the footprint, again without saying anything. He pressed his lips tightly together as he examined it, then simply looked at me and nodded. J., my son, and one of my cousin's sons, B., both thirteen, were playing back near the vehicle. When they saw the footprint they instantly accused us of trying to play a trick on them. Their joking assessment of the scat was that it was from B's older brother. It did look somewhat humanlike. We were pressed for time; the afternoon was supposed to be spent in Portland doing some shopping and sight-seeing with our wives and kids. I took a couple of pictures and collected the scats. We put them in the freezer when we arrived back at my cousin's house. The pictures were developed that night, but they did not turn out very well. Track details, in particular, were washed out  The track was two of my cousin's hand spans in length, about sixteen inches. Upon arriving back home in Oklahoma City, on Saturday, I began to search the Internet for Sasquatch-related sites. I found the BFRO and submitted a report. We requested confidentiality, which is why the report was not posted. We did get a lot of follow-up from researchers. I was in contact with several researchers via email, but my cousin was contacted personally and by phone.  As I understand things, the scats were shown to wildlife faculty, but no guess as to their identity was ventured. The last word we had on our observations was that they were from an area of high interest to the BFRO, and that there were plans to study the area more intensely in the future.",
  "classification": "Class B",
  "county": "Skamania",
  "state": "Washington",
  "location": "-122.015,46.10444",
  "location_details": "I'm sorry I don't have a specific distance - it was about ten miles north of a little store named (something like) Eagle's Cliff"
}