{
  "reportId": "2600",
  "title": "1996 Memorial Day Weekend Video",
  "date": "1996-05-26",
  "observed": "This event occurred on the Memorial Day weekend in 1996.  There were seven people in our party and we went camping and fishing at a very remote lake in the Pasayton Wilderness (part of the Okanogan National Forest, Okanogan County, Washington State). After fishing all day, we returned to the camp for the evening. In all, there were probaly 100 people along the bank of the lake, camping and fishing as we were.  Quite a few of these people witnessed what we did. I was building a fire between our party’s three campers. One of our friends was playing ‘catch’ with her son and dog. I heard her call out so I went around the campers to where they were playing. She told me that she thought she had just seen a Bigfoot and she showed me where, by pointing to a spot on the hillside where they saw this ‘thing.’ While she was describing what she had seen and where it had come from, this creature stood up behind a bush about 75 yards from us.  The creature just stared at us for a moment before turning and darting into the woods. At this point, many in the campground had joined us, including my wife, who brought the camcorder out of our camper. I told my wife to turn the camcorder ‘on’ and scan the woods on the hillside, thinking that it might show itself again. About 2 to 3 minutes later, it appeared another 100 yards up the side of the mountain, which was very steep and rugged terrain. The creature then proceeded to run across the hillside, between openings in the trees, jump a ravine and continued behind a knoll where it started walking.   As it approached the tree line, its upper body came back into view. My wife recorded about 22 seconds of footage of the overall sighting. I spent several more days there, doing additional research and recording, such as attempting to trace its path, compare my stride to the creature’s, and so on. I have some very interesting video footage of this support data, including what I thought were resting beds underneath some of the trees. Also, my tape has a howl on it as the creature had left our sight. Keep in mind, that I am a novice on this subject of ‘Bigfoot.’ I really did not have any idea originally what to really look for. I did not check for body odors, hairs, or anything like that.",
  "classification": "Class A",
  "county": "Okanogan",
  "state": "Washington",
  "location": "-119.7084,48.95835",
  "location_details": "Paysaten Wilderness Area, Chopaka Mountain, 3000 feet elevation, NW corner of Chopaka Lake, 5.5 miles south of Canadian border."
}