{
  "reportId": "8316",
  "title": "Father and daughter have nighttime sighting",
  "date": "2004-03-18",
  "observed": "One night in early April of 1994, my two daughters and I were driving in our car, headed west, on SR 16 near Penny Farms in Green Cove Springs, Florida. The stretch of road was lightly scattered with houses, but had mostly dense wooded areas with an occasional cow pasture. The weather was clear with a light night fog. As we approach one of the more deserted areas along the road, I spotted something off to the right hand side of the road. At this point it was not clear as to what it was. I slowed down a bit thinking it may be a dog or animal. I've commonly seen many nocturnal animals along this stretch of road in the past. As we approached somewhat closer, it stepped out into the path of the car. We, at this time, were moving approximately 20 MPH as the animal came in to direct headlight. I was stunned to see that which I had assumed would be a raccoon, actually stood at least 6 to 7 feet tall, walked on two legs, and was covered with brown hair, (was somewhat skinny). I completely stopped the car as it crossed the road. A car coming in the opposite direction stopped as well. I almost could not come to terms with what my eyes were seeing. My oldest daughter, which was nine years old at the time, said \"oh my gosh! What is that?” It crossed the road quickly into the thick brush on the left hand side of the road. Once again she said \"Dad, what was that?\" I sat there with my mouth hanging open, then tried to think of what to say that wouldn’t spook her. We had just passed a cow pasture about 30 feet prior, so I babbled, \"I a...a...a think it was a cow.\" We drove silently for a few miles. The whole time I'm thinking to myself, \"You just saw a Skunk Ape\". She then turned to me and said, \" Dad, cows don't walk on two legs... Looked more like a Bigfoot to me.\" I stuck with my ridiculous \"cow story\" until she was much older. She's now 18 years old, and we've laughed about the cow story for years. These days we both use each other as our witness that on that April in 1994 we both did truly indeed see a Bigfoot. My youngest daughter was asleep in the back seat during the entire event. But she says she has seen plenty of cows anyway. Cows... INDEED!",
  "classification": "Class A",
  "county": "Clay",
  "state": "Florida",
  "location": "-81.80005,29.98085",
  "location_details": "SR16 near Penny Farms in Green Cove Springs. About a 1/2 mile from CR218. Green Cove Springs is located approx. 16 miles south from Jacksonville ,Fl."
}