{
  "reportId": "20677",
  "title": "Resident describes possible vocalizations near Robertsville.",
  "date": "2002-10-09",
  "observed": "I was living with my daughter and son-in-law while my new home was being built. They live just down the road from me. A friend of mine had asked me to drive her to Montana at that time, so we left and I was gone for at least a week.  When I returned, it was around 11:00 at night somewhere around the first part of October 2000. I parked my truck down next to the barn area and walked up towards the house.  Off to my immediate right I heard this hair raising guttural growl.  My mind was racing...was this one of my nephews bull cows, or was it a deer, but none of those fit anything like that sound. I thought my feet would never get me to the door of the house. This sound was done once again. I finally went in and told my family what I had heard. My son-in-law insisted that it must have been a bear. I have hunted all of my life and know all of the animal sounds, including a bear. The next morning I called the Conservation office, and they put a gentleman on the phone and I related to him what had happened. I even made a similance of the sound the best I could. He said that he and his wife go to Alaska all the time to study bear and he had never heard anything like that and it definitely wasn't a bear. The next night, my other daughter and I were upstairs getting ready for bed around 11:00 p.m again and had the windows open. I heard the same sound again out my bedroom window. I quickly turned out the lights, and my daughter crawled from her room to mine to see if she could also hear it. By then, the sound had stopped. Several days later in the eveming, my grandaughter, grandson, and I believe another grandson were playing outside the garage door which was raised up about 3 feet. They heard this loud guttural sound also very close to the same place I had heard it originally and rolled under the garage door as fast as possible. Since that time, several of my family have had some very scary encounters with this sound near their houses. We live in a very wooded cedar and hardwood area with a year round creek. I would like to relate all of these incidents, but they are fairly numerous. I would be glad to tell you, and introduce you to the ones who have had these various experiences. These creatures have lived in this area for many years. My youngest son who is in college now, was out hunting with his friend. They were both about 11 years old at the time, and were hunting up a powerline when they saw what they thought was person, but realized it had hair on it like a gorilla, and it was shaking a fairly good sized cedar tree, which we assume it was trying to shake something out of it. They both turned and left the woods very quickly.",
  "classification": "Class B",
  "county": "Franklin",
  "state": "Missouri",
  "location": "-90.7,38.40685",
  "location_details": "[Details removed by witness request]"
}