{
  "reportId": "38619",
  "title": "Couple hear possible moan howls one afternoon at Eagle Rock Cemetery",
  "date": "2012-12-24",
  "observed": "My girlfriend and I were standing in a graveyard on a ridge top in Eagle Rock, VA. on Dec 24.  It was rainy overcast day at approximately 4:50 pm.   We were paying respect to my families graves when all of a sudden we heard a guttural call sound come from about, what I estimate, 100-150 yards away, if that far up the mountain from us. It was low and lasted several seconds. There were 3 distinct calls in the initial call. My girlfriend looked at me and said, \"what was that?\"  I started to answer her with an \"I am not sure\" response when it called out again, 3 distinct calls.  She said, \"is that Bigfoot\".   I said \"I am not sure, I grew up in the woods  and Had never heard anything guttural like that before and I have heard a lot\".  I could see the fear in her eyes.  I looked around and told her, I am not sure what it is but look at all the dogs, they know exactly what it is.  There was a very large dog about 100 yards away over the ridge, that was frozen in place and staring in the direction of the sound.  There were 2 other dogs, one on a chain on the porch of a house and a hunting dog on a chain about 75 yards away from us.  Both of those dogs were frozen in place looking in the direction of the sound.  Not one of the dogs barked.  The hunting dog was the closest to the sound and it was still and quiet. My girlfriend said what do we do now?  Before those words were finished coming out of her mouth, I was trying to make the same sound back at whatever it was but I only did one guttural call instead of 3.  She said oh my God Ernie. It was quiet for 5 -10 seconds after my call and then it responded with another single call like I had just done. I thought I heard something moving. When it responded, a rooster crowed right behind us and then the rooster and chickens with it ran off the hillside behind us.  My girlfriend wanted to leave and go to my grandfathers and that sounded like a good Idea, however; I wanted to see if I could get close enough to see what it was. I convinced her we were safe in the car. So we got on the gravel road that went up to the water tank farther up the mountain, very close to where the sound had come from.  On the way up we  passed the dogs, They were standing still and looking up the mountain. When we got to the water tank I wanted to get out but my girlfriend asked me not to.  I listened to her and frankly happy that I did, since I didn't have anything for protection.  I had the windows down hoping to hear it again.  There was silence and then the dogs started barking at us.   That told me whatever had scared them must have been gone then, so we left.  The hunting dog that was standing still when we went passed it on the way up the hill was spinning around and flipping he was going so fast to try to get at our car. I didn't see anything but heard much.",
  "classification": "Class B",
  "county": "Botetourt",
  "state": "Virginia",
  "location": "-79.79759,37.64224",
  "location_details": "Directions from Route 220. Cross the James River on James St. Take right onto route 43 (Church Street) into Eagle Rock. You will pass the Eagle Rock Fire Station on your left.  The next road to the left is Indian Lane.  Go up Indian Lane to the top and the graveyard will be on right, and gravel road to the water tank is on the left side of Indian Lane."
}