{
  "reportId": "41825",
  "title": "Bear hunter unnerved by thrashing in the bushes by unseen animal near Verlot",
  "date": "2013-08-07",
  "observed": "Me, my wife, and our 7 year old son were out for an evening bear hunt up to Coal Lake last night. We hadn't seen any sign of life at all the entire night covering several roads off mountain loop hwy, this was no exception. We stopped at the outhouse there at Coal Lake and walked up to the lake, at the time I thought it was weird that there was no wildlife at all. I mean none, no birds, nothing. After looking around a bit we got back in the truck and headed down the hill. We drove about 1/4 mile and found a small pile of scat in the road so I stopped to look at it, that's when I got a feeling that I was being watched. I went back to the truck and grabbed  my rifle and continued to look around. As I cleared the rear of the truck and approached the edge of the bank I started hearing some thrashing below me. I got excited thinking we found a bear but the longer we sat the less excited and more uneasy I got. The thrashing didn't move unless I moved. I worked my way down the road past the front of the truck trying to see what was making the noise but couldn't see it. I did get really nervous at this point because the thrashing followed me down the road. I have hunted elk and bear in Montana and Washington my whole life and never had one parallel the road with me nor be that close without growling. I was very well armed with a sidearm and a heavy magnum rifle but I had no interest in exploring this more. I don't know what it was, probably nothing, I do believe bigfoot is real however it never crossed my mind till my son told us that it was  not a bear it was Bigfoot.  But I can tell you it felt like my blood went cold.",
  "classification": "Class B",
  "county": "Snohomish",
  "state": "Washington",
  "location": "-121.5186,48.10892",
  "location_details": "East on the Mountain Loop Hiway from Granite Falls, then left on Coal Lake Road and approximately 5 miles to road end and the lake."
}