{
  "reportId": "3461",
  "title": "",
  "date": "",
  "observed": "[Note: This submission is edited slightly from the original, for readability.] We were camping for Thanksgiving week. There were 3 adults, 2 teenagers and 2 small children. My 14 yr old son was outside in the night getting me something from our SUV when he turned to see what he described as an 8' tall humanoid shaped figure walking south in the half-moonlight. He had no flashlight to look closer but when he saw it/him/her (I'll just call it an \"it\") he got scared and ran into the trailer where we all were. The weather was fairly cold (just a little above freezing if I remember right) and it was just after a sandstorm had passed through the two days before. All was clear with few clouds in the sky that night. Once inside he told us and we laughed and thought he was joking so we suggested that perhaps, because of it's size, that it was Bigfoot. I have a friend who knows/knew some people and had heard of at least 4 Bigfoot sightings in the [mountains] over the last decade or so it was not unheard of to know of Bigfoot sightings in the desert even though they usually live in forested areas. We have, within an hours drive of there, many forested and wooded areas in the mountains all over New Mexico and it is not a far reach to think they would roam outside their territory on occasion... especially in the dark of night. So after we got a good laugh my nephew, age 18, took his flashlight and they stood just outside the trailer looking to see if they could see this 8' tall figure my son claimed to have seen. Just then, although they didn't see anything, they heard a very large growl, like a warning sound or angry sound type growl, along with a shuffling of the dirt, or digging of the dirt with a foot(?) which reminded my nephew of a bull scraping the dirt with it's foot just before it runs towards you. The boys both freaked out completely and ran inside the trailer, falling down and slamming the door behind them all at the same time. They were yelling and said that  it was outside. I asked a series of questions and I could plainly see that Derek was totally freaked out and absolutely unwilling to go back outside. I suddenly got this feeling that we were in danger. We just stayed inside peeking out the windows with flashlights trying to see anything. We locked the door to the trailer and our friend (who sleeps in his car) locked his car during the night. The boys drove back to Las Cruces to spend the night because they were too afraid to stay and my nephew had to work the next morning. We didn't check the area until the next morning, but any tracks from the day before, including our own, were erased by the blowing sand.",
  "classification": "Class A",
  "county": "Dona Ana",
  "state": "New Mexico",
  "location_details": "To the east of I-25 a mile or two, north of Ft Seldon exit"
}