{
  "reportId": "8680",
  "title": "Boys hear moaning call from bedroom window",
  "date": "1980-07-27",
  "observed": "We were up late at night in a second-story bedroom of my grandparents’ Dee, Oregon, home, at about 2:00 AM in the summer of 1980.  There was a full moon.  My brother was practicing taking photographs of the moon.  He was taking pictures from our south-facing window (no screen) that looks out over a beautiful orchard landscape in the Hood River Valley that leads up to the foot of Mount Hood.  The window is above a long, straight, east-to-west gravel driveway that leads up to a detached garage.  The property is approximately 1 acre. Everyone else was already asleep in adjacent rooms. My brother and I were up late talking while he took pictures.  He probably had the window open for about 30 minutes.  The bed was to the side of the window.  He would get up from the bed, move toward the window, prop his elbows on the windowsill, and steady the camera for some photos.  Then he would sit back down on the bed and use his flashlight to adjust the settings on the camera and replace spent film.  We kept the lights off in the room so he could get good shots of the moon. My brother was at the bed when we suddenly heard a very loud, strange, human-like vocalization that sounded like a slowly rising, low-pitched moan.  As the pitch rose, it seemed to get louder like whatever was making the sound was approaching closer.  Everything else was silent.  It really sounded very close to the house, like it was nearing the window, which seemed strange and scary because we were on the second story.  The sound seemed very focused in our direction.  This eerie moan made us both freeze! After about ten seconds of being petrified, my brother shot up out of bed and slammed the vertically-opening window shut.  He later said that he quickly looked toward the source of the sound before shutting the window.  The moan seemed to come from the line of orchard trees in the shadows about 20 feet from the house along the south edge of the driveway.  But he did not see anything unusual.   We nervously muttered to each other, “What was that!?”  We listened for more, but the moan had stopped.  We were too afraid to open the window again.  My brother waited a few minutes, and then shined his flashlight from the closed window into the orchard.  But we saw and heard nothing the rest of that night.  We went into the orchard the next morning but found nothing unusual in the area of the sound. We told our family about what had happened, but they said that they had been asleep.  They brushed off the story because we were just teenagers at the time.  We have been trying to explain that night ever since.  We thought that it might have been someone playing a weird prank on us.  But we were only summer visitors to the area and had never met any of the neighbors, the nearest home being about a half-mile away.   We considered that it might have been some strange animal.  But it sounded semi-human, and unlike any sound we had ever heard.  Of course, there has always been the ghost theory. We never thought that it might have been a Bigfoot until recently, when we found out about www.bfro.net and heard the 1994 Ohio Field Recordings from Columbiana County (WAV Format, 1350 KB).  It is the same sound we heard!  I got chills the first time I listened to the recording (I still do).  I was immediately transported back to that night in Dee, Oregon.   If we would have known about the possibility of it being a Bigfoot, we would have searched for more evidence, or perhaps we would have been more bold during the encounter—easy to say in hindsight though.  This story has been in our family ever since that night.  Now we have a good explanation!",
  "classification": "Class B",
  "county": "Hood River",
  "state": "Oregon",
  "location": "-121.6444,45.5775",
  "location_details": "The event occurred at my grandparents' former orchard residence in the small town of Dee, Oregon.  My mom was born and raised in Dee, later moving to California as an adult.  My grandparents have been gone for over ten years now, and the orchard is now in possession of another owner (not known).  There is still someone living in this location, although the actual home has been replaced by a new structure.  The orchard still looks about the same.  The property is about an acre in area."
}