{
  "reportId": "3044",
  "title": "Second-hand report of creature looking in at woman through window",
  "date": "1975-09-10",
  "observed": "Over, I think, 20 to 25 years ago, a woman in LaCresent was doing her dishes at night and looked up to see  what was a large hairy faced man looking into her window that was over her sink. The police were called and a hunt for the window peaker insued.  An officer on the police force, saw a large man, over 7 ft. tall, run across the highway.  He notified the desk.  They searched.  Tracks were found. they were very large with a sizable stride. La Crosse Wisconsin then turned into a  hot bed of bigfoot hunters.  A man from I think Colorado came to La Crosse to look at the prints. He said that what ever made them was not wearing a false shoe because of the distribution of the weight in the print cast as well as tracks that went down to the river.  If someone was running around with a red ape suite on they were crazy. It was deer season in Jackson County and over in LaCresent Minn. Want to die, put on a suite of hair and run around in areas where people are hunting.  Who knows what it was. No proof only the sighting by a policeman, woman, and the tracks. Heck they had dogs out..everything. Nothing was tracked down. Vanished into the Mississippi bottoms. I have been down in the McGilvray Bottoms north of La Crosse, right on the Mississippi up by Trempealeau. I have hunted back in this large swamp for big swamp buck. When I get back in their  I have felt something with me. I felt it on several occasions. I walk, it walks ( and I know the difference between a deer and a person). I feel like something moves when I do. If I sit down for two to three hours, something moves around out there. Never find tracks. I have hunted for many years all over. I leave it at that. If their is something like a cleaver ape, it may travel along the Mississippi bottom land country. Its thick, swampy, and no one  goes there except to maybe hunt snakes, ducks, or deer. It is wet, thick and the Magilliary is where I would go if I wanted to stay out of sight, especially when hunting season starts. Thats when I have heard what ever it was. It stayed with me twice. I walk, it walks. I have never seen anything though nor found one print. Believe me, Ive looked.  Its Hunting season again in Wisconsin, Think like them. ",
  "classification": "Class C",
  "county": "La Crosse",
  "state": "Wisconsin",
  "location": "-91.33662,43.98694",
  "location_details": ""
}