{
  "reportId": "15923",
  "title": "Daylight sighting by mountain biker in Black Hut Management Area outside Glendale",
  "date": "1998-10-15",
  "observed": "The exact date was October 15, 1998. I was training for a mountain bike race and this was to be my last ride prior to the race. I was riding at the Black Hut Management Area in Glendale,RI. Along for the ride was my three year old mixed breed (shepard/lab)large dog. It was sunny but cool and I planned to spend an hour or so breaking a swet. As i weaved my way through the trails, i had to leash my dog to cross a street. After I unhooked him we started up a hill toward a chasam. It's small and kids hang around there and drink beer, have fires etc. At the crest of the hill I could see the top of the chasam (approx. 50 yards away). Out of the corner of my eye I noticed something that first appeared to be a dirty white blanket perhaps hung on a small tree. Suddenly (I think it heard us)it turned (as it was squatting with it's back to me)saw me stood up and disapeared into the woods. I was shocked and could not believe what I had just saw. From my vantage point I would say the animal was white or grey but very dirty. In no way did it resemble a man. I did not see the face clearly. But from what I did see (full rear view) although it stood fairly erect, it's gate and posture was like an ape. The arms were not long like a gorilla and oddly it was no were near seven-feet tall. I'd estimate maybe six feet at best. I reversed my direction and rode immediately to the top of the chasam. I looked for footprints and hair but didn't find any. I walked a short distance in the woods in the direction were it disapeared. My heart was pounding so loud I could hear it. I knew it was no were in the general area because my dog was not barking. Anytime there is an animal near fox, coyote, deer, my dog barks and will usally chase. Interesting point is that my dog never barked and I don't think he saw, heard or smelled it. I noticed no unusual smell in the area. And also noted no signs of broken branches and no way to determine its direction. I've told one or two people and in November of 1998 a friend and I (with video and digital camera) spent two weekends hiking in the area directly behind the chasam with no results. I also snow shoed the area after the first snow. I was starting to believe I had imagined it. In 2002 I met a hunter in a bar and asked him if he ever hunted at Black Hut. He said \"yes\", \"and once I saw a white gorilla there! I had chills and related my story. The differences were in color, he stated white (the one i saw was more grey) and said the one he saw was eight feet tall. Still, same place same type of sighting. What made me write this is the two other RI sightings seem to be similar. I wish I could have seen it longer and closer. ",
  "classification": "Class A",
  "county": "Providence",
  "state": "Rhode Island",
  "location": "-71.6568,41.98067",
  "location_details": "From route 102 N or S. Take Spring Lake Road. Follow there are multiple points of entry in to the reserve and a general parking lot at the end of Spring Lake Road."
}