{
  "reportId": "9506",
  "title": "Camping couple hears loud nighttime vocalizations near Knoll Lake.",
  "date": "2004-10-08",
  "observed": "We always try to get as far out as possible and this past weekend we went in a little further then last. It was on Friday the 8th of October when we got to our location we set up camp in less than an hour and we were just enjoying the views looking forward to some relaxation... We got our fire started about 7:00 pm because it was getting really chilly about an hour later we were talking away just shooting the breeze when We heard something from a distance I turned to my boyfriend and I said shh, listen and sure enough clear as day the most sharp clear screams just came over the wilderness as if it was so clear. We counted them and finally they ended at 12 being the last scream count. The final two of the screams sounded most horrible from the other 10 you can immediately hear the difference it was as if in pain a painful scream. That was it for me to scare me half out mf my witts begging my boyfriend to please explain to me what the hell that was as if he could give me an answer, but all he could say is I have no idea. It seemed as if it were a distance away east of us the steep canyons I am sure carry sound further then it really is but I would estimate it at being 1 to 2miles away all I know is it was clear and carried through the woods. what in the wordl would have a pair of lungs like that? If I had to choose animal or human animal would be off and human no way not that scream in the niddle of no where. Now, I know that they're are plenty of animals in the wild and I know they all have their own distinct sound, but this was unlike any animal I have heard.. we went down the list of known animals that inhabit the Arizona wilderness and as we marked each one off it became more clear to us that was neither animal, bear, mountain lion, elk buggle sheesh even havelina,which are only in the more lower elevations and in more desert terrain. nope, there is no way. When we came back from our trip it was all we could talk about there and all the way home. Just to mention I didn't get much sleep after that,     that night we came home and I put in one of my videos on bigfoot just to hear the audio on one of the recordings and we both just looked at echother like wow! too similar to discard the possibility. since then I have heard all I could get my hands on of any audio I could find. Now looking at my maps of the United states and keeping track of sightings from all over it doesn't seem impossible that they could be here  with New mexico and Texas around the corner why not. Next time I will be taking my tape recorder. I won't be caught off guard again that is for sure and will pursue leads as they come to prove he can be in any dense wilderness in any state. Thank you ",
  "classification": "Class B",
  "county": "Coconino",
  "state": "Arizona",
  "location": "-110.9986,34.4274",
  "location_details": "From Tempe az Take beeline hwy east to hwy 87 NE go through town of payson take hwy 260 to woods canyon lake pass woods canyon lake up to knoll lake an additional 20-25 miles once at knoll lake you proceed further pass the lake east old dirt roads go in all directions hard to explain. you follow the one heading east to it's end that is the site we were at."
}