{
  "reportId": "13033",
  "title": "Local hunter hears multiple screams after dark outside Sundance",
  "date": "1998-11-02",
  "observed": "It was the second day of deer season and I was going to try my luck in the Black Hills. It's the last chance hunt in this part of Wyoming for deer. There was a good snow a few days before. I had an old 64 Ford van and I put a shanty heater in it though the roof vent. I drove down Grand Canyon Road to Williams Gulch. I had to shovel out an area to park the van. I didn't go up the Williams road because the van was only two wheel drive and didn't want to get stuck in the snow. I parked where Grand Canyon and Williams Gulch road met. I got fire wood that day and hunted up the ridges. I had my dog with me and got ready to spend the night. I ate something and sat in the van enjoying the wood heat. The wood stove was doing its job all to well and had to open a side window on the van. Soon after I heard a strange screaming noise outside. I still had my boots on so I went out the back doors of the van to hear it again. I grew up in upper Michigan and been in the woods all my life camping hunting etc. This was something I never heard before. It sounded like a WHOAAAAAAAAAAAA that lasted for about 20 seconds. If you hear something that long it sounds like it last forever. It seemed to be some ways away and when it stopped you could hear echo off the ridges. What had me frightened was the volume of it. Whatever made it had on hell of a lung capacity. Afterwards my dog would not come out of the van. It screamed about four or five times. that night I just laid there on the cot wondering what the hell it was. The next day I didn't see one deer and that in its self is strange for the Black Hills. I don't know what I heard and I'm the type of person that only believes what I see bigfoot ufo etc. There is nothing in North America that I know of that makes a sound like that. To me it's an unexplained scream but it's been bugging me for years.",
  "classification": "Class B",
  "county": "Crook",
  "state": "Wyoming",
  "location": "-104.1665,44.4165",
  "location_details": "From Sundance Wyoming east on I-90 take Moskie Road county 207 to Grand Canyon Road  north to Williams Gulch Road."
}