{
  "reportId": "24975",
  "title": "",
  "date": "",
  "observed": "My in-laws own a couple hundred of acres that butt up against the Shawnee National Forest in Southern Illinois. There were about 12-15 of us gathered around the fire pit chatting around 9pm, it was completely dark at this time. My wife's uncle, myself and her cousin were helping set up a telescope to see the sky. As we were doing so we heard a large object in the woods near by, about 50 yards away. We were on alert because there had been a 280 lb mountain lion shot in the area just weeks before our visit to the family property. We kept shinning flash lights into the woods, but saw nothing. As we continued to set up this telescope, we had a big rock thrown in our direction. We all looked at each other and thought the people around the pit had thrown it, but then realized that none of them were dumb enough to do so, seeing that we were setting up a $10,000 telescope, and they wouldn't want to hit it. About 5 minutes later, another rock landed in our direction. We heard the sticks and leaves moving, but saw nothing in the woods. We didn't have the most powerful flashlights, but also the woods are very thick and deep. This time about 2-3 minutes later a 3rd and final rock came flying in, closer to our location. We saw nothing, but heard something large moving through the woods. We had 3 dogs with us, and they never once showed interest in the woods. Although they were dead tired and laying around the fire to keep warm themselves. We went back to the fire pit and everyone claims that no one had thrown a rock in our direction. Later that night, around 1 a.m., we heard a loud high pitch scream. As avid hunters, non of us had heard that type of scream before. I have heard recordings of supposed Bigfoot screams, but I can't recall if that's exactly how it sounded. I just remember it being a high pitch scream. The next day I went looking for foot prints, but the leaves and coverage was so thick, I really couldn't make anything out. I'm not claiming to have seen a bigfoot, but you might want to check the area out if you guys do searches. I have seen 1 or 2 other reports in the Shawnee area. It might be worth checking out.  In the  years I have been visiting this family land, this is the first time I have experienced this.",
  "classification": "Class B",
  "county": "Hardin",
  "state": "Illinois",
  "location_details": ""
}