{
  "reportId": "2457",
  "title": "",
  "date": "",
  "observed": "The sighting was witnessed by my brother and a friend. My brother told me of the sighting shortly after it happened in the winter of 1992.  He has retold it to me a few times over the years, most recently on New Years Eve '98. The story is always the same and never changes.  My brother was in high school at the time and had been at a party.  The party was supervised by parents at a friends house so there was no drinking envolved.  His friend was driving the family van. After the party, the two boys drove a girl home that lived west of Columbus around the Youth Camp Road area.  After dropping the girl off, the boys proceeded east on the road, back towards State Road 46.  My brother states that \"something\" crossed the road about 50-80 yards in front of the van.  He said it walked out of the woods on the left side of the road, crossed the road, and entered the woods again on the right.  He said the headlights caught a climpse of it as it was re-entering the woods on the rightside of the road.  He said it was completely white and furry.  He said that they drove for about 5 minutes in silence without stopping.  After about 5 minutes, my brother's friend said \"What the hell was that?\".  My brother said \"I don't know.  I was afraid to say anything because I thought it might have just been my imagination\".  According to my brother this is the EXACT dialoge spoken.  He said it was big, tall, and covered in white fur.  He told me that he didn't see it clear  enough to tell if it was \"Bigfoot\" like or huminoid, although he said it was about 6ft. tall and walking upright on two legs.",
  "classification": "Class B",
  "county": "Bartholomew",
  "state": "Indiana",
  "location_details": "This incident occured on \"Youth Camp Road\" around the Bartholomew/Brown county line west of Columbus, Indiana.  \"Youth Camp Road\"  is about 4 miles south of State Road 46 that connects Columbus to Nashville,  Indiana. Columbus is about 6 miles east of the sighting."
}