{
  "reportId": "2998",
  "title": "",
  "date": "",
  "observed": "Had been riding horses with three other friends on the six hour loop trail and stopped for lunch where the outhouse is located at the one day trail junction. We were all sitting at the picnic table having lunch and was hearing much crashing in the brush. Not unusual sounds for there are elk everywhere in the park. We did notice however that a \"bear\" or something had an awfully good time with the outhouse toilet paper, as it was strung all over the place. We all were sitting there having lunch and I decided that I wanted to go see where the elk were, maybe see a big bull! So I got on my horse and rode down to where I heard the noise and the trail is cut out on an old logging road and a creek crosses through a culvert to the other side of the road and the water forms a small pool before moving on down into the larger creek below. I could not tell you how long I was sitting there on my horse watching this creature not more than 30' away trying to get a drink of water out of the pool. It was a challenge, as the sides to the pool were fairly steep. At first, I thought it was a man, then a monkey, and at last my brain registered what I was looking at! Then I seen the finger nail, and it was black and human like. I was looking at an adolescent, possibly baby Bigfoot! It never had a chance to turn and to look at me, as the horse I was on kept getting more and more upset the longer that I stayed there. I ran back on my horse to my friends and told them in a stuttered manner what I had seen! Just by the way I was acting they knew something was up, because I have been in the woods on horseback almost half of my life. The immeadiately followed me back to the area where I had seen what I described as a young adolescent Bigfoot. My friends did not ever see the creature, but they heard it as it walked away and seen the ferns moving as it rustled through them on its way down the hill to the larger creek. Never heard any sounds from him/her. My friend was going to follow and I cautioned her, because I believe that \"Mom\" was close by. The crashing in the brush we heard was not made by the adolescent looking creature, it was made by something much larger. The creature was silver-gray, had medium length hair (like a bear), black human like fingernails, human like hands (I seen its thumb), was totally covered in hair from top to bottom (I never got to see its face, it was always looking down). I never have told anyone about the sighting and made my friends promise not to say anything for quite a while. I explained that this was a young animal and to allow me to get this close was inexperience. And if I could get that close on a horse, than someone could get that close with a gun! It was not long after that there was a news report about a son and a father seeing a Bigfoot cross the road near Prarie Creek State Park. The news report was within a couple of weeks of my sighting, but still I kept my sighting to myself!",
  "classification": "Class A",
  "county": "Humboldt",
  "state": "California",
  "location_details": "On six hour loop trail for equines in the Redwood National Park, Orick"
}