{
  "reportId": "36514",
  "title": "Father and son are approached by three large bipeds while fishing at dusk west of Asbury",
  "date": "2012-09-21",
  "observed": "I took my son Myles fishing behind Sundown Mountain ski resort. We turned west off of Asbury road on to Twin Springs Drive, where there is access to the stream. I had been promising my son some night fishing. We sat on a couple of buckets facing south, to the rock out cropping and wooded area across the creek. We were fishing in the deeper water across the creek near the rocks. We heard sticks breaking and rustling which I assumed were coons, as this is a good coon area. Then we noticed something larger coming toward the other side of the creek from a distance. Thinking that this is one of many deer that we often see, thought nothing of it until we caught sight of it in the back-light of the city or moon from the other side of the hill we were facing. This was a large bipedal animal, very unlikely to be a person, this time of night without a light (although we were fishing without a light source also). It came up to the top of the rock out cropping direct across from us and stood between two trees. It then squatted down and just sat there watching us. My son was scared, and I was intrigued. Within 10 minutes another came to join the first to his right and stayed just across a ravine. No more than 6 minutes later another came from the south, just to the left of the one squatting across from us. As this one got close, it let out a piercing shriek. Nothing like the calls that are heard on the TV shows. This was high pitched and frightening. The other two took notice and began to move toward the shrieking Squatch. At this point we had had enough and grabbed our fishing gear and ran back to the truck. The GPS location is as follows: 42.514765,-90.842826",
  "classification": "Class B",
  "county": "Dubuque",
  "state": "Iowa",
  "location": "-90.84215,42.50969",
  "location_details": "Public access area, secluded, running water, and wooded"
}