{
  "reportId": "1240",
  "title": "Sighting near Yellowstone Park entrance by two witnesses cutting wood",
  "date": "1997-11-02",
  "observed": "I was cutting firewood in a designated timber cut area with my brother approximately half way between Cody and Yellowstone. We were south of the highway, very near the north bank of the North Fork (an easterly-flowing tributary of Buffalo Bill Reservoir). The timber in this area is not dense and affords good views of the high north-facing mountain slopes south of the river. Shortly before sundown I noticed movement high up on a slope across the river. At first I concluded that it must be a bear or elk and pointed it out to my brother. My brother fetched the binocs from the pickup to have a closer look, as we are hunters and like to keep track of where we see elk. At first he seemed startled in that he didn't recognize what he was looking at. Rather than jump to a conclusion, he handed me the glasses and asked me to look. By the time I got the glasses up, the animal had disappeared into the tree line and I couldn't see it. Shortly after, I noticed it again lower down on the slope in a clearing, moving all the while. At this point I would estimate the creature at a quarter mile from us, moving closer (downslope towards the river). This time I got a good look at it through the glasses. It was definitely upright, walking on two legs. Though there is no way to say at this distance, the specimen appeared to be between 6 and 10 feet in height. More striking, however, was its mass. The creature, covered in dark hair, almost seemed fat. Maybe obese. This was no bear. I saw it walk for a good 100 yards and it never came down on all fours. There is something on the North Fork that I have sure never seen before. About half an hour after my last sighting, we were loading the truck. The chainsaw wasn't running so we could hear reasonably well (the river makes some noise). Right before we left (almost completely dark) I heard a high pitched, eerie squealing noise coming from a few hundred yards up river. I have never heard anything like it. Though it is about the right time of year still to hear elk bugle, this was no elk.",
  "classification": "Class A",
  "county": "Park",
  "state": "Wyoming",
  "location": "-109.7935,44.45584",
  "location_details": "Along the North Fork of the Shoshone River, on the road from Cody to the east gate Yellowstone entrance."
}