{
  "reportId": "2470",
  "title": "",
  "date": "",
  "observed": "In late summer, 1978, (specific date is being researched), the Sheriff telephoned me regarding a previous night report from a youth who related he and his girlfriend saw a sasquatch.  A deputy responded to the called in report about 11 PM the evening before and took a short report but developed no further information.  As much for curiosity as anything I located the reporter of the incident and secured a tape recorded statement. He related he and his girlfriend has returned to her home located on the east side of lake Sullivan at about 11 o'clock PM and were talking, she sitting on the car right fender and he embracing her.  The car was parked facing west towards the rear yard, security light, low stock fence and bean field behind it.  At the same time both subjects observe a large biped animal type creature appear under the overhanging outside light about 100 feet away.  It initially was crouched over, then stood up, stared at the two observers, hesitated for a few seconds; then stepped over the fence and disappeared into the soybean field to the west.  Horses in a field next to the lake to the west were heard spooked and running.  The creature appeared to be eight feet tall, covered with hair, eyes were distinctive.  Next morning search of the bean field determined impressions in the dirt but were not distinctive - it had rained during the night.  There was no further supporting evidence other than the girl's mother states the couple were very shook when they ran into the house to call the Sheriff.  I interviewed the youth 10 years later on a whim to determine if there was a different story or to per chance get a denial of the original report.  To my surprise he retold the account in precise detail as compared to the original.  A separate report initially seeming to have no connection was reported to the Sheriff the morning after from Hymera, a small town eight or nine miles northeast of the sighting location regarding a rabbit hutch had been torn completely apart by perhaps a vandal.  All rabbits were gone.  The rabbit hutch site is directly through the country from the alleged sasquatch sighting connected with coal stripped lands and creek bottoms that feed Lake Sullivan",
  "classification": "Class B",
  "county": "Sullivan",
  "state": "Indiana",
  "location_details": "1/2 mile north of the Glendora Road Lake Sullivan causeway, near Sullivan, Sullivan County, Indiana, USA."
}