{
  "reportId": "3588",
  "title": "Hunting party hears vocalization, wood knocks; finds elk carcass, off Gold Camp Road near Victor, in Pike Nat'l Forest",
  "date": "2001-11-05",
  "observed": "In November 2001, I was guiding for a husband and wife team and was also accompanied by my own wife during a elk hunt. That morning we had located a herd of elk in some remote country and had stalked to their location to find that it was only cows. Since we had bull tag only we did not pursue but instead went out on the point of a mountain to glass for any potential bulls. As our party was sitting and glassing I called periodically hoping for a response from a bull. To my surprise (all of our surprise) we heard a low guttural moan. At first I thought it to be a bull bedded down but the second time I realized that it was no bull at all and could not possibly be a bear. I immediately went toward the noise to confirm what ever had made it and found no animals, no elk, deer, bear, etc. Shortly after hearing and investigating the sound I moved the party up the mountain to a aspen grove where I knew mid-day bulls would visit to eat. Shortly after positioning the hunters my wife and I took a position higher up the mountain to get a better view and for calling. After sitting in the grove for less than an hour we heard logs being hit together. Not like two bulls fighting but more like someone taking a sizeable log and hitting against another. The end of the day came and we returned to the camp and the hunt was over. That night two inches of snow fell and I went back to the same location and found a dead cow elk with only her chest cavity being open and from what I could tell having most of her internal organs. I am of course no expert in zoology or cryptolgy [sic] but from my best guess and knowing what I have seen from the past I think that my hunting party and I disturbed a bigfoot while hunting that morning. I did find tracks but due to the sun melt the tracks were very large with no distinguishable marks. This took place only 8 to 10 miles from the previous sightings.",
  "classification": "Class B",
  "county": "Teller",
  "state": "Colorado",
  "location": "-105.0354,38.71145",
  "location_details": "It was off Gold Camp Rd., two miles east of the watershed road."
}