{
  "reportId": "14534",
  "title": "Multiple witness sighting in daylight in a remote area near Holden",
  "date": "2006-07-25",
  "observed": "This happened when I was still very young, perhaps it was 1953. The location was Holden Washington. My neighbor friend and I were playing in a sand box down by Miners' Creek. (Dad worked for How Sound Mining Co.) I looked up and saw a person in a fur coat across Miners Creek. It was Aug or late July and was hot outside. He was stepping from bolder to bolder and looking down at the waters edge making his way down stream toward us. I went and got my dad who collected a couple other adults and a pair of binoculars and went down by the Creek. I probably remember this incident because I saw the man in the fur coat first but none of the adults would let me look through the binoculars. I do remember them arguing about what it was they say. \"Can't be a man.\" Can't be a bear they don't walk like that and step from bolder to bolder.\" I remember that it was at a bend in the creek west of the Mine. Big scree field on that side of the Creek ment that there was not an easy way to get over there. The Creek flowed from the South West and turned East at this bend. That is if the valley runs East and West. The Creek was really noisy so didn't hear the men yelling for attention but did finally look up and noticed us. He turned and walked back up the creek. He walked back into pure wilderness;there is nothing to the Southwest of Holden WA. Dad is deceased so I can't ask him about it and wish I did. I am putting this report in because my sighting was in the middle of a blank spot on your map of sightings. Sightings ring it. He walked away swinging his arms like that tape of Big Foot that came out and was played over and over.",
  "classification": "Class A",
  "county": "Chelan",
  "state": "Washington",
  "location": "-120.7772,48.19923",
  "location_details": "Take a boat or sea plane to lucerne and up the road to Holden Village and follow the Creek until it bends southwest"
}