{
  "reportId": "7954",
  "title": "Boater finds footprints on bank of Rogue River",
  "date": "1975-09-15",
  "observed": "In the lower Rogue River canyon, about 10 miles above Agness, Oregon, I found some odd tracks while on an outing with my great grandfather.  The plan was to pick huckleberries and fly fish for steelhead.  I was about 10-12 and got bored picking berries real fast.  I was old enough grandpa would let me row the boat alone but not use the motor so I went back to the boat and rowed as far up as I could 'til the current got too strong, beached it, and hiked a couple hundred yards up the bank through a big boulder pile at the bottom of a steep clay bank.  Between the bottom of the clay and edge of the water was a rock shelf with the boulders lying on it, about 20-30 feet wide.  The river had dropped overnight and there was a layer of mud about an inch, maybe 1.5 inches thick on the rock shelf.   Just below the pocket I was going to fish I noticed a set of large tracks coming out of the water, crossing that ledge, and heading up the clay bank. Back then, the minimum size limit was 8\" for trout and we all had notches cut 8\" up in the cork in our rod butts as a guage to know which fish were legal.  Using that, I guestimated the tracks at 24-1/2\" long and 8-1/2\" wide.  I didn't measure the heel, but the foot didn't taper as quickly as a human foot.  I guestimated the stride at 6-1/2 feet using the 8-1/2 foot length of the rod. The stride didn't appear to shorten as it went up the bank, it just went up.  I don't think I could have climbed that bank without a rope, it wasn't vertical, just very darn steep.  There was no sign of whatever it was using the short shrubbery to boost itself along, either. Whatever it was, was very strong and very very surefooted. The track dimensions seem wrong, but I don't see how they could have been faked, nor does it make sense to fake them there where nobody would be likely to find them",
  "classification": "Class B",
  "county": "Curry",
  "state": "Oregon",
  "location": "-124.0255,42.6425",
  "location_details": "It was a short distance into the wild section of the Rogue River not too far above Foster Bar, and immediately on the south bank of the river."
}