{
  "reportId": "37758",
  "title": "",
  "date": "",
  "observed": "I have had several experiences over the years near my home. Five years ago I was picking blackberries on the back side of my property, late June. To the east of the blackberry vines is a farm field.  The field was planted in corn and there was a strip of last year’s corn reside at the edge of the field, old stubble, hard to walk through with boots on. There were a series of  footprints coming out of the field, moving towards the woods. There were five prints, about my size, men’s 11 or 12, bare foot, wide with no arch, flat footed. I go barefoot a lot, but no one in their right mind walks through a corn field with stubble in it barefoot. Four years ago, my son and I were in my bedroom, watching videos on my computer about six in the evening when something passed by my cabin and beat on the wall as it went by. Scared us to death. The pounding started near the corner of the room we were in, near the ceiling. This is a good ten feet above the ground level outside. The second hit was in the other corner of the room, the third hit sounded like it came from above the window in the den and the fourth and fifth hits were on the bathroom wall. Quick, BAM BAM BAM BAM BAM! I live in a log cabin and it literally shook the house. Next morning I looked around outside, no prints and nothing on the logs. It was in July/August. Ground was dry and hard. I have ruled out the house settling, small animals, birds, etc. No idea what it was. This year, May/June 2012 about ten thirty at night I was getting ready for bed, my son was in the bathroom. We both heard a low, very guttural grunt, “HOOO” outside the house. My son is eighteen years old and a large muscular young man but he came out of the bathroom pulling up his jeans and looking scared.  We ran out onto the porch in time to see something large, dark, and low to the ground run past my neighbors house. Truthfully, it looked like a gorilla running flat out on all fours. It activated my neighbor's motion sensor lights in front of his home and about thirty seconds later the coyotes on the other side of the highway went nuts. It was moving, quarter of a mile in just under a minute. The next day my father said he also heard the grunt, it woke him up.",
  "classification": "Class B",
  "county": "Macoupin",
  "state": "Illinois",
  "location_details": ""
}