{
  "reportId": "4790",
  "title": "",
  "date": "",
  "observed": "Hello my name is Tracie Q., and I am 35 yrs. old.  It has been over 25 years, back in the late seventy's, and my family and I can still remember, to this day, what we saw and heard during our motorcycle outings in the mountains.   At one time, we use to have a cabin off of Sly Park Road in the Pollock Pines area, and we would ride our dirt bikes at least 50 miles a day never coming across the same logging trail twice. Well, the first time, we were on the trail walking, instead of using the bikes, towards plum creek. My cousins and my sister kept hearing things around us, and I remember my parents saying it was nothing just enjoy the walk. We all would hear branches breaking, and things that a child, at that time, would think to be very scary. Well, this time, we came across a large tree which had fallen within the last few months. This is where myself and my family, still to this day, give Robin my oldest sister hell. Our parents were behind us and my Sister, being a smart ass goes up to look at this jelly like substance.  She puts her finger in it, and tasted it. Well, it was not jelly, but blood, and this is what makes this about bigfoot. Just on the other side of this log, my parents who had just ran up to see what we were all talking about, found this large, and I do mean a large foot print. We realized we were looking at something that was made by a large animal/human. My Uncle who is a big man, he put his boot next to it, and the size of it made his foot look like a kids footprint. If I remember right, they were saying it had to be over size 16.  This was a fresh footprint and the blood was still wet, and all I can remember, was that we all started back towards the cabin like there was no tomorrow.  Now we can't say that the blood was from bigfoot, but I know there was a large footprint. There was more than one time we came across something strange like that. Another time, I remember we were all on the bikes, and this time, we were either coming from or going towards the old ranger station that was located on the top of the mountain.  Where you were are able to climb the stairs to the top, which was over 3 or 4 stories high. Anyway, I want to say this was towards Grizzly Flats. I kept all of the old maps so that I could share the places we went with my kids one day. Well, there was a little snow left on the grounds that day, and we were taking a rest. My Mom has a thing for being the first one to step in fresh snow, so she goes off doing her thing, and all of a sudden she starts calling my Dad, not yelling, but you can hear it in her voice to get the hell over to her now.  When every body arrived at her location, there was this huge print, and it was human looking. The only thing about it was, that it only had one big toe. It was like it had all the others toes cut off, or just never grew them in the first place.  This print wasn't as big as the first one that I had seen. I think we saw them about a year or two apart, so it was not the same day or anything like that. There were other times when we would be riding, and you could hear something like voices, but not voices if that makes since.  My Uncle eventually sold the cabin and we stopped going up there.  Now that I live here in the Sacramento area , I have driven back to Jenkins Lake area several times and find myself sitting and wondering about everything that my family and I had seen up there in the mountains.  We never really told anyone about what happened, do to the fact that some people just plan don't believe.  Well I could tell them to stick it, because we are not crazy.  I know what we saw. We also would come across some old mines up there, and while at some of those places, you could feel like something was watching you.  I have tried to get back to Plum Creek, but a lot of the roads have been closed off.  What a shame there were so many beautiful places that are tucked deep into those mountains west of Lake Tahoe.  Well I feel kind of silly, but I just feel it was time to share these stories with others who believe.  Please feel free to contact me. I could tell you in person and my Mom and Sisters would also, but Dad is no longer with us.  He could have pointed the locations out on our old maps, just maybe my Mom can, but I can't say for sure.  Thank you for taking time to read this.",
  "classification": "Class B",
  "county": "El Dorado",
  "state": "California",
  "location_details": "I just know the first time was towards Plum Creek, which is still marked on our map. The second time was off a logging road deep in the El Dorado Mountains towards Grizzly Flats"
}