{
  "reportId": "38873",
  "title": "Dusk sighting in the middle of the road by a husband and wife while driving outside Cedartown",
  "date": "2012-07-15",
  "observed": "Last year during the summer my wife and I were leaving work. We were riding together in my car leaving the Cedartown Ga airport where we skydive. It was about 7:00 7:30 in the evening the sun was starting to set, not dark but getting there. We were driving down Old Rockmart Rd headed to Rome Ga where we live. Old Rockmart Rd is the back way home about 15 miles long surrounded by woods, trees, fields, and pastures. My wife and I were talking back and forth about the day just driving home. Its starting to get dark and as we come to a straight away about a half a mile long with pastures on both sides of us fenced in, I see something big and black in front of us about 10 to 20 yards in my lane of the road I thought it was a cow so i slammed on the brakes at that time this figure (BIGFOOT) stood up from a crouched position standing about 8ft tall with long black hair turned and looked at us. I think the brakes squealing scared it, but it looked at us, the lights shined right on him. He covered his face from the head lights, he took about 2 steps into the side of the road where there was a fence post about 5 to 6 feet tall, put his left hand on the fence post and easily hopped over the fence and took off. Our windows were down, it made no sound plus couldn't hear over the sound of the car. But I could smell something dead or garbage, it smelled bad. He was about 8 feet tall and way bigger than a cow. But this was not a cow, I know what I saw, he was on two feet walking and hopped a fence and ran toward the woods. I was shocked at what I saw and so was my wife. This is my second sighting of bigfoot in the same state about 40 miles from my first sighting. My wife and i were speechless for about 15min. I could see his face looked human but wasn`t, he was all black but face and hands looked like dark grey, his hair was all black long and matted, had dark eyes and very strong massive arms and legs.",
  "classification": "Class A",
  "county": "Polk",
  "state": "Georgia",
  "location": "-85.16238,34.05198",
  "location_details": "Old Rockmart Rd between Rome and Cedartown Ga off of Hwy 101 and Hwy 278."
}