{
  "reportId": "25233",
  "title": "Bowhunter recalls hearing possible intimidation at night while returning to camp in Farmington Canyon",
  "date": "1977-08-22",
  "observed": "This story that you are about to read has a lot of similarities to some stories you might have already read. It was in August of 1977. It happened on a hunting expedition in Farmington Canyon, Utah. There were four in the hunting party. Everyone was away from camp hunting. There are two lakes where this occurred. The sun began to go down to set. It was an archery hunt so normally you would sit wherever you were because that's when the deer or the elk come out. Every hunter's hopes are that he is going to see something before it gets dark. On this particular evening, nothing seemed to come out from the landscape. So I proceeded to move slowly back down the trail towards camp, which was set up just below the lakes. It was to dark now to see any of my other hunting companions. No moon was in the sky, just stars. I had positioned my self above the upper lake. I knew the area quite well. As I proceeded to go back, I had to cross a little creek that came out through a marsh below the upper lake. But being that it was dark, I couldn't really see the trail. But I could hear the water gurgling in front of me. As I came to this spot in the trail I new I had to make the right moves or I would end up in the water. I sat there trying to adjust my eyes to see where to make the next step. While I was standing there for a few seconds, I started to hear a low growling noise. I have never heard a noise like this. I never believed in Bigfoot. When I heard the noise I thought it was one of my companions playing with my mind hiding in the bushes. So I not very loudly muttered under my breath, \"Steve...Mike....is that you?\" Not getting any answer I could hear the trees start to thrash and that noise came back again with a deeper growl, almost like a moan, low in pitch. As I stood there it seemed like an eternity but was only about five minutes. I knew I had to be making a move. I had to take that trail that lead through the bushes. With my bow in one hand I held my breath and jumped to big leaps across the creek, landed half in the water and yelled out a couple of loud words and ran through those bushes. I never stopped until I reached camp. When I got back to camp. There was nobody there. So I put my bow against the tree and proceeded to get a flashlight out of the tent. Within a few minutes everyone was back at camp. We all talked about what we had seen and what we had heard. Then I talked about what I had seen and what I had heard and everyone had a hard time believing my story. They thought I probably heard a cougar. But I have been hunting for many years and I know a cougar when I hear one. About a half hour later, another friend pulled up in his truck. He was going to spend the night with us. He brought his dog. We fixed something to eat and crawled into the tent. We told a few stories and then drifted off to sleep. About the middle of the night, the dog started to growl in the tent. It started to growl at first and we tried to calm him down. It was pitch black outside except for the stars in the sky. The dogs growl began to pickup. We tried to hold the dog down, then it started to growl and bark. We finally got the dog down on the tent floor when we could hear something outside the tent. Something then brushed the side of our tent. The dog immediately jumped up and started to bark. The dog barked for about 30 minutes and then it seemed to settle down. The area where we had pitched the tent was in tall grass. There wasn't much dirt or barren trails. The next morning we inspected for tracks to find out what it was. But the grass was so tall we found nothing. The noise that I heard that night, has made me a believer of what lurks in the woods.",
  "classification": "Class B",
  "county": "Morgan",
  "state": "Utah",
  "location": "-111.8189,40.9744",
  "location_details": ""
}