{
  "reportId": "22802",
  "title": "Man recalls spotting a sasquatch watching him while hunting deer north of Grand Rapids",
  "date": "2008-10-06",
  "observed": "This occurred in western Michigan November of 1978, when I was about 13 years old. I lived in Cedar Springs, Mi on Myers Lake Road near 17 mile rd. The land today is a golf course. At the time, this was all rural farm land and woods. I hunted all around western Michigan when I lived up there. One evening while whitetail deer hunting, I was sitting in a cut corn field with about 5 or 6 inches of snow on the ground. It was just turning dusk. I had been sitting in this field for about an hour and a half. I was sitting on the ground leaning against a fence post looking over the field. There was a low wooded area behind me. All of a sudden, the hairs on the back of my neck stood up and I felt very uneasy as if something was watching me. I did not see anything although I was trying to be still while hunting. This feeling was not going away and I moved to look behind me and at the edge of the trees there was a Sasquatch standing there looking at me. It was dark brown, about 7 ft. tall, with hair about 6 or 7 inches long and the face was a little lighter than the rest of the animal. I turned back around quickly and thought to myself that what I saw couldn't be. I had not known anything about big foot at the time. I had a .35 Marlin rifle with a Tasco 3x9 scope on it. I turned back around to get a better look and it was still standing there just staring at me. I looked through the scope (he was standing about 150-200 yards away from where I was) and it definitely was a Sasquatch standing there. We looked at each other for about 2 or 3 minutes and I got increasingly scared of it, although it never made any indication of hostility. I got up and ran out of the field and across the road to my house. I did not tell anyone about the sighting until I was about 23 years old and was hunting with one of my best friends. There were reports of a 'Skunk Ape' on our hunting land in Southern Georgia on the edge of the Okefenokee Swamp. We often heard it screaming at night and supposedly the DNR cast foot print molds of it in the area. I then told my friend of my sighting as a child because I didn't think I would be ridiculed.I moved to North Florida in 1979 and have resided here since then. I know absolutely without question that they exist due to my experience. I really hope that it is proven some day.",
  "classification": "Class A",
  "county": "Kent",
  "state": "Michigan",
  "location": "-85.41,43.21",
  "location_details": "Just West of Myers Lake Rd and South of 17 Mile Rd."
}