{
  "reportId": "9018",
  "title": "Campers driven off mountain by unseen intruders",
  "date": "2004-06-01",
  "observed": "Two friends and I went camping in the San Juan National Forest just east of Lake Vallecito on 6-1-04. DC and I were from out of state but JG was a regular camper there. We went 12 miles up the forest service rd. and picked a campsite. We saw no one else that day and it was a dead-end road. JG said it was the first time he'd been there alone. We spent the day hiking around and cooking meat over the campfire. We did not see or hear anything unusual that day other than a partial horse skeleton. At about midnight, we were winding down when we heard three, 2-tone howls to the hill approx. 1/4 mile to our north. We knew it was not a coyote but almost sounded like a person trying to imitate a coyote because it had a deeper bass tone. About five minutes later, we heard the same thing again. Then I heard something like a gunshot in the same area but there was no sonic crack. It was like something hit a tree really hard. Both sounds came from the same place as the first set of howls. We were all standing around the fire wondering what it was. JG had his shotgun in hand and we were all starting to get a little edgy. We all are police/former police/former military so it takes a lot to get any of us \"edgy.\" We all have camping experience and none of us had ever experienced anything like this before. About five minutes later, directly to our west, was a very loud 2-tone howl approx. 100 yds. away. It howled again and it was closer so it was closing in on us. DC and I drew our pistols and flashlights and all of us focused on the logging rd. that it/they would have to cross to get to us. There was a bright full moon so the open areas were well illuminated. It howled one more 2-tone howl before stopping at what we estimated to be 50 yds. away in the woodline. It seemed like it covered at least 50 yds. going through the woods while howling three times. Whatever it was was BIG and LOUD! There was a lot more bass to the howls than a dog/coyote/wolf has. Each time it howled it was 2-tone, in a series of three and it seemed unemotional or intelligent. About a minute later, another series of three 2-toned howls came from the hill to the south approx. 1/4 mile away. It seemed to be answering the one hiding in the treeline in front of us. Then the one in the treeline let out three more of the same howls. Let me stress again, this thing was LOUD! We were all pretty shaken. We felt that we had aroused at least three, big things that were communicating among themselves and closing in on us. We were all facing out from a dying fire with weapons and flashlights drawn. We didn't know if we were being studied or they were getting in position for attack. We decided to leave. After some debate, we decided to pack the trucks while one of us took turns watching with flashlight and gun. A few minutes later we were packed and headed down the mountain to the main rd. We did not see or hear anything while packing or leaving. When we got to the road, we stopped to unload our guns and stow them legally in the trucks. There was one house close to the road and after a while the dogs started to bark. I joked to JG that \"they\" were coming after us. Just then, we heard another set of howls about a mile back the rd. we'd just come down. Whatever it was had followed us and we left immediately. We were not sure what it was that night but after talking about the incident quite a bit, we think we had a Bigfoot encounter. It was a remote, wooded, mountain location with a large lake over the hill. There were at least three intelligent beings communicating that sounded loud and large. We had been leaving our scent all around and had been cooking meat all day. No person would be crazy enough to risk getting shot playing a prank on us. The howls were very eerie. Like I said, they were all like the first 2-tones of a wolf howl but much deeper. There was no trailing off like a dog/coyote/wolf howl, just 2-tones. Each 2-tone howl was in a series of three howls that took approx. 5-6 seconds per series. The only thing missing from the encounter was the lack of the famous Bigfoot stench. There was no wind so maybe the thing in the treeline was far enough away for it not to reach us. We are not out to hoax anyone. We hope none of our colleagues find out so our day to day judgment is not questioned or ridiculed. This was the first time any of us had seen any of the other ones scared. We just felt that we had to share our experience for what its worth.",
  "classification": "Class B",
  "county": "Archuleta",
  "state": "Colorado",
  "location": "-107.4667,37.38334",
  "location_details": "The encounter took place above Beaver Meadow Spring in the San Juan National Forest east of Vallecito Reservoir. The camping area is accessed by taking Forest Road 604 from CO 160 and proceeding due north via a welter of forest roads."
}