{
  "reportId": "24530",
  "title": "Possible protest attack on an elk hunter's camper (vehicle) in Fishlake National Forest",
  "date": "1988-09-04",
  "observed": "September 1988, I was in the Fishlake National forest hunting with my wife and new born daughter, I also had 3 friends with me but they were in a separate vehicle pulling a trailer. We were Archery Elk hunting. We pulled off the main road and went on a dirt road as far as we could until we came to a small group of trees and so we pulled into those trees and set up camp. My friends found a spot about 100 feet from my camper and set up there. It wasn’t a very level area and so I found some big rocks and drove my truck up on to level it out. We spent a couple of days there and nothing unusual happened. The last night we were there around 1:30 am in the morning my wife and I were woke up by something hitting the side of my camper; my truck was a 1986 full size truck and an 11 foot camper. The hit on the side of my camper was so hard it’s hard to explain. My wife and I were both immediately awake, like I said the hit was so hard that my first thought was that the truck has slipped off of the rocks that I had used to level it. Anyone that has done that before can imagine how much that would rock your vehicle to have you slip off of the rocks all of a sudden. The camper actually rocked back and forth about 6 inches. My daughter remained asleep however my Black lab that is usually ready to bark at any noise outside was shaking in her bed. I tried to get her up on to the floor of the camper and she would have nothing to do with that, she just sat there and shook. I got up and stood up in the camper wondering if I should go outside and see what had happened, not knowing what had happened I really wasn't afraid or anything. I peeked out of the blinds and couldn’t see anything, there was a storm in the distance and the lightening was getting close. As I was watching outside, there was a flash of lightening and it lit up the immediate area around my camper. All I saw was the long grass around the camper; nothing unusual. After about 20 minutes I returned to bed and got under the covers. My wife and I talked for a few minutes about what we thought it was, we thought of everything from a tree branch falling and hitting the camper to a bear hitting it. We just didn’t know. Just as I am about asleep again, BAMMM another hit on the side of the camper. Same place but a lot harder this time it rocked the camper so hard that the doors under the sink actually came open and pans slid out on to the floor making a bunch of noise. I was wide awake and standing up before I knew it. Something was outside! This has been 20 years ago and as I’m writing this I have goose bumps on my arms, I have never been so scared in my life. My dog was shaking like crazy; my wife wasn’t going to get out of bed. I made sure the door was locked. Since we were Archery hunting you can't have any firearms so all I had was a knife. The blinds were shut and I was too afraid to look out. My wife kept saying, “Look outside or look out the emergency exit!” NO WAY! Like I said, I have never been so afraid in my life. To this day I think that not looking out was one of the biggest mistakes that I have ever made. I would give ANYTHING to have that chance back. Nothing else happened the rest of the night. When we awoke in the morning I was very cautious and opened the door, the sun was just barely cracking to the east and the sky was a dark blue. I opened up the door and looked at the ground. The grass around the camper was trampled done but that could have been from us the day before. There were no tree limbs lying next to the camper, as a matter of fact as I look at where the trees actually were it would have been impossible for a limb to fall and hit us. There were no rocks or anything lying around the truck. Then I looked up at my camper. There on the side of my camper was a huge dent. I am 6 feet tall and the dent was so high on my camper that if I stood next to the camper and tries to touch the dent I almost had to jump to reach it. This wasn’t an ordinary dent; it was about 8 inches in diameter about 3 inches deep. It actually dented the aluminum and broke the wood underneath it causing $400 damage. I went over to my friends trailer and knocked on the door, they opened the door and the first thing out of their mouths was \" what were you doing walking around our trailer last night? I told them what had happened and that whatever was walking around their trailer wasn’t me. He said he heard me slam my door during the night. I told him that I hadn’t opened the door that the noise he heard was something hitting my camper. I have known these friends for many, many years and I trust them completely. I have had people say that it was my friends playing a joke on me. They completely deny that and I do trust them, and why would you ever play a joke on a friend by damaging his camper and pounding on the side of his camper while his infant daughter and wife are asleep inside? I consider myself a sane person. I have hunted bears in Montana for a long time, I have killed several bears, I know how big and powerful bears are and for the record I have to say there are bears in the area that we were camping, not many but some. in my opinion there is NO way that a black bear could reach as high on my camper that the dent was, and then to hit my camper in the exact same spot 30 minutes apart. There just isn’t any way that this was a bear. I know that bears are strong, but to hit my camper with so much force would be impossible for a black bear.",
  "classification": "Class B",
  "county": "Sevier",
  "state": "Utah",
  "location": "-111.6631,38.8204",
  "location_details": "I-70  Goosberry road exit and then 10 or so miles up the canyon to Hoo Doo canyon.  Very thick trees mostly Quaking Aspens,"
}