{
  "reportId": "652",
  "title": "",
  "date": "",
  "observed": "About a week or two after summer vacation started between my eighth and ninth grade years, my brother and I walked down into the woods not too far from our house, on the outskirts of Sandy, Oregon. There was a trail that was used by kids in the area to get down into the woods and a little way off the trail, my brother and I had hauled a little wood and built a little platform about six feet up in the crook of a tree. That day, around noon, we were in that platform, shooting our BB gun at a tall stump that was just a little ways down hill from where we were. My brother turned around as I was preparing to fire and just as I was ready to shoot the BB gun, something with a human-like head passed right in front of the tall stump. The trees and brush obscured everything but the head, but I got a good look at it. It had brown fur over almost all of the head, but not dark brown, just a little darker than cinnamon color, a kind of flat nose and the hair/fur was not too long. It walked by and disappeared into the brush almost without making a sound (there was a very heavy bed of needles from the Douglas Fir all over), it happened so suddenly and so fast that I didn't have a chance to get scared. I called my brother's name and he turned in time to see some of the branches still swaying. We stood there and talked about it for a few minutes and then carefully went down to where it passed in front of me and figured that it had to have been about 7 1/2 feet tall. After this, I went to my former eighth grade science teacher who happened to live in the neighborhood (this was a town of about 1,200 at the time) and told him about it. He was very skeptical and gave me numerous things that he thought I'd seen. He obviously didn't believe I had seen a Sasquatch/Bigfoot. Later that same day, around dusk, my brother and I were sitting on the trail, not too far from the \"tree fort\" that I had seen it from earlier in the day, talking about it. Suddenly, I'm not sure what made him do it, but he looked over at the platform that we had built (about 20 to 30 yards away) and his face turned white as a ghost. I looked over there and saw a sillouette of a\"man\" looking at us (head and shoulders) from behind our tree fort. Since it was dusk, we weren't able to make out any features, just the outline. Also, we both jumped up and ran the rest of the way home, scared half out of our wits. The second sighting we had that day, the creature didn't seem anything but curious about us, but it still scared us. Also, two years later, I was down in the woods at almost midnight (I'd left something down there the previous day) and heard footsteps coming towards me and a huffing noise, almost like a horse blowing. I dropped my flashlight and ran the 3/4 mile home in record time. We looked for footprints after the first sighting, but due, I believe, to the ground cover, we found none.",
  "classification": "Class A",
  "county": "Clackamas",
  "state": "Oregon",
  "location_details": "The woods are located behind \"Skyline Mobile Park\" off Sandy Hieghts Road. If you turn into the trailer park and head straight to the end (it's a small one), then walk through the drain field, you will see the woods. There is a small stream at the bottom of the hill, through the woods, called Tickle Creek. Those are the woods we used to spend a lot of time in and the ones we had the sightings in. I haven't been there in years, so I'm not too sure what the area is like now. I do know that Sandy has grown incredibly over the last 26 years."
}