{
  "reportId": "451",
  "title": "Young man has sighting near home",
  "date": "1993-08-20",
  "observed": "I WAS 17 YEARS OLD, IAM 24 NOW. IT WAS LATE SUMMER, AND MY GIRLFRIEND'S PARENTS HAD GONE OUT FOR THE NIGHT AND HAD ASKED ME TO STICK AROUND AND LOOK AFTER HER AND HER YOUNGER BROTHER. I LIVE 5 MILES WEST OF ELKMONT,AL AND 1.5 MILES SOUTH OF THE ELK RIVER. I WAS IN THE LIVING ROOM AND HAD JUST GOT OFF THE COUCH WHERE ME AND HER LITTLE BROTHER WERE SITTING TO LOCK THE FRONT DOOR. I WENT TO THE BATHROOM. I CAME BACK OUT AND SOMETHING JIGGLED THE DOOR KNOB I HAD JUST LOCKED 1.5 MINUTES BEFORE I WENT TO THE BATHROOM. MY GIRLFRIEND WAS IN THE KITCHEN MAKING KOOL- ADE.WE SHUT THE LIGHTS OFF AND LOOKED OUT THE WINDOWS BUT DID NOT SEE ANYTHING. I GOT US OUT OF THE HOUSE AND RAN TO MY PARENTS HOUSE TO CALL THE POLICE. AFTER THE CALL WAS MADE, I STEPPED OUT OF THE HOUSE WITH A FLASHLIGHT AND MY SHOT GUN TO INVESTIGATE THE SITUATION. THE MOON WAS FULL AND I NOTICED AN OBJECT STANDING IN THE FIELD BEHIND MY HOUSE. AT THE TIME THE WEEDS IN THE PASTURE HAD GROWN UP BECAUSE OUR TRACTOR WAS BROKE DOWN. I AM 6 FEET TALL AT THE TIME AND THE WEEDS WERE OVER MY HEAD. I SHINED MY LIGHT TOWARD WHAT I HAD SAW IN THE LIGHT OF THE MOON AND SAW A CREATURE THAT TOOK THE SHAPE OF A HUMAN BUT WAS MUCH TALLER AND MUCH LARGER IN SIZE THAN A HUMAN. IT WAS AN OFF-WHITE COLOR AND HAD VERY LARGE AND WELL DEFINED MUSCLES. I DROPPED MY LIGHT TO DRAW AIM ON THE CREATURE, AND RAISED MY LIGHT TO FIND THE CREATURE GONE. I TOLD THE POLICE WHAT I HAD SEEN AND THEY TOLD ME THAT MY MIND WAS PLAYING TRICKS ON ME. I WAS VERY ANGRY AND WENT DOWN TO WHERE I HAD SEEN THE BEAST AFTER THE COPS HAD LEFT. THE WEEDS WERE AL MASHED DOWN. I WAS SURPRISED TO FIND THAT THIS WAS NOT THE LAST TIME I WOULD SEE THE CREATURE. I HAVE SAW IT AT HANNAH-WARD BRIDGE, AND HAVE SAW IT ON SULPHUR CREEK. EACH TIME IT DID NOT SEEM TO TRY TO HARM ME, BUT JUST STOPPED WHAT IT WAS DOING TO WATCH ME AS THOUGH IT WAS JUST AS CURIOUS OF ME AS I WAS OF IT.                                                                                                                                                   SIGHTINGS: ELK RIVER NEAR VAUGHN HOOLOW, HANNAH WARD BRIDGE NEAR VETO, AND SULPHUR CREEK NEAR ELK RIVER.                                                                                              TERRAIN:  MOSTLY HILLY AROUND RIVER BOTTOMS AND ALWAYS AROUND WATER.                                                                                              DATES: 1993-1996                                                                                                DESCRIPTION: APPROXIMATELY 7.5 FEET TALL WEIGHS 475 POUNDS, LARGE WELL DEFINED MUSCLES, VERY ATHLETIC, COLOR OFF WHITE",
  "classification": "Class A",
  "county": "Limestone",
  "state": "Alabama",
  "location": "-87.02025,34.9263",
  "location_details": "5 MILES WEST OF ELKMONT ON MORRIS RD INTO VAUGHN HOLLOW"
}