{
  "reportId": "2219",
  "title": "Children chased from woods by a seven foot tall creature",
  "date": "1978-06-15",
  "observed": "I was 12 years old and visiting friends (13 year old twins) who lived in this mountainous area. It is not very densely populated, and most inhabitants of the mountain are members of the family. We were walking into the woods but were still within eyesight of two houses and a field. The boy and I noticed it about the same time. We saw a tall (about 7 feet tall), bulky, lumbering figure coming toward us, from about 30-40 feet away. It was lumbering upright but was hunched over. It had a very large head. It was coming toward us. We turned around and ran toward the clearing, yelling for the girl to follow us. It chased us and got to within probably 15 feet of us. It stopped before the edge of the woods. We didn't see where it went, because we ran until we were out of breath, well away from the edge of the woods The boy and I were trying to come to terms with what we had seen. We both agreed it looked like a cross between a man and a bear, or a man in a bear suit. For some reason I associate the color blue with it, as well. The girl said she never saw it, but she actually ran out in front of us. The boy and I didn't get a good look at facial features, as our main goal was to get the heck out of there. I do recall its face was hairy, not smooth. I do not recall any type of a noise, though I vaguely remember a strong, musty animal smell. I do not recall if we told any of their family what happened. I am thinking that we thought no one would believe us, and he and I were so very certain about what we had seen and experienced that we did not wish to have to defend ourselves. The fact that WE knew what had happened was enough. I did tell my parents, who thought it was a little incredible but never said that they didn't believe me. To this day, 19 years later, the only other person I have told is my husband.",
  "classification": "Class A",
  "county": "Stephens",
  "state": "Georgia",
  "location": "-83.4192,34.6423",
  "location_details": "Approximately (as best I can recall) from Toccoa, about 5 miles west on GA 123, then north about 5 miles. I do not have a map that has this specific road on it, but I can try to track one down."
}