{
  "reportId": "7464",
  "title": "Deer hunter describes possible stalking on Pigeon Mountain.",
  "date": "1974-11-01",
  "observed": "I was deer hunting on Pigeon Mountain and was following a group of deer when I shot and wounded an almost solid black buck with a large rack. The buck followeded a well worn game trail and I had trailed the deer by blood drops. It was getting dark and the terrain was getting to difficult to continue and I had no light. I had to turn and come down the mountain. I began to feel like I was not alone, there were none of the normal animal sounds (birds, squirrels,ets). I heard something coming down the mountain taking a parallel path I was taking. I could not see any thing. There were limbs breaking, leaves rustling and then I would hear nothing. I had unloaded my gun for saftey and reloaded because I had never heard an animal move threw the woods like this one. Myself, one other person and the owner were the only people allowed to hunt in the area and the terrain it was using was to rough for a human to travel much less move at the speed this animal was. One minute it would sound like a raging bull and the next minute it would move down the mountain not making a sound. I heard a grunt and a growl. I was terrified and felt as I was being stalked by something I had never encountered before. When I stopped so did it. When I moved slow, it moved slow. When I moved faster, it moved faster. I was most worried when I would hear nothing. I reached the base of the mountain and had taken a wrong turn and had put myself infront of a large briar patch, I did not let that stop me. I dove threw the briars cutting and scratching myself. I finally reached the saftey of my truck and once again heard the grunting noise from behind me. I did not return to look for the buck I had shot or ever hunt in that area again. I did not ever see anything, but something large was in the woods that night. I have not felt safe in the woods since. I had hunted, fished and farmed in the area all my life. I felt as though I knew all the animals in the woods and the sound they made as they moved. I was taught to stalk hunt by an employee who worked on our farm and he had lived in the Smokey Mountains and fed his family by hunting game. I had heard deer grunt before and this was no deer grunt. ",
  "classification": "Class B",
  "county": "Walker",
  "state": "Georgia",
  "location": "-85.39171,34.66029",
  "location_details": "Pigeon mountain about a mile from the turn of a hwy 193. The area has change a great deal since this incident happened."
}