{
  "reportId": "26196",
  "title": "Possible intimidation experienced by two bow hunters near Cadillac",
  "date": "2000-10-01",
  "observed": "A friend and I were Bowhunting in October of 2000 or 2001.We found the area we wanted to hunt the day before.We hiked into the woods together.He chose a spot down by the creek over looking a small swampy area.It was down a deep ravine.I continued on further down the path and found a spot and sat down in the tall grass.Neither one of us had a tree stand. I had sat down for a couple of hours and was awaiting the time my friend and I call \"Crunch Time\". That is the time when the wind usually calms down and Deer start to move.Off to my left I could hear what sounded like an animal moving very quietly.I'd like to add that where I sat there was a small hill between me and the spot where I had hoped to ambush a Deer.This animal kept quietly rustling about and I moved from a sitting position to a crouch, getting ready for a shot.All of a sudden a very large tree started to shake violently and whatever this animal was let out a roar/scream that scared the hell out of me.I could see up into the tree and saw nothing in the tree. I could not see the bottom of the tree as it was obscured by the small hill. I immediately got up and ran all the way back to the truck.When I arrived at the truck two DNR officers were waiting to probably check our licenses.One of the officers was a male the other a female.The officers questioned me why I was running. I told them what happened and also told them that my friend was still in the woods.One of the Officers unsnapped his holster but did not pull out his gun.At this time it was dark we walked into the woods looking for my friend.After a short walk we could see his flashlight. The first words out of his mouth were, \"Did you hear that thing scream\". I told him that I did. He also elaborated that immediately after the scream two deer ran through the swampy area at full speed.We all walked out of the woods together with the officers instructing us to leave. They didn't even bother checking our licenses. They were at a loss to explain what had happened.I have since bought a trailer down the road in Manistee County and am in the area quite a bit.In looking back the thing that scares me the most is the fact that this powerful animal was very stealth until it wanted me to know it was there.The area also has legendary creature known as the Dog Man.",
  "classification": "Class B",
  "county": "Wexford",
  "state": "Michigan",
  "location": "-85.63835,44.16985",
  "location_details": "South of 46rd. Between 17rd and 21rd."
}