{
  "reportId": "9109",
  "title": "Couple has fleeting, afternoon encounter near Barlow Pass",
  "date": "2001-09-08",
  "observed": "My wife and I were on vacation visiting different sites around the southern edge of Mt. Hood off of Highway 35.  We came across a sign for the Barlow Road (US Forest Service Road 3530) and decided it would be fun to drive into the woods and perhaps see some of the wagon ruts.  We drove to the edge of a clearing just north of a deserted campground and stopped to take a look around. Just after getting out of the car we noticed an extremely large pile of fresh droppings about 10ft from where we had parked.  My wife, who has had experience hunting bears, elk and other large mammals, commented that the droppings looked odd and did not look like bear or elk droppings.  They were more \"human\" in appearance but way too large for a person to have made.  After a few minutes of looking around we both noted that we no longer heard any other animal noises of any sort.  It seemed way too quiet.  We had been visiting sites within a few miles of this place all day and this place really stood out as being eerily quiet.  It was at this moment that my wife stated that it felt like we were being watched.  I agreed.  The whole environment just seemed really strange.  We both got an extremely creepy feeling and decided to just turn around and leave.  It was such a relief to be back in the car and moving up the road that we both laughed out loud and shouted about how creepy the whole thing was! Then my wife confessed to me that just before we left she had seen something watching us from across the meadow a 100ft or so away.  She said that it had reddish brown fur, was moving on two legs.  Just after she saw it, it started heading away from us and back into the forest.  She only saw it for a few seconds before it was already back into the trees and out of site.  She was sure it was not a bear based on her experience on hunting trips with her family.",
  "classification": "Class A",
  "county": "Hood River",
  "state": "Oregon",
  "location": "-121.6796,45.274",
  "location_details": "At the intersection of US 26 and OR 35 (marked Hood River / Bend exits), exit right onto OR 35 towards Hood River.  Stay on OR 35 up hill 2.5 miles to Barlow Pass SnoPark exit (FS 3531). Turn right on FS 3531 and proceed to FS 3530. There is a large sign for the Barlow Road."
}