{
  "reportId": "553",
  "title": "Morning sighting by brothers near Yoncalla",
  "date": "1980-10-04",
  "observed": "10-29-00 A TRUE STORY: I left Oklahoma City with my two brothers, Bobby and Jimmy, and a friend named John. We headed for the state of Oregon in August 1979 for a possible long term stay. After a 5-day drive we came to the small town of Drain, Oregon, where Jimmy had been a few years earlier with his ex-wife and child. After about 3 weeks we settled in and everything was looking pretty good for us. A couple of months passed by and one early morning in October 1979 I got up and asked my brother Jimmy if he knew of a place to go deer hunting. He told me that he had been to a place a few years ago just outside a small town called Yoncalla, Oregon, a few miles south of Drain on HWY 99. So we took off to go check out the area he told me about. We drove south of yoncalla about 2-3 miles and turned to the west on an old logging road. We went up the road for about 2 miles and came to a fork in the road, at that time I ask Jimmy, do I go right or left? He told me it doesn't matter. So I turned right and the road ended at the top of a mountain about 2 more miles up. The road that turned left at the fork ended at the top of a mountain about 300-500 yards away to be left. Jimmy and I got out of the car for a nature call, after about 20 seconds Jimmy told me to look over on the other mountain top, he saw something move. I looked and I told him that I didn't see anything. About 10 seconds later Jimmy told me, look I saw something move! I looked and told him that, I.., and that's all I could say. At that time we saw a BIG black thing walking like a man.  It walked over to the edge of the other mountain, the mountain we would have been on if we had taken a left at the fork in the road. It was standing there for about 10-20 seconds before it walked back to where we first saw it.  When it stopped, it turned and looked at us for about 30 seconds, then turned away.  That's when we saw a little one standing there beside it. We watched as they walked away from us over the mountain. They were about 300 to 500 yards away from us; the big one was about 6-7 feet tall and about 300-400 pounds; very muscular.  The smaller one was about 4-5 feet tall and probably about 100 to 150 pounds. After we got over the shock, Jimmy and I left and drove down to the fork in the road and saw a man on a horse.  We stopped and asked the man if his horse was acting funny or if he saw anything strange? He pulled out a BIG pistol and told us he was not worried about it. I think that the Big Foot was looking at him, when it walked over to the side of the mountain and looked down. We stopped in the town of Yoncalla to get something to drink and told some of the people there and they did not care to talk about it, so we left. I hope you take this story seriously, because you are the first that I'vetold it to in a long time. I have always wondered why me, why did I see it. Charles A. Stephens ",
  "classification": "Class A",
  "county": "Douglas",
  "state": "Oregon",
  "location": "-123.3604,44.55505",
  "location_details": "2-3 miles south of Yoncalla then west on a old logging road."
}