{
  "reportId": "8729",
  "title": "",
  "date": "",
  "observed": "It was approx. 2 a.m. on a cool dark quiet night.  My wife, kids, and me were all in rear of trailer sleeping, which we had rented for the week. We had opened the windows all around the trailer, because it was hot earlier, but left them open after we fell asleep.  I was in a deep sleep, when literally my wife starts smacking and pulling at my arm, as I'm abruptly awoken, she begins frantically telling me in soft hurried controlled panic ”there is something outside”, I cracked my eyes and was conscious, I heard what she said, but was either not believing what she said, or that she wasn't lying, and something was really outside.  In her words she heard padded steps for a minute, before she woke me up. Then what got me was when something stepped on our outside trailer step, and put pressure on the step, which caused the trailer to move.  Well, by this time we were both sitting up in our bed, and hanging on every whim, listening in the night.  My wife was so scared; she said, “If that door opens I'm going to scream so loud I swear.”  At that moment, it was surely a strange eerie feeling, and I remember anticipating the door opening, and how helpless I felt.  I was sweating seriously, because something inside of me was telling me that I did not want to confront what was outside. Daisy, my beautiful Jack Russell dog we brought along who barks at everything, and is always alert, was in the front part of the trailer sleeping on the couch.  It was quiet the whole time not making a peep, and when we looked at her, she was like right, no way am I going out there!  In the morning we asked our friends if they heard anything, or were you playing around at night?  But, with paying it no mind they said \"no!\"  But, I knew it was not in their character.  I just don't know what else that would be so bold to actually go right to our trailer?",
  "classification": "Class B",
  "county": "Trinity",
  "state": "California",
  "location_details": "Well, from Bay area take I-5 north to Hwy. 299 then go west on Hwy. 3 North. The campground is right off the road. It was a very long and winding road, and it takes 6 hours to get to from home. It was a long and beautiful ride."
}