{
  "reportId": "42364",
  "title": "Memory told of a daylight sighting and parallel chase in the Gila River bottoms while riding horseback",
  "date": "1992-08-15",
  "observed": "This happened in Gila Bend Arizona. My sister and her friend had went horseback riding down to the river bottom just north of the farm we lived on. I decided to ride out and meet them, so I took out one of our real gentle horses that never got excited and jumped on him bareback. My parents two dogs (rottweilers) were with me. When I got to the North end of the farm I had to turn west and ride parallel with the Gila River. There was a barbed wire fence between me and the river bottom. On the other side of the fence was overgrown with salt cedar trees. There was a cement ditch on the other side of the road which lead to a big sump full of farm run off water. When we got close to an opening in the fence, the two dogs started sniffing the air and acted a little excited and the horse was getting real antsy. I thought they could smell the other horses and I was close to them. All of a sudden the horse just stopped and started trying to rear up and when I looked around the dogs were gone. They had started running through the field back toward my parents' house. I heard something and looked at the trees and standing behind a tree looking straight at me was what I thought was a gorilla, then it stepped from behind the tree in full view. It was very tall because the fence didn't even reach the top of its leg, and it was covered from head to toe in long brown hair that was all matted and had salt cedar branches tangled in it. It just stood there looking at me  with a curious look on its face. I held the horse as long as I could hold him and just stared back trying to comprehend what I was seeing. I was riding bareback and knew I couldn't stay on much longer if I didn't get away. I let the horse take off running to get to the road leading back to the house. We had to run about a quarter of mile along the river and this horse was in a full out run, yet this thing seemed to be staying with us through the salt cedars. It was running on two legs along the fence just inside the trees with us. When I turned on the road toward the house I looked back and it was just standing there. I ran all the way home and told my dad and brother who laughed at me and told me I was just seeing things. They did however drive down to the river bottom looking for my sister and her friend. They didn't see or find anything as far as what I had seen. My sister and her friend said when they were coming out of the river their horses were acting scared but they didn't see anything. A few years later, my dad and my uncle had found a strange set of large bare foot tracks with what appeared to have claws in the mud near the same location. ",
  "classification": "Class A",
  "county": "Maricopa",
  "state": "Arizona",
  "location": "-112.73,32.95",
  "location_details": "It was North of a farm on the North side of Watermelon road, that ended where the river bed starts."
}