{
  "reportId": "56954",
  "title": "Two young hunters hide and watch hairy bipedal animal walking near the Jenkins Ferry Battleground Historical Monument",
  "date": "1973-04-15",
  "observed": "It was during the 1973 spring squirrel season in southern  Arkansas. My brother and I were hunting near the Jenkins Ferry national historic site. He is four years younger than me, I was 17 years old and my brother was 13. It was early morning before sun-up. We were squirrel hunting with my dad. When we left the truck, my dad went down in the woods by himself and me and my brother walked down this gravel road deep in the forest where there was water on both sides of the road. The sun was coming up and we were standing in the road waiting for it to get light enough  to go into the woods.  I was looking down the road toward the sun. On the left side of the road under a big tree was a very tall - at least 8 feet - figure covered with hair from top to bottom. It was on the side of the road in the tree line. It then stepped on the edge of the road. I noticed that he wasn't wearing any clothes or carrying a gun, and it was too big to be a human. Me and my brother squatted down in tall grass next to the road. The figure then came to the edge of the road and just stood there. It looked straight up and he looked to his left. We were on his right and by then we were in the grass and he did not see us. My brother took aim at him with his .22 caliber rifle that always jams after firing just one shot. I asked him what he was doing. He said that is not a person and  if he comes this way I'm going to shoot him. I told my brother don't shoot, the gun will jam. I had a single barrel 16 gauge shotgun with squirrel shot. We just sat there in the tall grass and watched the figure walk across the gravel road. The animal took at least three steps and he was across the road. Its  arms very long and I noticed that there was long hair hanging from his arms. Its foot slid when it stepped off the road and onto the right-hand shoulder. Then one foot began sliding, causing the animal to lose its balance for a second, nearly falling backwards, just before it stepped into the water. Once in the water, It started walking into the woods and he never seen me and my brother.  We got up and ran back to the truck. The truck was locked but I knew the wing window on the passenger side didn't lock. I opened up the wing window and reached in and opened the truck  door and me and my brother got inside. We started honking the horn until my dad came out of the woods. We told him what we had seen. He said he did not see the creature but he heard something very large walking through the woods breaking sticks and limbs. My dad took the safety off of his shotgun  and waited and listened for a little while before getting in the truck. We left the area never went back there to hunt again. It has taken me all these years to tell the story. My brother and myself have told people in our family and they think we're crazy, but me and my brother know what we saw that day. I have been all over the world and I've hunted in a lot of different states, but I've never seen anything like this before or after that day.",
  "classification": "Class A",
  "county": "Grant",
  "state": "Arkansas",
  "location": "-92.57542,34.20873",
  "location_details": "It was on a unnamed, graveled woods road near the Jenkins Ferry Battleground Historical Monument."
}