{
  "reportId": "5059",
  "title": "Family hears strange screams off Highway 54",
  "date": "1973-04-04",
  "observed": "In the spring of 1973 when I was 8 years old, I was mushrooming with my mom, aunt, and several cousins in the woods near my grandparents home in rural Louisiana, Missouri.  We were in a deep hollow that was heavily wooded, when all of us started mentioning this horrible smell.  Since there seemed to be no source of the smell, we decided to head back up to the car because we knew about the \"Mo Mo\" sightings that had been occuring in and around Louisiana.  No one was at home at my grandparents so we all piled back into the car.  My mom had left down the window and within a few minutes we heard something let out a scream.  My mom said it sounded like a panther scream, but between the horrible smell and the scream we did not investigate, we left in a hurry! My grandma while picking blackberries in this area also encountered the strange smell and may have actually seen the creature out her back door that summer.  She had a lilac bush about 6 foot tall about 25 foot from her back door, one night she was looking out and saw what appeared to be two red glowing eyes peering back at her.  My aunt and two uncles on two seperate occasions encountered what may have been \"Mo Mo\".  Both sightings occured that summer in the evening hours.  Each said they seen two glowing red eyes, and as they drove closer they seen what appeared to be a large, about 7-8 foot tall, hairy creature standing on its hind legs staring at them.  Also, some neighbors of ours who lived a few miles from my grandparents had seen the creature in the garden in their backyard behind their house, it ran away when they came out.  But having just rained, the creature had left its footprints behind.  They had it plaster casted and I actually seen it, it was about 14-16 inches long.",
  "classification": "Class B",
  "county": "Pike",
  "state": "Missouri",
  "location": "-91.07,39.445",
  "location_details": "Most of the occurences happened on property that is no longer owned by my grandparents.  I do not know the name of the gravel road, but it is easy to find.  All occurences happened on this gravel road that is off of 54 and circles around several miles to another exit onto Highway 54.  My grandparents home was off the gravel road down a small lane that went a couple a miles back.  At that time the lane was heavily wooded on both sides.  Now it is unaccesible, the land having been made into a cow pasture and the trees pretty much have been bulldozed off years ago."
}