{
  "reportId": "31153",
  "title": "Ongoing activity on a family farm near Paisley",
  "date": "2011-07-04",
  "observed": "Late at night as my family and I were setting off fireworks, we heard something growl loud enough for all of us to hear. My daughters boyfriend, a policeman said he thought it was a \"bear\" just in the treeline off to our left which was very close. Since we do have black bears, I picked up my grandbaby and we all stepped back as my husband and daughter's boyfriend had a look around. Something crashed away into the woods and was gone. The crazy thing is that the sound was nothing like we had ever heard before and we've been here a long time. I might add that we recently completely fenced the area which makes it even more odd. Accessing the yard would be hard for a bear now. Our dogs did not bark but, we had been setting off fireworks, so, I kind of let them off the hook! This occurred again about a month later in August. I had stepped out on the back porch to get a soda from the refrigerator. I felt the hair on my neck stand up and about that time, I heard the same low growling noise straight in front of me that we had heard in July. Then, I heard rustling and what sounded like someone running into or hitting the side of our wooden shed out back very loudly. I yelled to my husband and ran out behind the shed with a spotlight. I saw nothing, and there was no noise of something running away. The woods are thick there so, someone or something would only have to stand a few feet away to disappear. The dogs finally decided to bark when I yelled at my husband, but then, they are kind of lazy and could have been sleeping. Amazingly enough, they are always manage to be awake long enough to eat.",
  "classification": "Class B",
  "county": "Lake",
  "state": "Florida",
  "location": "-81.43248,28.98491",
  "location_details": "From Deland, FL go W on SR 44 across the St. Johns River. Take first right on CR 42. Travel 3 miles to Lake Mack and turn left. Turn right on Bear Lake."
}