{
  "reportId": "18174",
  "title": "Small gorilla-type animal seen at dusk along the Laurel River near London",
  "date": "2005-07-20",
  "observed": "In 2005 while fourwheeling with my girlfriend in some bottomland near where I live I was following the laurel river as it snakes its way through these dense bottoms. it was getting dusk dark and we where on the left side of the river as we were riding we had met about 6 deer that were on our side of the river and we sat and watched them with out turning off the fourwheeler. I was carring my sony hi8 camcorder because i have seen bigfoot before but it had been awhile. i also had my .44 magnum pistol on me for we have lots of wildlife around hear and i would rather be safe than sorry. well as we continued our ride we came to a bend in the creek and the tree frogs and crickets were so loud that they about drowned out the atvs engine roar. so i turned it off so we could hear them better because the sound was just really nice and soothing. as we sat and listened i caught a movement out of the corner of my right eye across the river. now first i must tell you that the woods across the river had been logged about 2 years prior so it had a second growth of timber and the animal that i saw was about 75 yards away. anyway i saw a movement out of my right eye so i turned to see an animal which looked like a gorilla for it was on its all fours but was the color of an orangutan for an orangish/red and when it turned its head to look at me its face which i saw pretty well was white much like that of a skull. my girlfriend was looking the other way when i jumped off the atv to film this creature. the creature moved quickly to the base of a downed tree top which it was in front of and just climbed right over onto the otherside where i lost sight of it. my camera was around my neck so i poped off my lens cap cover and started filming in which all i got was a short video of the main branch of the tree shaking where it had just went over. this all took place in just a few seconds possibly 12-15 seconds. i was very disappointed as im sure anyone who looks for these creatures would be. i have alot of other reaports from around hear that i will post as soon as i can and i also have gamecameras in the woods at all times hoping that maybe one day he will run by it. thanks for your time . wes i.",
  "classification": "Class A",
  "county": "Laurel",
  "state": "Kentucky",
  "location": "-83.95846,37.0787",
  "location_details": "hwy 229 to 830 to 1189"
}