{
  "reportId": "50074",
  "title": "Possible encounter scares a camper from his hammock while in the Uwharrie National Forest",
  "date": "2015-10-25",
  "observed": "To begin, I am 34 years old, I have a degree in Biology, and I have spent my entire life in the woods mostly by myself and have grown accustomed to the noises animals and the forest itself makes. I go backpacking and backcountry camping year round. I am not an expert but I have experience in the woods. My wife, two dogs, and I were camping in Uwharrie National on October 23 -25. Friday night we heard a lot of noises ranging from coyotes far away to leaves rustling just outside our site. I just purchased a hammock and wanted to try it out in the woods. So Saturday I set up my hammock 20-30 feet into the woods just outside our site. Our site is on the side and near the entrance of the campground and the most secluded with the woods to its back; this is why we choose it. So I go to bed in the hammock Saturday night facing the campground and the woods behind me, and all is well until 2:30am, I wake up to branches breaking behind my head. The branches sounded like they could have been as close as 30 feet to as far away as 50 feet to my right. Imagine if my head is 12 o’clock and my feet are 6 o’clock, these branches were being broken at 11-12 o’clock or over my right shoulder. At first I thought it was a deer or a bear passing by but I know what they sound like as they walk (a couple months ago I was face to face with a mother bear and her cubs), but I never actually heard distinct footsteps and as the breaking didn’t move in location I became a little freaked out. I’m lying in the hammock trying to explain what is going on and nothing is making sense. I never made a noise to scare it away and didn’t shine my headlamp. Then I hear a noise that is hard to explain come from about 1 o’clock or over my left shoulder. I can only describe this as similar to the noise a deer makes when it’s alerting other deer to danger, but if a deer were to make this noise it would have to be 20 feet tall. It was deeper than any noise I’ve ever heard come from the forest. Deeper than a lion’s roar and as long as a human’s sigh. The branch breaking continued for about 15 minutes until I start hearing the alternating branch break and what sounded like a large bird flapping its wings one time. I heard ‘snap whoosh, snap whoosh, snap whoosh’. About this time, I hear my wife coughing and before we went to bed she said that her stomach was feeling a little upset, I thought maybe she is sick. I muster up the courage to get out of the hammock hoping that in doing so I will also scare away the animal. I go up to her and she’s fine, now I have a dilemma, I don’t want to go back but I can’t stay in the tent because my sleeping bag is in the woods. So I go back and I pick up a branch, snap it and throw it in to the woods three times. Then I urinate all around my hammock. While I was doing this the branch breaking had ceased. I get in the hammock and seconds after turning off my headlamp the breaking begins again. I listen, while getting more and more scared, to the breaking for a couple more minutes. I shine my light into the woods and the breaking stops, I turn off the light and it starts back. I waited a couple more minutes and turned my light on again and the breaking stops, I turn the light off and it starts back. I’m lying in the hammock completely terrified at this point and decide the only thing I should do is retreat to the tent with my wife and dogs. It was like torture to be in the hammock. So I quickly grab my sleeping bag, walk to the tent, get in, and lay down. We both heard the branches being broken for about 15 more minutes, then we heard one large break that sounded like a 4 inch log being broken in half that echoed through the woods. It was almost as if they were saying ‘And stay out’. I was so terrified and my adrenaline was pumping so much that I couldn’t sleep for about an hour. The next day my wife and I look around the area for any sign of foot print or the branches themselves. I didn’t find any sign of activity. We did find a grassy area with three large rock piles. Two of the piles were old and had trees growing out of the pile, one was newer with nothing but small vegetation growing on top. One thing to keep in mind is that the area is frequented by campers so there are few branches, especially large ones, on the ground for anything to step on; and there are paths all through the area and as we all know animals will always take the easiest route when traveling. Something else we thought of is Saturday we both went to the bathroom deep in the woods, we thought \"what if we encroached in their land?\". Before I was skeptical but now I know there is something out there and this experience has truly changed my life.",
  "classification": "Class B",
  "county": "Montgomery",
  "state": "North Carolina",
  "location": "-80.08778,35.46955",
  "location_details": "Uwharrie National Forest"
}