{
  "reportId": "22577",
  "title": "Three witnesses encounter a large creature while walking down a gravel road outside South Sioux City",
  "date": "1998-09-15",
  "observed": "In september 1998, me and my brother-in-law and his girlfriend (which wish to remain anonimous) were walkin down the gravel road that I lived on. It was about 2:00am, we were about 1 mile away from my house, and we smelled this horrible smell, almost like the smell of something dead but stronger. We looked around, but couldnt see anything considering how dark it was. We walked a little bit farther and decided to turn around and go home. As we came across the spot that smelled so bad, we noticed that there was no smell anymore, so we decided to look around a little more. On both sides of the road were ditches that were about 8 to 10 feet deep. We walked over to the side of the road where we originally smelled that bad smell, as we got to the edge of the road a creature that looked to be about 7-8feet tall suddenly stood up, it was very dark that night but the creature looked to be the size of a grizzly bear, but there are no bears in the area I live in. Needless to say it scared the hell out of us and my brother-in-laws girlfriend screamed and the creature took off running as did we. As we were running back home we saw three deer running in the cornfield near the road. I slowed down for a second and watched them, then I heard this extremly loud screaching kind of howling sound. Im wasnt sure what it was we saw or heard that night, and wasnt much of a believer in bigfoot, but then this last summer I was watching wierd travels on the sci-fi channel. They were talking bout bigfoot, and they explained exactly what we saw, heard and smelled that night. I never mentioned anything about it till now for fear of critisizm. But i am now a strong believer in bigfoot, and want more than anyone to prove these amazing creatures exsist.",
  "classification": "Class B",
  "county": "Dakota",
  "state": "Nebraska",
  "location": "-96.46025,42.47356",
  "location_details": "Outside of South Sioux City NE on Golf road about 50 yards past Elgin ave."
}