{
  "reportId": "16499",
  "title": "Possible stalking on the Concho River outside San Angelo",
  "date": "2006-08-01",
  "observed": "My two sons and I decided to go fishing. We went down to the Concho River to a sort of remote area. We were trying some new bait we bought. It was getting dark but the fish were biting good, so we sat there a little longer catching fish.  I didn’t have a flashlight, so I told my boys we needed to get going. But we stayed until we could only see shadows of our poles. We heard a noise off to our left like something was walking toward us through some real heavy woods and brush. As I looked over you could here and see the birds flying out of the trees like they had been scared. It looked like one of those horror movies the way they were acting. The footsteps kept getting closer.  I could tell it was no small animal.  My youngest boy started to cry. We jumped up, as the footsteps got closer.  I yelled to scare off whatever it was, but it didn’t stop moving toward us. My older boy [15], started saying dad what do we do?  I told them to real in their poles fast. The trail down to the river was about ten feet to our left beside a 6-foot tall fence. On the other side of that was the trees and brush where the noise was coming from. So the only way out was to walk toward the fence then up the trail trough some trees.  The footsteps got right up to the fence line. So I ran toward the fence waving my arms and yelling at the top of my lungs to try to scare it off. It didn’t move. The brush and trees are so thick at the fence you couldn’t see anything but shadows. I told my boys to stay on my right side and get up to the truck. As we made it up the trail, I put my boys inside the truck.  My boy dropped his fishing pole down on the trail, so I went back down to get it.  As went back down I was cursing at what ever it was, to come out that I would beat it to death. Still no movement.  As leaned down to pick up the pole, I looked through the fence to see what it was. I stand 6 feet 1 inch tall; all I could see was a shadow of something that made me look small. I grabbed the pole and backed up the trail to the truck. As I got to the truck it started running up through the trees toward us. We jumped in the truck and started it.  I spun the truck around to shine my lights at the trees. It took off running back the way it came from.  We got the heck out of there.  I'm not much of a person to get scared but this thing made the hair on the back of my neck stand up. I have never been that scared in my life. Even talking about it makes my hair stand up. I have tried to think that this thing was a bum or some one trying to scare us on purpose, but the way I tried to scare it off you would think that it would have made some sort of noise when it stopped at the fence line. I went back the next day, crossed the fence to see what if any, evidence I could find. The trees and brush are so thick I couldn’t see anything.  I know ill never go back to that spot at night again. I don’t know if it was a big foot or not, and I’m not saying it was. All I know is it was the biggest thing I've ever seen, and like I said, it scared me and my boys worse than I’ve ever been scared.",
  "classification": "Class B",
  "county": "Tom Green",
  "state": "Texas",
  "location": "-100.4219,31.44815",
  "location_details": ""
}