{
  "reportId": "26205",
  "title": "Young adult has daylight visual encounter of bipedal creature while driving near Rhinebeck",
  "date": "2010-02-15",
  "observed": "I was driving on a backroad in Rhinebeck, NY. I was heading to a rehearsal at the Rhinebeck Center of Performing Arts at about 6 :30 in the evening. The road is called Pilgrims Progress Road. While I was driving on this road, I passed a 20 mph road sign because it's a sharp right turn, but on the same road. The road is very curvy. I passed this turn, and in the middle of the road was a Hannaford bag with an open cereal box, and a log placed in the bag. I had to go in the left lane to miss the bag. As I passed the bag, something darted behind my car from the left. I looked in my rear view mirror, and saw this big, black thing right where the bag was. At first, I thought it was a bear because it looked like it was on all fours. I kept driving, looking in my rear view mirror. After a few seconds, it was out of my vision. I kept driving down the road until I pulled into a driveway on the right, and turned around to see what it was. As I got to the location where the bag was, I noticed the bag was missing. I kept driving for about 0.2 miles down the road, past the 20 mph sign. As I turned, I saw something walking on two feet about 50 yards in front of my car. It was walking on the side of the road. I could see that it was definitely not a bear. It was black, and it looked as if the hair was short. It's back was towards me, and the shoulders were very broad. It looked like it was slouching, and I couldn't really see it's arms. I don't know if it was holding something, or if it was the way it walked. I'm about 6'5\", and It looked like it was taller than me from what I saw. I saw it for a good three to four seconds, until it leaped up this little hill to the right. I sped up to the location I saw it leap from, and got out of my vehicle. I looked all around because there weren't many trees. The grass was very high though. I didn't see it after that. I was nervous, confused, and excited at the same time.",
  "classification": "Class A",
  "county": "Dutchess",
  "state": "New York",
  "location": "-73.87915,41.94512",
  "location_details": "From the Rhinecliff Bridge heading towards Rhinebeck, go straight at the first light. Turn right at the second light, and drive until you see another light in an intersection. Make a left at the intersection, and Pilgrim's Progress is the first right on that road."
}