{
  "reportId": "28197",
  "title": "Man recalls his possible nighttime encounter while instructing at Ft. Lewis",
  "date": "1977-10-01",
  "observed": "OK fellas - here goes. In 1977, I was an Army instructor at Ft Lewis, WA. We had to take lower ranking enlisted men to the woods for part of the month long training, while in the NCO Academy. During one of these exercises, (a patrol or something)we had set up an observation post along this trail in the woods. I moved away from the troops so as I could better observe them and therefore, \"grade\" them on their skills.Sometime during the early morning hours, I began to smell this foul odor ( kind of like garbage or rotten eggs - whatever). A few moments later I heard this rustling of brush and braking of branches and tree limbs. All this was taking place, PROBABLY, about 25 to 30 meters in front of me. Keep in mind, it was very dark and only a little illumination from the moon. As I tried to focus on the location of this \"event\", I recognized that there was a pair of \"eyes\" looking directly at me. This creature was moving from my left to my right, staring at me. It was evident to me that \"it\" could see me clearly. I was frozen in place and panic set in immediately. I even crouched down in the bushes to try to hide myself. This \"thing\" kept moving and eventually moved out of our area. When it left, the odor disappeared, there was no more tree branches breaking, and I was petrified. I know this sounds like a load of crap - but, this happened and I have no reason to even mention this after all these years.But, do with it what you want. I just thought I'd let you know about my expereince. Thanks for your time. (Name edited out)",
  "classification": "Class B",
  "county": "Pierce",
  "state": "Washington",
  "location": "-122.6997,46.98578",
  "location_details": "Somewhere in the backwoods of Ft Lewis. This are is full of deadfall, creeks, ridges, thickets, swampy areas, small caves, and is very inhospitable, and can be dangerous if you get lost."
}