{
  "reportId": "25648",
  "title": "Possible nighttime encounter, food taken from hunters camping near Tuolumne",
  "date": "2003-09-15",
  "observed": "I was traveling with my father and my fathers friends. Now i should tell you that my father was an active hunter, hiker and outdoorsman. My father was also 6'3 and two hundred and fifty pounds. There where exactly 6 of us including my self. We had traveled to the end of forest route 3n83 and had planned to camp in the general area for the night. Later on my father and told me that all this was planned so i could get used to hunting, and camping, this was a surprise for my 13th birthday. he said that we were supposed to spend two days there. We began to travel east of the end of the road. We walked for about 20 minutes through moderatley dense underbrush and reached a clearing where my dad decided to teach me how to make a fire. After around two hours i finally succeeded in making a fire. At around 4:30pm I finally made a fire. At this time my father decided to camp here, his friends agreed and set about setting up camp. Now as they set up they talked about there other hunting experiances, me being young and stupid i decided to re-enact some of the stories. I decided to walk in a general east direction playing with a stick pretending it was a rifle. I eventually got to a smaller clearing and saw a squirell or some other small mammal and decided to chase it. It ran across the clearing and up the nearest tree. I threw two rocks at it and then became bored. So i continued in the direction i was headed. I came to an area where the tress thinned and i could see a meadow. At this time it had just begun to get dark. I turned around to go back to the camp when I noticed a terrible odor. It smelled like a very large wallowy pig. I covered my nose and continued walking. I began hearing brush breaking about 50 -100 feet behind me. At this time i noticed that me father and his friends had begun to look for me and I could hear them calling. As soon as i could hear the voices the brush breaking stopped so i ran back to the camp. When i got back to where they were they had already started to pass around beef jerky and water. I sat next to my father and awaited the food. That night i was in a tent with my father who was sound asleep, when i thought i heard some brush breaking. We had divided our group into three tents, two in each. I sat there very still not sure what to do but i felt that something was wrong. I quietly woke up my dad to tell him about the sound. He woke up and I motioned him to be quiet and he heard the brush breaking around the edge of our camp. He grabbed his hand gun, and yelled whos there? The brush breaking stopped and then the area got quiet. My dad cocked the safety back and yelled again. This time there was a kind of crashing noise like a branch snapping, and then it got quiet. My dad crept form the tent and checked on the others, they were woken up by my dads yelling and had heard the crash. They lit a fire and remained awake the rest of the night. The food we had hung 6 feet to 7 1/2 feet of the ground was gone. The branch it was on had broken about a foot's length from the trunk of the tree, the branch there was at least 4 to 6 inches in diameter.  There was also the faint wallowy odor in the forest around the clearing. We packed our stuff up and left the woods. My father and i have since moved from california and my father has never spoken of the event again.",
  "classification": "Class B",
  "county": "Tuolumne",
  "state": "California",
  "location": "-120.0459,38.03917",
  "location_details": ""
}