{
  "reportId": "36407",
  "title": "Mother & daughter hear possible vocalizations outside a home near Richland",
  "date": "2012-09-04",
  "observed": "Highway 7 South, Richland, MO 2158 September 4, 2012 My daughter who had come to visit me was getting ready to leave.  We were taking a last minute look at my garden which is very close to the house.  We had only been out there a couple of minutes and then we heard the most unusual screaming sound.  My daughter asks if it was a coyote and I said NO and ushered her back to the house.  The call came less than 150 feet from the house.  It was loud and remarkable.  The dog that usually barks and runs after everything ran under the house. I did not say what I thought it was to her; instead we looked on the internet for sounds that might occur, like coyotes, panthers, fox, Barn owls, etc. After going through the whole directory.  She asks what the sound was.  We then listened to recorded sounds from Big Foot recordings.  Our stomachs turned. Yes, that is exactly what it sounded like.  I have lived in the country most of my life.  I grew up listening to coyotes and the occasional panther, bobcats, owls, Ferrell dogs and deer they all can make weird sounds.  But this, this is crazy.  I never thought that I would hear something like that in my woods.  I live in the river bottoms and I remember when I was young we heard the same sound, that was over thirty years ago. When I thought back on what happened, I realized that before we left the house my inside dog and cat were acting strange, pacing and panting. When we exited the house to go to the garden I should have known something was not quite right.  There were no night time sounds.. No crickets or frogs .. Just silence.. I finally put on my brave face and escorted my daughter to her car and pretended like everything is ok.  I could still hear snaps and cracks in the woods.  I watched her drive off then quickly got back in the house.  In the morning......I'll go look for other evidence, for now you couldn't pay me to go outside and I don't spook easy at all! When I calmed down I am sure I will wish I had walked towards the sound, but for now... I am glad I am inside.",
  "classification": "Class B",
  "county": "Pulaski",
  "state": "Missouri",
  "location": "-92.22327,37.50983",
  "location_details": "Approximatley .5 miles from the Gasconade River.  Four water supplies with in 1200 feet, abundant deer and wild life.  We don't hunt the land.  Approximately 100 acres, minimal population."
}