{
  "reportId": "511",
  "title": "Daylight sighting by duck hunter near Pella.",
  "date": "2000-10-24",
  "observed": "Yesterday, October 24 my husband took our son duck hunting.  They were at a public access huntiong area in Marion county outside of the town of Pella.  My husband saw a crane and he was watching it fly away and pointing it out to our son when he saw something run across the trail about 40 yards away.  He said it was solid white and tall.  It was on two legs and very fast.  He said the weirdest thing was how fast and quiet it was, almost as if it couldn't have been there because it didn't make sense.  He said he got a weird feeling because it was just so odd and he had our son sit down and he loaded his gun and went to see if he could see anything at all of it or foot prints to indicate what it was.  However it was gone and there were no prints as there are leaves all over the place.  I told him it sounded like bigfoot stories my dad read to me as a child and my husband said he doesn't believe in bigfoot but it was just too fast to see its features.  Just two legs and running upright.  It was too fast for a man and so quite with the leaves and all.  My husband said he doesn't want to look like an idiot and hear the jokes so he is not going to ask around about it and he isn't sure he would say it was a sasquatch because he has never thought they existed but he cant think of anything else that does exist that it looked like unless a super fast man in a big white hairy suit, with the grace and quiet of a ballet dancer was running through the woods.  Are there any authentic sasquatch reports of a white one?  I don't know a lot about it but my husband is not one to get scared outdoors or to make up things.  So, I know he saw something strange.  Please mail me as to whether or not they are all white in color.",
  "classification": "Class A",
  "county": "Marion",
  "state": "Iowa",
  "location": "-92.9008,41.3675",
  "location_details": "Public Hunting Access about 3 miles south of Pella, IA in Marion County."
}