{
  "reportId": "25280",
  "title": "",
  "date": "",
  "observed": "While on a mountain-bike ride down ********* trail, located approx 17 miles northwest of Chelan Washington.  I came around a left-hand bend in the trail, which was proceeding up a ridgeline slope of moderate grade.  The trail was well packed and damp, as a rainstorm had preceded my biking trip by two days. This weather pattern was unusual for Central Washington in the late summer month of August.  I was biking alone, and the section of trail preceding my unidentified animal sighting was downhill and allowed me to ride quickly, making little noise.  As I proceeded around the left hand bend in the trail, my vision was drawn to a motion on the ridgeline that continued to my upward left.  What I saw was a tall (approx 8 ft), Dark brown, longhaired animal running rapidly in a bi-pedal manner from the exposed ridgeline in a northwesterly direction.  He remained in my line of vision as he ran through a moderately dense high alpine forest. It was astounding to me how quickly and quietly the animal was able to move for his sheer body size.  I immediately stopped my bike with the initial sight of this animal.  After stopping my bike, the animal remained within my sight for approx 10-15 seconds as he was running rapidly away from my intrusion.  There was no mistaking this animal's height as I am 6' 4\", and my estimate of 8 ft. may be a moderate estimate of actual height.  There also was no mistaking the bi-pedal pattern of running exhibitited by this unknown animal.  After seeing the animal run through the forest, I dropped my bike where I stood, and walked quietly down to the point where I saw him cross the trail.  The tracks of this animal showed poorly as the ground on either side of the trail was densely vegetated with low-lying grasses and shrubs. It was remarkable to see such a large animal move so quickly and efficiently through the density of the forest.  I looked for broken twigs, branches, or hair and found none. I failed to find tracks within the trail.",
  "classification": "Class A",
  "county": "Chelan",
  "state": "Washington",
  "location_details": "Specific directions omitted"
}