{
  "reportId": "24254",
  "title": "Woman remembers she and a male friend watching an upright creature walking on the edge of moonlit Lake Hamilton",
  "date": "1992-06-14",
  "observed": "A male friend and I left a local nightclub to go sit quietly by the lake. We had both had a couple of beers in a 5 hour period, but this was around midnight-12:30 am on Saturday night, Sunday morning. Neither of us were drunk, or tipsy at that time. I loved nature, and always spent as much time as possible in the outdoors. It was a beautiful night, with a full moon and we decided to go to Lake Hamiliton, about a 13 minute drive on the highway from our location. We were in a truck, and took the access road and parked so we were facing the lake. Surrounding the lake is very thick woods, and this particular area was for fishing and not used very much. We got into the back of the truck, and sat on a blanket, enjoying the peace and quiet. We heard the normal sounds, an owl, a branch creak, etc but nothing out of the ordinary. The moon was extremely bright, and it was easy to see about 2/3 of the lake shore. Around 1am or so, I noticed a dark shape to my right. My friend was on my left, and I motioned to him to be quiet. I made the shhh sound. At first we couldnt identify species or size, because it went in and our of visual field. The creature seemed to be walking around the lake, sticking close to the woods and forest. There is a small stretch, about 100 yards where they have made access for fishing, and the creature was almost to that point, which would put him straight across from us, about 75 feet away. We both saw it at the same moment, and looked at each other, wide eyed and open mouthed and then looked back to the creature. It was too far off to see tiny details of the face, but close enough to note the following; it was substanially larger than even a big man. It had to be at least 8 feet, it appeared to be covered in fur or hair, and it had walked upright the entire time we watched it. I am familiar and have seen MANY bears in the wild and this was NOT a bear! It's posture was upright, yes a bit stooped. It had long arms, long like a humans, but not overly long, I would say its arms reached about mid thigh. It had a flattened face, and big rather dense bone on the arms and legs. It resembled NOTHING I, nor my friend had ever seen before. I grabbed his arm, and as I did, the creature turned, and startled, seemingly as if spotting us for the first time. He seemed to waiver on what to do.. as if he wasnt sure if he should receed or move forward. At the moment he began walking in our direction, towards the truck we both literally jumped up off the truck bed, and into the cab of the truck! I looked through my window, as he was starting the truck and advised him it was still \"walking\" towards us. At that time I rolled down my window, and realized it was only probably 25 feet from our truck, I said, go.. go.. go.. and he sped off. We discussed this over and over again, but could not come up with any creature that could possibly have been what we saw. This was back before I had ever even heard of \"bigfoot\" and so I had no knowledge that such a creature even existed. Around 1999, I came across some articles online about bigfoot, and when I read the descriptions, my blood ran cold. It was EXACTLY what my friend and I had seen that night. It surely was not anyone in costume, we made the decision late one night to go to the lake, and we know it wasn't a bear. I know in my heart that what I saw was a bigfoot, and no one could ever convince me othwerise.",
  "classification": "Class A",
  "county": "Garland",
  "state": "Arkansas",
  "location": "-93.07654,34.44652",
  "location_details": "Lake Hamilton, access road to the lake for fishing."
}