{
  "reportId": "22598",
  "title": "Possible vocalizations heard outside Inyokern",
  "date": "2008-01-07",
  "observed": "I lived in the High Desert of California in Ridgecrest, CA in Kern County from 1980 to 1985. I did a lot of hiking in the Sierra Nevada Mountains. I never saw or heard anything unusual during that time. MY Mom, Sister (& Family), and Brother and his Family still live there. My 19 year old son and I were visiting various family members from Sept 17 through Sept 27 2007 in Ridgecrest, CA. My sister took me and my son up to the Siebert family gold mine, cabin, and mining equipment on the 24th of September. We had spent about an hour at this location and we were preparing to leave. My sister was in the Port-a-Potty and my son and I heard this high pitch scream like a woman hollering, and it sounded just like the ones we heard on your sight. Just like the sound that was reported in the BFRO Report # 9426 (Class B), which is only 7 miles from that site. We yelled back thinking it was a woman in trouble and there was no reply. I asked my sister if she heard it she said no. I told her what we heard and she told me that she had horse backed and hiked through this area and had never heard anything that would make that kind of sound. She has lived and in this area since 1980. I asked her Husband who’s an avid hunter, horseback trail rider and hiker in these mountains and he said that he knew of no animal that made a high pitch scream in this area. My brother- in-law also has lived in Ridgecrest, CA area all of his life. In searching for the animal that made this sound on the internet, I found this site with the sound that I had heard. It is located in Kern County, up Indian Wells Canyon Rd, off California Highway 14, at Latitude 35°41'47.44\"and Longitude N117°57'54.36\"W, near Owens Peak.",
  "classification": "Class B",
  "county": "Kern",
  "state": "California",
  "location": "-117.9667,35.7",
  "location_details": "The Sound originated at higher elevation than ours. to the south of us. Distant was unavailble to us"
}