{
  "reportId": "3352",
  "title": "Large footprint found in sandbar",
  "date": "1981-01-31",
  "observed": "My friend, his Irish Setter, Kelly and I were walking down a gravel road while his father was up in the woods cutting firewood with a chain saw. It was around 1200.  As we were walking, Kelly was roaming in the woods as usual until the woods became very silent except for the chain saw.  The few birds around in the winter had stopped chirping and Kelly came out of the woods and stayed near us. We kept walking down the road but we both had that wierd prickly feeling that something was watching us.  But, we went on anyhow, since we could not see anything or hear anything in woods. After going about 200 - 250 yards down the road, we heard something off the road going through the woods away from us. Kelly became more spooked, tail down and ears back, but we decided to investigate the sound. We headed toward the noise and came to a creek that flows fast enough that it hadn't frozen.  As we got to the near bank, the noise of something moving receded quickly and died out.  We looked at each other and started to cross the creek, which was about 12' wide at the point we were at, when we both saw a large, human foot print in a sand bar that was in the middle of the creek.  The foot print was of a large barefoot, about 14\" - 16\" long and about 3\" - 4\" deep and maybe 7\" - 8\" wide at the base of the toes.  And was very fresh as water was just starting to trickle into it.  We did not see any other foot prints on the far bank, which is about 5' higher than the near bank.  So, whatever walked across the creek had a stride of at least 6' to reach the sand bar and was tall enough simply step right out the creek and over a 5' bank on the other side. We all turned around at that point went back up the road toward my friend's father.  As walked, we both agreed that not many humans have feet that big nor would they be roaming the woods in sub-freezing temperatures and running through chilly creeks. When we got back to where my friend's father was, we asked him if he had noticed anything strange but he said \"No\".  My friend and I figured that he hadn't noticed the stillness of the woods because of the chain saw and maybe that was what startle the creature\" we heard and followed since it was headed away from the place my friend's father was working.",
  "classification": "Class B",
  "county": "Adams",
  "state": "Ohio",
  "location": "-83.40573,38.89665",
  "location_details": "Private Land near Peebles OH - Adams County - off Rte 41 - near Peach Mountain.  I think the nearest road is Steam Furance Rd., but this inicident was a long time ago."
}