{
  "reportId": "9051",
  "title": "Family hears strange sounds near West Point at dusk",
  "date": "2004-07-24",
  "observed": "This happened yesterday: My wife and I were exploring some forest land northeast of West Point, Calaveras County, CA yesterday in our 4x4 and on foot, scouting for deer. Near dusk we set out a picnic next to a creek.  About 15 minutes after sunset a long howl came up the canyon from downstream.  It was loud enough to hear over the noise of the creek five feet away.  In between the howls there was deep toned \"jibberish-barking\" noise, almost like two deep voiced men talking at the same time.  It did not sound like humans, but we couldn't rule it out, until another howl answered from up on the ridge behind us.  Howls were exchanged from the creek valley to the ridge us and we were in between!  This ruled out humans making odd howls and \"jibberish\". The next thing we noticed is the cows that were grazing downstream all started heading upstream, away from the howl.  We could monitor their movements from their cow bells. We decided to pack up and high-tail it out of there, leaving right at dark.  Our departure route followed the creek downstream towards the source of the first howl.  As we neared where the howl came from, a buck bolted across the logging road in front of us, fleeing the creek bottom where the howl came from.  It was bolting up the hill before it noticed our vehicle. There are a few undeveloped creek access areas along the road and we looked at each one as we drove out, confirming no one was in there. A week earlier (last weekend), as we were leaving the area during a previous trip, my wife stopped her 4x4 because someone/something whistled from the woods.  The whistle was loud and nothing like any birds she'd ever heard.  The kids heard it, too.  (I was following her in a Jeep). Upon arriving home we listened to our \"Sierra Recordings\" CD's and the audio files on the BFRO site.  The howls were just like the Ohio recording and the distant \"ridgetop\" howls on the Sierra Recordings CD, and the whistling was just like the whistling on the Sierra Recording's CD. i also noticed lots of (dozens) broken trees and photographed some a few weeks ago.  I'm undecided as to the cause of their breakage. This area is very easily accessible, with logging roads through-out and only about 25-30 minutes out of West Point, CA.  Parts of the area are currently being logged, with miles of fresh, very fine dust perfect for finding prints.  Much of the area has been gated off for about 4 years and is now open due to the logging.",
  "classification": "Class B",
  "county": "Calaveras",
  "state": "California",
  "location": "-120.5264,38.39917",
  "location_details": ""
}