{
  "reportId": "2784",
  "title": "",
  "date": "",
  "observed": "First, a little information on me.  I am 36 and grew up in western NY; where I spent a lot of time hunting, hiking and camping in the woods. I spent four years in the US Marines, where I spent most of my time in the field. Every year I return home for deer season.  In 1993, I went deer hunting in Clearfield County, PA.  My Uncle (a long time resident of Clearfield) took us out to some state game land outside the city of Clearfield.  We traveled in on a old horse trail and went our seperate ways.  My Dad and I walked a couple of miles in from the trail.  I dropped my dad off in a meadow, told him that I would pick him up after dark and walked about 3/4 mile further in.  I found a nice valley and set up for the evening hunt.  The valley was surrounded on three sides by a step snow covered 200' hill.  About an hour into my hunt, I heard a strange distant noise.  It was very deep and repeated every so often.  I could not place the noise with anything I have ever heard in the wild, but didn't pay much attension due to its distance.  I continued hunting and listening to the noise.  I started to get a little nervous, when the noise began closing on my location.  It was covering distance extremly fast, and I still couldn't place the deep belch like noise.  Being well armed (Winchester 30/30 rifle and a Ruger 45colt sidearm, I still decided to pack up and leave as dusk was approaching quickly. By the time I had packed my backpack and got it on my back, whatever had made the noise was directly at the top of the hill above me.  It stopped making the noises and began breaking branches off of trees, just inside the wood line.  At this time, I had my Winchester at the ready and was watching the steep snowy ledge in front of the tree line.  For the first time in my life, I was afraid to be in the woods.  I felt as if it was trying to intimidate me out of the valley.  I stood there for about ten minutes on gun shaking, as it moved back and forth in the woods breaking branches.  Now it was getting dark and I was terrified, but knew I had to move.  I got a bearing on my compass and began moving quickly toward my Dads position.  As I left the valley, I didn't hear anything again and just kept moving. When I found my Dad, I rushed us back out to the horse trail.  Once at our vehicle, I asked him if he had heard anything strange.  He advised that he heard the same noise in the distance, but payed it no mind.  At the truck I nervously waited armed for the rest of our party, and didn't relax until we reached my Uncle's house. The guys all got a kick from my story and started making Bigfoot jokes about it.  For me it was not a joke.  I still hunt year round, but I'm nervous when entering the woods in the dark and would rather walk out before last light!  I don't know what was on that ridge; but do know that this US Marine combat vet, vetran police officer, experienced hunter and outdoorsman was shaking in his boots.  To tell you the truth, just writing this story gave me a chill! I",
  "classification": "Class B",
  "county": "Clearfield",
  "state": "Pennsylvania",
  "location_details": "Unknown - driven to the area by a relative."
}