{
  "reportId": "875",
  "title": "Man has sighting near Alturas",
  "date": "1974-06-01",
  "observed": "In 1974, I purchased an arce of land in northern CA in a place called California Pines, a very remote area bordered on 3 sides by a national forest (Modoc Nat. Forest).  To get to the property, which was located many miles from civilazation, you had to travel on a very rough road (one cut with a dozer) so our motor home could not make it to our lot. Near by was a small pond and a campsite that was for the use of property owners. The pond was about 75 to 100 feet across, the banks were covered in cat tails and the pond was full of trout (we tried all day to catch some fish, without luck). My family(wife, son and 2 daughters) were aware of how quiet it was in the evening, we could not even get a station on the radio. We built a camp fire and were sitting around it watching the field mice run down to the edge of the pond to get a drink. As I remember it was a bright night, the moon was visible overhead. Along about 10 or 11 pm, the wife and kids went into the camper and went to bed. I remained outside by the camp fire trying to get a station on the walkman radio. About 1am, I was putting out the fire when I saw movement on the other side of the pond, I noticed the movement because of the noise this thing was making. At first I thought it was a deer (I was told they were common in the area) so with that thought I headed toward the sound armed with my trusty flashlite. As I approached, the moonlite was very bright, I could see lots of movement in the cat tails but could not see the animal. At this point it hit me that maybe it was a mountain lion, because I could hear a low rumbling sound like a cat purring but much louder. I decided to return to the motor home, as I turned to retrace my steps (I was probably 50 feet from the noise) this huge hulk stood up in front of me and made a loud screeching noise. It raised up to a full standing position, I would say 7 or 8 ft tall, dark brownish hair.  We looked at each other for a moment and then I turned and ran full speed away from him.  When I looked back to see if he was following me, he was walking in the opposite direction toward the deep forest. I stood and watched him until he disappeared in the deep woods. He did not walk like an animal but more like a man. When I composed myself, I went back to the area I saw him at to look for tracks, but all I found was crushed cat tails, an area of about 10 ft in dia was all smashed down, and it smelled like a strong urine smell in the area. I told the family what I saw and to this day they think I saw a deer or some other animal. I tell this story now to my grand children when we go camping. The one thing that struck me about this encounter was after the event was over I felt that whatever it was did not seem threating but just as startled as I was.",
  "classification": "Class A",
  "county": "Modoc",
  "state": "California",
  "location": "-120.6781,41.41",
  "location_details": "California Pines--an area boarded on 3 sides by Modoc Nat. Forrest"
}