{
  "reportId": "1829",
  "title": "Motorist witnesses two-legged man-like creature in field just off Hillsboro highway",
  "date": "2000-10-15",
  "observed": "It was dark. I was driving my truck going South on hwy.219 out of Hillsboro. I had the truck's bright lights on. I was scanning the countryside for wildlife as is my practice. I've seen hundreds of deer and a number of elk over the years.(Not necessarily in this location.) But, what I saw that night, made my mouth drop open. I saw a very tall, shaggy golden brown animal with two very long legs. Its' arms were hugging its' sides. It was standing as still as a tree as the headlights hit him. My first impression was \"THAT is the biggest deer I have ever seen in my life!\" But, even though it was looking directly into the headlights, the eyes were not reflective. It had no antlers, and as I got closer I saw that it didn't have hind legs or a horizontal body attached. It was taller than an elk and much, much taller than a white tail deer. I would estimate that it stood approx. 8' tall. It had a good build (well proportioned)The hair seemed to be about four inches long and covered all the body except for the eyes. The head was round on top with little or no neck. The face appeared flat and the nose was small enough not to be noticed. The hair had a slight wave to it. It did not lay flat. To tell the truth, it looked a lot like Chewbaca (sp?) from Star Wars. It was standing in a field about 2-3 pickup lengths from the road,facing the road at an angle in such a way that my headlights hit him straight on as I approached, and I could see him from the side as I passed him. I was going 55 MPH so I saw him for only seconds. But the image is etched in my brain! I've thought about this since the day it happened and can figure out nothing else that it could be other than a sasquatch. I finally decided to report it.",
  "classification": "Class A",
  "county": "Washington",
  "state": "Oregon",
  "location": "-122.9903,45.48204",
  "location_details": "From Hillsboro, take hwy. 219 south. Jackson Bottom Slough is just a little ways past the railroad tracks. From the Jackson Bottom Slough sign, continue on hwy. 219 for exactly 1.5 miles to a field that is just opposite where Tongue Rd. intersects with 219. It is in that field that I saw what I believe was a sasquatch."
}