{
  "reportId": "34502",
  "title": "",
  "date": "",
  "observed": "In December of 2010 (I think it was the around the 15th, whatever the 2nd muzzle loading season fell on during that year.) I was going deer hunting on private family property very close to Elkhorn City, Kentucky.  This was my first time going hunting in a while as I had gave up the sport in my late teens/early tewnties and I would have been 30 at the time of the sighting. The road that I had to travel is passable with a 4-wheel drive and is an old mining/logging road.  The terrain is typical Appalachian terrain and the spot that I was headed to (where my tree stand was located) is on a ridge top and somewhat flat from old mining operations but very steep on one side of the road and somewhat flat on the other.  I was hunting with a muzzle loader gun and as I arrived at my parking spot (in a steep curve in the road and and on a long what we call point, a natural crossing place for deer and other wildlife I got out of the drivers side of my truck and walked behind my truck to get to the passenger door to get my gun and load it.  I am not sure of the time but it was well before daylight.  As I was attempting to load my gun I heard what was coyotes, making a lot of noise which is not uncommon but these were close and I have to admit that I got spooked and hurried and got back in the drivers side of my truck, locked the doors and flipped my head lights back on.  My truck was facing the flat area with the point to my back and the steep hillside on my right.  I cracked my window to listen for other sounds and I heard more coyote sounds and in about 2 - 3 minutes time I heard what I knew had to be a large creature coming from the flat area where my truck was facing.  Keep in mind the coyote sounds were coming from the same direction.  Next I saw something that I have never seen before or since.  I saw a creature that had to be at least 8 feet tall.  It came out of the wooded area towards the left side of my truck.  The creature was moving at a quick speed but when it came out of the clearing it seemed to be shocked to see my truck and apprehensive.  It stopped for maybe 5 to 10 seconds and took off and dissappeared behind me.  The creature had the form of a really big man with long arms and longer hair that covered his whole body.  It walked slumped over almost like it had a hunch back.  My total time of seeing the creature was probably about 10 seconds.  Since this occurance I have seen bear while hunting and I can say for sure that what I saw that December morning was not a bear or anything else that I have ever seen in these hills and mountains.  In a nutshell the creature looked ran/walked like what you see on TV reinactments.  I truely believe that on that morning I saw a Squatch.  I can't describe how I felt after seeing the creature.  I wasn't scared but I wasn't totally comfortable either.  I suppose you can say I was bewildered.",
  "classification": "Class A",
  "county": "Pike",
  "state": "Kentucky",
  "location_details": "The location is in what used to be called xxxxx  Branch.  The main hollow is now being filled with dirt in the making of US 460."
}