{
  "reportId": "1456",
  "title": "",
  "date": "",
  "observed": "I was just looking around the net tonight when I came across your article on the Wookie. Well I can tell you one thing, I was raised in the small town of Dry Prong La, as we spent many a night in the woods camping. Most of the time in the swamps around Little River. Well one night we were sitting in camp listening to the sounds of the night, and watching the ligntning bugs as they floated in the still air. When all of the sudden the woods came alive with screaming, not like any thing I ever heard in my life. I know what panthers, and wild boares sound like, but this was one sound i will never forget. We shined the flash lights out into the direction of the screaming, and what we saw or thought we saw was to say the least some what up setting. My grandfather and my Uncle were raised in this part of the woods, and i had never seen then afraid of any thing, but this was one time that was diffarent. We would have left right then and there, but it had rained earlier in the evening, and the road was to muddy to travel. We had to spend the night, oh and what a night it was. I can't  remember ever being so damn scared in my life. That thing tore the woods up all around us, and it screamed and made some of the wierdest noises i ever heard. I don't think i will ever forget that night, even as I write this, twenty years later, I can still hear it. Well any way, in the early morning hours it finally went deeper into the swamp and out of our area. We waited until first light and with gun in hand we decided to have a look at what ever was there. The small trees were broken about six feet off of the ground. Not totally off, just snapped and shoved down. The grass around them was flattend to the ground and we looked for some king of foot prints. What we found, no one would have ever believed us. They were huge! I have to tell you one thing, I had never heard of big foot or any other kind of wild animal at that time. But now I know what was there, and it was one night I will never forget.",
  "classification": "Class B",
  "county": "Grant Parish",
  "state": "Louisiana",
  "location_details": "In the swamps around Little River, near Dry Prong Louisiana"
}