{
  "reportId": "9929",
  "title": "Hiker Hears Loud Vocalizations and Thumps",
  "date": "2004-09-30",
  "observed": "I have read most of your reports that cover the West Coast states. I have yet to see it mentioned but, a friend of mine that has read numerous reports on both your site and others told me that one type of B class reports deals with hearing a thumping sound like a padded baseball bat hitting a large tree trunk very rapidly. I need to know if this is evidence of proximity to the Sasquatch. I live just outside the old Weyerhauser Tree Farm in Snoqualmie Valley and spend alot of time taking early morning walks there with my dog to take pictures. One morning I had hiked in about 1.5 miles off a logging road to a swamp that was partially exposed by logging and was sitting for about 20 minutes on the ground up from the edge of the swamp in the bushes waiting for the frogs to start up again when on the hillside across the swamp from me I first heard thumping. It was rapid short duration and deep. There was no more than 5 or 6 knocks. The sound was much deeper than the sounds made by woodpeckers, I have heard and seen these too while out there walking. The tree thumps are very rapid, I couldn’t knock that fast one handed at all with something heavy enough to make that sound. The sound is also much fuller bodied than knocking a dead branch against a tree branch; the sound is more like if 4 people were to hit a hollow trunk in fairly quick succession 1 1/2 to 2 times. This first thumping was followed shortly by a second simular series of resonant thumps about 250 yrds from the first on the same side of the hill. This thumping was closely followed by 2 short calls coming from each original thumping source areas repectively on the hillside. The calls were one constant sound for a short duration, one call and then from the other location exactly the same sound. They sounded like a howler monkey in hollowness and pitch. There used to be howler monkeys just in the entrance of the San Diego Zoo of which I used to have a yearly membership. Like the thumping it was a sound that traveled far. The other location where I heard the thumping was right outside the Chester Morse watershed which is off limits. I was again out hiking in the early morning with my dog for picture taking. No vocalizations this time, just the same rapid patting of a tree trunk. I can't stress enough that this isn't woodpeckers, I do know that sound. The speed of the contacts wasn't as fast as a woodpecker. I guess my question is does this \"thumping\" show up before in your experience proximity of the animals? I know you're very busy but, I just need to know if any one else has reported hearing sounds like this or if you know what I am hearing?",
  "classification": "Class B",
  "county": "King",
  "state": "Washington",
  "location": "-121.7812,47.4352",
  "location_details": "First incident was in the Weyerhauser Tree Farm outside of Snoqualmie just off the county road that runs thru it. Second incident was outside of the Chester Morse Watershed by Rattle Snake Lake and the John Wayne Trail."
}