{
  "reportId": "24241",
  "title": "Family has a strange and terrifying encounter while fishing in the Everglades National Park",
  "date": "1975-06-18",
  "observed": "I've thought about posting my experience here for awhile, but since I was so young, I have faded memories of the event.  Therefore, I wasn't sure it would be so useful.  However, after looking at the BFRO data base for the area, I couldn't help notice the similarities in occurrences, specifically BFRO report 1283.  Also, report 15170 was in the exact same area. I emailed my mother and father about the event a year ago, and I'll edit to protect the names/paraphrase what they had to say about it. In an email, I asked my dad if he remembered the night, remembered throwing a rock in the woods at what we heard, and what exactly happened, here's his response: \"I remember that night very, horribly, well...  We had been camping at the very Southern tip of Everglades National Park.  If the same camping area still exists, I think it's now called the \"Flamingo Campground.\"  Nice name.  If you don't quite recall, here's the link - http://www.nps.gov/archive/ever/visit/camping.htm Anyway, we set up our campsite, and I believe it was on the first night that we chose to do some night-fishing along one of the zillion canals in ENP.  We had the little orange '73 Honda Civic parked on the side of a canal.  As you recall, we heard the leaves rustling s-l-o-w-l-y as something or someone moved back and forth.  Although I don't remember it, I probably did throw a \"rock\", aka \"rock sponge\", aka, a piece of uselessly light coral.  Nothing happened, so I shone our huge, massive, bright flashlight with a big 6V batttery right at the source of the sounds.  Of course, the vegetation was too thick for decent light penetration, but NOTHING was revealed.  And, most chilling of all, what/whoever it was, pacing back and forth, continued to pace back and forth in a most non-wild-animal way.  I/we shouted, to no avail, and I got a series of impressive chills down my spine. I said, \"Let's get in the car!\" and we took off down the little side road while Mom said, \"Do you think it was the Skunk Ape?\".  I was carrying our surf-casting rod with my hand along the roof of the Civic, and was really, really glad to be out of there.\" I then emailed him back and asked him if he smelled anything: \"No, I don't remember any smell.  In the cold light of dawn, I thought that it was probably just an armadillo or some other exceptionally stupid animal that didn't know how to be afraid of light at night.  It didn't even stop moving, let alone run away, when I turned on the flashlight and swept it around the area the sounds were coming from.  I remember being so afraid that I didn't think there was time to break down the surf-casting rod, so that's why I carried it with my hand, gripping the roof of the car with the rod against it.  It was the most scared I've been in my adult life.\" Here is my mom's response to my original email: \"I remember  that  I was sooo scared I didn't even open the car door I shoved you thru the window and you piled in on top of a bunch camping gear,  cooler ect... Dad had to drive backwards  too. I have to say it was one of the most scariest things that has happened to me.\" Personally, I remember mostly being terrified as a child, because my parents were.  My dad in particular, is not one to scare easily.  On top of that, he is a lifelong scientist who views all 'strange nature' occurrences with a very stern skeptical eye.  So as an adult, to think back on his fear, and have him admit how scared he was, means that something instinctual kicked and told him to haul butt out of there.  If he thought it was a person, he would have confronted them immediately. I've seen him do exactly that on many occasions. I wish I had been a bit older when this happened, but I figure any bit of detail can help the larger cause.",
  "classification": "Class B",
  "county": "Monroe",
  "state": "Florida",
  "location": "-80.87379,25.19935",
  "location_details": "It wasn't in Flamingo Campground, but as my dad said, along one of the zillion canals in Everglades National Park."
}