{
  "reportId": "14997",
  "title": "Possible approach to campers near Spring Creek Pass in the San Juan Mountains",
  "date": "2006-06-10",
  "observed": "My boyfriend and I were on the last night of a week-long vacation/road trip.  In the past few days, we were just driving through SW Colorado, driving through areas we had not seen before. We had driven over Spring Creek Pass (going South).  We drove West on a dirt road, into a high valley with a stream.  We parked during sunset/moonrise, just off the road and near the stream (a pullout-type area).  My boyfriend wanted to get some fishing in before it got too dark.  So we quickly started to get a quick dinner together (soup) and get our gear ready for the night.  We were not going to put up the tent, but instead took some gear out of the truck bed (truck has a topper) and we were going to sleep in it.  We were moving pretty quick to get this stuff done so he could fish, so I guess we weren't paying much attention to other stuff.  We did stop to take a few pictures of the rising moon. He went over to the stream to fish, and I started to eat my soup in my camp chair.  The bushes near the stream were very tall and thick, and I couldn't see my boyfriend at all.  There were more bushes on the other side of the truck (between the main road and truck).  I was just eating my soup, when I heard loud crashing through these bushes (between the road and truck).  It sounded like something very big with very long legs stepping through the brush, and it was coming right towards the truck.  The brush came very close to the truck (less than 10 ft). At first, I thought this might a moose.  (We had seen moose in the Northern Colorado mtns earlier in the spring, and we had seen a sign posted near the road warning a moose had been seen in the area (\"Hunters, be sure of your target...\").  So, I first thought this could be a moose.  It was definitely very big and had long legs (much bigger than an elk, and not a bear).  (We have also seen bear in Colorado, so I've seen the size/movement of bear.) The last thing I wanted was a big moose (or anything else) to step out of that brush (and on me)!  I was very scared.  I quickly made room in the front seat, which were now filled with gear, and started honking the horn.  I wanted it to know I was there (because it sounded like it was going to pop out of there pretty quick).  The crashing continued but seemed to move off a bit.  Then it stopped.  I couldn't be sure if it had completely moved away or just stopped.  My concern was also for my boyfriend.  I didn't want a moose to come across him in the bushes by the creek.  My boyfriend heard the honking, and I could hear him coming back.  The bushes were very thick and he was swearing, struggling.  He returned, I explained the situation.  Irritated and with fishing pole in hand, he walked up to and down the road a short ways and didn't see anything. If it were a moose we felt we would have seen it (he from the higher road or I would have seen it crossing the pullout to the stream).  My boyfriend would have been able to see if a moose was in/near the bushes near the truck, from that higher position.  At this point I heard very low growling, faint (very deep, very low).  It seemed to come from the tree line across the road and part way up the hill.  It was brief (seemed like 4 growls), and over by the time my boyfriend came back.  I didn't tell him at that point, because it didn't make sense, and I didn't want him getting irritated for my being spooked. He went back to the creek.  I sat in the truck and ate my soup, window half down to listen.  I heard more noise from the same area as before, this time loud splooshing and splashing (there was a drainage with water that was coming down from the hill to meet the creek).  The noise was very loud and distinctive, not at all like natural water sounds.  It sounded like something big splooshing in the water. My boyfriend came back, saying it was getting too dark to fish.  He sat in the truck with me and ate.  I started to tell him about the splooshing (which stopped when he came back) and the growling from earlier.  He was disturbed and said we should leave. We both knew it wasn't a moose.  We felt he would have seen it from the road.  We also knew a moose would have not have just hung around making more noise once it knew we were there.  I thought it was too big to be an elk/deer/bear.  We felt something was still there and we couldn't see it. We quickly put all the stuff in the truck and drove off. I was surprised that he was so scared, very unusual for him.  He finally told me that he had found big footprints by the stream, in the mud.  He said they were huge, much bigger than his print, and much deeper (the thing would have to have a large foot and be extremely heavy).  He had seen other tracks by the stream, from other animals and from a person earlier in the day (sneaker-type print).  He said no man could have made those bigger tracks.  He said the tracks also went into deeper brush.  When he was working his way back to the truck, he would try to follow these tracks out, but would only end up in deeper brush (thats why he was swearing). He said he was wondering at the time, \"Where is this idiot going?  Why is he going into the brush?\".  He thought there were tracks from more than one, at least two, and from that day. I asked him, why didn't he say something the first time when he came back. He admitted it took some time to process.  He also said that it felt like something was in there with him, in the brush. He said it took him time to put everything together, the crashing, the growling, the thing not leaving, the giant footprints, the uneasiness.  We both concluded it was likely a bigfoot.  Giant footprints like that are hard to argue with. The noises were made from a big animal , but he didn't see anything from the road.  My boyfriend said these things must have been intelligent.  They seemed to be watching/waiting/hiding.  They knew when he walked away and came back. When we drove away from the pullout, I had a good look at the brush between the road and truck, and it amazed me how small an area it was.  If something big was in there, and it didn't leave, it would really have to hide in there. I've always believed in bigfoots, but my boyfriend has always been skeptical (even despite the visual sightings by his step-dad, his friend, and his own odd experiences).  But he thinks it was a bigfoot.  I wish I had seen the tracks, but there was no way! Also, I don't think I've ever seen my boyfriend that scared.  He just kept driving.  When we finally pulled over somewhere. He wouldn't get out of the truck.",
  "classification": "Class B",
  "county": "Hinsdale",
  "state": "Colorado",
  "location": "-107.1971,37.89225",
  "location_details": "A little South of Spring Creek Pass, to the West of highway 149.  Don't know the name/number of the dirt road we took.  (I would be happy to sit down with someone and go over the maps, I just don't have it at hand.)"
}