{
  "reportId": "36006",
  "title": "Man recalls multiple experiences (including a daylight sighting) as a youth near Gainesville",
  "date": "1976-06-15",
  "observed": "It was the summer of 1975 or 76 not sure, as it has been so long ago.  I was 12 or 13 at the time when I  had 3 different encounters within about 2 weeks’ time with something that I now believe to be Bigfoot. First incident happened one sunny afternoon when my neighbor and I had gone down to the creek behind his house to fish for what we called horny heads, little fish with horns on the top of their head.  We were one house over from his house and had been fishing in this deep hole for about 20 minutes when his dog Tiger started acting very strange.  Tiger was one of the meanest dogs I have ever known and not afraid of anything at all.  Well Tiger started running around in circles and whimpering, I looked at my neighbor and asked him “what was wrong with your dog” and he said “he did not know he had never seen the dog do that.”  Well next thing we knew Tiger is tucking his tail between his legs and running all out for the house.  It was then that we heard from the hill behind us what I can only describe as what sounded like a lady being torn apart.  This was the most blood curling scream I have ever heard.  My neighbor and I dropped our polls and ran straight to the house.  Neither of us turned to see what was on the hill behind us.  When we got to the house we found Tiger under the house in the crawl space where he stayed for the next 3 days.  We could not get him to step foot out from there.  People said it might have been a bobcat or something like that but I feel certain Tiger would have chased after something of that nature. Incident number two.  The following week a different neighbor and I went down to Lake Knickerbocker, a small lake that is fed from the creek my other neighbor and I had been fishing on the week before.  We had ridden our bicycles down a small trail that goes from LeDan Road back to the lake.  It was again a sunny afternoon and we had fished for most of the morning without any luck so we had decided to pack it in, as we were headed back out on the trail we heard all these dogs barking and going crazy down the hill just below us near a swampy area on the lake.  We stop to see what was going on.  As we sat there on or bikes we could see the bushes and tall reeds swaying back and forth.  There was a lot of deep grunting sound coming from this area and the dogs were getting more and more intense.  That is when we saw it come out from the reeds, it was massive, hairy from head to toe standing upright like a man, but not a man.  This thing was a good 9 feet tall with hair all matted to its body. Its arms were huge and long with massive hands.  I have never seen anything like this in my life.  It turned toward an open field and started running from the blue tick hounds that were now chasing after it.  As it ran it appeared to be taking what looked like 8 to 9 foot steps from left leg to right leg, it ran upright just like a man swinging its massive arms back and forth, and the dogs didn’t stand a chance at catching it.  I turned to my friend to say “did you see that” in disbelief but he was already high telling it down the trail headed for home.  So I started after him when the fishing rods that were tied to my bike got caught up in the tree branches.  This is when I made my mistake of hollering for my friend to come back and help me.  As soon as I hollered I noticed that the thing running across the field had heard me too.  It turned and looked straight at me as it ran the rest of the way across the open field and did not look away until it entered the tree line at the other end.  My friend came back and almost broke our rods grabbing them and jerking them free from the trees.  When we got to my house about a half mile away my mom looked at us and asked “What’s wrong boy’s you look as though you have seen a ghost”.  Well we told her what we had seen and she just shrugged it off saying “you probably saw a bear”.  But we explained to her that it was no bear as it ran upright just like a man only taking huge strides, and that the dogs had no chance of catching it.  That was the last time I went fishing on either of those water ways. Incident number 3.  This happened the day after my neighbor and I had seen the thing at the lake.  My parents had gone to an office party for the evening leaving me at home with my older sister.  Well she and her boyfriend at the time decided to leave me at home and go see a movie.  So there I was home alone thinking about the events of the last week and a half, it was about 6:30 in the evening and I was freaking myself out.  I didn’t want to sit there in the house all alone so I got on my bike and started riding up on the street behind my house.  Back then there was a lot of tall grass and bushes between our house and the road behind our house; it runs along under a high power line path, with just a small trail going from our back yard to the road behind our house.  As I road my bike along the road I noticed that when I would get to this one spot there appeared to be something in the tall grass making a loud deep grunting sound.  I looked down that way and could see the grass swaying back and forth but could not see anything else, as I would pass the grunting would stop.  Then when I would turn around and come back by the grunting and swaying would start back up…. This happened for a couple of passes before I got scared and went and locked myself in the house waiting on my sister to return.  Three days later my friend that had seen the thing down at the lake with me and I were throwing a Frisbee back and forth up on the road near the place I heard the noise.  One of us messed up our throw and the Frisbee went flying down into the grass where the noise had come from.  I told my friend that I was not going to go get it as I thought whatever we had seen down at the lake was down in there the other night.  We both agreed to go down in there together and when we got to the place where I had heard the noises there was this big hole dug out in the ground.  The hole was about 10 foot in diameter and about a foot deep, it looked as though it had been dug out by hand there was also strands of long dark hair all around in the hole.  We got our Frisbee and got out of there quick.  We told our parents about what we had found but they would not go and see for themselves.  That was my last encounter with whatever this thing was.",
  "classification": "Class A",
  "county": "Hall",
  "state": "Georgia",
  "location": "-83.87177,34.36153",
  "location_details": "1st incident happened behind the 1st house on the left on LeDan Road coming off of Hwy 60 2nd incident happened about a half mile down Ledan Road at Knickerbocker lake 3rd incident happened behind 2nd house on right on Ledan road."
}