{
  "reportId": "1296",
  "title": "A geologist witnesses a reddish-brown animal hanging from a low branch over the bridge on the opposite bank of the creek from him.",
  "date": "1997-09-28",
  "observed": "I and one other person were in the area measuring and sampling rocks exposed near Cane Creek (we are geologists); throughout that morning, farmers had been hunting on their lands. As a result,we could hear sporadic gunfire all around us; after about thirty minutes to an hour, most of the gunfire had ceased. Some time later,as I worked, I heard a rustling sound   behind me. Believing it to be some kind of animal coming towards us, I turned my head to see behind me. Immediately, I observed something  hanging from a low branch over the bridge on the opposite bank of the creek from me. The first feature I noticed was the unusually long arms of the thing.  Secondly, I noticed that it was covered by reddish-brown long hair. The creature has hanging from the lower branch with its arms much like an orangutan does; in fact, the hair and the way it hanging from the tree made me think of it as an orangutan. Also, for some reason, I seem to remember that the arms had less hair than the rest of the body. The entity that I saw was about four to five feet long with about half of that being arm. The body was round and squat. I did not notice the legs or head of the thing. The window of observation was about ten to fifteen seconds although I cannot be positive.  Anyway, as soon as I noticed the thing, it dropped from the tree onto the ground.  However, the presence of the bridge prevented me from seeing it hit the ground, but I do believe I heard further rustling sounds although that was probably just imagination. Afterwards, I asked my companion if he saw or heard anything; although he indicated that he may have heard something, he said he did not see anything extraordinary.  That meant I was the only witness. We did not really search the area afterwards for traces or the creature itself. Since no other unusual sounds or sights occurred after this, we felt that nothing would probably be revealed. However, I did have a vague temporary feeling that this thing was advancing towards us.  Of course, considering the brief span of observation time, the distance (about 200 to 300 feet from me), and the lack of additional evidence, I still cannot be positive that what I saw was genuine.",
  "classification": "Class A",
  "county": "Muskogee",
  "state": "Oklahoma",
  "location": "-95.70208,35.70166",
  "location_details": "Incident occurred in the Northeast corner of NE 1/4 SE 1/4 Sec. 14 T14N R15E in western Muskogee County, Oklahoma. The area was about 4.5 miles south of the junction of Highways 16 and 72 west of Muskogee and 2 miles west of Highway 72. The creature, or whatever it was, was observed near a bridge above Cane Creek."
}