{
  "reportId": "789",
  "title": "",
  "date": "",
  "observed": "First of all I don't believe in Sasquatch's.  2nt I don't care if you believe me or not,( Nobody does, except the person that was with me) As a boy I just about lived on the Banks of the Santee, every summer my Grandparents would camp on the Santee River.  My granddad would take me out of school on the last day of the school year, and we would go straight to the Santee River and just about stay all summer. My Granddad use to tell us story's of a bear or something that look like one, my grandmom would make him stop because it would scare me so. She just tell me he's trying to scare me so I didn't ever believe him.  Until one hot summer night about 18 years later a group of friends wanted to go camping but wanted to go somewhere real succluded.  Since I was always in the wood they ask if I knew of any place.  I told them that I did know of a place on the Santee River about a mile from the Dam.  The next thing I know plans were set to go.  A girlfriend of mine at that time, wanted to go also so I gave everyone direction on how to get there and my girlfriend and I would set up a day early and see them the next day there. I haven't been to this place since my Granddad past away, it was to hard on me to go back but I felt like I was ready to try it again 10 or so years later. The Santee lake and around it is swampy and the lake is full of stumps, a lot of moss in the trees.  It a very beautiful place to go, but not to many people go to the river side of the Dam.  The river starting from the Dam is 51 miles form the ocean I know this because my mother caught a flounder there and someone took a pitcher of it and put it in the paper.  They told the story of it and that it was 51 miles from the Ocean. I know all about that river and I know where the grate Swamp Fox is buried way back on the river also.  Anyway, my girlfriend and I got to Wilson's Landing about 3:00 PM on a Friday that's a bait shop just behind the Dam, from there the pave road turns into dirt and mud. We drove about a mile back into the woods along the river to a place we use to camp. Nothing has changed one bit.  Except for the trash on the river. The river is at some spots about 200 yard wide and 1 foot deep in some places it only 20 feet wide and 15 feet or so deep.  When the water comes out of the Dam it is spite into by a island.  I have never been on that Island, It is very swampy and full of snakes.  My uncle still hunt on it though as a matter of fact this is why I'm telling this, he has hard something there and doesn't know what it is so I told him my story and he is the only person who didn't laugh.You name it, it's on that island Snakes, Wild Hogs, Deer, lots of Deer, people say they seen bear and gaiters. I am now saying there is something that walks on two legs and is not a bear. As I was saying we drove way back there and started to set up camp. To our right there is a cleft about 50 ft high with bushes and what not on it.  You know I'm not going to make a big story out of this, I'm just going to tell you what happened.  Where in the woods, it's dark and we here things on the river.  My girlfriend (who was new to this camping thing) kept asking me what was that on every little thing.  That was an owl, that's frog, that's deer jumping into the river from the Island.  Are you sure someone isn't down there throwing bricks in the water !  I told her it would have to be cement block to make that loud of a sound.  But I will take the light and shin down to the river and look. I went over to the edge and shined all around and didn't see anything.The noise stop also. So everything is fine for about thirty minutes.Then I mean Deer were jumping in that river like crazy. I have to admit and it could have been her asking all those questions, I was getting a little nervous. Then it happened, SOMETHING was coming up that cleft and I mean it was breaking branches and you could here the dirt falling down from the weight of it.  There is no way a deer can clime that bank. It was getting closer and closer and it didn't take but one what out of her to get me in the truck looking for my gun. Couldn't find it and I was yelling out to her asking where is my gun, she answered I don't know from the Passenger seat but here's the keys lets go. I jumped in and fired up the truck and started driving out praying I wouldn't get stuck, not here, not now. We made it to the dirt road and I hung a right, we left everything at camp, Food, tent, Lantern burning, and somewhere my gun!  I have never been that scared in my life!  I must have drove 50 feet and then I slammed on the brakes and yank hare left and stop facing the way we were leaving. What are you doing ? she ask. I grew up in these woods on this river and I am going to find out what's back there. She didn't say a word.  I started off and was going about 2 mph and looking with my high beams on. Looking for something, Deer or bear or something. We started around the curve to the left just around the curve is the drive to camp, I don't want to go there, so I told here we would drive up a little past camp and turn around.  I didn't go maybe 5 or 10 feet past the drive when this thing stepped out in front of us. I hit the breaks!  What is it? she ask, I don't know let me back up so I can see. All I saw at first and SHE SAW was to long hairy legs, I started backing up so my lights would spot it better since it was to close to the truck. GOD as my witness and her, this was no bear, this thing was maybe 7 or 8 feet tall and big, hairy and wet, it didn't stand real straight like you and me would but more at a slump from the waste up. It had the reddish eyes I have ever seen, and it just looked at us. Frozen, looking, not moving at all. Just standing there, OH my GOD !  My granddad was telling the truth after all. Then it just looked to his left and leaned as his leg started to turn then the other taking about a three foot stride, until it was out of site, gone into the woods. This thing walk on two feet and was not a bear. Sasquatch a hairy creature like a human being reported to exist in the northwestern U.S. and western Canada and said to be a primate between 6-> 15 feet tall----Called also Bigfoot. Hello I live in S.C.  I said earlier that I don't  believe in Sasquatch's but how am I to explain what we saw. One night that change me and her forever. The next day we saw those foot prints and they were bigger then mine, I saw the cleft and all the broken branches and the dirt that was dug out from it. Nobody will believe me when I tell this story but that's ok I don't care, I know what I saw and that's that. This was 7 years ago and the only reason I'm thinking about it now is because of my uncle who was telling me something last night.  Something he heard in the swamp/ woods on the Island of the Santee River.",
  "classification": "Class A",
  "county": "Berkeley",
  "state": "South Carolina",
  "location_details": "Santee River, One mile from the Santee Dam, Dorchester Co. near Pinevill S.C."
}