{
  "reportId": "5381",
  "title": "Solider describes late night encounter on Fort Jackson",
  "date": "1964-10-10",
  "observed": "I just read a report from South Carolina and not far from where this happened is Fort Jackson, near Columbia, South Carolina. Fort Jackson is an Army base. While I was serving in the Army on Fort Jackson something happened that might be related. We were on a training mission for escape and evasion.  I was supposed to escape through the enemy lines and make it back on my own. This was about seven or eight miles to walk through the woods, alone. As I remember the incident happened at seven pm just after dark. There was no moon. It was the darkest night I ever spent in the woods alone.  Being from West Virginia and hunting all of my life, this did not bother me too much. As I made my way down a fire lane at around two am I come to a crossing of fire lanes and stopped to rest for a minute and get my bearings. Back then there was no lights coming from Columbia or Fort Jackson to direct your way. I was about one step passed the crossing resting trying to decide on the way to go when I heard something coming. Immediately I thought another person was coming. I was happy that I would have someone to be with this dark night. I could not see my watch or my hand in front of my face only a faint white sand line path. I waited until this thing (or maybe two things) was within a few steps of me. Then I said who goes there.  This thing went to its left in a flash. It went about fifty to seventy-five feet away and just stood there. Then I heard what sounded like someone talking backwards in a sort of growl as I was standing their confused about what was going on.  In about a minute a two I heard this thing coming back toward me so I took one step to my left an kneeled down as it rounded the corner.  Then I stood up and said I got you now. That's when all hell brook loose. It took off running, crashing through the brush like a train. This is when I got really scared. The hair on my neck raised and I started to speak but was unable to. I said to myself boy you get out of here.  I must have run a half mile or so to my left and stopped to see if this thing was coming. I only stopped  for a second and started running again luckily in the right direction. I run up on an airport sergeant who had a fire built  and a truck waiting.  I never wanted to see a person so bad before.",
  "classification": "Class B",
  "county": "Richland",
  "state": "South Carolina",
  "location": "-80.80685,34.0431",
  "location_details": "on Fort Jackson i would say to the south"
}