{
  "reportId": "2394",
  "title": "Four friends saw and heard 8 foot creature plow through the trees while they were out fishing",
  "date": "1990-05-30",
  "observed": "It was late May 1990 and some of my friends and I were camping on the north side of Lake Ray Roberts. It was 12:30 AM when we decided to go fishing. We walked about one mile when my friend Russ looked at me and asked if I felt like some one was watching us. I replied \"I feel the same way\". At first we just thought it was some kids or a game warden, but when we called out no one answered. We decided to turn back. As we started walking back the feeling got stronger. We got to my truck at a dead run, then we noticed trees moving behind us. We got my mag light out of the truck and started looking at the tree line. We were parked about two hundred yards off the road, in a half circle of trees with an open field behind us. As we looked around we noticed the tall grass was pushed down like a deer had bedded down there. It was just beyond the tree line. That's when we heard a loud screeching roar. It was coming from the trees just beside my truck. When we turned to it, I shined the light and saw something plow through the trees. I looked at Russ and he was advancing toward the truck. I followed, and we asked Daryl and Kyle what they saw. Daryl was hunched down in the back of the truck with the .22 rifle I carry when camping. Kyle was getting in the truck and yelling at us to follow, we left in a hurry. The next night we went back with more guns (we were young and this seemed like the right thing to do since none of us had a clue as to what had happened.) I had taken a spotlight from my dad's boat, and a shotgun I owned. We went back to the same place and waited. At the same time as the night before we heard the roar again. This time it was further away, then it screamed again yet only a few feet from us. We got the spotlight and lit up the area and that's when we saw it running from us. It went from sounding far away to ten feet with out making a sound in the heavy brush. When we saw the creature, it was about eight feet tall and stood straight up with its back to us. Then as it ran away it stopped as if it was looking at us. Then Russ shot at it with the shotgun. I thought it hit it square in the chest. Then it made the same roar only more intense. Then it pushed a cottonwood tree over (we inspected the tree some time latter and the tree was very green and eight inch in diameter.). We left and did not return until the following summer. The area is more populated now and no evidence of the Critter (the name we gave it). That was some nine years ago and we have not seen it since then. We still go out there sometimes just to see.",
  "classification": "Class A",
  "county": "Cooke",
  "state": "Texas",
  "location": "-97.04361,33.48028",
  "location_details": "USA Texas/Cooke Mountain springs; north side of Lake Ray Roberts"
}