{
  "reportId": "1719",
  "title": "Possible collision with vehicle outside Homestead",
  "date": "1972-03-15",
  "observed": "My parents had a full-sized house trailer in Key Largo during the 1960s and 1970s for weekends and summer vacations.  At that time we lived north of Miami and would drive out SR 820 to US 27 to US 1 to get there.  After I got my own car and driver's license in the late 1960s I began making the trip down there ahead of the rest of the family usually leaving about 4am each Saturday. On one particular Saturday in '71 or '72 I had  made it down US 27 to about 200th Avenue(outside of Homestead in the Redlands)when I spotted red flashing lights ahead.  Obviously it was a wreck and it looked like it just happened - only there was just one damaged car just off the road.  The LE present were from the FHP and the Dade County SO.  I stopped my car on the side of the road, people did that back then, and got out. I noticed what I remember as an American mid-sized car with a very crumpled left front quarter panel. Just about that time a trooper and deputy sheriff emerged from a very densely wooded area at a right angle to the road.  That part of Dade County was very rural at the time and US 27 was generally the dividing line between anything that passed for civilization and the Glades.  I then also noticed that a man who was quite upset talking to them. One of the LEs was shaking his head and saying no one could have walked away from impacting a car at that speed and walked away let alone run away.  The other said he never saw a bear move like that.  Then a P/U truck stopped and another car.  The trooper told us there wasn't any need for us to be there and it was dangerous to be on the side of that road (traffic-wise it was one of the most dangerous in Fl). I never saw the creature or talked to the witnesses but I had this wierd feeling that you get when someone is staring at you - even before I knew what was going on.  I left and went on my way.  Well this wouldn't mean much to anyone except later that day I heard on a radio news broadcast that a man said he hit the Florida Skunk Ape and that he claimed that two LE Officers had given it chase into a dense thicket. I hadn't thought of much of this until about 15 years later I moved to another part of the state and got acquainted with hunters that claimed to have seen the creature, heard it, found its scat, and tracked it.  This being mostly in Lee and Collier Counties.  I just heard another story this last week and decided to tell what I know of an \"almost\" encounter.",
  "classification": "Class B",
  "county": "Dade",
  "state": "Florida",
  "location": "-80.5158,25.4817",
  "location_details": "US 27"
}