{
  "reportId": "34460",
  "title": "A large biped seen in headlights on a moonlit night in the Chuska Mountains",
  "date": "2011-07-16",
  "observed": "It was Saturday, July 16, 2011, about 12:30 a.m. early last Saturday morning. We were going to the Chuska Mountains on the Navajo reservation for a family reunion. We just left the main paved highway through Narbona Pass, Indian Service Route 32, Hwy 134, between Sheep Springs, NM and Crystal, NM. We went south on a dirt road, Indian Service Route 32, into the Chuska Mountains. we were about 5-8 miles into the mountains, when we came upon a small hill that curved towards the east, then to the south. As we approached the hill to go up, the road quickly turned right/south. As we reached the top, we saw the full moon and it lit up a flat green pasture that was on top of the hill. As we made the turn to the right/south I noticed a big black figure standing. As I looked at it, it stood with the full moon behind it, so that all I could see was a black outlined form. I kept my eyes on the figure while making the turn right. I said to my wife,  \"Did you see that?!\" She said, \"What?\" I said, \"Something is standing over there by the road.\" As I looked, I noticed that the figure was standing by a small pond, which was about 10-15 feet from the road. I could see the figures reflection in the pond, along with the full moon. I would say when I first saw it, it was about 75 feet away. As we got closer, our headlights turned to the right, away from the black figure, but I still could see it, because the moonlight was so bright. It just stood there, still, as if it was waiting for us to leave. I told her I was going to pull the truck onto the edge of the road. The road being dirt, and because of the rain, it had been plowed, so there was a ridge of dirt on both sides of the road. So, I pulled the vehicle, left towards the \"Bigfoot\" to flash my headlights on it. As my headlights flashed the \"Bigfoot\" it turned. We could see the legs (two) turn, the arms (two) turn, and it started running away from us up a small hill into the trees. It was a quick smooth run, I mentioned to her that it ran, Ninja-like, smooth and stealthy. In less than 5-6 seconds it was in the trees. As it was turning and running, we didn't see any clothing, buttons shining from the headlights/moonlight, we saw a huge mass, a body running on two legs, we never saw any eyes. We noticed the legs and arms, and for sure it ran on two legs up the hill. We were about 30 feet away from it when it ran up the hill. We could see that it was not a bear or human. It stood at least 7-8 feet tall. It was wider and taller than a person. After it ran away, we were in shock, we sat quietly in the truck, still for about 15 seconds. Then, all of a sudden my oldest daughter, screamed and said,  \"Daddy what was that.\" I was shocked that she was awake the whole time. I thought only my wife and I saw it. But, she was terrified, asking me, over and over, Daddy what was that. I couldn't say anything but tell her, it was a Bigfoot. My wife and I aren't crazy nor are we believers of Bigfoot until now. In fact, we were the biggest skeptics. But we can't deny what we saw. I have to believe it because it was real. My wife also admitted that she saw it too, as we first approached the hill, just like I did. She, just wasn't sure at the time if it was the same thing I saw. It was eerie and exciting at the same time. We also went back there on Sunday to look for tracks. There weren't any, the ground was extremely hard where it ran up the hill. Along the pond, we saw hoof prints from cows, dog prints, deer prints, no noticeably Bigfoot prints. By the way, the pond was only about 10-15 feet wide, it was just runoff of rain water, so it isn't always there during the year. It seemed to me, that it was not wanting to be seen. I believe if I didn't turn my headlights towards him it would have probably stood there until we passed by, then it would have left. I think it was very intelligent. Because it watched us. And even before I could get the headlights turned onto him, he had already started to turn away from us. It had to have known what we were going to do next. That is probably why we didn't see any eyes. I have lots of stories from my grandma about Bigfoot. She said they have been here since the beginning of time. And, that they were like us, living among us, until they saw \"humans\" start to fight among themselves. Then, they didn't want any part of us anymore, so they went into hiding. They, know that if they kill a human or make contact with one, they know that nothing good will come of it. So, that is why they stay in hiding.",
  "classification": "Class A",
  "county": "McKinley",
  "state": "New Mexico",
  "location": "-108.84,36.0605",
  "location_details": "We were on a dirt road, Indian Service Route 32, going South into the Chuska mountains. About 5-8 miles south of Indian Service Route 32, Hwy 134."
}