{
  "reportId": "533",
  "title": "",
  "date": "",
  "observed": "I am not sure I have anything to report, but cannot quit thinking about an experience I had this August 2000 in the Six Rivers National Forest in Northern California in Trinity County.  I grew up near there so am not easily \"spooked\" by nature's noises.  While camping with my family, my husband and I heard this very strange noise off in the distance.  It was weird enough for me to ask him, \"What was that?\"  He did not know either.  Having grown up in the mountains, I ruled out coyotes (we heard a pack of coyotes every other night we camped but not that night), foxes, and mountain lions.  I do not (or should I say have not believed) in the legendary Bigfoot.  My father was a timberfaller for nearly 30 years and never experienced any Bigfoot sightings, so I am not sure what to make of this strange sound.  To give you an idea of the indescribable noise, my husband's first impression was it was a bear that got hit by a car, although we did not hear a car for three days.  But after listening to the taped scream from Del Norte County, CA, the recorded sound was very similar to what we heard except it went on for hours.  I had my husband listen to it this morning and did not show him what it was, just had him close his eyes and listen to the recording and he agreed the sound we heard this summer was similar to the recording.  I am trying to rule out the Bigfoot possibility, that is why I am going to your organization.  This all happened on a full moon which further adds to the spookiness.  It lasted from about 10:30 at night until about 3 am.  It started to the left of out camp (no other campers around, as we do not stay in campgrounds) and got closer.  When it was directly across from our camp (all the while traveling along the rocky river bar) the noises stopped.  But what is strange is our four dogs started acting scared and started to dig to get inside the tent.  They whimpered, and having a Jack Russell, black lab and two dachshunds, acted out of character.  The did not bark at the noise which is what they would have done had it been an animal. They acted afraid.  Then the noise started on the right of the camp for quite some time, then started getting closer again. Again ceasing when it was across from our camp sight.  It went off to the left and quit about 3am.  It made the hair on the back of my neck stand up, and I don't think I want to \"see\" what mande those noises, and like I said I haven't been able to get it out of my mind.  I would like to find a simple answer to the sound.  As a side not, I had a video camera with me, but was too afraid to get out of the tent and go to the truck to get it! ",
  "classification": "Class B",
  "county": "Trinity",
  "state": "California",
  "location_details": "We were at a campsite located at Three Forks, which is near the source of the Mad River.  We were just off the paved road about thirty yards."
}