{
  "reportId": "20430",
  "title": "Possible camp stalking at Betsy Lake, Grandaddy Basin, Uinta Mountains",
  "date": "1985-08-17",
  "observed": "We backed pack into the Uintah's two years in a row - this was our second year. I have never shared my experience with anyone.  I was afraid people would think I'm crazy.  My personal experience happened about 1985-1986.  We were camping in the high Utah Uintah's (Grand-Daddy Basin) on the North edge of Betsy Lake, in a small clearing.  Since we were by the lake we built a little raft out of logs (tied them together).  The FIRST night something woke me (I was in a tent with my nephew).  It was about 2:00-3:00am I could feel and hear heavy walking outside the tent.  We had a two man tent and something was playing with the top of the tent (feeling the poles).  I lay in my sleeping bag (petrified!). Because we were so close to the water, I also heard someone (something) in the lake. What caught my attention the most was the long strides when they walked.  I knew it wasn't a bear, because bears would have clawed at the tents.  Whenever I camp, I always sleep in my clothes.  I finally got the courage to go out of the tent to look things over.  While I was putting on my shoes, my Nephew woke, and he said, \"What's that?!\"  I said, \"I don't know, but I'm going out to find out.\"  As I went out of the tent, I screamed as loud as I could (like Tarzan) to scare them away! The one in the lake came out and joined the other and they ran past the tents.  My sister heard them run past her tent and they ran fast!  They were gone immediately! The SECOND night I moved into the tent with my sister and her husband and my nephew moved into his sister's tent.  About the same time of the night, I heard them again.  I just lay in my sleeping bag wondering if I was crazy.  I could hear them walking around and I listened extra hard to recognize how large they must have been from the extra heavy footsteps and very long strides.  They hung around for several hours (moving around) and left at day break. The THIRD night they came about the same time.  I could hear them walking around again, and then one of them grabbed the tent rope and plunked it (\"Bing\" like a guitar string).  My head was about 6\"-8\" from the side of the tent and suddenly one of them ran their fingers across the side of the tent (that's how it sounded to me).  With my heart pounding and everyone awake, I stepped out of the tent to build a fire (hoping this would scare them off).  While I was building the fire, I could feel them watching me.  When the fire became a blaze they walked off (they didn't run this time).  Later in the day we went out on the raft.  As I looked into the water, I pointed and said \"Footprints\"!!  My brother in law laughed at me, but what I saw were large dips as if something had walked into and out of the water.  It was about the same place I heard something come out of the water the first night.  My brother in law teased me about my \"big Foot\" experience.  Since my brother in law is a heavy sleeper and snores loud, I have wondered if the sound of his snoring is what brought them to our tents. .",
  "classification": "Class B",
  "county": "Duchesne",
  "state": "Utah",
  "location": "-110.8139,40.61087",
  "location_details": "We went around Strawberry reservoir (NE of Heber) Hwy 40 up to Hanna, then on a dirt road, then backpacked to Betsy Lake (Granddady Basin).  We were on the North side of the lake. It as a \"No firearms allowed\", area."
}