{
  "reportId": "9785",
  "title": "Repeated encounters by Native American family",
  "date": "1983-06-15",
  "observed": "I have lived on the Warm Springs Indian Reservation all of my life, and I have had three 'run ins' with Bigfoot.  The first one was when my first daughter was about 2 years old, and we lived at my father's home at a place called Wolf Point.  Back then (1971) it was the only house out there, and the house had a large sliding glass door that went out to the back porch.  Back then, the glass doors were only 1 pane, and we had only a thin white sheet to cover it with at night. It was about 2:30 a.m. when I woke to hear my daughter giggling in the dining room.  I walked down the dark hallway, and came around the corner and I was about to tell Diane that it was too late to be playing around, when I saw why she was giggling.  We had forgotten to tack the corner of the sheet back up, so the sheet was only hanging by one tack, and the window was wide open, with the back porch light on. On the porch, there was a small bigfoot standing directly in front of the door, and it was jumping off the porch, then it would jump back up and my daughter would giggle and jump up and down.  I could only stand there and watch, but I felt so scared I wanted to just grab my baby and run!  Then it saw me and jumped off the porch and disappeared from my view.  That seemed to break me, because I screamed \"DIANE!\" and she spun around and looked at me.  Then I saw what I assumed to be the mother bigfoot walk by the window.  I lunged and grabbed my daughter's arm, picked her up and ran back down the hall.  My dad came out and asked what was going on, and I told him.  Being a very traditional Native American man, he got mad at me for allowing my daughter to \"play\" so late at night, and told me to go back to bed.  He said that Bigfoot have travelled and protected our people for many generations, and they meant no harm to us, if we leave well enough alone. The second time was when I was pregnant with my fifth child.  Again, I was living out at Wolf Point at my dad's house, but he no longer lived there, and had left his house to all his children after he remarried.  I didn't see it this time, but our dogs were barking up a storm, and I remember my Mexican husband (not believing in Bigfoot) telling me that it was only the cattle or horses that wander around the area.  Then the sound intensified, and whatever it was was hitting the rain gutters outside.  It wasn't trying to pull it down, it was as if it was trying to intimidate the dogs with it's size or something.  It intimidated me! And finally, my husband and my two younger brothers went hunting for rabbits in the Wolf Point area hills.  They were all talking and not really doing a good job \"hunting\" when my husband looked up and saw about 100 yards away a figure standing in the distance.  It was an open range with only juniper trees.  They had been on the plateau, and he assumed it was a horse standing facing them, so that it appeared to two legs only - until it turned sideways and walked very fast away from them.  My husband only described disbelief, being from Mexico and not really ever believing my stories.  Then they all started chasing it!  It went over a hill and they continued running their fastest after it, until they reached the point where it left their sight.  He said he abruptly stopped, because they were on a cliff that went straight down.  He described them looking for a trail or a ledge that it must of gone down, but there was nothing.  It just disappeared over the cliff.  He became a believer ever since.",
  "classification": "Class A",
  "county": "Wasco",
  "state": "Oregon",
  "location": "-121.1537,44.8464",
  "location_details": "My father's home was very isolated at that time, near Wolf Point.  Now it is a neighborhood and many homes have been added there.  It is wide and open, with juniper trees and sage brush."
}