{
  "reportId": "23978",
  "title": "Possible encounters near the Upper Chattahoochee River Recreation Area",
  "date": "1990-10-20",
  "observed": "I have a personal experience that would like to relate. I would hesitate to call it an encounter because it was dark and from an undetermined distance. Somewhere between 30 - 50 yards and it was on an elevated plane to us. Just outside of Helen off of s.r.75 north of the Upper Chattahoochee River Recreation Area. If you go to the top of the mountain north of the park clearing thats where my experience was. I had my first experience there in the year 1990. While a group of 5 friends and I were walking late at night we saw something on a near by ridge it stood up clearly visible but only as a sillouette in the moon light and jumped a very large distance. It then seem to stride over the back side of the ridge away from us. It was actually very quiet it didnt make a sound before we saw it stand and we didnt hear it land or stride away, as if it was stalking or observing us! Of course we were all extremely scared after seeing it initially. Again it was at night, and far away so we couldnt get a clear description. But we all saw it and were all struck with a panic like fear! I also went back with my dad who is a very harsh skeptic in the summer of 2006. We did not \"see\" anything but I had noted a couple of other things at this later date it was summer. First there was a very strong odor that seem to hang in a centralized area the entire weekend. Secondly the park rangers came by to tell us that the night before in the same place we were camping the last people left food out went into town after night fall and returned to find the camp completely ransacked so we needed to pack our food up or better yet keep it in the vehicles back on the road. They said the bears were forageing and getting brave because of the onset of the drought. Again no sightings but interesting because nobody actually spotted the \"bear\" either! And lastly along the mountain road at a heigth of 9-10 feet off the ground there was a 4 inch sappling rung and twisted completely around! My dad once spent 3 months in the woods living off the land in the late seventies in north Georgia. Its the number one reason he is skeptical he says that long in the woods and he would have seen something if it was out there. But when I noticed the odor and asked him if it was skunk, he said no not really, more likely a wet bear that got sprayed by a skunk but it had a more dank odor than just skunk. And also when I pointed out the rung tree and asked him what could have possibly caused that he had no clue!  I work in agricultural marketing. My job is to determine the amount of meat that will be derived from individual cow carcasses after slaughter and before they are split into primal cuts. To determine this we have to compare the confirmation of the animal or the ratio of muscling to fat and factor in the skeletal structure of the animal. So if I apply this to what I remember seeing when I was younger this creature was absolutely huge at least 8 feet tall and weighing easily 550 pounds! It was tall but had a slightly more narrow build in shoulder area width than the animal in the Patterson film. It was still too large to be human, wider and thicker muscled than a man but not as stocky as the Patterson footage, that is why I say it may not be heavier.",
  "classification": "Class B",
  "county": "White",
  "state": "Georgia",
  "location": "-83.78375,34.78035",
  "location_details": "Poplar Stump Rd. (FS 44)"
}