{
  "reportId": "5953",
  "title": "Family hunting near Wahkiacus is stalked by a large animal",
  "date": "2003-04-23",
  "observed": "I am new to the net,found your site in a magazine today at the doctors office.This event takes place about about 15years ago on a hunting trip in the Klickitat-Wahkiacus area of Washington State.Our family has hunted this area for many years on this trip things got a little spookey.There was a total of 7 of us all hunting the same place 2 are now deceased.We started off this saturday morning the second week of October, opening weekend of deer season driving our vehicle down a old abandoned skid trail in the vecinity of the old Woodruff mill,to get into a hot spot where we would park my disabled mother on a stand.When it was starting to get light enough my father and I proceded east from the vehicle to head off on what we called a drive(try to push the deer out of the brush and to my mother). We were walking down the road it was a little soft from the night before rain and dense low fog.W e were loking for sign when we encountered the tracks right on top of where are tires had just rolled something had followed our vehicle.At first we thought it was a big bear immediately we were on alert.As we examined the tracks more closely we determined that bears dont walk on their hind feet for this long of a period of time.There was no front paw tracks!We continued on our drive encircleing the area.On our way thru the thick buckbrush heading west back to the truck we started hearing noises,something was now tracking us.We could smell a strong oder that was like cat urine or a dirty cat box.At this point we were both scared we could hear it smell it but we could not see it.The visibility in this brush was near 5ft.in most places besides the trail we were on where you could see 20ft to the front or rear of you.We started to move faster for the truck as we sped up so did it.The brush behind us was cracking so we took cover behind 2 trees each of us on the oposite side of each other aiming to where the noise was.At this time whatever it was squealed in a high pitch(almost like a woman giving birth)and took off running n.w. of our position.Hoping it was gone and fearing it was heading for mom we scrambled that way.When we got to the truck she was in it with the doors locked.She told us it was N. of her position making lots of noise(thrashing).We went to investigate,we found more tracks and trees about 4inches in diameter were uprooted and thrown down the gullyside,there was no sign of it.We met up with my uncle and cousin and showed them the tracks they could not beleive it.We went back to our uncles camp for lunch when we got there we noticed more tracks it had come into the camp.My cousin is a big guy his shoe size is a 15,these tracks had more than 3-4 inches on him whatever this thing was it is BIG!! I dont tell to many people about this for fear of being laughed at or called crazy but for the 7 of us we will never forget.",
  "classification": "Class B",
  "county": "Klickitat",
  "state": "Washington",
  "location": "-121.1692,45.88039",
  "location_details": "North at old Wahkiacus post office for approx. 4 miles there is a school house.From there it is approx. 2mi N.W. on private land."
}