{
  "reportId": "980",
  "title": "Elk hunter spots reddish-brown sasquatch",
  "date": "2001-03-05",
  "observed": "I called the professor at WSU and left a message but he never contacted me. I had a pretty close encounter in September, 1994(I believe)  near tolgate, OR during elk bow season.I had been in the woods for several days. I was tracking a hit elk on the north side of usfs rd 64 (skyline)about opposite jubilee lake at about 1 or two PM. I was down the skookum spring side of dusty ridge about 1/4 to 1/2 mile from dusty spring, an abandoned campground, and saw movement about 70 yds crosslope and down at the edge of a clearing(approx 50 76 45 n 117 59 30w)some 30 or 40 yds across . a large biped with unusually long seeming arms walked across the clearing heading away and upslope at an unhurried pace. near the far edge of the clearing it stopped and turned, looking directly at me. it was covered head to foot in hair, dark brownish in color and i got a very (too good actually) look at it. it knew i was there, i have no doubt to this day. it then turned and continued away. i saw it for perhaps two minutes, in bright sunlight. I vacated the area without finding my elk or going over to look for tracks. I can say it was not a man or anything i have seen before. as it walked it swung its arms but they were so that the palms of the hand was clearly to the rear and much nearer the knees as opposed to the hip as mine are. The datetime can be better established because when i got home and was telling my wife, she said that the previous weekend some guy had taken videos of bigfoot at Hoodo spring some twenty miles from where i was at and they had been on the news. I have no pictures but can certainly take someone to the spot without difficulty even now.",
  "classification": "Class A",
  "county": "Umatilla",
  "state": "Oregon",
  "location": "-117.991,45.84175",
  "location_details": "north side of usfs rd 64 (skyline)about opposite jubilee lake at about 1 or two PM. I was down the skookum spring side of dusty ridge about 1/4 to 1/2 mile from dusty spring, (approx 50 76 45 n 117 59 30w)"
}