{
  "reportId": "40204",
  "title": "Daylight sighting by a young man fishing near Whittemore",
  "date": "2013-04-11",
  "observed": "My name is Michael, and I am 17.   I had a Bigfoot sighting in Michigan. I was fishing one day and I was all alone because I walked up and down the river for almost a mile and a half. I was fishing and all of a sudden a huge rock hit the water like 50 feet down from me and make quite a big splash. This is in the Whittemore Area, and I looked down the river and then this big giant apelike creature looked out over the river at me and literally scared the crap out of me it had really long hairy arms and big broad shoulders and the head on this thing was way bigger than a human. The creature stood at least 11' in the air. Then it turned and started walking into the woods, but it walked toward me. it made like 5 steps and stopped. When it walked you could hear the sticks and leaves cracking under its feet. It got quiet but too quiet. Even the birds stopped chirping. It was getting scary. So I packed up my fishing gear and started walking curiously toward the trail. I was yelling into the woods and asking \"Is there anybody there?\" but nobody answered so I started walking down the trail. on the quarter mile back to the main road. I started walking back and then I kept getting this feeling that someone was watching me or something. I turned around and as I turned around this big giant thing jumped over this barbed wire fence and ran up the hill leaving this big stump swaying aggressively. It was up and over the hill in like 5 seconds. This thing was freaken Fast! I ran up the hill but on the other side was a big field. It was gone by then. I later bumped into my Aunt my brother and my cousin. They said that they heard something walking up by this pond then they heard a low growl and then it walked away. I really hope that you guys investigate this case because I did some research and the last sighting in Iosco county was in 1985. Was it the same Sasquatch? Please help me understand what I saw? Please?",
  "classification": "Class A",
  "county": "Iosco",
  "state": "Michigan",
  "location": "-83.89001,44.2725",
  "location_details": "location was: Whittemore Area off of W. M-55"
}