{
  "reportId": "8251",
  "title": "Young deerhunters see moving biped shape and later hear vocalizations.",
  "date": "1985-10-25",
  "observed": "At age twelve my cousin and I embarked on our first official hunting trip with my other cousin and father. We set up camp early in the day a few miles north and east of McCall,Idaho. The day was October 25th, the weather was cold and clear with a corona around the moon telling of the coming snow. It was dusk and my cousin and I had just finished setting up our lean-to shelter about seventy yards from where my dad and other cousin had there tent set up.  We both got a feeling of being watched. We turned and saw the silhouette of a very large bi-ped observing us from only about ten feet away. Scared we reached for our rifles, but by the time we turned back the creature/ animal was gone. My older cousin was quite a prankster, so immediately we thought it was him, but he was still at the campfire talking to my dad. In the morning no tracks were found as the ground was nearly frozen. That next day we walked up into a nearby drainage about seven miles from camp. At an elevation of around 7,200 ft the area is covered with huge granite slabs and a sandy soil from the erosion off of the rocks themselves. Mid morning we both heard a low guttural yell, which sounded like someone was saying heeeyyyyyy, several times. It was one of those sounds that makes the hair on the back of your neck stand up. Later my father told us that this wasn't the first time he had heard this odd yell.  Evidently, when he had started hunting with my grandfather they both had heard this same type of vocalization on various occasions. Since this initial trip I have hunted in the area 19 years, and have heard the same type of yell four other times, all in the same area.  I can honestly say this sound is like no other I have ever experienced; from mountain lion screams, elk bugling, deer and moose grunting, and bear snorts. On other hunts into the area, the sound has been witnessed by two other hunting companions. It always seems to occur in the same drainage. Initially I thought it might have been the wind echoing off the rocks, but I have been there in all different types of weather conditions and can testify that this is some type of animal generated sound.",
  "classification": "Class A",
  "county": "Valley",
  "state": "Idaho",
  "location": "-115.75,45.08334",
  "location_details": ""
}