{
  "reportId": "16518",
  "title": "Hunter hears guttural scream while on overnight hike outside of Oroville",
  "date": "2006-10-20",
  "observed": "I am new to hunting but I have spent my whole life hiking in the woods.  This potential incident happened on a deer hunt.  After seeing a herd of does, I found a buck trail leading uphill.  I followed the buck trail trying to find sign like, feces or tree marks.  I would come across some fresh buck feces every hundred yards up the saddle between Chopaka and Hurley mountain.  I saw buck sign everywhere, I marked it with a buck tarsal scent gland from a fresh deer kill from my friend.  I continued following the buck trail and signs up some very steep country with lots of boulders and dangerous rock fields.  I finally found and spooked whatever I was following; I never saw it but it stormed off over a rock field before I could get sight of it to shoot.  I am assuming it was a buck or sheep or mountain goat.  The fresh deer sign ended here and I decided to continue up, following old deer sign and camp.  It got very, very steep; I climbed approximately 2000 foot of gain to about 3/4 of the way up the saddle.  I was too tired to reach the top of the saddle, so I camped on the back side of a large tree in the midst of boulder fields.  There were many berry patches with thickets hard to pass through.  I built a soft bed for my sleeping bag and built a fire.  I saw a large pile of droppings that were black with lots of berries in it, probably bear; they were not round balls like the deer droppings I had encountered before.  I used a deer call throughout the day.  Sometime after the sun set, maybe 2 hours I heard a frightening scream come from the top of Mount Chopaka.  I had an excellent view of the snow covered peak from my slope side camp.  I have never heard a sound like this.  It was only one guttural scream.  I can describe it as a Pterodactyl (flying dinosaur) cry from a movie.  It had an extremely loud volume.  I slept with my .44 magnum ready for the worse.  Nonetheless, I didn't sleep well that night. A week or so before this incident, me and a buddy were hunting in Chinchelo Creek of the Sinlaheikin (wilderness area), which connects to the same woods as Chopaka.  We were using a dying rabbit call and we were sitting on logs waiting for a bear to come out.  We both heard a soft yet loud hissing sound pass behind us like a shadow.  We saw nothing, it was eerie almost as if a ghost had passed behind us. I also saw a shadow out of the corner of my eye as it passed.  This was very creepy.  Neither of us have heard anything like this before.  My buddy works in the woods all day and has never heard this.",
  "classification": "Class B",
  "county": "Okanogan",
  "state": "Washington",
  "location": "-119.5423,48.94655",
  "location_details": "directions are as follows: from oroville pass through nighthawk then turn right on chopaka rd just before palmer lake.  travel halfway down chopaka road to BLM hunter access point.  climb 3/4 up the east saddle between chopaka and hurley mt."
}