{
  "reportId": "1391",
  "title": "Man has late night sighting north of Redding",
  "date": "1999-03-04",
  "observed": "On or about March 4th, I had decided to take a drive up the inner-coastal (I-5) highway from Sacramento, CA to Portland, OR to visit some friends that I had not seen over the holidays. At approx 9:30-10:00 I stopped for gas in a small town just north of Redding, CA. I departed and continued heading north to Edgewood. I was searching for another exit, one with food, however I didn't find one, so I exited and drove out about 1-2 miles on a paved highway that turned into dirt without warning. (Off Edgewood road). I pulled my car over, and got out some food I had taken incase I couldn't find a restaraunt. I proceeded to eat, and take a short nap. I awoke about 1:30AM to the sound of something hitting my car from what I thought to be the front. I got out to look around and found a rock had hit my vehicle in the hood area. I found this very odd, and thought maybe some kids were playing around. I re-entered my vehicle, started it up again, turned on the lights, and to my utter surprise infront of me was a creature (for lack of a better term) just in the range of my headlights. Apparently it had been there watching me walk outside the vehicle and didn't move or make a sound. It seemed uninterested in me, then suddenly turned and started to move away (left) into a small brushy area. I would have to estimate it at 7'0 to 8'0 tall, somewhat of a chocolate color, and very mobile for its size. It did not seem awkward by any means. I was not sure what to do, so I locked the doors and waited until I got my bearings together again. I got back on the highway and used my cell farther up the road to try and call CHP. When I reached them, I was unsure of how to explain this. I decided to call leter on when I knew exactly how to say what I had to say and not sound crazy.",
  "classification": "Class A",
  "county": "Siskiyou",
  "state": "California",
  "location": "-122.4306,41.45833",
  "location_details": ""
}