{
  "reportId": "24301",
  "title": "Man remembers hearing strange vocalizations and seeing a hairy, upright figure while hunting in Sweden Valley",
  "date": "1987-11-28",
  "observed": "My incident occurred on the second day of deer season 1986 or 87. I was hunting alone in the afternoon and the woods were quiet. It was the second day of antlered deer season and I was surprised I didn't hear any shooting. I was near the top of a ravine/bowl and standing on the ground next to a tree where I could survey the valley and sides of the ravine.At about 3.00 to 3.30 pm I just got an odd feeling that something was wrong...really wrong. I had hunted and hiked in the woods for the past 10 years all the time and never felt that way. I have even done a lot of night hunting and was lost in the woods one night..I still never felt that way. Before long I heard what I assumed were a couple of hunters talking to each other loudly.But what they said made no sense.It sounded like the japanese language played backwards.The hunters were moving uphill and covered a distance of about 200 yards in 12-15 seconds!!!There was a foot of snow on the ground and the hill had about a 30 degree grade.(I did the math..its about 45 mph)!I was puzzled and just figured my mind was playing tricks on me.Then I heard loud limbs breaking and expected to see deer run ahead of the \"hunters\" so I got ready.After about 5 minutes a movement out of the corner of my left eye got my attention.There was a lone pine tree swaying like it was in a hurricane.The top of the tree was moving severely to the left and right about 40 degrees!Something was standing under the tree which appearred to be moving it.It was about 7 feet tall and I saw it for about 5 seconds.Its \"arm\"? came down and it took a step forward.It then moved a couple steps and was behind a group of trees.I would say the color of the hair was medium brown with a slightly lighter area.When it stepped behind the trees it never came out the other side.Keep in mind these trees were spaced about a foot apart and were maybe 8 inches in diameter.The odd thing was you could not see any hair between the trees or movement even through my scope.I was about 70 yards from the thing and couldn't understand where it went.I knew it would have left tracks but something overwealming told me to stay away.I had what others have described as a sense of \"doom\" which is a good description.That was it.No smell or other events.I never knew what to think of what happened and stopped hunting after that.Since then I found this site and that memory came rushing back after reading a number of the stories.I did not get a good look at the \"thing\" but it was not anything I had ever seen in the woods.",
  "classification": "Class B",
  "county": "Potter",
  "state": "Pennsylvania",
  "location": "-77.99314,41.70813",
  "location_details": "It was about 3 miles south on 872 from route 6. Just as 872 starts as a long hill ,there is a dirt road that leads off to the left.Right were the dirt road meets the hyway climb that hill to the top..that is were the event occured."
}