{
  "reportId": "9840",
  "title": "Nighttime sighting on country dirt road",
  "date": "2004-12-06",
  "observed": "On November 18, 2004  at approximately 6:45 pm, I was traveling south on a winding, dirt road less than 5 miles from my home on C Hwy between McDowell and East Purdy, Mo. As I drove along, I noticed ahead in the ditch line, an animal.  I know that there is a mule that often gets out nad roams the area, so I slowed down considerably so as not to hit her. As I got closer, it stood up, facing my Explorer.  Instead of moving into the headlight beam as a deer or something would do, it came at an angle from the ditch, towards the passenger side of my truck.   It was in my estimate, at least as tall as I am (5'8\") covered with hair.  The hair was a buff or light color. All I really remember at that point is hitting the lock button on my doors and screaming.  It came up to the passenger side window and I could see it's chest.   If I saw the face, I do not recall it, just the chest in the window.   I was screaming and hit the accelorator and sped away as fast as I could.   I don't know what it was, only that I have never seen anything like it before in my life. But, it does make me wonder about events that have happened around our house in the past.  In the spring of this year, my dogs started going crazy barking and I stepped out onto the porch to see what was wrong.   I hear a scream that I took to be  a mountain lion.   Knowing that I had a dog in the back pasture, I went to my truck and went to the back to let her into the main pasture with the other dogs.   I noticed on my way down to the back pasture that my very large dogs had all of my goats in a tight knot by the small barn and the dogs were in a semi-circle around the goats.  When I got to the back, to let the other dog in, I noticed that there was no sound at all in the woods nearby.  My dogs were silent.  The dog that I went down to get was terrified and rushed through the open gate as soon as I opened it.   I went back to the house and went to bed. The next day the neighbor told me that my dogs had fought something behind his house at about 3 am.   He didn't know what it was, only that it was large.  When I checked my dogs out, they did not have the slash cuts they would have had, if they had tangled with a mountain lion.  There were scrapes but that was about it. Our fence at the back of the place was also pushed down.  Our fence consists of cattle panels that are 52\" tall.   They are hooked to the post with heavy wire ties.  I can not bend the ties with my bare hands.  At the place where the fence was pushed down, the panel was loose from the post and the clips were in the brush.   AT the time I thought it odd, as a mountain lion would not have been capable of doing this.  A bear could, but not a cougar.",
  "classification": "Class A",
  "county": "Barry",
  "state": "Missouri",
  "location": "-93.8232,36.8133",
  "location_details": "I can show you the place where I saw it."
}