{
  "reportId": "24134",
  "title": "Homeowner hears possible howls east of Winter Springs",
  "date": "2008-06-30",
  "observed": "On Monday, June 30, 2008, between 5:00 a.m. and 5:15 a.m., I had the experience of hearing a chilling and unexplained sound.  I was taking numerous boxes and garbage bags from the garage to the end of my driveway at the street for trash pickup.  I had made approximately 6 trips back and forth when, after laying a box down at the curb, I heard something that made me stop in my tracks.  I experienced what I first thought was the start of a loud siren, a loud and ascending WHOOOOO…, coming from across the street.  The sound came from a tree line about 200 feet away at the edge of Horseshoe Lake.  There are empty grated lots directly across the street from my house (about 125 feet deep) and then approximately another 25 feet or more of dense palmetto scrub and primarily pines and loblolly bay trees down to the lake shore.  The sound continued to ascend in pitch and when the pitch didn’t change like that of a siren and I realized that a siren would not be coming from that direction, but rather from the highway behind our house, I felt somewhat panicked.  The sound ended in a booming –OOP.  The entire whoop was long in duration and went from a low to high pitch.  It seemed to be aimed directly towards me and was extremely far carrying in tone.  I immediately felt the hair on the back of my neck stand up.  When my brain could not place the sound with any animal or bird that I am familiar with, I became very frightened at thinking that a man was watching me and calling out.  I started to take some steps backward towards the garage in anticipation that I would see something moving towards me across the empty lot.  Within seconds of the WHOOP, an owl called out with a common hooting from the top of a tree in that same area, as if it had been startled.  The owl’s voice was very distinct from the other sound in the loudness and the way it carried, as well as the elevation of the source of the sound.  I went back into the garage and waited for about 5 minutes there to listen for any other sounds, but only heard the frogs that are common at that time.  Although still dark, there were clear skies at the time, and I could see the silhouette of the tree line.  My side of the street was dimly lit by the lights in the garage and street lights a short distance away.  I go out at this time every morning to haul trash and to take my dog for a quick walk out to the mailbox, and I am used to hearing numerous types of frogs, owls, and whippoorwills. As I stood there, logic told me that even a large man could not have made the resonating sound that I heard from that distance away. Over the next few days, I told my family members what I had heard and asked if they knew of an animal or bird that made such a sound, but they didn’t.  The sound I heard was so unusual, that I couldn’t dismiss it.  I felt the need to keep trying to satisfy the mystery of the sound by placing a native bird or animal to it.  I read every voice description of Florida bird species entries in my North American bird book, paying closed attention to all owls, loons, cranes, egrets, herons and hawks, that I thought may be large enough to have such a bellowing voice.  None of the voices were described as “whoops.”  I then went online and searched for “bird sound whoop” and “animal sound whoop.”  I spent quite a bit of time on National Geographic’s website listening to voice recordings of numerous birds from this area as well as bobcats, coyotes, foxes, etc.  Nothing seemed to match.  I then started to notice the many links to the BFRO website as well as a link to a video of our local Channel 13 newscast of an expedition that BFRO had in the Tampa area about a year ago.  When I played the news clip, and heard one of the female researchers make a call out like a whoop, I almost felt relieved, like I knew in my heart that I was on the right track.  The sound I heard was very similar to the call she made, although the whoop I heard was of a longer duration.  After seeing the news clip, I felt more comfortable about researching the information on the BRFO website.  I came across the sound recordings, and after listening to several, I became convinced that what I heard matched more closely to some of the Skunk Ape recordings than to any other animal or bird known in this area.  I decided to call your organization to discuss what I had experienced. Below are the most similar recordings I found on the website as compared to the sound that I heard: 1974 Whoops and Knocks from California (although I heard only one “whoop” and it was of longer duration) The “Florida Howl” and the 1994 Moaning Howl from Columbiana County, Ohio (the howls in this clip start off like the siren-like beginning of the whoop I heard, but these then descend in pitch as opposed to the one I heard which continued to ascend until ending in a –OOP)",
  "classification": "Class B",
  "county": "Seminole",
  "state": "Florida",
  "location": "-81.14076,28.63434",
  "location_details": "Exact location omitted"
}