{
  "reportId": "46475",
  "title": "",
  "date": "",
  "observed": "The Backpack trip Draft 9-8-2014  Background:  Biologist at a major biotech company.  No previous experience with Sasquatch or similar, but have seen a couple shows on television (1 episode of finding BF, and one episode of Survivorman). The Survivorman version was more honest in the “I don’t know what that was” category and peeked my interest; later reminded me of the structure I saw on the ravine trail here.  I have many years camping experience, and some deer and turkey hunting, and grew up summers playing Dan’l Boone in the woods, so I am pretty comfortable in the woods normally.  After this, I really have no interest in chasing BF – but would go there again only if I had a few capable buddies together for security.  On August 31st, I went on a solo backpacking trip on the Wilderness Trail at Meramec State Park in eastern Missouri.  The trail traversed a ~10 mile loop through the ~7,000 acres of protected wilderness with backpack campsites scattered along the exterior circumference of the loop.  I started at the main trailhead at the MSP Cabins parking lot, traveling counterclockwise along the route.  I was on the trail at 4PM sharp, a sunny day with chance of evening thunderstorms, highs in the mid 80s.  Trail goes through a heavily forested area, typical Eastern white oak, hickory, with understory trees and shrubs, poison oak, etc.  – significant areas of the trail were overgrown and thick annual weedy undergrowth, and many creek crossings (soil is moist under the rocks, but almost no areas with clean free-flowing water).  After fifty yards or so there is a trail-use sign-in box; the box was pretty full of hiker slips so I gathered the rangers do not check it often.  Heading clockwise, campsites 1&2 are about ½ mile in, and about 3.5 miles are campsites 3&4.  I ran into two people (day hikers) on their way out near the sign-in box.  Human sign became very thin after ½ a mile, and zero footprints or any human sign after the backpacking camp 2.  I was very much alone after that, and evident with the thick weedy overgrowth (thought path was visible nearly always).  As campsites 1&2 were in a hollow that was muddy & buggy I kept going to campsite 4, which was on high ground with much of the undergrowth removed, and excellent visibility.  No sign of large mammal life save one whitetail deer buck I scared about 1 mile short of campsite 3.  The site looked like it had not been used for a year.  No footprints, disturbed anything, and the piles of logs were pretty covered in fungus.  I decided to go a bit further on the trail looking for fresh water before doubling back to make camp; I was a running a little low on water to enjoy lots of drinks.  After campsite 4, the trail heads steeply down into a ravine following a creek (the creek head is more or less at camp 4).  Going down 150 yards or so down the trail in the ravine, its gets very dark and overgrown, and I got a sudden creepy feeling I was being watched, and I kept halting to listen as I may have been hearing echoes of my own pack squeaking.  Trust your instincts.  Not finding water, and the creepy feeling getting much worse, I turned around heading back up to make do with the water I brought in.  Half way back up I noticed I had earlier walked right by a very strange “structure” formed out of 3-6” thick trees bent and broken about 6-12 feet off the ground.  They were all bent inward towards each other from different directions, still with green leaves, and no other trees around showing wind stress or damage, and this being in a protected ravine, it made no sense.  I’ve never seen it like that before, except maybe where one tree felled another, but not bent and broken midway up the trunk.  Besides, there was no big fell-tree in sight.  I shot a few quick pictures with my iPhone and quickly headed up to camp.  Seems safer there being open and with a homey firepit, and a four-square around it of linearly-laid logs etc.  After dinner, I went to bed about 9.  The sleep setup is a camping hammock between trees maybe 30-35’ from the fire, a bugnet bag surrounding the hammock (dark mesh also affords privacy), and a taught inverted V-shaped tarp over all in case it rains.  I was just getting settled and then endless noises started.  Noises I could not identify for the most part.  Around 9:30PM, it was nearly pitch black with occasional wind gusts very high at the top of trees.  Below me towards the deep woods ravine: and then two loud knocks in quick succession.  I recall how loud, close, and how musical they were, not dull bark on bark, but like a baseball bat against a oak tree, or like the sound wood makes when it is being split by an axe.  But nobody could swing an axe that fast, or just make two swings, much less there was no one within miles.  The knocks were followed by sticks breaking underfoot, and then a loud snort or two like a big deer or horse maybe 20’ from my hammock.  I was frozen to move.  Then someone shook my tarp very quick.  I shone my light and saw nothing (but difficult to get good beam through the bug net).  Maybe ½ hour later the sound of a rock landing and loudly clacking against other rocks in a dry creek 25’ behind me, and something plucked one of the strings on my hammock or tarp (boinnnnng).  Man, something was right there.  Again a quick look to catch something and I could see nothing with my flashlight – but the beam only went about 8 feet at most through the bugnet.  At this point and the rest of the night my heart was pounding, and I was praying for rain to make the things go home. A while later, up on the ridge where the single knock came from, a loud ugly animal scream  - maybe six in a row (like a fox makes, but deeper).  At some point I swear someone was messing with a stick on the fire, the coals moved around like someone threw something at them again and again.  I got an impression this was like kids playing around or something.  At the same time, for at least two hours, the constant sound maybe 30-40 feet away of someone walking around quietly and picking through a rotten log or removing bark from a tree.  Like looking for grubs or ?? There aren’t any woodpeckers a 2 AM – right?  Also, I was surprised that no whiporwhills, chuck-will’s-widow or other birds were making noise.  Come to think of it, no owls either.  Very quiet except for these “things”.  The log chipper was flinging bits and pieces – like small twigs landing on my tarp over and over, but would stop if I shone the flashlight.  The whole thing was like someone messing with me having fun.  I sat motionless. But more of the same went on and on.  I did get the impression someone was more curious and insistent then going to eat me.  By then I had my machete, knife, and flashlight in the hammock with me … but I am a small man. I lost track of what came before what between about 1 and 3, but this went on all night until about 4AM.  Around 2, I heard a fluttering sound about the hammock and tarp (like someone blowing several loose raspberries with their lips bbbbfppppt, and flicking the tarp with their fingers).  This was really annoying.  At some point around 3, I fell asleep exhausted, but awoke to the sound of a dog’s collar tags coming closer jing-jing-JING-JING getting louder and closer – Thank heavens, a dog to chase them away!  But I yelled Hey!, and it stopped instantly. But I found there was no dog, and instead it was my zipper pulls jingling together … someone had been flicking and jingling them only 2 feet from my head.  Later I swear I heard people talking, a woman in a casual conversational tone, like someone hiking to camp (again felt great relief.  But who would be hiking to camp at 2 AM, and it stopped suddenly and nobody was here – plus no lights of course.  I hear her again, and then nothing.  Could not make out any words (at one point I thought maybe someone in the woods was messing with me), but there was no one there and no footprints or otherwise noises that people make.  Whatever these things were, they were fast and deadly quiet when they wanted to be.  Occasionally sticks breaking underfoot, or grunts, but not much.   I’ve heard deer breaking sticks underfoot, and grunting, so it wasn’t hugely different from that – but this is 2-3AM, and kept coming back and they would not do it sniffing around a person’s hammock.  I remember a few other things up on the hill behind me.  At some point lot of loud wood cracking – trees being broken or pushed over.  But I don’t recall hearing the thump of them hitting the ground.  Also, in the great distance over the hill outside the park was some kind of a red-neck rodeo with the sound of jeeps and four-wheelers zooming around, and a few distant trains & whistles.  At one point dogs barking very far away back there, - possibly at the red-neck party but they didn’t bark long just a few times (not a coon hunt), and I recall that really upset whatever it was below me in the woods.  I don’t recall what they did in response, but I made a mental note that they became very agitated at the sound of dogs (possibly just lots of stick breaking).  During a quiet spell, I’d had enough and chanced it to out go pee.  I didn’t see anything, but did find one sock was missing from my boot.  Thinking a raccoon got it, and thinking about hiking back with one sock was memorial (funny and annoying at same time).  But the next morning my sock was back, thrown more or less where it should have been. It is possible I was so tired that I just missed the sock in the night, but I’m not sure.  Again, messing with me.  Later I woke to some scratching on my backpack like someone checking it out (the backpack was right behind my head leaning up against the hammock suspension tree) and then that started plucking at my hammock guy-wire.  With a quick flash of the light it stopped and – nothing.  It was hard to see directly behind me, but no Raccoon either and they always move from people and light.  Either way, in the morning, nothing at all messed with my pack, sweaty clothes still sitting on my pack, or my food bag set 50 feet away – all pristine and untouched.  Very late, maybe 4AM, I hear the scream on the hill again, but this time Much deeper voiced.  Maybe a combination bark and scream.  This one really scared me as it sounded like a huge dangerous daddy.  But nothing happened.  Lastly, I heard the most ghostly howling below me.  Quiet at first, but ghostly, with lots of air and echo, like the way a person would tell a campfire ghost story making a ghost howl, starting high and moving the ghostly echo tone gently lower and lower through all the minor notes.  The long ghostly howl ran twice, then it was over.  I almost laughed as it sounded so fake, and ridiculous after such a long crazy night.  Almost like the Matriarch calling everyone home down the hill now that big daddy was back, and time to go to bed.  In the morning, the rain finally came between 6-8AM, I ran out to cover my clothes and batten-down the tarp and was grateful for the peace under the tarp.  Packing up and leaving between 8-9, I noticed a few other things of note, but cannot tell if they were associated, unrelated, or my tired head. 1. The tarp was last to take down.  Shaking all the rain off, I noticed an extremely dark shape in the open woods back above me and facing me.  Black like nothing else.  Set very low, I thought it might be a huge dark gall on the side of a tree trunk 75 yards away.  I moved around a bit and it did not move or change, so I assumed just a gall that got wet.  In hindsight, there was definitely something about that thing that wasn’t right and got my attention so raptly.  Maybe about the size of a crouching adult person, but fatter and shorter. 2. One of the logs next to the fire had been severely gouged out with bits and pieces pulled out.  But after the torrential downpour in the morning, hard to say when that was done.  But not real long ago as they were colored bits.  I might have a photo of it by accident when I took some last shots of the camp, I can look. 3. On the hill above me, it seemed odd that so many large trees (entire trunks), were laid down in linear piles.  Like piles of 6-10 trees on top of another all on the same direction.  Could have been a logging operation, but there was no logical arrangement of the piles to each other, and no road anyway.  That was another spot that was compelling to check out, but I did not feel comfortable going up there to investigate at all. 4. I looked over the small dry creek bed behind me for heavy deer footprints but I could not find any to explain the huge ruckus all night, and the snorting next to me, and the stone clacking in that area.  But it did rain. 5. About 2/3 mile from the exit on the way out, just before the spur to camps 1 & 2, I heard a crash a large limb falling down and hit the ground just maybe 15 feet off the trail to my left.  Pretty close.  Of course hiking I’m looking mostly towards the ground/trail, not up.  A bit startling, but not totally unexpected if we had a downpour and storm in the morning.  But I heard buzzing nearby, and my feet moved before I knew it (having experienced yellow-jacket nests in the wild before).  50 feet away looking back and I saw that the crashed tree/stick or whatever, had a hornets nest on it and the hornets were making a small black cloud.  Fortunately they hung around the nest area being also confused, I took a picture from a distance and got out of there.  In hindsight, could something have really been trying to send me a message to never come back?  Perhaps I’m over-thinking it.  I was out by 11AM and in a daze for a few days after that… Of all the sounds, the deep cry of big-daddy and the creepy ghost howl bothered me the most.  That or the thing shaking and plucking at my tarp guy lines, jingling my sipper pulls over my head,  and tossing rocks and sticks at me.  I could not explain those at all.   The grunts and first set of screams… could be other animals like foxes, huge deer, a bat fluttering under the tarp… well, maybe, but given all this, it’d have to be grand central station for the zoo. ",
  "classification": "Class B",
  "county": "Franklin",
  "state": "Missouri",
  "location_details": "Meramec State Park, Missouri.  Off of Interstate 44, near Sullivan.  In the large section of wilderness."
}