{
  "reportId": "2070",
  "title": "Two men see something walk up and over ridge behind home",
  "date": "2004-10-17",
  "observed": "I am the brother In-Law of the person who told me they had an experience back in the early 70's. My brother In-Law told me it bothered him for at least a year after he saw something. Strangely enough,I have reported a sighting my family had in 1994 in Wyoming.This was reported in your February 2001 listing under new sightings. My brother In Law Dan, told me of his experience after I told him that I reported mine to BFRO! Dan's story goes like this: He had gone up to visit some people camping in a trailer. As he arrived and turned off his motorcycle engine, he observed something dark in color moving on an open hillside below a timber line. There was snow on the ground, it was getting towards dusk and it was a little foggy.The thing was two hundred and fifty yards away approximately. As Dan observed this thing, he noticed it was quite tall, seven feet or more in height. This thing let Dan know that he saw Dan by looking back directly at Dan, as he continued walking uphill towards the timber. He looked back at Dan several times without breaking his stride. His stride was long, longer than a man's, and was effortless as he walked through the snow. Dan thought, what kind of a man would be wearing a dark hairy suite that covered his entire body, out in the forest? Dan also noticed that this thing was much bigger than any man he has seen and it's build was very big! Dan felt it could weigh a good six hundred pounds or so. This creature disappeared into the timber. Dan knew he had seen something very unusual and he was aware of Big Foot sightings in the news. He just let his story go all these years until I am now reporting it to you. ",
  "classification": "Class A",
  "county": "Chelan",
  "state": "Washington",
  "location": "-120.2955,47.35305",
  "location_details": "Will need to talk to Dan to get the details, he can give them to you."
}