{
  "reportId": "8621",
  "title": "Boy scout hears repeated screams",
  "date": "1974-08-15",
  "observed": "Channel 2 News and becoming curious as one day long ago I heard sounds that to this day I can't identify. In August of 1973 or 1974 I believe, I was a twelve or thirteen year old boy scout on a scout camping trip at Camp Baldwin, Oregon. Another scout and I, in order to receive our 'camping merit badge', had to spend a night camped out in a tent away from the other scouts. We left the rest of the scouts to find our campsite, approximately 1/2 to 3/4 of a mile away from the main camp one late afternoon. We set up our tent, gathered the firewood for the night and cooked/ate our dinner. We sat around the campfire talking until we felt it was time to go to sleep, and retired to our tent and our respective sleeping bags. The boy I was with was quickly asleep but I was having trouble falling asleep. After what seemed like hours I finally started to drift off when I heard a sound in the distance that shook me bolt upright and wide awake. It sounded like nothing I had ever heard in my life, nor have I heard it since. I would estimate that it came from about a quarter of a mile away, in the opposite direction of the main campsite at Camp Baldwin. I've listened to the recordings of the vocalizations on your website and this sounded a bit different. It began as a low guttural sound that grew louder and higher in pitch until it sounded very similar to your recordings, high pitched and kind of warbling, before dropping in pitch and dying off quickly. Each vocalization lasted approximately 7 or 8 seconds. I listened to this sound repeat many times for probably an hour, maybe a little less, with my head buried in my sleeping bag not making a sound. The sound seemed to get closer at times, but never sounded close enough that I thought we were within its eyesight. Still, fear kept me from making a sound, even to wake up my tent mate, and I just lay there listening and trying to remain as motionless as possible. Eventually the sounds quit and what seemed like an eternity later I finally fell asleep. I am 42 years old now and have spent my life in the Oregon woods, fishing and the like. I have still yet to hear anything that even remotely sounds like what I heard that night. Was it Bigfoot? I have no idea as it did sound somewhat different than the recordings you have on the site. I do know it was a sound that scared the hell out of me and as an outdoorsman born, raised and still living in Oregon, cannot come close to identifying to this day.",
  "classification": "Class B",
  "county": "Wasco",
  "state": "Oregon",
  "location": "-121.424,45.4051",
  "location_details": "I've never been back since. I couldn't tell you anything about the exact location."
}