{
  "reportId": "4093",
  "title": "Daytime sighting between Pocahontas and Imboden",
  "date": "1977-09-25",
  "observed": "My dog started barking at something on the hill, that is where the road is up on a ridge, our property descended down at a slope of about 20 degrees.  When dog started barking he would usually run up the hill to investigate, but not this time. I had tamed this dog which was 1/2 shepherd & 1/2 Wolf. The dog was the leader of a Wolf pack at one time & that dog wasn't afraid of anything, but he would not leave the yard. The dog had a son about 2 years old & he was whimpering under the house. I would have never seen this if the dog had not have been barking. The creature was walking along the road on the hill about 200 yards away. The creature stopped and looked at us then turned & started walking down the hill toward the dog.  Well, about 20' off the road we had an electric fence & on this fence we used copper-steel-weld wire, copper coated steal basically, you could pull a car with stuff. The creature walked through the fence like it was honey suckle vine. I heard the fence break one second later & I heard the sounds of it falling all across the hill, it makes weird sound when I breaks.  The creature looked down & around then looked I me and I am still standing there scared stiff not knowing if I should move of not, then it turns & begins to walk a lot faster in the other direction, it was only seconds until the creature disappeared over the hill.  Later that day, after my parents got home, I went up the hill with my dad to look for any evidence, but there was drought that year & the ground was so dry there were no footprints.  I did notice the tree limb the creature walked under, that was only a foot from its head, but was too high for me to reach, at least 9'.",
  "classification": "Class A",
  "county": "Randolph",
  "state": "Arkansas",
  "location": "-91.1125,36.19791",
  "location_details": "Randolph county between Pocahontas & Imboden AR about 1 1/2 miles down Squrriel Rd."
}