{
  "reportId": "31888",
  "title": "Scary encounters outside a rural home near Jackson",
  "date": "2004-10-22",
  "observed": "I am about to graduate with a BS in Biology, and want that noted. The incidents began in the fall of 2004. It started out as hearing strange howling sounds in the evening. I never heard the vocalizations in the day time.  In the fall of 2004 some friends and I went camping on my driveway. It was the middle of October, and around 2 in the morning I heard a loud grunting sound and trees snapping. The noises were so loud that they woke me up. It was a full moon that night and clear, and when I opened the window on the tent I could not believe what I was seeing. I saw a large dark figure with eyes that seemed to illuminate red in the moonlight. It was beating something in the head which I found to be a deer come sun up. The creature drug the deer up to the top of the hill above the camp sight. It walked up on top of some big rocks and I could make it out perfectly. 8 to 10 feet tall and covered in hair. The one friend who stayed the evening saw the exact same thing. I watched it eat the deer. It pulled off appendages like it was nothing. Shortly after it started eating it noticed our tent. It walked right down to the side of the tent, and the smell coming off of it was intensely musky. It knocked the frying pan out of the tree by the tent as it was walking by, and when it hit the ground, it ran back to the top of the hill. The deer carcass was gone, but hair and intestines were left behind. The liver, spleen, heart and lungs must have been eaten. We followed the drag marks from the carcass and found a mass of pine trees bent and broken into some form of shelter. I have many other encounters that I can share. They are real and they are here. I have had rocks thrown at me, and I have been charged by one twice. I barely got inside the house both times. They do not like light, and they do not like it if you shine a light directly at them. I say them because on more than one occasion my fiancé and I heard at least three. Hardwoods and swamps surround my house. When this started there were many subdivisions going in, and massive habitat loss which had to drive them to my property. There is also a 20,000 acre national forest that is squatchy as all get out about 7 miles from my home. The sounds are not as frequent now, but they can still be heard from time to time here. I only hear them in fall and winter though. I am also a hunter, and when I was hearing the Squatches every night, there was not a deer to be found. When I did see deer they were very jumpy. This was during archery season that I made this observation, therefore no gun shots were occurring to spook them. I promise you from the bottom of my heart that they are real. I have seen them in person more than once. If the wind is right you know when they are close because of the smell.",
  "classification": "Class A",
  "county": "Butts",
  "state": "Georgia",
  "location": "-83.90588,33.34677",
  "location_details": "Halls Bridge road runs parallel to Jackson Lake. They are many cow pastures in the area that people rarely go in."
}