{
  "reportId": "23448",
  "title": "Possible nighttime encounter by campers at Volga River State Recreation Area",
  "date": "2006-10-07",
  "observed": "It was in the fall of 2006, we were camping.In the Volga River Rec. Area in Fayette, IA. It was myself and 5 other friends. We were sitting around the campfire, I'm going to have to say it was about 11:30 P.M. There was a campsite farther down from us with a husband and a wife. They also were sitting by the fire. My friends and i decided to take a walk about the campsite. There is a open field along the road of the campsite Josh and I decided to sit there to see if we could call in some coyotes that night because the moon was full that night making it easy to see. The rest of the guys went back to the campsite. Josh and I went and sat along the side of the field. We were sitting there, making the sound of a dying rabbit. The field is border with large trees, and bushes. After about 10-15 minutes, we see a large \"person\" step out onto a little hill at the edge of the trees off to our left. We had a tall friend with us so started saying to the person, \" haha Mike very funny!\" gestures of that sort and the person didnt move or speak. All we could see was its upper torso and its eyes color, I can't recall the exact color. So we ran back to the campsite to make sure it wasnt just our friends spooking us, and sure enough they were all there. Josh and I grabed a shotgun that I had brung for safety, and when we got back to the spot the \"person\" was gone. We were both very frightened by this we ran back to the campsite told everyone what we heard no one believed us. Later that night I saw it again, this time it was in the woods across from our campsite, just on the edge of the woods. The moonlight was bright. This time I called everyone over to look, this time Mike, Josh and me all saw a very large black shadow across the road moving towards the first spot we had seen it. After the incident I really had no idea what this was. It was very large man like probably about 6- 6.5 ft tall all i could tell is it had a black color to it. I also saw eyes that is all I can recall from the incident, hearts were definetly racing at the time. If i would have known about your site I would have put this on a lot sooner.",
  "classification": "Class B",
  "county": "Fayette",
  "state": "Iowa",
  "location": "-91.75641,45.8618",
  "location_details": "The area lies just east of State Highway 150 and about five miles south of U.S. Highway 18. The Volga River Recreation Area is in Fayette County. Cedar Rapids is 70 miles south, Dubuque is 90 miles southeast, and Waterloo is 55 miles southwest of the area. (Iowa DNR)"
}