{
  "reportId": "35339",
  "title": "Unexplained happenings on a farm outside Tuscaloosa",
  "date": "2012-03-15",
  "observed": "I live in Tuscaloosa Alabama in the Yellow Creek Community  ... My husband and I have heard screams in the woods from some kind of animal that is so loud and it has a long guttural yell that sounds like a man... We have never heard anything like this. This has been going on now for three weeks in March 2012, almost every night just about 8:30, or right before it getting dark. Then it stops for about a month, and now it has started back up again. I have lived in the country all my life and I am 52 and my husband is 66 years old. We are not a bunch of kids making these things up. I know what cougars, coyotes, bears and wolves all sound like. We have never heard anything like this in the woods before... Other then fourteen years ago, my son who is in the Army and still is to this day. He and I were sitting outside one night at 11:00 talking... We heard the same thing yell out then... It came from behind my house and it yells out in that long guttural yell three times and after the third time it sounded like there was 50 or more coyotes were surrounding us and they stated yapping like crazy. ... The recent sounds are coming between my Grandfather's old house place and my home... It is about a 1/2 mile away. We have a huge lake behind us and nothing but woods... My grandfather has some old abandoned gravel pits and lakes close by too.. There is a swamp in front of our home about 1/4 mile away. I was also told when I was a child that back in the 1930’s my grandfather went through the gravel pit one night ... He saw something setting on a hill that looked like a huge hairy thing that had a face like a man.... This was before all the media hype from the Patterson films.. I need help because this thing is getting closer to our home. My husband doesn't have good hearing and he said he could hear it upstairs one night and it sounded like it was in the yard. We have animals, Cattle and Donkeys here we don't know whether to shoot at the sounds from where it is coming from or what... On March 31, 2012, it sounded like it was right down at the bottom of the holler right past our fence ... It sounded like TWO of whatever this thing is, was mad and was yelling at us. I got so scared I took off running into the house.... I have never been so frightened in my life, and believe me when I say I go outside a lot at night by myself I really do, we have a huge wraparound porch   I love to listen to the owls and whippoorwill at night but nothing like this has ever happen to me before.... Last week I went to put my puppy up for the night in our garage then I heard whatever this thing is, let out a scream, I called for my husband to come home it was back. When he got here we heard it growl. It came from the same area as before. Like I said before we heard it just about every night for 3 ½ weeks and then nothing… That night I told my husband HE BACK! Then the next night we heard it again but this time down in front our house down at the swamp. For the past 2 years people have stripped cut thousands of acreage of land all around here and a lot of animals have migrated around here. My father didn’t have his timber cut and he has a large amount of land and we live in the middle of it. We have no one who lives by us. I e-mail you at BFRO in March and I have been talking with one of your investigators.",
  "classification": "Class B",
  "county": "Tuscaloosa",
  "state": "Alabama",
  "location": "-87.28992,33.20837",
  "location_details": ""
}