{
  "reportId": "5771",
  "title": "Silhouette awakens boy while camping near S. Fork Nooksack River",
  "date": "2003-04-23",
  "observed": "This was a long time ago. In the summer of 1972. My cousin and I were spending a weekend fishing on the South Fork of the Nooksack River. The exact location was at the end of the Strand Road off of Highway 9 between Sedro Wooley and the Mt Baker Highway. We were both going into the 8th grade. Our parents dropped us off on a Friday and would pick us up Sunday. Crazy werent they! We set up camp fairly close to the end of the road, about 50 feet from the river. We spent Friday afternoon fishing and came back to our camp and built a fire. Finally we went to bed. We both stuck our pocket knives in the sand next to us in case we needed them at night. I was startled awake in the middle of the night by a sound and as I awoke sleeping in my sleeping bag saw the silhouette of something on the other side of a small fence, and slightly above us. It was about 20 feet away. There was a full moon behind which created a perfect silhouette image. This creature made a series of long hissing type sounds. The best discription is a hissssssssssss. Then it would stop for a bit and do it again. It did this 5-6 times. The silhouette was from about the waist up, it was broad shouldared with no neck. It had a sloping forehead and not noticable ears that I could detect. It rocked slightly from side to side as if it was smelling us or trying to see us laying there a bit better. It could not have gotten right us without going through this fence and under some small branches. It appeared that it was likely crouching down maybe on one knee. I was obviously petrified. It was there for probaly 3-5 minutes. When it left it kind of pivoted its entire body to its right and was gone. I would estimate this to be about 3 in the morning. I heard nothing as it walked away. I layed there for the rest of the night frozen stiff with fright, to the point that my body began cramping up! I did not hear anything as it left, nor smelled anything. I did hear shortly after it left, from the direction of the river and sounding like across the river a series of clicks with what sounded like rocks being hit togethor very rapidly. They were hit togethor 3-5 times very fast. I heard this a few times firt fairly close, then farther off as if going away from us. My cousin did not hear a thing.. sleeping away. We stayed there the following night without incident. although with a big fire going and fishing line tied to each others wrist, should we need to wake each other! In the morning I told my cousin and we looked for tracks, but did not see anything. The field that this thing was on was hard packed and it was very hard and dry, so no indentations. I know what I saw! It was not a man nor a bear, nor someone trying to scare us making a growling sound or something.. None of that! It makes the hair stand on my neck as I recount this incident even though it has been nearly 30 years ago!",
  "classification": "Class A",
  "county": "Whatcom",
  "state": "Washington",
  "location": "-122.2156,48.76075",
  "location_details": "Heading South on Highway 9 from the intersection of Highway 9 and the Mt Baker Highway, past Van Zandt about 5 miles to the Strand Road. Turn right on the Strand Road, going about 3/4 mile until it dead ends at the South Fork of the Nooksack River."
}