{
  "reportId": "654",
  "title": "",
  "date": "",
  "observed": "I was bow hunting and had parked myself between two deer trails, each running along side a clear cut. I was dead center with 25 yards between me and each trail. I faced west into the wind at about dusk. There was usually a lot of deer in the area but on that evening it seemed very quiet. Just as it became too dark to see my aiming sights, I heard crunching foot steps coming from directly behind me. At the time I thought it might be a buck in rut. The animal seemed to be following my sent directly to where I was hidden in some blackberry bushes. A cover scent had been applied to my clothes and boots using pine needles that were blended with water. My clothes were soaked in the solution and dried -- very effective ... for deer anyway. This animal walked right up to the clearing behind me. I had plenty of time to turn around to situate myself for a clear shot. I raised my bow and it came into view 25 yards away and stopped. It seemed know exactly where I was sitting. We were staring at each other from a distance of about 75 feet for about a full minute. The bigfoot slowly swayed back and forth a few inches from side to side. I estimated it to be about 7 1/2 ' tall and maybe 600lbs+ . I never pulled back on the bow and the bigfoot eventually just turned around and walked in the same direction it came from. Because of the thick leaves on the ground no tracks where found the next day when I returned to look around. This animal was black in color and its shoulders were approx. 4 feet wide. Since this incident happened I've brought up this subject with many people in this area and I am suprised at how many have had, or know someone who has had, experiences in this County. If you're ever in the area look me up and we can take a trip into the Cascades here behind my home.",
  "classification": "Class A",
  "county": "Clackamas",
  "state": "Oregon",
  "location_details": "In the woods near Hunter Road, outside of the town of Colton"
}