{
  "reportId": "29836",
  "title": "Family experiences strange occurences while fishing Kankakee River",
  "date": "2011-07-02",
  "observed": "The day was july 2,2011 we decided to go fishing at the kankakee river out in manteno, il. Ive been fishing there for about 10 yrs. just recently about 4 yrs at the new location between the wilmington and momence dam. it was about 11pm  when me and my nephew decided to go and check the lines we had set about 50 yrds or so away from where we had set out chairs and fire. my gf and other nephew stayed behind. this has happened before on past occasions where i have the feeling someone or thing is watching me run my lines at night. i dont make any big fuss about it as i dont want to startle my nephews, or who is with me on that day. this occasion on july 2 2011, i noticed my nephew that was sitting with my girlfriend at the time i was checking lines that he was fueling the fire to get brighter. when we got back he and my gf both said they heard footsteps behind them with brush moving. i paid them no mind as i didnt hear anything. about 10 min later i heard what sounded like someone walking behind us. i asked them to turn off the flash lights and i went and stood in the little path we walk threw in pitch black just watching. and in the distance to my right about 20 or 30 yards i hear a sort of grunt/growl. but i didnt see anyone. as i walked back to my chair and told them to keep there lights off. my nephew asked my other nephew if he keeps farting hes gonna punch him, i told him thats not a fart its to pungent to smell that way. as i have encountered that smell before on previous visits to that site to fish. after that i here a whooping noise noise behind us in the direction i heard the grunt/growl. i always thought it was like a big geese/goose at night, but we have never seen any at night. since ive herd that noise before it didnt bother me none, as ive herd it before. we ran our lines and packed up to leave about 12:30am as the 4 of us are walking out i got that feeling again that someone is following us back to the bridge to our right. again i dont mention it to my nephews or gf as i dont want to startle them of get them worried and panic as there easy to frighten. 2 days later i had seen one of your shows and herd the exact whooping noise that i had herd. and it got me to think what if it is you know! THE SQuatch. i asked my dad if hes ever herd these noises also as hes gone a few time with me fishing and when he herd the whooping noise and the tree knocking in the distance, he confirmed that he has heard that as well. and my dad is a believer but doesnt acknowledge it. He is the type that says things are out there but if you dont believe it it wont happen, if you go messing with it your gonna find yourself getting the you know what scared out of you. i did some digging on your website and found that there has been sightings near that area/town or county.",
  "classification": "Class B",
  "county": "Kankakee",
  "state": "Illinois",
  "location": "-88.01345,41.207",
  "location_details": "south of route 102, on s warner bridge road. under the bridge crossing"
}