{
  "reportId": "36280",
  "title": "Campers hear knocks and unknown vocalizations at night in Tillamook State Forest",
  "date": "2012-08-18",
  "observed": "My adult daughters where out camping the weekend of 10AUG2012  in a slightly remote camp in the Tillamook  forest. For 2 nights in a row they heard possible big foot calls that went on for 20min the first night and about 3 min the next night. I can assure you it was not any Elk, Deer, any of the owl species, That calls where  whoop call, and im told  extremely loud, This group totaled 6 that weekend that heard this series of calls. The following weekend this weekend friday 18AUG I myself and a friend from work and his daughter went to the very same camp to hear for ourselves and attempt to get recordings of the calls, long story short, I’m an experienced out doors man as an avid Bow hunter and fisherman I’ve spent countless hrs in the woods and have heard most of all the local animal calls. From all the known owl calls, to every possible combination of elk and deer calls to the death moan of a bear. I’ve been known to follow elk heads at night and just be in a good place to hunt them in the Am. Be that as it may On Friday the 18th I set out to this camp and waited for the arrival of my work friend and his daughter. After dinner we relaxed at the camp fire till about 9:00 p.m. and set out for a short hike to the power line rd and did some Knocking, with  no responses’ we returned to camp and was doing a little star gazing around the camp fire.  At 10:15 p.m. to our astonishment we heard in rapid succession a series of Knocks 1,2,3,4,5 pause then 1,2,3,4,5, coming from the SE 2 sets of about 5 of 6 knocks with a delay between sets of about  no more than 5 seconds. Within 10 seconds of the second set of knocks we had our recorder going hoping to capture more  knocks on tape when from the NE we heard a classic call back Howl in response 2  Howl calls in fact, We have captured those calls on tape. Being that our camp was in-between the calls my best estimate of distance or camp was from the calls where no more than a ¼ to a ½ of a mile as the crow fly’s with us between them, our camp that night was the only camp site taken in the whole camp ground. With the closest set of camp grounds approximately 6 miles away. In conclusion with my current back ground in Metrology and reporting my findings with an unbiased opinion using the return calls taped on your show that I’ve heard over time and applying them as a reference standard I must therefore conclude this as the genuine article and report this as very plausible given my own personal experience. All I need now is to personally see one and it push it over the top for me. As it stands right now I feel 85% certain that this phenomenon is real. I am no expert with regards to Bigfoot and would love to hear your thoughts on this matter and would very much enjoy putting you in contact with all involved and giving you the audio we recorded. I look forward to hearing back from you as I would very much like your thoughts on the recordings we have.",
  "classification": "Class B",
  "county": "Tillamook",
  "state": "Oregon",
  "location": "-123.3973,45.61308",
  "location_details": "Oregon Hwy 6 West."
}