{
  "reportId": "3024",
  "title": "Campers hear vocalizations and find possible prints near Skookum Meadow",
  "date": "2001-08-11",
  "observed": "Since my wife and kids were away visiting my parents in Ohio, two co-workers (A.S. and D.G.) and myself decided to try our hand at bigfoot \"hunting\" after hearing about the BFRO expedition to Skookum on the Medved radio show and then reading about it on the website.  We decided to camp out two nights (starting Friday) at the Tillicum campsite which was about 4 miles from Skookum, hike into Skookum Saturday, and then leave Sunday morning. All three of us were sharing a four man tent and after going to bed Friday night, I was awoken by A.S. who mentioned that there were strange sounds outside. At that point all three of us were lying there awake. The first sound that I heard sounded just like coyotes but then I heard a weird gutteral growl like sound (which in all truth kind of gave me the shivers). That was the last sound I heard and before going back to sleep I remember commenting aloud \"weird\". The next morning before going out on the hike we talked briefly about the sounds and A.S. mentioned that before the coyote sounds there were some stranger sounds that had woke him up (more about this and the other sounds later). On the hike down trail 21 we found some deer trails that per A.S.'s GPS system looked like they went down do Skookum. We decided to follow the trail and maybe an eighth of a mile down the trail A.S. got excited and pointed to what could have been prints.  The prints were vague but did appear to be somewhat human shaped with possible toe and hill prints (the ground was fairly firm and the prints did not look fresh). I would say that the prints looked like size 12 or 13 feet. The prints also appeared to go down the trail and there were possibly 4 or 6 that we could make out. Since the prints were pretty vague it would have been impossible to make casts and we decided that the pictures probably wouldn't come out well (now I wish that we had). For the rest of the trip we didn't see or hear anything strange. After the trip we discussed the prints more and of the three of us, D.G. appeared convinced that the prints were the real thing, I was fairly neutral giving them about a 50% chance of being the real thing (I would like to have higher confidence but I was worried that we could be biased in that we \"really\" wanted to see something) and A.S. who had been the first to see them and initially very excited pretty much talked himself out of thinking they were anything of importance BUT he kept mentioning those weird sounds we heard the first night and how he thought they might have been something. I didn't think too much about the sounds besides doing my rendition of them for my wife, brother, and sons until the night of Friday August 17th. Up until that time the main reason why I didn't pay them as much attention as I later would is that they didn't sound like the sounds available on the BFRO website. That all changed on the 17th though when I was getting ready to put a movie in the VCR and noticed that \"Encounters with the Unexplained\" on the PAX channel had a special on Sasquatch.  After watching for about three minutes, they played supposed bigfoot sounds and several of them WERE JUST LIKE THE ONES I/WE HEARD!! My wife who was in the next room unpacking heard the same sounds on the tv and noticing how similar they were to my renditions made a comment as to whether or not those were the same I heard. In that instant when I heard those sounds on TV I decided that we had heard a bigfoot and for about the next half an hour I had goosebumps going up and down my body (my wife was shocked/amused about how shaken up/freaked out I was). On Sunday I called A.S. up (he had been away for the weekend) and questioned him more about the sounds that had originally woken him up. He said that he had first heard a long moaning like sound followed by a loud wail which was followed by the coyote and other sounds which I had also heard.  We decided that we might as well submit this report to BFRO and after talking with D.G. he also agreed. My apologies that this is such a long story just about some bigfoot sounds and possible prints but I am still very excited about it all and thought that you might be interested due to this all happening in the area close to Skookum.",
  "classification": "Class B",
  "county": "Skamania",
  "state": "Washington",
  "location": "-121.8,46.1333",
  "location_details": "Sounds heard while at Tillicum campsite located about 4.5 miles NE of Skookum meadow.  Possible prints found on deer trail off of hiking trail 21 while going to the meadow."
}