{
  "reportId": "25975",
  "title": "",
  "date": "",
  "observed": "My best friend and I were big night hiking fanatics, and decided to go to one of our usual hiking locations just outside of the Phoenix area. We picked up two of our friends for company, and away we went. We arrived at our destination somewhere between 9:00PM to 2:00AM. We parked our truck near the main road, but far enough into our recreational area where it could not be seen from the road, so no one would think the truck was abandoned. Close to where we parked and bordering the North side of this riparian area is a CAP canal, and bordering the South 3/4 of a mile is a major road. That night we would be hiking through the Northern half of it, and cover 2 to 3 miles to the East. We all walked down the canal road and left it after a while, to hike through small trails with sections of dense vegetation. On our way back we returned on the canal road, following it back to the truck. As we were walking, my three friends became very boisterous, reminiscing about old times, and even singing songs. The strange thing about this was that I usually take part in this rowdiness. I instead was walking just behind my friends and was not interacting with them at all. As we were about 3/4 of the way back, I heard a tremendous guttural growl coming from our left (south) from across a field of dry grass. This jolted my senses! I could not believe my ears! I immediately stopped in my tracks, and knew the closest thing to this sound would be an African Lion, and yet we were not in the Serengeti. I jerked my head left, and at the same time slowed down the cadence of my steps. What I saw sent shivers up and down my spine! There were trees and heavy foliage at the opposite side of the field. In the middle of this grove stood the tallest and fullest of all the trees. It was this tree that was being violently shaken, all the while hearing this lion type growl. Now my senses were telling me this was something bigger than a bear, but as strong as a Rhino. I completely stopped walking, turned to face the direction of the tree, and reached down my leg to undo the safety catch on my bowie knife sheath. I became fixated on the tree until it stopped shaking. I immediately crouched down on the hard packed dirt road and began surveying the whole area. After what could only be a minute or two, two short dark bi-pedal creatures ran from under the trees low hanging branches towards me. They were 3 ½ to 4 feet tall, husky build, with long hanging arms, and had a dark furry looking outline. They ran straight toward me crossing the dry grassy field, and crouched down about half way across. They ran extremely fast and seemed to almost float across the grass, with no apparent head bob. Incredibly, there was little or no noise coming from them tromping down on dry grass. Since I regularly tracked rabbit and javelina at night, I was able to see and hear with extraordinary skill. At this point I had tunnel sight and hearing. I blocked out all of my friends noisy antics. I spent thirty seconds to one minute watching the creatures staring back at me. I was getting very paranoid, so slowly I got up and made a number of steps to my right, while keeping my head and eyes pointed toward them. I then felt comfortable enough to turn my whole body toward the direction of my friends and start walking. I had to keep my eyes on the creatures. They stood very still.  So I started jogging away, looking over my shoulder frequently. At this point I noticed how far ahead my friends were, and totally oblivious to what had just happened. When I caught up to them, I stopped them and told them what had happened. They thought I was joking, which I was not. As I was trying to convince them, I kept looking over my shoulder to see if there was any more activity. My friends finally took my pleas to heart seeing I was afraid, and asked what we should do. I told them that we should slowly jog to the truck and leave. We stopped occasionally to look back, but did not see anything. After this night my friends always believed that this was a story cooked up by me to make the hike more interesting. I had stayed away from hiking in this area for a few months, then decided to go back a couple of times, only never to return again. My feelings are the same as they were then, that to go back would certainly put me and anyone else with me at high risk of danger.",
  "classification": "Class A",
  "county": "Maricopa",
  "state": "Arizona",
  "location_details": "Outside Metro Phoenix area (edited per witness' request)"
}