{
  "reportId": "459",
  "title": "",
  "date": "",
  "observed": "This story goes back many years, it has always been a bit of a joke in my family but there isn't one person who was that doesn't believe that I saw somthing that day.  I was about 9 or 10 years of age and we used to stay at my Uncle's house in western Jersy (I don't know if anything has ever been sighted there but I saw something).  He lived very far west and at the time there was a great deal of woods around his house. I don't know where the nearest neighbor was. Anyway one morning I took a walk into the woods looking for my brothers,as I thought they were down by the stream. As I walked deeper into the woods and neared the stream I heard a lot of noise coming from the other side of the stream out of my sight. I thought it was my brothers trying to scare me so I called out to them and threatened to \"tell mom\"  if they didn't stop. Still no answer thats when I became really frightened (if you've ever met my mother you would know what I mean). I came off the path to the stream and hid behind some bushes on the side, thats when I saw it coming down the stream, walking on its hind legs like a man. It appeared to be very big and was covered completely in dark long hair, I thought maybe it was a bear but the face was not like a bear at all. I never saw anything like it before. It stop in front of me and looked directly at my, being the brave soul that I am I closed my eyes,held my breath and waited for it to kill me or leave. I was so scared either one would have been just fine with me because I could not move. But thankfully it left, just walked away. I heard it leave walking in the same direction it was going. When I could finally stand again I ran up the hill crying. And was so frightened that we had to leave my Uncles house and stay in a Hotel the rest of our visit there.  Not to mention every visit there after.  So thats my story. Please let me know if there were any other reports in Jersey years ago or resently so I don't feel so all alone. I know what I saw and it was not anything I've ever seen before. Please give me some answer to a question that has haunted me for 30 years.   Thanks Mary",
  "classification": "Class A",
  "county": "Hunterdon",
  "state": "New Jersey",
  "location_details": "take rt87 to Bloomsberg"
}