{
  "reportId": "28485",
  "title": "Possible daytime encounter by a family hiking near Lake Cushman",
  "date": "2011-01-25",
  "observed": "On Friday the 5th of November 2010, my family and I decided to go hiking near Lake Cushman. I typically go hiking alone as it gives me opportunity to gather my thoughts and enjoy the outdoors. Seeing as how my wife’s birthday was coming up she managed to convince me to take her and our two children along. I had planned a more arduous hike near Mt. St. Helens but given the children’s notable lack of ambition and current weather conditions I elected to drive the hour and a half from our home in Castle Rock to Lake Cushman for a more “family friendly” outdoor experience.  We arrived at the Big Creek trail near Hoodsport at around 1000 hours and began our hike (trail 827.1 loop). It was a cool day with a light drizzle and visibility was at times no more than 75-100 yards. The hike was rather uneventful and my wife and I both noted that the utter silence of the forest that day was deafening. There was one other car at the entrance to the park so I just assumed they had gone in ahead of us on the same path and had ruined our chances of viewing any wildlife. At around 1130 hours I heard a truck about 75 yards up the ridge. I looked up just in time to see the cab lights of a logging truck heading up the mountain on road 2419. About 10 to 15 minutes later I heard what I initially thought was another vehicle struggling to climb the road. A couple of seconds later I realized it wasn’t a car at all but an animal or possibly another person. It sounded like part howl and part groan. It was difficult to describe other than to say it seemed mournful. This groan/howl lasted about 8-10 seconds during which time I turned to look at my wife and children. The look on their faces said it all. They had heard it as well. Almost simultaneously everyone said “what was that”. I said I had no idea and we continued on. At around 1200 hours we approached the Skinwood Creek Bridge. All at once we were stopped dead in our tracks by a horrible odor, which I can only describe as a cross between skunk and ammonia. The odor was so heavy we could taste it and our eyes even began to water a bit. My daughter began to cry and repeatedly begged me to let us return to the truck. I must confess I would have liked to oblige but we were at the half way point and continuing forward seemed to be the most logical course of action. As we continued on the odor dissipated. We made the turn at the bridge and started back down the trail on the west side. At almost the same point we encountered the odor on the east side of the trail we picked up the scent again on the west side. We continued down the trail and once again the odor dissipated. The remainder of the hike was uneventful and I dare say we made much better time heading back to the truck.",
  "classification": "Class B",
  "county": "Mason",
  "state": "Washington",
  "location": "-123.1267,47.29435",
  "location_details": "Olympic National Forest just East of the Mount Skokomish Wilderness on Big Creek Trail 827.1"
}