{
  "reportId": "3295",
  "title": "Afternoon sighting in hills between Oakland and Sutherlin",
  "date": "1980-09-05",
  "observed": "This was a long time ago, but I have never forgotten that day. I can still clearly see the beast.  I was about 15 and my friend & I went hiking in the hills between these two neighboring towns of Sutherlin & Oakland, Oregon.  It was in the fall, I believe we were just about to go back to school for the year.  It was a pretty warm day.  We stopped along the way to take a restroom break.  We were on some logging roads, or they may have just been fire control roads put there by the BLM, but anyway we were on a curve in the road.  We knew there were probably other people in the area, and so we each posted a 'watch-out' while the other of us did our business.  Anyway, I was watching out for her, and walked a little way back down the road the way we had just come... when I heard a noise. I looked up just in time to see what I thought must have been a bear.  It was just across a clearing across the road coming down a very steep embankment.  It was near the top, very dark brown or black in color and was crashing down the embankment through some smaller trees, in an upright position.  I know it was not a man. It did not have clothes on or anything like that. It was big and hairy. it started from the top of the steep embankment and crashed downwards almost in our direction. I could hear the thump thump thump thump of its steps very clearly along with all the crashing of the brush.  It was doing this in an upright position taking huge steps as one would if you were walking down a steep hill very quickly.  I was stunned for a moment, then I screamed, and it stopped and looked in my direction, I ran... my girlfriend was still around the corner and she screamed too... I was yelling bear! bear! bear! and we both hurried off in the other direction.  She asked me what I saw and I told her; we speculated on it for much of the rest of our long hike.  I had convinced myself that it must have been a bear.  Later that night I told my father about our close call with the bear and when I told him what I had saw and what it did... he told me it must have been a man because bears did not ever walk upright and definitely not upright down a hillside.  that is when I came to the conclusion that it must have been a big foot. I know this most likely won't be of much interest to you because of how long ago it was.  I am 37 now, but I saw it.",
  "classification": "Class A",
  "county": "Douglas",
  "state": "Oregon",
  "location": "-123.175,43.225",
  "location_details": "We were on BLM land-- at least I think it is BLM land.  It is located between Sutherlin and Oakland."
}