{
  "reportId": "1796",
  "title": "Elk hunter observes an apparent family group",
  "date": "1983-09-04",
  "observed": "Either late august or early september 1982 or 1983 at the opening of archery season. Several friends and myself were camping near Elk Valley with our dads at our annual bow camp.  One morning we started our hunt at the top of a thick area of timber. I had never been in this area before, but my instructions were to make way through the forest and walk straight downhill.  After awhile, I was expected to breakout into a clearing where here will be a saddle with a few rocky knolls which would drain into some ponds at the bottom.  This entire area is known as the \"Bloody Bucket\", for what reason I wasn't sure and I didn't ask!  The hunt was planned out that my friends and I would slowly walk down through this are hoping to scare out a mule deer or a bull elk and having the big game cross the path of another hunter in our party.  We were spread out so far apart that we couldn't see or hear each other.  As I made my  way into the opening, everything was just as was described to me.  I could see where I needed to end up and meet even though it was a ways away.  I came out right in the middle of the opening and walked down to a rocky area, stopped to take a breather and looked around.  All of the sudden down to my left about 100 yards away I saw what appeared to be 3 erect dark brown beings walking down a trail near the trees as if they were in a hurry.  They were in order of height with the tallest leading the way, then a slightly smaller one followed by the smallest of the three which was trying hard to keep up with the other two.  As I took a deep breath to gather myself, to see if what I was experiencing was what I thought it was, the leader turned around and waved his/her arm in a manner as if to tell the smallest one to hurry up!  They continued to speedwalk into the timber and faded away.  I was very shocked, nervous and somewhat frightend. My heart was pounding and I just sat there in amazement for abut 15 minutes. I didn't go down to see if I could see any sign of what I just experienced. I just went down to the bottom like I was suppose to and didn't mention a word of it to anyone. I didn't think anyone would believe me anyway. A few years went by and I met up with one of my friends that I was hunting with that day. I was relieved when he told me \"Do you remember that year when we hunted the bloody bucket in elk valley?  Well I've got something to tell you!\"  He went on to describe to a T what I saw that day.  It turns out that he was just a little ahead of me and toh my right , in the trees about 75 yards. Neither one of us knew that we were so close to each other and witnessed the same thing.  It would have been nice to have had someone to back me up. Eversince then I've told a few more people.  I also heard that that same summer there had been a sighting near Montpelier resivoir which is a few miles west of elk valley.  It's ironic that the only time that I would probably experience something like and I didn't have a camera, camcorder or was too stunned to go check out the are and tell somebody about it.  No sounds were heard, no real proof that this happened.  Just my own word.  I remember it like it was yesterday!",
  "classification": "Class A",
  "county": "Bear Lake",
  "state": "Idaho",
  "location": "-111.1241,42.5149",
  "location_details": "Elk Valley in Bear Lake Co. east of Montpelier, Idaho near Wyoming. Specifically at some beaver ponds called \"The Bloody Bucket\"."
}