{
  "reportId": "24404",
  "title": "Woman recalls a very close encounter as a child on a farm near the Mark Twain National Forest",
  "date": "1967-07-30",
  "observed": "Many times I have tried to write about this major event in my life, but I find it difficult to tell it just like it happened.  It seems as though I have missed many details. I do not like to relive the event.   Since I can never forget it, I might as well share it with you. I was born and raised on a farm about ten miles from the nearest town in the Ozarks.  The farm had a wooded area that was connected to The Mark Twain National Forest.  I had a neighbor friend that I played with as a child. She lived about a half mile down a gravel road where we would walk back and forth to each others homes. That summer I was twelve years old.  It was a summer evening, and I had walked up to my friend’s house playing. It would soon be dusk and time for me to go home.  I had been taught to watch out for snakes and I kept an eye out for wild animals.  It was starting to turn dusk just as the old gravel road dropped off into a hollow.  It was always a few shades darker in the hollow as both sides of the road were lined with trees and foliage acting as a canopy. I guess I was not paying as much attention as I knew I should have been.  I was watching out for the snakes because the hollow always seemed to have more than its share.  My dad had hunting dogs and one always followed us around.  I could smell the dog.  It smelled liked it had been down in the pond again.  I could hear it walking along with me, just a few feet off, in the woods.  I started calling the dog to come to me, but it did not respond.  I thought this was odd.  The road was coming up out of the hollow, and I started to pay more attention to what was happening.  I could finally hear the dog coming toward me.  It stepped out of the woods onto the gravel road, to my right and just behind me.   The hair on my neck started to crawl.  Something was not right and I could feel it.  I looked down and a little to my right, expecting to see the dog but all I saw was two huge hairy feet.  Suddenly, I turned my head back toward the road and froze in my tracks.  My feet became rooted in the ground as a wave of fear washed over me.   My mouth was as dry as a bone. I could not have uttered a word;   Even though I was so frightened I could not help myself, I had to look.  I had to see what was standing next to me.  I slowly turned to my right again but this time I looked over my shoulder, right into a hairy body.  It was within arm’s reach.  As I lifted my eyes, they traveled up, up as it was very tall;  I saw nipples under a reddish  thick hair, it was not fur. Finally I was looking into a face.  It was watching me very closely.  The whites of the eyes were reddish and its pupils were a bluish color. I looked away and down at my feet. I did not know how I was going to get away from this creature.  It was tall and stocky built. It could have killed me had it wanted to.   I put one foot out slowly and walked as though I had rocks tied to my feet.  The distance from where I first saw the creature and home seem like an eternity.    At last I was to the door of home.   My body was so tense it hurt to move.  I was so afraid but knew I had to look to check where it was.   It was still behind me. I could not allow this thing to enter into my home so I slowly turned my head to look behind me.   I had only turned a little when I saw it standing down the drive a short ways.  There was a cedar tree along the driveway and its hand was close to the top of the tree.  It still watched me and then it just dropped its hand and in about three strides disappeared into the forest.   I then cried out.   It must have been a strange or horrible scream because my dad came running.  I could hardly talk to tell him about what had happen.   He knew something had happened so he got his rifle and searched around the house.   Dusk was falling fast when he returned.   I was so relieved to see him return safe.   He started trying to calm me down and reassure me.   His tried to convince me it could be a bear because everything can be explained.   And maybe I should not repeat it to anyone else.  I know he was only trying to protect me by his words.   It took two years to finally have an idea what it was that I encountered.   Then a TV program came on “The Legend of Sasquatch”.       Then my dad said, “Sis, is that what you saw a few years ago?”     I said, “Close enough.” I have spent a lot of sleepless nights since that awful evening and I have thought of what happened and I wonder what would have happened if I would have reacted differently.",
  "classification": "Class A",
  "county": "Howell",
  "state": "Missouri",
  "location": "-92.09264,36.97061",
  "location_details": "Near Noblett Lake"
}