{
  "reportId": "28637",
  "title": "Two fisherman recall a daylight encounter north of Helen",
  "date": "1993-05-15",
  "observed": "In May of 1993 Some of my friends of mine and I decided to go trout fishing above Helen, Ga.. After fishing for a couple of hours one guy and I decided to go upriver to find some new spots. So we started walking up an old roadbed that followed along the river. We eventually got to a spot where ther was a gully across the road, at one time there must of been a bridge. While me and my friend were standing there we heard a loud thud behind us. As we turned around there was a big ten foot log (about the diameter of a car tire) laying there. Take into acount just a second ago that log was not there. We climbed over the log and started to head back down the road when all of a sudden we heard leaves shuffling above us. Both my friend and I had a strange feeling as we looked at eachother. At the same time we bothe looked up above us and there was a Bigfoot standing 10-15 feet from us. We halled ass out of there. We finally made it back to where our other friends were, and told them what happened. They wanted to go see, the guy that was with me said no and went back to the vehical. I took the other two guys to show them, and on the way there we saw a footprint in the mud that looked like someone walking barefoot except it was appro. 18 inches long.  We walked back up and saw nothing else. Now I am 6'3\" and 290 lbs., and this thing dwarfed me bigtime. It was at least 9 feet tall and about 4 feet across at the shoulders. It had to way around 800 lbs., It really looked like a big human covered in long shaggy black hair. The thing that got me was its reddish brown eyes. It took years for me to go back up there fishing, and when I did I would not go alone. It is wierd cause sometimes when up there you feel safe, but other times it feels like something is watching you. Since then I have heard wood knocking, vocalizations, and had rocks thrown at me. I do not hesitate to go up there anymore, but I will not go alone.",
  "classification": "Class A",
  "county": "White",
  "state": "Georgia",
  "location": "-83.77811,34.7673",
  "location_details": "the upper hooch"
}