{
  "reportId": "7832",
  "title": "A man has heard similar cries in the night for over 15 years that were noted in another BFRO report from the same location",
  "date": "1987-07-01",
  "observed": "I have just read \"A.D.'s\" April 1997 report about a loud animal-like noise in the wooded area behind an apartment complex on the East side of Kent. I have lived in this same apartment complex for nearly twenty years and have often heard this incredibly loud howling sound. I agree with A.D. that the sound is difficult to describe. It is a very loud, somewhat high-pitched sound that originally suggested an animal in pain. I have recently taken up an interest in Bigfoot, and after some books on the subject began to wonder whether the sound I heard was perhaps one of the creatures. Then this morning I ran across A.D.'s report and thought, \"Ah-ha! So I am not the only person who has wondered about these cries.\" After giving thought to the possibility that the cry is that of Bigfoot, it crossed my mind that rather than a cry of physical pain it might be instead a cry of emotional pain, the cry of a lonely being hoping to hear an answering cry. I have only heard the cry at night, and not as I recall in winter. For many years the cry was fairly frequent. I have not heard it now for more than a year. The area behind the apartment complex is heavily wooded. There is a dirt roadway that goes back (north) a hundred yards or so to a gas well drilled about four or five years ago and then capped off and left untended. Another fifty yards or so north is a railroad track with frequent trains. Beyond the track is more woods, within which is the remains of a toxic waste dump that was cleaned up by the EPA eight or ten years ago. Beyond that the woods ends into some homes and the town of Brady Lake.",
  "classification": "Class B",
  "county": "Portage",
  "state": "Ohio",
  "location": "-81.37181,41.16187",
  "location_details": "In the woods behind the Kent Village apartments, Route 59, Kent, Ohio."
}