{
  "reportId": "7904",
  "title": "Woman observes small bipedal creature cross 441 near Ft. Drum",
  "date": "2004-01-18",
  "observed": "I was driving south east on US Hwy 441 North between Ft. Drum and Okeechobee, Florida on Jan. 18, 2004. It was almost dusk, approx. 5:30 PM. There was only one other car on the road and it was several miles away in the west bound lane coming at me ( two lane road). I took this opprotunity to remove my sun glasses. A spring type clip on which I need both hands to remove. I turned my head and dropped them in my purse on the seat next to me. As I looked up toward my rear view mirror a flash of movement caught my attention. It happened so fast all I saw was the last few steps of a small hominid running across the road in front of me. It wasn't close but I'm not sure how far away. It stopped on the edge of the road for a split second and made a leap over the roadside ditch and a barbed wire fence. I tired to reason I had seen a limpkin or a sandhill crane but knew it wasn't. I braked as soon as I saw the first movement and slowed to 20 mph by the time I thought I was where it had leaped into the bushes. I couldn't see any bushes moving or water movement. I was so intent on looking at the side of the road I didn't think to look into the pasture on the other side of the barbed wire. If I had been sure in my mind I had seen a wading bird I wouldn't have slowed as I see them all the time. I knew in my heart it was something different from what I'd ever seen before. I have reported this to the Mysterious Encounters web site and have thought more on it and will now revise my estimates of it's size. I judge it to be 3 1/2 to 4 feet tall and between 75 and a 100 pounds. It had a very round head on an upright body no neck to speak of. The hair was long and silky not matted or tangled. It was a brownish red, more light brown than red. I'm sure it had it's head turned away from me and I was seeing the back of it's head as I didn't see any facial features. I remembered seeing it's foot later. It was like a person of color whose skin is darker than the sides of their feet. The hair hung lightly over the sides of the edges of it's foot. I saw one arm and it reached almost to the knee.  When it leaped it didn't swing it's arms out or bend it's knees to jump it just leaped flat footed, pushing off. The distance it leaped was approx. 20 to 25 feet. Seeing it bothered me and then I saw the Redwood Giant episode of Mysterious Encounters, Jan. 24, on OLN. A man on the show said a three foot tall hominid ran in front of his car in NC. It hit me like a shot, I knew what I had seen then. That's when I filled out the report form on their web site. I did a Google search tonight and found your site. The more I've thought about it and talked with my family ( after they stopped laughing) we have come up with other times we could have been in the presence of these hominds over the years. Once two years ago my son and I were on the Kissimmee River, the western boundry between Okeechobee County and Highlands County, Florida. We heard a call...scream.. yell, from a distance. After discussing it my son said it must have been a big bellied redneck out hunting or a skunk ape, we laughed it off but kept a watch around us the rest of the day. It was very disturbing. A year a go a friend and I were on the board walk of the Grassy Waters Preserve on North Lake Blvd in northern Palm Beach County, Fl. It was early morning and we were walking to the end to go into the little nature museum and looked out across the water and sawgrass toward a cypress head. Standing in plain sight was a BIG dark figure. It would bend over and do something in the water at the base of a cypress tree, then stand up and act like it was eating something. This went on for quite a while, bend over- stand up. The woman who was in charge of the museum came out with a pair of binoculars but they were so badly fogged we couldn't make out details. Just a big homind figure. There are many more times and incidents I could relate but they go back to the mid 1970's. So I will stick with the present.",
  "classification": "Class A",
  "county": "Okeechobee",
  "state": "Florida",
  "location": "-80.8044,27.3973",
  "location_details": "The hominid ran across hwy 441, the location was maybe a 1/3 the distance between Ft. Drum and Okeechobee. I would rather not put the location on the site for fear the locals will go and try to hunt it. There have been reports of a panther and somet took to the woods with guns. Several years ago an escaped or released python was sited and some people wouldn't rest until the had killed it. That's the mentality around here."
}