{
  "reportId": "5637",
  "title": "Campers have frightening experience in the Marble Mountains Wilderness",
  "date": "1977-07-01",
  "observed": "This was summer, 1977, and I lived in Arcata, California working as a volunteer Botanist for Six Rivers National Forest. I was helping out a graduate student at Humboldt State University with his Master's Project (we studied wildlife and plants associated with freshwater ponds in the forest near Willow Creek). One  weekend, my girlfiend and I drove up to the Salmon River to go camping. Its a remote area; it seemed that most people up that way were either miners along the river or fire crews. Near Forks of Salmon (town) we stopped and camped at a pullout near the mouth of the Little North Fork. The next day, we hiked up the stream, went swimming, (even saw a black bear on the trail) and later drove home. The following morning (Monday) my coworkers came to pick me up for the week's work, but I realized while packing that I was missing the telephoto lens to my camera. I remembered using it on the Little North Fork photographing a frog. Figuring I had laid it by the stream and forgotten it, I did not join my two coworkers.  Instead I called my girlfriend, told her what had happened and asked if she would like to return to the Little North Fork. Instead of roaring up there and back (about 100 miles ?) we decided to make a backback trip out of it.  We got up there, hiked the trail, found the lens, but decided to drive further up the paved road to a spot somewhere near Sawyers Bar where a dirt road followed the North Fork and led up to a trailhead where hikers could further follow up the North Fork and into the Marble Mountain Wilderness Area. It was dusk, so we donned packs and got up the trail as far as we could before it got completely dark.  There were no obvious camp sites so we rolled out our bags and literally slept in the middle of the trail. Its old growth forest and we felt pretty alone. The next morning we got hiking again, following the North Fork up a long forested valley.  We passed one other couple that day who had stopped to swim and set up camp. We hiked on another four miles and the trail left the river; it snaked up along the side of the canyon and became more of a narrow path. Always the dirt beneath our feet was covered with the prints of bears.  There were no human shoe prints, just bear prints. It was getting late again and the topo map indicated a stream would cross the trail some distance ahead so we pressed on figuring to set up camp there. We soon heard water. At the crossing we were very tired and were ready to drop our packs, but we both had a very uneasy feeling about the spot and agreed we could'nt spend the night there. Consulting the map again, we found that the trail branched a little ways ahead and an unmaintained primitive path headed up the mountain to a small subalpine lake that we had earlier planned as our destination. The map showed the creek to cross the primitive trail shortly after the path left the main trail. We figured the trail junction might be a good place to camp since it would be close to the creek but hopefully without the feeling we experienced here. Soon we got there and found a small open area between the trees just off the trail, level and large enough for our sleeping bags and a fire.  We dropped our stuff and then went down the start of the primitive trail to the creek (20-30 yards). It was in a steep, boulder-choked, densely forested draw full of log jams left from spring or winter torrents. It was barely a creek now in mid-summer. It was getting dark and again we had a bad feeling about being dwon in the creek bed.  We hurriedly filled our cooking pots with water and got back up to our packs. We were tired.  After cooking, I remember arranging our pots and pans along a log on one side of us and the fire on the other side. I hoped if a bear entered camp during the night he might knock the pots off the log and thereby wake us up. Sometime in the middle of the night (I had no watch, but the fire was completely burned down to ashes and coals) I awoke to a terrible racket going on down in the streambed through the trees below us. It was the sound of logs and large rocks being hurled and crashing into things. I sat up in the dark and listened. I shook my girlfriend and told her to wake up. She at first buried her head in her bag and did'nt want to hear the sounds.  I was really scared. It was totally dark, I knew there was no one around for miles and I also knew that bears do not go rampaging around throwing things. I also knew darn well that anything living out there could probably smell the remains of our fire. Whatever it was was clearly spending a lot of energy either trying to scare us or angrily searching for something in one of the logjams. After listening for maybe 10-20 minutes (its really hard to know how long) my worst fears were realized. The crashing sounds stopped and soon there was the sound of footsteps coming up the slope directly toward us. It was on two feet and they were clearly audible, heavy footsteps. By this time my girlfriend was wide awake and sitting up in her bag like me listening. Although neither of us said it, we both were thinking of what it had to be. With the fotsteps came the sound of labored breath. Whatever it had been up to in the stream bed clearly had been hard work. I had a sheath knife, but standing to fight seemed out of the question: it was dark, this thing was big, and I was petrified. Just as it came up behind the trees immediately surrounding us, I flicked on my little flashlight, hoping to keep it at bay with the light. The light did not penetrate the darkness beyond the nearest trunks. The creature stopped just behind the nearest tree trunk (15 feet? away) and just stood there breathing. The sound of the breathing was at least seven feet up in the air. I yelled \"Hey!\" with as load a voice as my adrenalin could muster. The breathing paused momentarily and the creature made a \"humph!\" like sound in response, not to me directly, but more to itself. It was very careful to not reveal itself and used the tree to avoid my light striking him. After this, it turned and walked through the brush and trees directly away from us, not back toward the creek but parallel with the creek, heading downstream.  The stride was unhurried. We quickly built the fire back up and stayed awake until dawn. After the sun came up we got some sleep. After breaking camp we dropped down to the creek before heading up the path on the other side.  I looked around briefly to see if I could see what the creature had been doing, footprints, etc., but I found nothing. I wish now I had gone down or upstream a bit, since the sounds may not have originated at the crossing like I assummed at the time.  We got up to Lake of the Isle (kind of a shallow cirque lake as I recall) in the afternoon.  There were some old campsites there but no recent evidence of people. The place was scoured of firewood, though. I spent a lot of time hauling wood up the hill so we would have enough to last all night.  I also stockpiled throwing size rocks. That night we could'nt sleep.  We would hear rustling in the brush near camp.  I would throw rocks in the direction of the sounds (probably racoons or black bears) and  build up the fire some more.  We did that all night until dawn. We fnally got some sleep.  When we awoke we both decided to bag it and hike out.  We packed our packs and hiked all day. The last mile or so to the car we hiked in late dusk; the thought of spending another night out there was out of the question. We were so paranoid by this time, we jogged the last half mile. That's it for the incident.  Although we did not actually see the creature, neither of us have any doubt as to what it was. Up until that point in my life, Bigfoot stories were like the Loch Ness Monster: something intrigueing that you sort of wanted to believe in but could never be sure about. For me, the matter of Bigfoot's existence was resolved that night 25 years ago.  ",
  "classification": "Class B",
  "county": "Siskiyou",
  "state": "California",
  "location": "-123.1778,41.31917",
  "location_details": "Hike up the trail from Little North Fork Campground."
}