{
  "reportId": "10258",
  "title": "Loud vocalizations repeatedly disturb family",
  "date": "1987-09-15",
  "observed": "The very loud, high pitched scream occurred around 500ft behind our house. The scream occured 2 or 3 times the 1st night. The dogs hid under the house, my whole family awoke.  I was only 13 at the time. My father climbed up the ladder into the loft of the house were my bed was located in the rear of the A-frame below a large window. It scared me once I saw how scared my father was. He opend the window and fired shots from his hand gun . He also set up a12 volt spot light the next day below the window. After he shot his gun off, then we heard something fleeing up the mountain. We experienced the same thing 3 or 4 more times in the next week. Always late at night. My dad would shine his light out at the noise but never saw the creature. My dad was able to get audio tape recording of the high pitch, long scream. Dad and his best friend, a Nooksack tribal member, determined it was not a mountain lion and on two occasions went out in an attempt to find a track or hair or blood. To no avail -  they did see small trees that had been broken in half in the area we heard it . They also reported the smell of rotten eggs. Even though the screams stopped, we ended up moving within a month. I still live in the same state but have never gone back to that house. I can remember feeling like I was being watched whenever playing in the woods. I've only told my girlfriend about this incident, yet I remember it like it was yesterday.",
  "classification": "Class B",
  "county": "Whatcom",
  "state": "Washington",
  "location": "-122.0247,48.9294",
  "location_details": "Incident took place behind our A-frame house one half mile north of the North Fork of the Nooksack River and at the base of Black Mt. and  quarter mile northeast of Boulder Creek. Take I-5 north until you get to Bellingham, take sunset Mt. Baker Hwy. exit continue eastbound for1 & half hour you will see Boulder Creek. Quarter mile on left, past Baptist camp is the location . "
}