{
  "reportId": "55552",
  "title": "",
  "date": "",
  "observed": "Being an avid outdoors man and interested in various types of wildlife since childhood, I've had my share of camping, canoeing, hunting, fishing, finding Native American artifacts, and hiking, etc.  On one particular sunny spring day during 2011, I decided to walk some trails adjacent to Brendan T. Byrne St. Forest opposite Rt. 70.  On one side of the sandy/gravel trail is a pine forest, on the other a downward slope into a densely wooded swampy area where a stream flows.  At one point a few yards into the swampy area, I heard an unrecognized sound similar to a cross between a bird call and a whistle type noise at which I stopped dead in my tracks in attempt to see what made this unusual sound, but saw nothing. Within a few seconds just to the side of this noise I heard the smashing and crashing of large wet logs on a level the likes of which I have never heard before.  This ruckus appeared to be purposeful in origin as if the creature was attempting to make as much noise as it possibly could...And it was succeeding!  Having known several friends and family members who declared witnessing large bipedal hairy creatures in New Jersey, I immediately surmised this, too, must be a Bigfoot or Sasquatch type creature.  After all, I've worked several seasons with very large animals at Great Adventure's Safari Park. I've touched, fed and/or pet elephants, rhinos, American Black Bear, European Brown Bear, tigers, leopards, bison, elk, etc., therefore I feel I have slightly better idea as to the average person, what size animal could make such a disturbance.  In addition, I have a fair understanding of a variety of large North American mammal's behavior, and this seemed to fit nothing other than Bigfoot.                                      As I stood there mostly in silence, the animal slowly proceeded deeper into the swamp, all the while smashing and crashing.  Since I understood that bigfoots normally don't harm humans, at one point I quietly verbalized to myself, \"MAN, THIS IS REALLY COOL.\"  On the other hand I thought that if this thing is as angry as it sounds, I didn't want it to come bebopping onto the trail, since there was likely little or nothing I could do to protect myself. As the ruckus began to dissipate, it seemed as if the creature wanted me to believe that it was further into the swamp than it actually was. I estimated it to have stopped at approximately forty five yards away.  I stood there quietly for a number of minutes but heard absolutely nothing, not even a bird.  I then slowly proceeded down the trail in search of any type of tracks, but saw nothing other than mine.  Some distance down the trail, I came upon where the creek is at its closest, then heard what sounded as if either a very large animal jumped into the stream, or another large wet log was smashed, about forty five yards away.  I stood there silently for a few more minutes but heard no further noise, then I proceeded home.  At one point I had realized this creature must have paralleled me from the time I first heard it, to the last smash or splash, and yet during that period I didn't hear so much as a twig snap!                         After further contemplating the matter, I feel there may have actually been two creatures; one making the initial vocalization, and yet another the ruckus.  After going on-line listening to recordings of alleged bigfoot vocalizations, I came across one in particular that sounds nearly identical to what I heard yet quite unlike any other animal with the exception of a chimpanzee.  [The high pitched sound of the 1972 aggressiveness and whistles from Al Berry and Ron Moorehead.]                  From time to time I revisited the location and on Sept. 3rd, 2016, I strongly feel that I had found a stick formation right between where I heard the initial sounds and the last smash or splash.                                          From 2011, until now, I am convinced that the weight of the animal smashing through the swamp must have been at least twice the weight of a fully grown male black bear, or equal to that of a male grizzly bear, at least 600 pounds.",
  "classification": "Class B",
  "county": "Burlington",
  "state": "New Jersey",
  "location_details": "Near Country Lakes (Please omit exact location)"
}