{
  "reportId": "3702",
  "title": "Daytime sighting by swimmers in Wolf Creek area",
  "date": "1975-07-01",
  "observed": "In 1975 I lived on Coyote Creek Road in Wolf Creek Oregon, and used to spend summer days at a popular, isolated swimming hole about 12 miles out a dirt road that ran between Wolf Creek and the Rogue River.  We called it the \"Jesus Saves\" swimming hole after some graffitti sprayed on the rocks.  In mid summer I was there with a friend, we were the only people in sight.  I was washing my hair in the creek and looking up between my legs I saw a head peeking over a fallen log about 60 feet up the hill behind me, slightly to my left.  Though I spent much time alone in the woods, this felt really creepy to me.  My first reaction was to stand up and yell thinking a \"peeping tom\" was sneaking up to take a peak as this was a skinny dipping hole and my friend and I were following that fine tradition.  As I stood and turned quickly, the head slunk down to disappear behind the log.  Instantly I had these simultaneous impressions:  this large round head with brownish hair (features were indistinct due to the angle of the sun) moved like an animal, not a human, the hair was standing up on the back of my neck; and I felt panic along with a need to flee.  Within seconds I told my friend something was stalking us and we needed to leave NOW and looked back to the log -- 25 feet beyond the log was a clump of scrub oak.  I clearly sas the head, shoulder, arm, and upper torso of a very tall creature standing upright and melting into the trees.  This was not a bear.  It was not a human.  It was brownish and hair covered.  Within 90 seconds my friend and I swam across the creek and climbed the rocks below the trail.  Feeling less frightened I stopped and together we searched the hillside across the creek.  We saw absolutely nothing. During the early 70's I had three other encounters in the Wolf Creek area where I heard something inexplicable and had the same sensation of panic and hair actually raising on the back of my neck.  This story describes myt only visual experience.  In those days many folks lived an isolated lifestyle far back in the mountains.  I heard many stories from solid people about encounters with what they believed to be Bigfoot.",
  "classification": "Class A",
  "county": "Josephine",
  "state": "Oregon",
  "location": "-123.3833,42.375",
  "location_details": ""
}