{
  "reportId": "17449",
  "title": "Possible vocalizations heard by backpackers in Otter Creek Wilderness",
  "date": "2007-01-09",
  "observed": "I'll be brief since this was only an audio. We were backpacking in the Otter Creek Wilderness near Elkins WV. It was the first week of Jan. '07. It was unseasonably warm. We were out for about 4 days, 3 nights. The third night we were camping by Yellow Creek. It was Saturday night at about 4 30 pm. It was starting to get dark and we were working diligently to start a fire. It had rained on and off the entire time we were there so everything was wet. As I used a small log to hammer my hatchet through another log ( splitting kindling), I heard something howling way up the hollow. It was pretty far off by my estimation and at first I mistook it for a coyote. I kept hammering away as my buddy, who works for ODNR Div of Wildlife, was talking. He hadn't heard it. I then heard it again. The same call. This time something struck me as strange. It wasn't a coyote. There are several reasons I quickly came to this conclussion. The call was long and drawn out without the typical undulations and yipping associated with a coyote. It was also very far off. If it had been a coyote, it would have had to been at least 3 or 400 lbs. to produce that kind of volume. I stopped hammering. My friend looked at me and immediately asked what I was listening for. Then we heard it a third time. It resembled the scream of a woman ( for lack of a better comparison ). It was quite long, perhaps 5 or 6 secs start to stop. It definitely resembled a primate call of sorts. Coyote have never made the hair stand up on my neck before and I can identify about every call in the woods in this part of the country. I looked at him and asked if he could tell me what we had just heard. He said he could not and we both agreed neither of us had ever heard anything like that. I have heard similar recordings on websites devoted to the north american great ape theory aka; bigfoot. He and his fiance had also taken their dogs. She hadn't heard it but the dogs had been acting strange since we arrived at that campsite, several hours earlier. At one point they were barking at what seemed to be nothing. One of the dogs hair was standing on end from the base of his tail to the back of his neck as he sniffed the wind and repeatedly barked in the upwind direction. This was about an hour before we heard the call. It was still daylight and we saw and heard nothing. It was obvious to me that whatever he was smelling was scaring him. After going to our tents for the night and the fire had burned down, I heard more noises closer to camp. It sounded as if someone was stomping around in the rotodendrin and was not trying to be quiet at all. I also heard branches snapping and they sounded pretty large. This was in the direction of Yellow Creek. Perhaps on the other side of the creek. My friends did not hear this. They somehow had gotten to sleep. This only lasted a few minutes and then ceased altogether.",
  "classification": "Class B",
  "county": "Randolph",
  "state": "West Virginia",
  "location": "-79.665,39.9433",
  "location_details": "Otter Creek Wilderness area around Yellow Creek. I believe the trail was called Yellow Creek Trail. The campsite was in a small stand of pines approx. 75 yds from the creek."
}