{
  "reportId": "7246",
  "title": "Hunter has daytime sighting near Shocco Creek",
  "date": "1983-11-15",
  "observed": "I was hunting a creek bottom,called the little Shocco Creek. The creek bottom is heavily forested,and a dense crop of a bamboo like reeds grow along the bottom. I was leaving the woods,but stalking slowly along a logging road. As I started up a hill,a doe deer that was bedded down just above the reed cane (on the side of the hill),jumped up and headed for the thick cover of the reeds. The deer was angling to my right,and down into the reeds. I quickly got to higher ground,above the reeds,in hopes of seeing the deer as she slipped through the reeds. As I was watching her white tail waving through the thick,green and brown cover,something to my extreme right moved,and on the other side of the creek. I could not really understand what I was seeing. I saw a tall,(in comparison to the reeds,which grow at least 4-6 ft tall)figure moving away from me,and it appeared to be dark,and sort of mottled in color. The mottling was not in highly contrasted colors,but simply darker shades of brown,and slightly lighter shades of brown.Maybe it was the effect of the sun filtering through the leaves. It was the early part of the deer season,and the leaves had not fallen entirely. I estimate the distance to maybe 50 yards. Being above the reeds,was the ONLY way I could have seen this. As I watched it move through the woods,it appeared to have what I would call a hump on it's back,and I only saw that when it turned and looked in my direction,as it pushed through the vegetation. I had the perception that it went through some very heavy limbs,as I saw them snap back once it was through. It did not seem to be running,but moving quickly,and with no need to duck or dodge the vegetation.It just pushed through it. I will admit,that I was unbelievably unsure of what I had seen.I was scared to be honest. At that time,and as it is now,black bears were NOT known to inhabit that part of our state. And,black bears do not walk very far in an upright manner.This was upright. I did not go back into that bottom again. I hunted a very large clearcut area that afternoon,and I could see for several hundred yards in each direction. I was armed with a heavy caliber hunting rifle,and armed with a .44 mag. revolver,and I would not venture back in there again I have seen no tracks on the creek bottoms,or around muddy spots,that we could not identify. As far as I know,area residents ,my immediate family,have not reported any thing similar. I have several cousins that practically LIVE in those woods during hunting season,and have heard nothing,rumor or otherwise. Hunting with hound dogs, is still popular in that region,but no one has reported anything unusual being brought to bay,or treed,including bears.",
  "classification": "Class A",
  "county": "Warren",
  "state": "North Carolina",
  "location": "-78.09365,36.21335",
  "location_details": "Area has seen \"some\" residential development,and some logging (clearcutting)had been reported At the time of my experience,it was an old forest,with hardwoods,and pines mixed. "
}