{
  "reportId": "23537",
  "title": "Possible camp stalking and strange sounds heard near Moore's Hill",
  "date": "1982-08-01",
  "observed": "My friend, his younger brother, my younger brother and I were camping about 100yds behind my friend’s home.  It was either July, or August 1982. Over a few years I had spent several nights camping there with my friend.  His mother had been our Den Mother.  I was about 13 years old at the time of the encounter. Our camp which was really only a barren spot in the trees behind the house that sits on  top of a hill whose contours followed a U in a stream that empties into Logan Creek and eventually the Ohio River about 12 miles down-stream.  The area is typical of the region; rolling hills, and a patchwork of farms and woods. During the day we were approached by something making a call that was sort of bird-like and a little screechy chimp-like. The calls came in threes.  eeeehh….eeeEEEHHHH….wEEEEEEEAAAAAGH. The calls volume would build to the end.  It’s sort of hard to describe. As it made this noise we could also hear it coming up from the creek.  As it moved closer the calls became louder, and more frequent.  It was such a ridiculous sound that at one point I remember looking, at my brother after a particularly loud colorful call and we were both chuckling.  The call made me feel like it was saying ‘come on you have to be able to hear me now’.  I don’t know why, but that’s how I felt.  It was obviously trying to get our attention. When my friend’s brother said he thought it was a peacock my friend responded with, “Uh-uh” as in no.  I looked at my friend because he sounded funny and when saw his face he was slack-jawed with a bewildered look on his face.  He then said, “Something’s moving around down there.”  Which was sort of a funny thing to say; we were all very aware that something had been moving around for minutes.  I had the impression he had just seen something.  I suggested we go and see  it, and he said, ”Uh-uh”, and shook his head slightly from side to side with that funny look on his face. The sound continued for about 5 minutes, or more.  I remember being surprised by its persistence. The other two brothers began to argue about going down to see it.  The younger kid wanted to see a peacock and my friend didn’t want anything to do with it.  It was during their argument that the sounds went away. The sound was not frightening to me. They were loud and intense and came to within about 30 or 40 yards but did not at any point seem to be a threat.  That said I was reluctant to take any initiative, on the let’s go check this out front. That evening we had to birds whistle to each other across our camp for what was probably an hour.  Not significant in its self, but later that night, when we had gone to bed, and with most of us asleep something else happened. In the morning my brother took me aside and asked about my friend’s dad.  He wanted to know how often the father came out to check-up on the boys camping.  I told him that to my knowledge never.  As a matter of fact, in the years that I knew my friend I had only met his father once and he had never been out to check on us times we had camped there.  My brother told me someone had walked up to our camp once everyone else  was asleep.  He was sure it was a big person because they stood at the edge of our camp breathing very heavily.  He was hoping it was my friend’s father, but was confused as to why he had come from the creek side of the camp, and not the house side. The funny thing is we never talked about any of it after.  My brother and I have talked about it, but he doesn’t remember the day time vocalization so much as the night time visitation. It still makes me laugh to think of him lying there scared stiff.  I can't prove and can only speculate what happened that day. I think a bf approached us because we were some kids screwing around in the woods and not a threat.  I think it returned that night to check us out again.  I am to this day extremely disappointed we didn’t check It out.",
  "classification": "Class B",
  "county": "Dearborn",
  "state": "Indiana",
  "location": "-85.01295,39.06565",
  "location_details": "Private residence three miles down Bloom Road which is a dead end road off of StRt350. Between Moores Hill and Aurora"
}