{
  "reportId": "49293",
  "title": "",
  "date": "",
  "observed": "It was a Sunday afternoon and I went to stay at a cabin we rented with my two children for the night.  We were escaping the heat of Phoenix and it was a beautiful day, clear, sunny and no rain or clouds. That night we were asleep in the cabin but I kept waking up because I was on a very uncomfortable cot.  As I lay there trying to fall asleep again, I heard what sounded like a “whoop”.  This was followed by a clear wood knock sound.  They were about 8-10 seconds apart.  I lay there listening and about 1 minute later, I heard the same “whoop” and again, followed up by another knock about 10 seconds later.   They seemed to both come from the same direction (SE of the cabin).  I was the only one who heard it as the kids were asleep and I didn’t tell them as I didn’t want to spook them.   The sounds sounded close, I’m guessing within 50 yards since I was able to hear them while inside the cabin. There are a few other things that make this significant and eerie. One was that from the time we arrived at the cabin, there was no wildlife or sounds. Just birds chirping and the occasional wind blowing through the pine trees.  We never heard a crack in the woods or any other wildlife sound. It was just quiet. So when I heard this, it stood out because we heard nothing all afternoon, evening or at night.  Another is that as we drove down the road to the cabin we saw only 2-3 other camping parties along the roughly 12 mile stretch to get to the cabin.  It was Sunday afternoon about 2PM when we drove to the cabin.  But when we left the next morning about 7AM, they had all left – assumedly the previous afternoon since it was a Sunday.  So we were the only ones in the area 12 miles back in the woods.  We passed one truck near the main road as we left Monday morning but that was it. Lastly was another noise we heard that I didn’t put much credence in until after I heard the whoops.  It was about 10:30 earlier that night, shortly after we climbed in bed. I was trying to fall asleep while the two kids were playing games on their ipods.  All of a sudden a rap noise hit the window on the south side of the cabin.  Immediately, the kids look at me and say “what was that?!” The sound was like a small pebble hitting the window.  Again, it was clear and no wind.  I played it off to the kids that it was probably just a moth or bug hitting the window and it may have been just that.  But then I heard the whoop and knocks later in the night and wondered if something was watching us. Whenever we camp, we always set up a camera trap for the fun of it to see what wanders in to the camp. I did so on this night too and it was set up in front of the cabin but it had zero hits on it.  Not sure what all this adds up to.  The thing hitting the window could have just been a bug.  But the whoop and knocks I have no explanation for and I clearly heard them.",
  "classification": "Class B",
  "county": "Coconino",
  "state": "Arizona",
  "location_details": "The witness requested not to disclose the location."
}