{
  "reportId": "30135",
  "title": "Man recalls encounter with 7 foot tall creature on grandparents farm",
  "date": "1960-11-04",
  "observed": "My sighting occurred when I was about 10 years old on my Grand Father's farm located in Troup County, Georgia. This was the most terrifying experience I have ever had in my entire life.  I don't mention this event to my friends because I am sure they would not believe me. When I was a young boy, I accompanied my Grand Father to his 98 acre farm every day from his home located in LaGrange.  He had about 60 head of cattle, hogs, chickens and a mule. He also grew corn and vegetables and had a 2 acre watermelon patch.  After doing my chores on the farm, I liked to roam all over the property, especially down to the creek and 10+ acre swamp which was created by beavers damning up the creek. It was late one winter afternoon and I was walking in the woods far away from the old farm house when I noticed some move in the woods behind me. I remember it was late in the day, almost the time of sunset, when I was walking along the path leading back to the house when I saw \"it\" out of the corner of my eye. A huge, 7 foot tall, ape-looking creature that was covered in tangled hair. The creature was standing completely still with its long arms hanging at its sides. The one thing that I saw that I will never forget was its 2 big yellow eyes that were staring straight at me. I felt my heart skip and knew this creature, or whatever it was, was like nothing I had ever seen in my life. It was about 80 yards away and I knew that if it started running, it could probably easily run me down as it had extremely long, gangly legs. I was completely and utterly terrified.  I knew the only way I could escape was to turn and run as hard and as fast as I could, back to the house. I did just that - jumping over the one cross-fence located between me and the house, which was about a quarter of a mile away. I knew that I tripped or snagged myself on the fence, the creature would catch me and rip me to pieces. I was near  exhaustion upon arriving back at the house; completely out of breath. I immediately went to my Grand Father's side where I almost collapsed. I never told him about my sighting or anyone else, until years later after I was married.  I have since then told my wife and parents and one close friend about my sighting. I will be more than happy to explain more about my Bigfoot sighting. I truly believe with all my heart that what I saw that day was a real Bigfoot. After my sighting, I never one time went down to the swamp by myself. Previous to my sighting, I would often find some of my Grand Father's young calves lying dead in the woods, near the swamp. I wondered how and why this could occur, but after my sighting, I knew that the Bigfoot had killed these young calves as well as some of a neighbor farmer's goats. I remember one calf that appeared to have been ripped open i.e. mutilated. Later, after my Grand Father passed away, my Mother inherited the property and allowed some of her friends to hunt deer on the old farm place. One hunter told us recently that he had heard a howling like none other while hunting very early one morning on the farm. He said it sounded, not like a cry or howl, but more like a scream. Said it even frightened him and he is a seasoned hunter of many years! My story may sound make fake, but believe me, I know exactly what I saw that day and it was a living, breathing Bigfoot.",
  "classification": "Class A",
  "county": "Troup",
  "state": "Georgia",
  "location": "-85.02602,32.96854",
  "location_details": "Removed for confidentiality."
}