{
  "reportId": "2467",
  "title": "",
  "date": "",
  "observed": "My name is Don. I lived with my brother in a small A-frame cabin on Corydon-Ridge road in Corydon In.47112. It was summer of 91 ,it started with hearing sounds\"howl-screams\" in the woods behind the house. It scared the heck out of us and our dogs but we blew it off until it happened again. Being young and very stupid at the time (I was 20) I got the brilliant idea of shooting into the woods from where the sounds came from. From that night till we moved out about 2 weeks later we would hear the screams getting closer We kept shooting up in the air and out into the woods about 200 yards away the screams would stop after 5-10 shots but they would start a night or 2 later. My friend James came over and camped back in the woods. He was only there for several hours he said he saw something humanoid/hairy/tall walk between 2 trees He left shortly there after. The next night my brother woke up to a large shape staring at him in the window it had to be at least 8 foot tall. The next night my friend Mike stayed over out of disbelief. That's when it howled it sounded like it was in the house it was so loud. It was right under my window(my bedroom was upstairs).We went out the next day no tracks but the back steps(WOOD 2x8's)two of them had been caved in from something heavy enough to break the door jam. The knob was not hurt the door lock was still locked it was pushed with so much force it splintered the frame where the bolt met the wood. My dogs were cowering upstairs they messed all over the upstairs they wouldn't even come to me. The house was not touched inside. It smelled like feces/skunky/wet hair/urine/ it is hard to describe it wasn't overpowering it just was strong .I moved out the next day. No one would believe me, so I've only told a few people. I asked the local people about it they all said I was nuts or they would slam the door in my face. Some people bought the place a few years later; it was rental when I was there, I thought it was odd they disassembled the tiny cabin and hauled off on a flat bed truck ,they sold the land. There is a large brick home there today. Corydon is in Indiana,Harrison county,USA 47112 If you want to ask any questions contact me I never saw anything I guess this would be a bigfoot I don't know what else it could be.",
  "classification": "Class A",
  "county": "Harrison",
  "state": "Indiana",
  "location_details": ""
}