{
  "reportId": "1297",
  "title": "Man and his mother witness a Sasquatch while walking in the woods.",
  "date": "1997-07-15",
  "observed": "I was down on the lake target practicing with my rifle. My mother had come along to get out of the house. I was shooting into a mud bank at the edge of a small clearing that has a deep gully running down beside it. I had been there about a week before and had left early because I had been overcome with a sudden dread bordering on terror. I had been unable to explain this at the time, but the events that transpired next seemed to have justified my fear. I had fired several shots to set in my scope while my mother walked down to the lake. I soon had my scope set and followed my mother down to the lake taking my rifle with me. We then decided to walk up to an area  were I wanted to check for deer sign, which is directly across the gully from the car. At this time the sun was just going down on the horizon. We had just reached the area and I was busy looking at the ground for sign when I heard a series of peculiar whistles, at first I thought it might have been a cow but they were to high pitched and had an strange quality to them. As I was listening to this my mother walked over and told me that someone was standing by the car I couldn't see the car for trees from where I was at so I walked over to where she had been standing. I could see the car but couldn't see anyone . I then asked her if she could still see them, thinking she might have mistaken a tree for something else. she told me it was gone. As I said earlier the sun was going down and it was getting dark so we started back down the hill around where the gully terminated and up the dirt road that ran past the clearing where the car was parked. By the time we reached the road it was getting dark enough to be hard to see. There is a lot of brush on the side of the road and we couldn't see very far. As we were going up the hill about 20 yards from the car, the only way I can think of to describe what happened next is to say we hit a wall of smell. It smelled just like an outhouse and was very powerful. About that point I took what my mother had described to me to heart and decided that there was something in the brush in front of us and at the same time began to get extremely scared. I still had my rifle so I fired a couple of shots in the air. No sooner than the echo died away I heard heavy footsteps like the sound of a man running, going away from us towards the car and the gully , these sounds ended with a heavy thud like something jumped off the edge of the gully and landed on the steep bank. We then cautiously made our way to the car. I held my rifle at the ready while my mom got in the car. While this was happening I heard a sound coming from the edge of gully about 15 yards in front of me, it sounded like a cross between a rhythmic grating sound and a human voice. I then got in the car and we drove away. After we drove home my mother described to what she saw in more detail, what she saw is as follows: a tall manlike shape with light from the setting sun ! behind it, she was unable to make out a face because of the light behind it, but she could tell that it was very broad shouldered and from the light surrounding it that it was covered in hair about 6 inches long and reddish brown in color. Also by using my own height as a scale which is 5'11\" and the car as a reference we were able to determined that it was approximately 7 feet tall. After considering all these things we decided that we had encountered at least one sasquatch.",
  "classification": "Class A",
  "county": "Marshall",
  "state": "Oklahoma",
  "location": "-96.75361,33.89444",
  "location_details": ""
}