{
  "reportId": "6445",
  "title": "",
  "date": "",
  "observed": "My brother and I were on our family farm playing in the woods as usual.  We were in a heavily wooded area with thick underbrush in a valley behind our tobacco barn playing in the stream that ran along one side of the barn.  We were collecting rocks and making a dam for a swimming hole for the next summer's use.  It was late in the afternoon- almost dusk.  I kept having one of those \"gut feelings\" that something wasn't \"right\" but I couldn't put my finger on it, so we kept working. I had mentioned my feeling to my brother.  I crossed the stream with a jump holding a large field rock and heard a stick break loudly.  I looked under my feet and there was nothing but leaves and mud, I looked back across the stream at my brother who wasn't near any dead fall.  I also had a severe wake up call in my gut to get out of there.  I placed my rock and told my brother we had to get out of there immediately, something wasn't right.  He didn't protest as his hackles were also raised by that time. I retrieved my rifle from the tree across the creek where we'd left our \"weapons\" (pump BB air rifles, we didn't get shotguns till the next Christmas) and walked to the 4 foot woven wire fence we had to cross.  I set my BB gun down on the other side of the fence and grabbed some low hanging tree limbs to assist my getting across the fence.  Once I dropped down on the other side I turned toward the barn to pick up my BB gun.  I came eye to eye with a... thing.  A huge black, hairy thing crouched down slightly behind an old tree.  It had huge black eyes and needless to say scared the beegeesus out of me.  I screamed my brother's name at the top of my lungs and started pumping my BB gun for all it was worth, I intended to shoot it in the eyes if it moved.  My brother was about 15 yards from me on the other side of the fence retrieving his BB gun.  My next thought was run for help so I took off for the clearing some 50 yards away.  My brother says he looked at me after I screamed (a bloodcurdling scream he says) and says I was literally as white as a sheet and thought \"what the hell's wrong with her?\"  He then fired his BB air gun because it was a long pistol type model that he stuck through his belt.  Then he said he looked up across the creek and saw the thing- only it was out from behind the tree, standing fully erect now.  My brother cleared a 4 foot fence in one bound with 2 pair of long underwear and a pair of jeans on and he wasn't much taller than the fence at the time.  Meanwhile I'd made it to the clearing and turned toward the woods with my gun ready, looking for any sign of my brother.  I was never so glad in my life to see a hunter's orange sock cap bobbing my way.  I was crying and screaming for him hysterically.  He ran up to me and said he'd heard it chasing him, but it didn't follow him out of the woods, yet anyway.  We ran the whole rest of the way back to the farm house which was about 1/4 mile across a main road.  When we reached the house and \"fell in the door\" as my aunt says, we told her and my cousin about our encounter.  They laughed it off nervously and my aunt then confessed to many sightings and strange occurrences through the years in the area.  She told us a man had disappeared off a bridge on a tractor just below (less than 500 yards downstream) where we'd been when she was a child.  Said the tractor was found overturned in the creek, but the man never was.",
  "classification": "Class A",
  "county": "Robertson",
  "state": "Tennessee",
  "location_details": "Robertson County, Springfield, TN; New Cut Road near Old New Cut Road"
}