{
  "reportId": "10239",
  "title": "Motorists observe animal crossing the road",
  "date": "1994-08-13",
  "observed": "It is pretty sickning that I am saying this now considering it has been 10 years ago. It was a August morning outside brackettville tx or inside kinney county. Time was roughly between 7:00 and 7:30 we were coming back from laredo on hwy 131 Up ahead we both noticed a large hairy creature moving across the road. This was about 300 yards away from us. We both said that must be a bear and when we get to that spot we should stop. well we got to the spot and nothing just a patch of hair on the barb wire fence now with that in mind the fence stood about 4 1/2 feet high Bears have not been known to climb barbwire fences nor have they been seen in that part of the country for a long time. We both got pack in the truck and proceeded back to brackettville. When I got home I called my father who was a border patrol supervisor and told him the story. He told me that there has been several sighting in the area from local ranchers of seeing the type of creature. He told me not to worry it was probably just a bear from the mountains. Mountains I thought to myself Mountains are like a least 100-250 miles away from here. I just couldnt understand.   Now 1/13/2005 I saw some clues that i diddnt see before...there is a cave in that area called kickapoo caverns now it isnt open to the public and in the area alone there is tons of dome mountains or really big hills and plateus. I was thinking maybe it was a bigfoot we saw on that morning back in 1994 in august. The area of Kinney County is big and unspoiled. I would not be suprised if there are more sightings in this area the problem is you talk about this out there and people think your nuts. but there still are few people that will speak out if they have the chance to do so(resoures)_",
  "classification": "Class B",
  "county": "Kinney",
  "state": "Texas",
  "location": "-100.4104,29.24665",
  "location_details": "was on the highway 131 about 35 miles outside brackettville"
}