{
  "reportId": "353",
  "title": "Night sighting by two motorists near Lake Tahoe",
  "date": "2000-09-23",
  "observed": "On Saturday night Sept 23, 2000 (last night) my wife and I were on our way back form dinner and were driving south on HWY 89 just south of Tahoma (west side of Lake Tahoe), about 100 yards north of the Sugar Pine Point State Park Campground turn off when my headlights illuminated what appeard to be a furry animal crossing the road. When it saw our vehicle approaching it began to run from the center of the road to the other side into the trees as we passed. The general motion was from right to left heading west to east toward the lake form the campgroud area.  The strange thing was that it was clearly not a bear or any kind of four legged animal. It had a distinkt two legged run as I would expect a human to have, but was covered with hair (or fur) that was much longer than that of other furry animals and had a rust colored hugh to it. It ran slightly bent over and had medium hight (5-6'). It happened too fast to make out special features like feet, hands or the shape of the head. I could only see the running form of the body. The first thing that I thought was that it looked like a big foot, but was hesitant to suggest that to my wife. She in her exitement pointed to it and began to say \"look at the bear\" but stopped up short. I told her that I didn't look like that to me.  She was the one who suggested that it  really looked more like a Sasquatch, and at that point I know that we had both seen the same thing. A few reflections: 1. I would prefer to believe that it was just a prank by some fun seeking camper, but it was very real. This animal did not run or move as I would expect a human to run or move. What we saw was not a prank. 2. I can't think of a reason why anyone would go to that much work to fool a motorist for no apparent reason. 3. I have been a bit of a sceptic until yesterday, but we saw what we saw. I've been unable to find any other expanation for it. 4. As one might expect, we were unable to get a photograph and will have to live with our rememberance. I hope that this may help you or other who are keeping track of sightings.",
  "classification": "Class A",
  "county": "El Dorado",
  "state": "California",
  "location": "-120.0914,38.9575",
  "location_details": "West Lake Tahoe just north of Sugar Pine Point State Park Campground"
}