{
  "reportId": "23305",
  "title": "Hunter hears loud vocalization and is nearly trampled by a spooked Elk north of Burns",
  "date": "2005-11-07",
  "observed": "We were hunting third split rifle in section 26 of Flat tops in 2005. I had not seen many Elk in area this year. I hunted an area I had seen Elk before in the early morning by myself and saw nothing. My brother Greg got up late and went to same area. He said in open grassy area on side of hill was a large group of Elk in plain sight. Greg took a shot at about 200 yards from a fence. He shot at a large bull in group. He thought he was successful, but nothing dropped. He walked accross Derby creek down a big canyon chasing them, but to no avail. He came back and got me from camp excitedly after looking all afternoon. I have confidence in my brother shooting, so I said lets go back and look some more. After, we got back, we went to side of the open hill and found two separate blood trails. Not one, but two, which is strange. You could smell what I thought was Elk heavy still in area, so I thought. I followed blood trail down the ravine towards Derby creek. As I got about 1/3 down on Elk run at a very steep angle the huge bull Elk from the group came running crazed up the trail and was on me in no time. It about run me over and I jumped to get out of the way and I fell down. Then after I got my wits back from nearly being gored. A bout 30 seconds later we heard the loudest angry howl or growl I have ever heard come from the hill below me from the heavy woods. It made my hair stand on end. Everyone heard it, it was a 100 times louder than an Elk bugle and sounded like an angry animal or human of some kind as it echoed through the ravine. It really was something. In fact, it was the most awesome sound I have ever heard in my life. It spooked the horses from our other hunters and the guides horses as well as the hunters. In my mind, we may ruined a another hunters hunt. This is why the second blood trail, and the foul smell and the angry yell. I will never forget that day and my brother and I speak of it often.",
  "classification": "Class B",
  "county": "Routt",
  "state": "Colorado",
  "location": "-106.6735,39.879",
  "location_details": "The area is the Derby Creek drainage system near Stump park."
}