{
  "reportId": "28568",
  "title": "Nighttime sighting near a dumpster by a bicyclist in Canton",
  "date": "2010-10-17",
  "observed": "After a late concert at the square in Canton, Illinois, my friend was bicycling home and turned right into the parking lot, that leads past a shed, fence, and dumpster. Hearing a shuffling bang noise near the dumpster, she slowed her bike and began looking. Behind the shed was more than a noise. A shadowy sasquatch shape. Its puffy balloon feet (as she described it), held up a stocky, not so tall frame (6 ft.). Startled, it turned and walked into the bushes, moving branches to get into the woods.This was a thinly wooded area, and on the other side, a corn field. So freaked out she said, \"what is that?\", and sped right home and told me. I could tell she was worried, and by her description, this did happen. We discused the situation further (5 minutes), then decided I should go check it out. She locked the doors and I got on my bike. I sped around the corner keeping my pedals quiet. The noise, there was the noise. I pulled over behind a pine tree, and quietly snuck up beside the fence staying low. At the minute I was ready, I turned on the flashlight under the fence. No feet were there.  But that noise, was it inside the dumpster? So I slowly snuck around the corner. Only one cover of the four covers was open on the dumpster, so when I was ready, I shown the light through it. A small coon was trapped. Unable to climb out of an almost empty dumpster. It was out of breath, and sad looking, so I put small cans and an old sign in to give it a ladder out. I went back later that evening and the coon was out and to check the shadows around there.  We think it heard the coon also, and may have ben trying to find a way inside. We dont know if it was hungry, or just trying to help the coon out.  We still walk our chihuahua Soosy near there, not quite so close to that shed anymore. Notes: 1. Definitely walking on two legs. 2. You do not want to see it. 3. Hoppy, startled, quick walk. 4. Stocky, muscley. 5. Black to blend with darkness. 6. It was probably curious 7. They just want to be left alone.",
  "classification": "Class A",
  "county": "Fulton",
  "state": "Illinois",
  "location": "-90.0055,40.5658",
  "location_details": "Go to the end of the road on E Myrtle St."
}