{
  "reportId": "27589",
  "title": "Possible footprint and strange occurrences  at a rural residence west of Louisa",
  "date": "2010-04-13",
  "observed": "I live in the very wooded hills of eastern kentucky. I noticed that some of my garbage behind my house had been ripped up, not reallly chewed up. Then one night about 2a.m. I let my dog out for the night and I saw him looking up the hollow(which is a very deep valley with a creek at bottom and about 4-5 caves surround the area). About 5 minutes later i heard him barking loudly like at something and i could tell, I went to the door and yelled for him to get back here thats when i heard him skuffle with something. I could not see him but, then suddenly he came running back fast and ran in the door. I then called my dad which lives right beside me and told him to bring his light and his gun something was outback trying fight the dogs. We started to walk up the hollow and heard really loud crashing and breaking of good size limbs, and also heard a grunting sound a couple time. They move for about 30 seconds very loudy breaking everything it sounded like, I heard alot of animal run in the woods but not any that just run right through the trees most animals will dodge the brush. We held the light up on the hill about 100 feet away for awhile all we heard was one constant sounds in the leaves right in front of us as something else walked around to the right of us. We left right after that because we didnt really hear anything anymore. The next day me and my dad decided that we was going to go look to see how the brush was broke or any kind of sign of what we were dealing with because we have had a big history of dogs just disappearing without a trace, and i have 3 dogs now so i want to protect them from whatever i thought it was. We walked all over the hill only finding spots where it seemed like something was bedding. As we were walking off we decided to walk down an old logging path off the hill, about half down my dad says whats that there and I look and see what looks like a really big human foot print, but like really big with a prominate heel and toes with a arch in the middle of the print. We both looked at it and looked at each other we both knew it looked like no animal track we had ever seen before and we are avid outdoorsmen. We came back down off the hill amazed by what we had found. So I got on the internet that night looking at some bigfoot stuff, i had watch some already and i believed in bigfoot but never really thought i would experience it in my own back yard. So I looked up some stuff and saw that some people had heard a banging stick sound. The next day which was April 15 2010, I went back to the footprint to take pictures, which i have and would love to share. I took the pictures and decided to start banging some sticks together to see if i could call something out. I did it for probably about 10 minutes and was about to stopped i was gonna do it 2 more times. I hit it again and right after i did I heard a loud really high pitch scream/roar that sounds just like the recording that was caught in Ohio in 1994. It scared me so bad I turned and ran a fast as i could down a really steep hill running through briars and everything, i thought i was running for my life. I made it all the way back to the house i had never been that scared in my life. Ive heard almost every animal before even a bobcat and I have no clue what made that sound. I didnt even take time to look back even though i wanted to try to attract it to snap a picture. I am definately a firm believer now and I think if someone could come investigate pretty quick it may still be hanging around. I am going to continue to try to lure it out and try to get a good clear picture( if i dont run again lol) I also have the pictures of the print that i would love to share.",
  "classification": "Class B",
  "county": "Lawrence",
  "state": "Kentucky",
  "location": "-82.70393,38.11509",
  "location_details": "West from louisa, in a area called fallsburg."
}