{
  "reportId": "13653",
  "title": "Dusk sighting by a US Forest Service Law Enforcement Officer on the beach south of Tillamook",
  "date": "1995-08-14",
  "observed": "Back several years ago, I reported this sighting to Peter Byrne, who took it very seriously. I agreed to talk on camera, to \"Good Morning America\" back in 1996. My conditions were that only my voice would be used, and not my name.  They interviewed me, but then showed me completely.  I felt betrayed by \"Good Morning America\". I and my girlfriend were both in law enforcement at the time. I was, at the time, a US Forest Service Officer (Law Enforcement LVII) and later a police officer.  Now I have been out of the field for 3 years, and I want to tell my story and show the photos. On August 14, 1995, my girlfriend and I were camped on a beach in Oregon, north of Lincoln City and south of Tillamook. We were on vacation, and we were the only people on that beach. We had a good fire going and dusk was approaching around 21:00 Hours. We were camped on a bluff about 7 ft above the surf and had a clear view of the beach north and south. We were set back on the bluff around 100 ft from the shoreline. I noticed a figure which I thought was a person, standing south of us on the beach, I guess around 100 yards from our location, standing near the shoreline, looking in our direction. At that distance I thought it was strange the person was covered in black clothing, so we thought.  I was a bit alarmed thinking someone may be planning to harm us. We also thought it was strange because nothing was down the beach except rugged beachline, to at least Lincoln City, 20 Miles  to the south. When I lost sight of it I was a bit uneasy, wondering what the person was up to. Later, we saw the person come back, but not stop. It kept walking in our direction, to a distance of about 50 yards. It stopped, turned around, and headed back to the south. Again, 5 minutes later, the person came back, this time it kept walking to a 90 degree angle to our location, and turned around and headed back south. By now the sun had set but the moon was full or close to it. It was a very bright twilight, with the sand and ocean. The \"person\" in question again came back, following closer to the shoreline this time. It walked directly by us and past to the north now. We noticed the person was very large and seemed to be as tall as we were on the bluff. It was jet black and had the forward posture with the long swinging arms. We also noticed the person almost seemed totally uninterested in our presence and looked like it was looking for something on the beach, stopping occasionally and starting up again. The person turned around and went directly back at a quicker pace and headed at a fast walking speed (guessing 4-6 mph) to the south. We were amazed at how unusual the scene was. The pace, the fact the motion was more fluid, and not bouncing as we walk or jog. Also, all black. There was no other color, from head to toe. The head was pointy.  The \"person\" now headed south quickly, and went out of sight. I grabbed my mag-light and ran down to where my girlfriend told me to stop, so I knew where to look for prints. Just before that point I nearly tripped on a track, and was amazed at how deep it was. It was at least 10 inches down. I pressed down maybe a inch or two at most in the sand as I walked. I yelled for my girlfriend to come down to see what I was looking at. She reluctantly came down. When she got close she immediately said, \"Oh my God!\" The tracks where at least 16\" long and 10 inches wide.  As we were focusing on the tracks, my mag-light went out. I told her not to worry. I had a spare bulb in the back of the flashlight. As I was fumbling to change the bulb, in bright moonlight, she yelled, \"It's coming back!\" I dropped the bulb in the sand and I just stared as it approached us at a fast rate. From the south, at 100 yards, at a fast clip. She pulled my arm and tried to drag me back up to camp. I told her I was staying and wanted to find out what it was. She became frantic, screaming, \"come on!!\" as she headed to camp. I stood there and I was stunned. At a far distance of 80 yards or so, this thing was taller then me, at a level field. As it got closer I started yelling \"You better stop! I am going to shoot!\" I was unarmed.  It kept coming, directly at me, like I didn't exist. Its shoulders seemed to be at least 4-5 ft wide, with no neck. I started to notice hair all over, and started to make out the face. At that point I realized, and I said out loud, \"Oh My God, it's not a human!\"  I  couldn't move for a moment. When I got control again I ran like hell, toward my girlfriend, who was screaming, \"Run!\"  I ran fast, thinking it was coming for me. I got to the top, and was happy to see it kept walking past where I had been standing. It walked beyond where I was standing, then turned around and walked back to the south, out of sight. We then ran over the hill to the rental car. I yelled at her, \"Where are the keys??\". We realized they where back down on the beach in the tent, in my bag. We hesitated and then went back. We grabbed them and were going to leave everything else. After a few moments we calmed down and decided to go back to our things. Then we decided to stay through the night, after my girlfriend started saying that it didn't hurt us and it could have. We decided to stay, and I got the video camera out of the car.  I kept the fire going all night, staying up. She didn't make it all night, and fell asleep. I didn't see it again. As soon as day break came, I took the film camera and took pictures of the footprints, heading both north and south on the beach. Luckily they where not very degraded due to the wind. I followed the tracks and used items and myself to give depth and distance. I noticed the tracks all went to the east at a point. This was the direction I assumed the creature went. After I took several photos of the tracks I ran back to camp. We left Oregon, drove to Seattle and caught our flight back to Colorado. After a few weeks, I did a bit of research and contacted Richard Greenwell [deceased], of the International Society of Cryptozoology. He interviewed me and had me get in contact with Peter Byrne in Portland. Byrne contacted me and wanted me to come back out and show him the location of the sighting and the trail. I couldn't get back out due to vacation time availability. He found the location and looked around, but nothing was found. Later that next year, Byrne gave me a call and said \"Good Morning America\" wanted to do a story on my sighting. I told him I could not, due to my employment position. He assured me that I would be off-camera, and they would only use a voice-over. I agreed to do the interview. My girlfriend, who was a deputy sheriff, decided to stay far away from the media, in case things got out on identity. I reluctantly agreed to do the interview. I did this also to help Peter Byrne, so he could possibly get some funding for his organization, knowing it would help his cause.  Later the tape was aired, showing me on camera and speaking. Not good! ... Since that time, in 1996, I have been back to this area a few times to look around, but have not contacted anyone else about it.  I will be happy to send pics but do not see how to do it here. If you want the entire collection you can contact me.",
  "classification": "Class A",
  "county": "Tillamook",
  "state": "Oregon",
  "location": "-123.972,45.145",
  "location_details": "[Removed from report]"
}