{
  "reportId": "21193",
  "title": "Daylight sighting by motorist from Jimmy Witherow Bridge",
  "date": "2007-08-01",
  "observed": "I was traveling in my vehicle coming across a bridge with a well known river passing underneath, when I noticed a large tree that had fallen into the water off to the right about 200 yards. As I looked at it, I peered up over the concrete railing and saw something standing in the river perhaps 75 yards away. My first thought was 'well, there's a bear'. But as I kept looking, it was apparent to me that it did not have a snout of any sort. It's face was like a human face, but black. This creature seemed to be in the middle of something (fishing?) and I had either spooked it or interrupted it. As I looked at it, it was looking at me and following my vehicle with it's gaze. It was black and it had long hair, like a shaggy dog. Trying to remember now, but I don't believe it had a neck of any sort that I could see.I corrected myself, before veering over too far and rubbing against the railing. I kept driving. It never occurred to me until later that what I saw was a Bigfoot. Am very familiar with Bigfoot and thought if I ever saw one it would be walking away or from a distance, and be a unique experience to remember for a lifetime, but it was nothing like this. And to be honest with you, it was an intimidating experience and I have not been back to that area since.",
  "classification": "Class A",
  "county": "Whitfield",
  "state": "Georgia",
  "location": "-84.5136,34.48287",
  "location_details": "This is an area that I am very familiar with, have fished there many times, seen deer, bobcat and coyotes but nothing strange or never heard any strange sounds.Before I was born there were rumors of panthers in the area. Lots of wilderness in this area. Years ago, teenagers used to swim in the river.And people would throw out their trash, old mattresses or furniture there. About 10 years ago, the old dirt road was blocked and a new road was paved with a new bridge put over it and I used it quite frequently, but not everyday. The nearest house was probably 200 yards away."
}