{
  "reportId": "12825",
  "title": "Possible vocalizations heard in undeveloped section of Ocean County",
  "date": "2005-11-13",
  "observed": "It was at least 2:00 am, in January or Februrary. The temprature was in the low teens. I was dropping a friend off at his home, the back of which was separated from the Highway (Rt.72) by about 150 to 200 yards of woods and a dirt road. There are no homes or streetlights on this part of Rt.72. The east side of Rt.72 is completely untouched woods for miles into Burlington county. This area was the end of a development that had never been finished.  Work stopped in the late 1970's, as part of the Pinelands Preservation Act. There was a dirt road about 30 yards behind the house,which connected to the East into a grid of unfinished, unpaved roads. At that time his house was the last house on that road, completely surrounded by woods. We were talking beside the car under the streetlight for at least 20 minutes, when we both heard a woman screaming.  It sounded like it was coming from the unpaved road behind his house. We both thought someone was in trouble, so we ran inside his house and grabbed a flashlight, knife, and a hatchet.  We ran into a trail along the right side of the house, (south-east) which led out to the dirt road. We could hear the screams getting louder and more to our right in the woods.| We were only about 40 paces into the woods, when I started feeling very uneasy, and I started to realize that this wasn't a woman screaming. I could hear it now to my right, more like a loud whistling now (not ahead in the dirt road like I had thought) about 15 yards away. We both stopped and listened for a few seconds, my friend had the flashlight scanning the woods which was new growth oak saplings, blueberry bushes (waist high) and 12' to 14'ft. scrubby pine saplings(20 years old?). I could hear it heaving as it breathed in and exhaled out with a very loud high pitched whistling, we couldn't see anything but It was very close to our right as we faced southeast -- within 10 yards. My friend immediately turned toward me and said \"that ain't no girl screaming\" and quickly moved past me back toward the house. I was standing still and listening, it was still screaming right at us. At this point I knew it wasn't a girl at all, more like a loud whistling is how I could best describe it. There was no noise other than the screams. There was no movement at all. No sound of struggle. I thought that it might be a wounded animal, like a deer or something. It was so loud and the deep breathing noises were from a much bigger animal than a fox. I could distinctly hear it breathing in and out rapidly to make the screaming noise.  I remember thinking that it's dangerous to be this close to a large wounded animal.  It was not like anything I had ever heard in my life. I turned and headed back, looking and listening. It was still screaming, but did not follow. We immediately called the police and reported it. Within 15 minutes we went back outside, now the screams were further toward the south-east, very faint now. It had definitely moved off quickly. The screams faded totally within 10 minutes. We listened for at least another 45 minutes but it was gone. I don't know what the police had done after we'd called. I had always thought it was a wounded animal of some kind.",
  "classification": "Class B",
  "county": "Ocean",
  "state": "New Jersey",
  "location": "-74.2975,39.7384",
  "location_details": ""
}