{
  "reportId": "5299",
  "title": "Camping group has night time sighting near the Dosewallips River",
  "date": "2004-10-13",
  "observed": "I was about 13 or 14 at the time, and went with a group of church kids on a hike up into the Olympic Mountains. There were about 10 kids and 4 adults leaders. We hiked up the Dosewallips River headwaters to the Royal Basin where there are a couple of small lakes. We made camp and eat dinner then went to bed. The adults stayed near the campfire area. One group slep under a large rock overhang. I chose to sleep a little away from all their noise of the others. I remember looking up at the stars and the jagged mountains. After a while I looked up again and saw that the mountains appeared smooth! I was thinking, how could this be, when the \"smooth\" mountain started to sway a little. I smelled a definite skunk cabbage smell. I then realized that this was not the mountain but the silouette of a large animal. I was seeing its head and shoulders as it was standing at the foot of my sleeping bag. I pulled the sleeping bag up over my head. Later I looked out and it was gone. The mountain was back to its normal jagged shape. Then the group down by the overhang rock started yelling. \"Whats that over there?\" \"It looks like a big gorilla!\" \"Look you can see it, its moving!\" The adults were upset at all the talking and screaming. I heard each of the adults in turn saying to knock it off and get back to sleep! Not one of the adults could have been pulling a prank. They were all off to the lake side as I could hear. The next morning there was a lot of talk of what they saw the night before. The adults thought the older kids were just trying to scare the younger ones. I think they were telling the truth.",
  "classification": "Class A",
  "county": "Jefferson",
  "state": "Washington",
  "location": "-123.2135,47.8306",
  "location_details": "Headwatters of Dosewallips River, Royal Basin near the largest lake and rock overhang in the medow."
}