{
  "reportId": "8451",
  "title": "",
  "date": "",
  "observed": "It was in at the end of August 2003. My self and a friend were fishing the Potomac River. We Were fishing between mile marker 57 and 58 off the C&O Canel. We parked in the town of Knoxville Maryland and crossed the rail road tracks to get to the river. We were fishing in a brach of the Potomac that was about 600 meters long before it went back into the river. We got to the spot around 8:00 AM we had our backs to the Potomac when fishing the banks of the branch. Behind us was the Potomac. There was an island that was about 600 meters long and about 200 meters at it widest point. The island is a hill and you can't see the Potomac from were we were fishing. We were only there about Five mintues when heard what sounded like a dying deer. My friend heard it too, I said it sounds like some one shot a deer and it was dying. This whole time we were walking down the river and fishing at the same time. As I got farther down the branch of the river my friend said what is that alful smell. I said it must be that deer. My friend said that is the worst smell I have ever smelt before. Then we heard some thing moving behind us on the island. I was thinking that deer is not dead yet. I started to walk across the water (which was about three feet deep) to the other side to see it. As I was walking I could smell it and it was getting worst. My friend said what is it, I don;t know I can't see any thing but I can smell it. He started walking over towards me. He was walking with the river (south east) I was standing in front of a hill and could not see over it. Wear he was walking from he could see over the hill. I was about 50 meters down river from him. He said John I see some thing, I said is it a deer. No I think it is a bear. I started to walk back and towards him. I was hoping it was not going to atttack us. I said lets go some place else. I wanted to fish not get attacked by a bear. He was walking to me and I was walking towards him I said lets go. Then were heard it again and I said that dose not sound like a bear.He said No but it might be a bigfoot. I said all the more reasons to go some place else. As I got to the bank acrossed from the island I got up on land to see if I could see it. He was still in the water but walking towards the bank wear I was standing. I could not see any thing but I did hear some thing walking on the other side of the hill. I said maybe it was a hunter and he killed a deer and now he is coming over the hill back to his car draging the deer. The steps were getting louader and I could smell the smell with every breath. At this point I am ready to run. I was a 4:18 miler in college and I was hoping my feet don't fail me now. It stopped and we could not hear it any more. I would have ran like hell if I would have seen a bigfoot. That might have been the day I went sub 4:00 in the mile. We left and talked about all day long. We still talking about it. He likes to tell the story I don't go up that way much.",
  "classification": "Class B",
  "county": "Fredrick",
  "state": "Maryland",
  "location_details": ""
}