{
  "reportId": "9863",
  "title": "Hiking couple hears calls and finds footprints near Mt. Adams",
  "date": "1997-05-15",
  "observed": "I have had a couple of experiences in 1997 in the Mt Adams Wilderness Area. I did not see an animal. To be brief, it was in the late fall, my husband and I were camping, at about 0400 we heard a strange animal call. It was a roaring, warbling, guttural yodeling sound that included a high pitched scream element. We heard the call 4 or 5 times in succession, then all was quiet. The sound was between 800 to 1000 meters from our camp.  In this same area on a following trip that fall we found some partial tracks in a mud bank. They were just the toes and part of the ball of the foot. The track was approximately 7-8\" wide, I noticed that the great toe was disproportionately large (wide) in relationship to the other digits. The reason we noticed the track initially was not because it was so large (which we discovered on closer inspection) it was because there was patchy snow on the ground, it was raining, quit chilly, and here someone had be out in the middle of nowhere walking around bare footed. The tracks went up a muddy bank and were very distinct. I take it that they were very fresh. At the top of the muddy bank the track intersected a game trail. At this intersection I found what appeared to be a deliberately placed \"calling card\". It is a rock (I have this rock). It was out of character for the surroundings. A piece of basalt with a deposit of a white quartz-like stone that I don't think is quartz. The rock was lying in the trail, completely clean, no moss, no mud, white side up. This rock is about the size of an orange.  We have had a few other experiences that we have not been able to explain away that happened in a different location. I feel good to have told these events to some safe to speak to of such things. I am a registered nurse and own a small business, so it wouldn't  be good to have my name attached to this report publicly. I am sincere in my belief that there probably is an un-cataloged primate out there, possibly from a couple of different gene pools. This fascinates my husband and me. We find ourselves in the deep woods in the middle of the night frequently, sans alcohol or anything else.",
  "classification": "Class B",
  "county": "Skamania",
  "state": "Washington",
  "location": "-121.7512,46.0803",
  "location_details": "As I stated in the narrative., this was in Washington State in the Mt. Adams Wilderness Area at the \"Cold Spring Campground\". We came in from the south, from route 147."
}