{
  "reportId": "2062",
  "title": "",
  "date": "",
  "observed": "When we arrived to our camp from a early spot lighting mission for game we (Tom Marlatte, my long time friend and I) were breaking down for dinner, there was a sound which sounded like a mule and wailing screams. This occurred only once but lasted for about 15 seconds. It is hard to describe these sounds in print but whoever I tell my story to I always get goose bumps. We had a 1.5 million candle powered spotlight and could not see to far into the brush because it was so dense, but we saw something about 7-8 feet in height, hairy body but with an open face with not so much hair on the face. Bigger eyes than normal even though we could only see the reflection of the eyes, they reflected back to us as a blue green to a slight red tint. The creature only remained in the light for only a few seconds and covered his eyes when the light was directly shined on to it. His hands were big with the palm was hairless. The creature was supporting itself or bracing between two trees about 6 inch diameter. His hands clearly wrapped around the trees. We both couldn’t believe our eyes and grabbed our riffles after it shambled off into the woods. The whole night we could hear something walking around our camp sight with ease. I was kinda scared but had sufficient fire power to kill anything in these woods. We did build a bigger fire and it took us many hours to go to bed that night. The next day I went up to look for anything unusual and noticed freshly twisted limbs on white fir trees about 5 to 8.5 ft. tall. The pitch was just barely coming out so it was only a few hours old. These \"twistings\" were about 50 to about 200 yards from our camp site all around us. It was to dry for any quality tracks. I've been in the woods for a good part of my life and I never thought this could happen to me or ever happen again. I'm still scared of that area to this day but I want to return to search for more evidence of Bigfoot. I believe now!",
  "classification": "Class A",
  "county": "Clearwater",
  "state": "Idaho",
  "location_details": "Idaho, Northern region. Clearwater County. 20 miles away from a town called Elk River by the junction where Elk River flows into Dorswack Lake. This incident occurred in October 28 1995 at about 6:00 p.m. the nearest road is the 3Bear RD."
}