{
  "reportId": "29891",
  "title": "Possible encounter experienced by a family while fishing at Prather Lake",
  "date": "2011-07-09",
  "observed": "I went fishing in Morgan Monroe State Forest with my two sons and our beagle. About mid day we heard something BIG in the woods near where we were fishing, way bigger than a deer running through the woods, in fact it was like a large crashing sound and about 30 seconds later there came the sound of a tree breaking. I suppose it's quite possible that an old rotten tree was in the process of falling down, and it didn't really scare us although it was odd. What happened for the next few hours was however beyond odd, it was downright spooky. For those who aren't familiar with Prather Lake, it's in a very remote part of Morgan Monroe and it's quite a hike to reach the lake when the access road is closed. When you get there you know that it is rarely visited, maybe due to the extremely rugged terrain or the long walk that it takes to get back there even when the road is open it's still quite a hike down a long downhill trail to reach the lake. Back to my experience, after hearing the noises coming from the woods nearby the lake my sons and I moved to another spot to fish. Not an easy feat when you're carting fishing gear and a stringer of fish because like I said, the terrain is rugged and steep. We moved to a place in about the middle of the lake and begin to fish again, this location was approximately the direct opposite side of the lake from where we heard the crash and tree breaking sounds. For the next few hours that we were fishing we heard sounds like someone banging on a tree with a tree branch. I guess in the world of Bigfoot research that's called knocking. The knocking seemed to be somewhat rhythmic in the sense that it was two or three big knocks followed by 10 or 15 minutes of silence. Our beagle was busy sniffing around all day long, like we'd never seen her sniff before, her level of excitement was through the roof! What was unusual about her behavior was that she was reluctant to leave our sight. She didn't venture out more than 20 or 30 yards from us until about the time we decided to leave. Anyone who owns a beagle knows that they love to sniff and love to stray away on the trail of what ever they are sniffing out and our dog is no exception. This day she didn't, and she seemed scared out of her wits. We were getting tired of fishing and were talking about leaving because we had about a hours walk ahead of us to get back to the car. We decided to finish out fishing because we only had about five night crawlers left and it seemed to be a waste to toss them. Our dog finally mustered the courage to venture out of our sight. She did so meandering up the mossy covered hill that we were at the bottom of and she was gone for about 15 minutes. We heard her rustling through the leaves and forest foliage and then she would get quite for a minute or two. I didn't think too much of it at the time until she let out a series of barks and whines that sounded more like she was in trouble than if she were on a trail. This got our attention and we looked in the direction of her calls, we heard her high-tailing it through the woods and she appeared racing down the hill in our direction. She raced toward me with her tail between her legs and nearly tripped me trying to hide behind me. We got a good laugh out of that figuring she probably got into it with some forest animal and it got the best of her. That's when we heard the knocking again- behind us in the same area that the dog had just returned from! We also noticed an extreme smell, like crap in the air. The dog began to bark and get super excited while looking up the hill behind us. She started to run up the hill again, but stopped short only about 10 feet from us and again raced back behind me and looking up the hill. Then we heard the knocking again. I decided it was time to go, my sons who are age 9 and 10 began to get spooked by all this excitement and honestly, so was I! All day long I had made up excuses for the weird noises we heard because I didn't want to say bigfoot or sasquatch around them and make them afraid to go into the forest. But things were beginning to get all too strange so we quickly packed up our gear, grabbed our fish (fought off the huge snapping turtle that was trying to steal the fish off of our stringer) and got the heck out of there. On the way back up the steep hill that lead back to the fire trail my oldest son said to me, \"Dad, do you think that Daisy (our dog) saw a big foot?\" Not actually seeing anything myself, all I could tell him is, \"mmmm, maybe?\"",
  "classification": "Class B",
  "county": "Morgan",
  "state": "Indiana",
  "location": "-86.4324,39.3804",
  "location_details": "Hatfield Ridge fire trail back to Prather Lake trail. Long walk down the gravel fire trail to get to the trail that leads to the lake. The lake trail is completely down hill and once the lake is in sight the whole area is super rugged, mostly steep mossy covered hills that surround the lake, very difficult to traverse."
}