{
  "reportId": "24033",
  "title": "Woman describes foul odor and possible vocalizatons near home outside Charlevoix",
  "date": "2008-06-15",
  "observed": "Hi, This is really wierd for me, and I have no idea if BigFoot even exists and have never in my life considered that it may. I do not mean to waste your time and do not intend to. I just want to let you know what I have experienced and it could be nothing at all. I have NEVER in my life read about signs of a bigfoot or anything of the kind so I don't know what to look for, but it occurred to me that something odd is going on in the woods behind my house in Northern Michigan (my summer home). Upon arrival to Michigan for the summer, I walked around the back of my house via my wraparound porch and smelled such a pungent aroma kind of like a sulfer/waste smell mixed with the strongest male body odor I have ever encountered. It was about 50 degrees outside and I could not get over the strong smell which literally overwhelmed me. The home has been vacant for months and noone would have been near the house in the preceding days of our arrival. It smelled like a man, but more like a poopy body odor but literally ten times stronger. My house is located on a cul de sac with only 2 other homes on it both at least 100 yards and 200 yards away. Our lot is big about 1-1/2-2 acres with woods on 3/4 and the 3rd hole of the golf course on the other 1/4. The woods however are quite thick and have lots of deer and turkey etc. The next day I went outside again early in the morning and smelled it again so strongly. The smell actually lasted around 2 1/2 days and then finally went away. Keep in mind that the house has been vacant for over 9 months until we arrived. Then 2 nights ago my husband and I heard a deep-throated moan or sream kind of like an animal dying but it didn't sound like an animal and it didn't sound human either. Strangest thing ever.",
  "classification": "Class B",
  "county": "Charlevoix",
  "state": "Michigan",
  "location": "-85.23538,45.33075",
  "location_details": ""
}