{
  "reportId": "4206",
  "title": "Predawn sighting on north side of FM 1375, just east of bridge over Lake Conroe",
  "date": "2001-09-11",
  "observed": "I am a little unsure if this is a Bigfoot sighting or not but it certainly freaked me out enough that I felt the urge to look into a bit further.  It happened in September of 2001 on the county line between Walker and Montgomery Counties in East Central Texas.  At the time I was living in the college community of College Station Texas and would commute the hour and a half from home to my work in Conroe.  Due to the drive and the time I needed to be at work I often left long before the sun was rising. On the 11th of September I left home at about 4:30 A.M. and headed to work.  The quickest not easiest route leads through some rather empty country and part of the Sam Houston State Forest which borders Lake Conroe.  I was on FM (Farm to Market Road) 1375 which cuts through the Forest and over part of the Lake.  The 'cut off is approximatly 15 miles from the state highway to interstate 45 running north south from Dallas to Houston.  Halfway down the road is a bridge spanning the upper portion of the Lake. I had just crossed that bridge headed east when I decided to pull to the side of the road.  I am a heavy coffee drinker and for obvious reasons the rural nature of the spot made it an easy stopping point.  Where I had stopped years of fishermen have worn a path down the from the road bed to the Lakes edge.  I had just started to step onto that path when I noticed a VERY heavy musky odor.  I wish now I would have made a point to stop and take another breath but at the time I was thinking just that it was a really strange skunk odor. I had taken maybe 2 or 3 more steps when the hairs on my neck literally stod on end and to this day I swear I heard a 'woofing' noise.  Not like a dog does but kinda like that and as if something was telling me I was not where I needed to be.  I stopped and that is when to my immediate right something stood up and grabbed the branches of a small tree right next to my head and began to shake. I had left my lights on in at the truck and though they were not shinning in my direction the reflection was enough to get a general idea.  It stood well over a foot taller then me and was still 'below' me on the slope of the embankment I am 5'8\" so I would think it was about 7 feet tall.  It had dark colored hair, a rather large head and I could not see the nose or eyes due to shadows.  It had long arms I think and large hands.  I am a little unsure of that because I can not remember if I really looked at its hands or not.  The stench was amazing.  Enough to make my eyes water.  It began to make a squelling bark kinda noise and in 2 or 3 strides was past me and headed for the road.  I don't know why it didn't turn and head back into the forest but it didn't.  I turned to watch and as it started across the road a light colored truck came around the bend in the road headed west.  I don't know if the driver saw what I did but I can remember the red lights of the brakes shinning so he/she must have seen something.  The creature moved up the hill on the otherr side of the road and went into the pine trees there. I got back into my truck and got the heck out of dodge so to speak.  I have only told one other person about this cause to be honest I don't want to look like some idiot seeing a ghost in the middle of the woods in Texas.",
  "classification": "Class A",
  "county": "Walker",
  "state": "Texas",
  "location": "-95.58334,30.52361",
  "location_details": "I have given about as good of a description of the area as I can.  Half way down FM 1375 on the north side of the road just past the bridge spanning the upper portion of Lake Conroe."
}