{
  "reportId": "13673",
  "title": "Various incidents around home with women and children only, near Summerville",
  "date": "1970-06-24",
  "observed": "I'm not sure how to really explain the thing that my friends and I saw that year. I've not told too many people about it because I did'nt think that I would be believed. I am 47 years old and I can still remember what I saw and smelled just like it was yesterday. I can also remember the fear. It happened during the summer of 1970. I lived in a small community called Lincolnville S.C., right outside Summerville.There was'nt a whole lot for the kids in my neighborhood to do at night so hide and seek was our most popular passtime at night. One evening as we were outside playing I began to notice an awful smell, like something dead,a real overpowering smell. The place where I lived had a chainlink fence all around the property which was about 1-2 acres. We were on the backside of the property which had woods behind it.You could see red eyes glowing in the dark but I could not say how tall it was.I do know that it was taller than a human being. It just stood there and watched us.All of us were so scared that we went into my house and told my grandmother and cousin about it but were not believed. It was seen on many occasions.We could smell it before we ever saw it. There were several neighborhood dogs at that time that were found with crushed skulls but no one knew who or what had killed them. But one night my best friend and I decided to camp out in a mobile home that was on the backside of our property one night. Whatever this thing was walked around the trailer and hit on it and tried to get in. We could see it's shadow everytime it came around. It was the longest night of my life. It continued just until daylight. We hit the door running. One another night we were awakened by a loud thud on one side of our house. My brother came out screaming because it was at his window. We all went outside and we could hear it running slow heavy footsteps, it went over our fence into the woods,we did'nt see it but we could hear it. It got so that we quit playing outside because the kids were scared. I did see it one time after that.It was probably October of that same year.I had to go out to the pumphouse and turn the light off the well because we kept it on the pump at night to keep the water from freezing. I saw in the early morning sunshine this creature that looked like an ape standing on the other side of the fence watching me. It was tall had dark brown hair and it had a sloping forehead that looked like some kind of ape.I could not see the eyes because they were hooded. It was standing there just kind of rocking side to side. I can still see it plain as day in my mind right now as I write this. Anyway I backed into the house never taking my eyes off of it until I went inside. When I turned around it was gone.",
  "classification": "Class A",
  "county": "Charleston",
  "state": "South Carolina",
  "location": "-80.156,33.007",
  "location_details": "(EDITED) off of Hwy 78"
}