{
  "reportId": "3866",
  "title": "",
  "date": "",
  "observed": "It was the spring of 1994 I believe, probably April.  I was 15 years old.  The incident happened at my friends house in Girard, PA.  There was me and four of my friends.  It was the weekend and we were ready to camp out about a half a mile away from my friends house.  He lived at the end of a dead end road that ran right by Interstate 90.  Girard is about 15 - 20 minutes from the Ohio Border. We got all of our stuff back to camp and set up around 5 or 6pm.  Our camp site was at the bottom of a ravine with a small creek running through the middle of it.  It was right next to the highway but down a little bit.  The area was dense forest of deciduous mixed with pine. Around 12pm or so we split up into teams and started having a b-b gun war across the ravine from each other.  This was going on for probably about a half hour or so.  I was on the side of the ravine furthest from the highway with two of my friends, my other two friends were on the other side shooting at us.  Then I started to hear something moving through the woods behind us.  It was pretty loud movement with dead fallen branches snapping and twigs breaking.  I grew up out in the woods,and at the time was an avid hunter.  I have seen lots of deer and other native animals in the area and never heard such a ruckus.  Not even from humans before.  So the three of us sat there and listened for a while to this thing getting closer.  We were all a little nervous about what the hell this thing could be.  So when it continued we called a truce over to the other side and joined our other two friends on the bank next to the highway.  They said that they had been hearing the same noises and movement close to them. So with the five of us all huddled together with b-b guns aimed we waited for a little bit.  The noises started up again really close this time so we decided to shine our lights in the same direction on the count of three.  As soon as we turned on the lights the only thing I really saw or paid attention to were these very large green glowing eyes.  They were much bigger than a humans or a bear for that matter.  I took a couple of shots at this thing in reaction( I don't know what a b-b gun would have down but it was pure instinct).  When I got ahold of my self I realized that all of my friends were already over the fence and running down the middle of the highway.  I busted tail and caught up with them when we all stopped on the side of the higway in a ditch to rest for a second.  We were all questioning what each other saw and talking about what the hell this thing was when all of the sudden one of my friends looked up to the top of the hill that the highway fence was on and yelled wolf.  I looked up and saw this enormous outline of a body standing upright, and the biggest thing that stuck out in my mind was the size of the arms compared to the whole body.  The arms were hanging down past this creatures knees .  We got up and bolted down the rest of the highway until we reached the exit and proceeded to walk all the way down route 18 untill it hooked up with route 20.  This was no small jaunt, but we were all scared pretty severely. ",
  "classification": "Class B",
  "county": "Erie",
  "state": "Pennsylvania",
  "location_details": ""
}