{
  "reportId": "1451",
  "title": "",
  "date": "",
  "observed": "I was cutting through the College's small managed forest to get to work. It was early evening, but midwinter, so very dark. I was raised in upstate NY, and felt comfortable hiking in familiar woods alone at night, even though female, and I knew the trail well. It cut from the main campus near the track and ended in a small corn or wheat field bordering a quiet avenue about 40-60 acres away. The night was dark. There was no moon, yet my way was faintly lit by starlight, reflected on about 6 inches of old snow. About a third of the way through the woods I became aware of the sound of twigs breaking behind me and to my left about twenty yards or so. At first I thought it was a dog, or fox, because the animal was following me at a steady pace, but keeping really quiet, and off the trail just inside the cover of the trees. This made me uneasy because there had been reports of rabid \"coy-dogs\" in the area, so I quickened my pace a little, keeping track of the animal, expecting it would lose interest and meander off somewhere else in the woods. But it didn't. Instead, it seemed to quicken its pace, too, and its sounds became louder, like it was kicking up leaves and snow and breaking not twigs but branches. I thought: \"This is some weirdo stalking me!\" Yet, the \"weirdo\" still didn't show \"his\" face, but kept pace with me. My ears tried to place where it was in the black woods, but the lack of light meant I was restricted to sound only. I guess I was afraid to run from \"him\", fearing \"he\" would most certainly catch up with me, so I decided to pretend I was unaware. At this point, I had about one third of the trail left to cover, and my follower was keeping pace with me, walking like a fairly large person through the woods judging by the sounds I was hearing. \"His\" distance was approximately 15-20 feet away from me, but I still hadn't seen anything. Up until now I had just been looking out of the corners of my eyes, not willing I guess to turn my head for fear of what I might see. I admit it. And when I did turn my head, just slightly, as we kept walking together, what I saw really kind of changed my perception of reality. I saw a blocky, dark and very tall moving object working its way through the woods next to me. I could hear breathing. I could see it moving, but I could not tell what it was. I could feel my brain growing new dendrites trying to handle the reality of what I was seeing! It couldn't, though, not really. In my mind I was                thinking, \"Well, it's not human, so it must be some kind of spirit or something.\" I really did not know what it was, and until a few months ago when I discovered your pages I guess I would not admit to myself what I had experienced. But I revisited the experience recently, and let myself kind of relive it, and remembered it in full. I do not know if this \"being\" was a Bigfoot. There was no smell.  I did not see a face or arms. Only the bulky body and occasional shadows that looked like legs walking. I was too scared to look closely, really. We walked together the rest of the way through the woods, and I was the most scared when coming to the edge of the woods--I felt like if \"it\" was going to grab me it would be here. I was also scared of seeing \"it\" I think. So at the very edge of the woods, I bolted. I ran about 3/8 mile and my feet never touched the ground. I ran into the nearest fast food place and caught my breath.  Whatever was following me never came out of the woods, and I have never told anyone this story until now, because the idea of a 10 foot monster following you through the woods sounds like a kid's nightmare.",
  "classification": "Class A",
  "county": "Cortland",
  "state": "New York",
  "location_details": "Cortland, NY. In the experimental forest on the campus of SUNY College at Cortland."
}