{
  "reportId": "6304",
  "title": "",
  "date": "",
  "observed": "Hi, my name is Stacy G., and I want this sent to Richard directly, PLEASE, he has already visited me about a sighting that I had in 1997, same place in  Hesperia. Well, guess what Richard, he’s back!!!! I went to my mom’s house today and she said that her goose was dead. So, I went  out to look at it and it’s neck was broken in half, and it had visible punctures in the neck.  I can’t tell if it’s from fingers or teeth.  The goose was laid out perfectly flat with it’s back feet facing to the rear.  There’s no way it died like that, but looked as if it was laid out like that on purpose.  Then, in the middle of it’s back was a huge patch of plucked feathers about the size of a large fist, then in the middle of that was a hole about the size of a silver dollar, and there were no insides left in the bird!!! Outside on the ground were a few left over intestines, and two perfectly clean rib bones. I have never seen anything like this except the last time he was here. Now, not only that, but we have a perfect footprint with four toes.  Also, we found a spot in the weeds at the back of the property, where he laid down, and a path of smashed downed weeds, that look to be foot prints, that are about four to five feet a part!! I Need for you to call me ASAP so you can come out immediately to see this or if I can go ahead and bury the goose. I want you to see this.  Please call me ASAP! My phone number is xxx-xxx-xxxx, or xxx-xxx-xxxx which is my parents number, where this accrued.  Also, I know he is going to be back, because he also tried to rip the roof off of chicken coop!!!  Hope to hear from you tomorrow, Stacy G.",
  "classification": "Class B",
  "county": "San Bernardino",
  "state": "California",
  "location_details": "Near the Mojave River bed.  Because of the recent rain fall, we had water running in the river for about a month, and now there is lots of vegetation growing in the river bottom area."
}