{
  "reportId": "928",
  "title": "Hikers find tracks and a possible nest",
  "date": "1977-05-22",
  "observed": "We were hiking towards the west on a 45 degree slope of forest soil when we came upon four large prints. They ran from west to east towards the direction we had been coming from. Above the easternmost track there was a 5th print that was the best to view. These two prints had been created by a biped who put most of their weight on the lower down hill leg while placing only a small amount of weight on the uphill leg. As a result, the lower foot had slipped about 8 inches down the slope, tearing the slope to the wet clay beneath. The upper track was 16 inches long and over 4 inches wide. The track that had exposed the wet ground was less than 10 minutes old when we found it, since it dried before our eyes to form a dry crust. My husband, Mark tried to duplicate the track's depth and appearance by stomping his hiking boot into the ground. It required 5 such kicks. The main line of tracks were spaced at over 4 feet apart. When Mark tried to duplicate this same stride length, he fell because the slope was 45 degrees. Above the 5th track, there appeared to be toe-kick-in prints made as the subject turned to go directly up the slope. The tracks vanished in an area covered with deep pine needles. We followed the general direction of the prints uphill until we came to a large nest. The nest was next to a pine on the uphill side. It was about 3 to 3.5 feet high, made of pine needles and was shaped sort of like a volcano with a hole at the top. The hole was about 2 to 3 feet wide. We took pictures of the best track, and the nest. Over a decade later, we were watching a special about China on P.B.S. that showed what was supposed to be a nest of the Chinese version of Bigfoot. It looked just as ours had except the one in China was made of twigs. It appears that the subject was moving our direction, then stopped to view us. It then climbed up the slope towards the nest site for what ever reason. This occured at 10:00am-11:00am in May of 1977.",
  "classification": "Class B",
  "county": "Chelan",
  "state": "Washington",
  "location": "-120.6705,47.4644",
  "location_details": "Washington State; west of highway 97; up the Ingalls Creek Valley, on the south side of the valley; about 150 feet above the creek."
}