{
  "reportId": "1372",
  "title": "",
  "date": "",
  "observed": "After an unsuccessful days elk hunting trek of many miles around the heavy timbered area near the Rabbit Ears pass region, my Uncle Bill, Cousin Charles and myself, decided to call it a day and head back to our camp in the Walton Creek Campgrounds. About four miles south of our camp, as we were talking softly together while we walked, a loud crashing noise behind us came to our attention. My Uncle, an experienced hunter and woodsman of many years, replied that it sounded like we had spooked a large bull elk. Having accustomed ourselves to the area over the last few days, we knew that a deep canyon running through that location about 3 hundred yards in the direction the animal was moving would slow it down. Thinking that we could possibly get a fair shot as it crossed this canyon below us, the three of us started in pursuit. The animal was obviously spooked and running, as the sounds of its progress through the dense aspen trees and pines ahead, were easy to hear. After a laborious and exhausted chase through the heavy timber, the three of us broke out upon the canyons edge expecting to see the \"Bull Elk\" crossing the canyon bottom below us. The canyon in mention, runs in a south westerly direction, dry bottomed and is sparsely treed do to its steep sides. It is approx. a hundred yards deep, narrow sided, approx. 50 yards across the bottoms, with a heavy foliage of brush averaging 3 to 4 feet high. Trying to catch our breath, we were amazed that no elk was in sight below us running across the bottoms. After a few seconds I was alerted to the sound of rolling rocks across the canyon from me. As I looked up horizontally and directly across the canyon from me, I spotted what I at first believed to be a very large Black Bear running up the steep sided canyon. The opposite canyon rim was slightly higher than the side upon which we stood. The distance was approximately 200 yards. Startled, I called out to my companions attention the animals location, raising my rifle to view the animal through my rifle scope. After losing a second or two while I located the animal in my scope I was stunned. The creature was running up the steep hill on two feet. It was cover completely with what appeared to be matted, shaggy course black hair. The full back, shoulders, buttocks and legs were turned to me. The back of the head appeared to be hunched slightly foreword and without apparent neck visible. The back of the head was round skulled with no dome shape visible. Through the scope, I did not see the arms or hands, as they were directly in front of the creature and blocked from my view by its body. After later reflection, I believe the creature was using brush and limbs in its path to help pull itself up the incline. After approx. ten seconds the animal reached the top of the opposite canyon. Without pausing, I saw the creature turn slightly at the hips, presenting its right shoulder to me and peer sideways across at us as it disappeared through the trees. I clearly observed the facial features through the scope. The face was flat, small mouthed and thinned liped. The nose was flat with large nostril flares. The eyes appeared to be intelligent, what I would call a knowing look, black, slightly wide apart and set below a low brow ridge. The face seemed to be lighter in color, possibly tan or light brown and hairless with a leathery appearance. The sighting was of approx. ten seconds or less. After a moment of startled silence, the three of us compared notes about what we saw and discussed our options about what to do. All three us immediately decided against trying to follow it. One: It was late in the day and its trail ran in a direction away from our camp. Two: Even though all three of us were armed with high caliber rifles, none of us believed that we wanted to get too close to the animal. Three: As all three of us were experienced hunters, we knew that we could not shoot what ever it was in any case, as it was too close in resemblance to a human and we did not kill anything unless it was for food. However, we were excited about seeing a creature that none of us had ever seen before and decided to back track it towards our camp area in order to get a better idea about what we had seen. As the creatures trail was very easy to find due to torn brush and tree limbs in its passage, we followed it for about 3 miles to where it emerged out of the forest, crossing US Highway 40, where it continued back into the forest on the other side. Due to the lateness of the day and exhaustion we abandoned the trail and returned via the highway back to camp. Observations: It was apparent that we had startled the animal about 350 yards north of the canyon where we had skirted a wide patch of brush. We had passed within a few yards from this creature as our own tracks were clearly visible. After examining the area closely the following day it became obvious that animal had been taking its time wandering around through the thicket foraging for service berries, acorns from the scrub oak and wild currents. We believed the animal had become aware of our approach and had lain down in the brush waiting for us to pass, then in a state of panic had fled the area in great haste. All along the creatures path form this thicket to the canyon, brush and large tree branches had been disrupted by a great deal of mass and force. Judging from 3 to 4 inch thick tree limbs 7 to 8 feet above the ground, the creature stood apprx. 71/2 to 8 feet tall, which coincided with our judgment at the time of the sighting. The ground through out the area was covered in fall leaves and pine needles or else frozen and rock covered, leaving a poor surface for track impressions. However in several wash out areas the creature hand left a few clear enough scattered tracks for us to get a measurement. For the most part the animal appeared to have traveled in a wandering action, leaving tracks of 15 3/4 inches. From one impression it was discovered that the creature was missing the little toe from its left foot. It was judged by my uncle, an experienced game tracker of 40 years, that the creature had weighed upwards of 350 pounds. Once the creature had taken flight, it had traveled rapidly with over 7 foot strides, oblivious to obstructions, crashing directly through brush and trees. At one point the creature had hurtled a fallen tree about four feet off the ground, apparently without braking stride, leaving a deep impression in the torn soil upon landing on the other side. No hair strands or scat signs were found. Conclusion: The following day a report was made to a Colorado State and Game officer checking hunters in the area for licensees and game kills. The officer seemed skeptical at most and unwilling to check out the physical evidence. In his professional opinion it was only a bear and possibly a combination of hunting nerves. He also warned us about the use of alcohol while accompanied by fire arms. Needless to say we were offended by the way the report was received and by the accompanied remarks. In the final analysis the three witnesses concluded: A. The animal had definitely not been a bear or any other animal that they were familiar with. B. The creature stood approx. 71/2 to 8 feet tall and weighed in at approx. 350 pounds. C. The creature had been bipedal.",
  "classification": "Class A",
  "county": "Routt",
  "state": "Colorado",
  "location_details": "4 miles SW of Walton Creek Campgrounds, Routt National Forest, Gore Mtn. Range"
}