{
  "reportId": "5294",
  "title": "Forest Service employees see big footprints near Lake Isabella",
  "date": "2002-10-27",
  "observed": "I am a long term seasonal with the US Forest Service.  I do know the different tracks the wildlife leaves behind. What I and a co-worker saw was not a typical wildlife track. On this day, we decided to go to the Piute Mountain to cover illegal OHV trails.  As the day was going we covered 5 illegal trails around the Landers meadow area then decided to head for the Weldon and Woolstaff meadow area.  As we were heading towards the Weldon Meadow area a rancher stopped us to ask if we saw some of his cattle.  Are reply was \"No, if we see them we'll let you know.\"  Never found them.  At Weldon meadow we stopped for lunch and this was are next area to work.  During lunch, the co-worker went to do a little exploring.  After about 10 minutes the co-worker yelled to me to come and see and ID some wildlife tracks.  These were not wildlife tracks.  We saw what looked something like a human foot track but, it was way to big with a slight distortion in the toes.  The tracks measured about 16 inches long and 7 inches wide.  The tracks looked like the ones I saw last year at the Six Rivers National Forest.  I snapped a picture of the track and looked to see wher the tracks were going.  The tracks followed the barbed wire fence.  The meadow area is used for cattle grazing.  The co-worker asked me what it meant.  I said, \"It's possible that Bigfoot was looking for food or was heading for the spring at the end of the fence.\"  We then proceeded to do are work so that we could finish this area and head for the other area.  We finished and headed towards the Woolstaff Meadow Area.  Once down there we proceeded to do are job.  While working on the project, I spotted the same tracks that we saw earlier.  The tracks cut across the trail and headed towards some rock outcroppings.  This was enough to spook my co-worker and so we left the area.  Back at the office the co-worker told what we saw and was laughed at.  I didn't tell them that I snapped pictures of the tracks.  I too would have been laugh at.",
  "classification": "Class B",
  "county": "Kern",
  "state": "California",
  "location": "-118.3356,35.51222",
  "location_details": "From Lake Isabella - head east on hwy 178 to Kelso Valley Rd.  On Kelso Valley Rd - travel 17 miles to a dirt on the right hand side.  There you should see a small wood sign saying \"Claraville 10 miles, Landers 8 Miles\" etc., etc.  Take the dirt road (27S02) past Claraville and go another 2 miles to French Meadows (28S27).  Follow the road to a sign pointing to Weldon Meadow or Steve Springs.  First site is Weldon Meadows (28S27A).  After that go down towards Steve Springs (28S27 then to 28S25 then to 28S24).  Go past Steve Springs and head to Woolstaff Meadow (28S24 - Lowest gear or 4 WD - not for low riding vehicles).  When you come to a split in the road - take the left road. Follow the road for about a 1.5 mile +/- (You'll pass the Dry Meadow Trailhead).  At the end of the road, you'll walk up a south facing slope for about a 1/4 mile +/- (this is the second site)."
}