{
  "reportId": "398",
  "title": "Woman and friend drive past amazing animal on Georgia backroad",
  "date": "2005-01-31",
  "observed": "It had to be July of 96, on a Sunday. It was the month of the \"blue moon\". Myself, a friend and my 17 year old son was going fishing at yellow jacket creek in West Point Georgia. I felt we needed to cut our all night fishing trip short, it was an urgent feeling I had, and knew we had to go. We were leaving the park about 12:00-1:00 A.M. There wasn't any lights on the long road and we were the only ones out that time of night. We were in a Mitsubishi truck pulling a med size boat, needless to say, we couldn't go too fast. I'd say about 20 to 25 miles and hour at best. My friend and I saw something in the headlights and shouted \"a deer!\" At first Bud (my friend) thought it was a deer,  but I could tell it was much bigger and was slowing down to get a better look. He was approx. 8 feet tall and was about the color of a deer. He was walking upright with long strides, his arms hung down to his knees, and his head was extremely large. It looked to me like his head was bigger than it should have been. He had sharp pointy features and darker hair was on the top of his head and down the back of his neck, spreading across his shoulders to about the shoulder blades and fading out. The rest of his hair was lighter in color and was close to the skin, like a deer. He walked on the right side of the road and as we approched, he veered off the shoulder of the road and eased off in the ditch, where he reached up and grabbed a mimosa tree limb, pulled it down as if to hide his face from us. We both could see him from his shoulders down. I seen his ribs, the muscles in his hips and thighs, and legs, and partly his back. That's when I seen the hair fade into short close hair. I remember in detail, his face was distorted almost, and darker. The cheek bones were almost spikey, (for lack of a better word). Bud and I don't hate each other, but we are not the best of friends but he will verify everything, and, no, we were not drinking or doing drugs of any kind. It was a Sunday, and it was a full moon, the month of a blue moon. Bud said it had to be a werewolf for the longest, till I said it had to be bigfoot.",
  "classification": "Class A",
  "county": "Heard",
  "state": "Georgia",
  "location": "-85.12705,33.26885",
  "location_details": "Yellow Jacket Creek..... there is a little store at the entrance and it is about 1 to 2 miles to the lake... Bud could tell you more about the road numbers and names.  I can get Bud's phone number for you to talk to him. You can call me if you'd like. Just let me know. I have tried off and on for the last few years to get some one and tell them what we saw, with no luck.  I tried to call a 1-800 # and it was no longer in service and had to let it go. But it DID happen and I know what I saw. There is also an elderly man in Tucker Ga. who as a young adult was hunting around Yellow Jacket Creek and he made his sister bring him to me, an hour's ride, so we could talk about it. Said no one belived him and he was afraid to tell it. As we talked he started to cry. He had to be 80 at this time but said he remembered it in detail and was so glad that someone else had seen it, that he KNEW he wasn't crazy. This stays on my mind and I hope to hear from someone. Thank you."
}