{
  "reportId": "36076",
  "title": "",
  "date": "",
  "observed": "I was among a group that spent the summer and fall on the side of mountain several thousand feet up opening old gold mines closed down due to WWII. Phone reception was poor, and I was asked by Steve to run him up to the top switchback to make a phone call.  It was sunset, I ran him up the fairly short distance to the highest switchback and turned off the ATV, walking a hundred yards or so to give him privacy. It started getting dark (it gets dark and cold that high up real fast) and I began meandering back to hopefully hurry him up. As I approached a cluster of trees right up against the switchback on the uphill side, there was the deepest growl I've ever heard - in a warning manner.  At first I thought it was a cat, but it was much deeper in resonance. Thinking this would be a short trip, I left my rifle and shotgun at camp, and only had my 1911 sidearm on me, and I wasted no time in shucking it. I was fearful for Steve, as this thing was between me and Steve who was unaware of any threat, so I slid-walked toward Steve, both arms extended at ready-fire.  I peered as closely as I could, but could see nothing due to the tree cluster and twilight. As I finally slid-walked past the cluster and was now between the previously unaware Steve, I chanced a quick look over my right shoulder to see if Steve had noted anything yet.  He had, and had also shucked his pistol, with the phone in the other hand, clearly getting off. As my head was turning back toward the low growling in the tree cluster, halfway, I was stunned to see an absolutely massive, huge, very tall creature hurrying toward the tree cluster. It actually had to slide past me to get to the cluster, so it wasn't threatening me.  It reached the cluster and I heard no further noise, steadily backing up. Had there been a cat in those trees, there surely would have been quite a ruckus, but things went silent.  I recall very clearly being not stunned by its size, but how fast it was and how quickly it covered ground.  I remember thinking, 'this thing could run down a deer.' From Steve's angle, he couldn't see it, but the thing had to run across some thirty yards of knee high (to me) growth, so I got a good look at this thing. I reached the ATV and said, \"we're leaving.\" In retrospect, after replaying this a hundred times again and again, I feel that there was either a female or juvenile in the trees, and was surprised when I approached, and growled to warn me off. This is entirely speculative, but I feel confident that the huge adult was hustling over to the tree cluster to tell the other one to 'knock it off.' The .45ACP is a very effective anti-personnel round up close.  However, when I saw the sheer mass, if this thing wanted me dead, as big and as fast as he was, he'd have had me. Steve found another location to make phone calls after that which was much closer to the camp.  Two weeks later, he came fogging it back to camp running - as he heard loud thumping steps and turned to see one running away - up the mountain. We stayed another few weeks, but I didn't get a lot of sleep.",
  "classification": "Class A",
  "county": "Baker",
  "state": "Oregon",
  "location_details": "Elevation 7821'"
}