{
  "reportId": "5123",
  "title": "Loud calls, rock/boulder throwing disturbs campers",
  "date": "2004-11-19",
  "observed": "Overview: Dates - Oct. 17 -20, 2002 Location - Douglas County, MO near Dora, MO - Mark Twain National Forest Campground off CC Highway, North Fork, Campsite #20 (Pine loop). Evidence - Loud calls, rock/boulder throwing, footprints, displaced log in middle of lower trail, multiple incidents. Witnesses - Myself and camping partner, Carl. No other campers were in the entire park on 10/17/02. Incident #1 10/17/02 approx 7:30-8:00 PM After eating dinner my camping partner and I were sitting in front of the large camp fire facing the stream (North Fork of the White river). It was an extremely quiet night. No crickets, or locusts or frogs/toads could be heard at all. It was very quite. We were talking and listening to music. Over the music I heard an animalistic sounding call out of my right ear. I heard it twice before I asked Carl if he heard it. To me it sounded about 150 - 200 yards away, upstream and on the opposite side of the stream up on the bluffs over looking the stream. He said, \"I hear something\". I jumped up and turned off the music. Immediately after turning off the music we both heard a similar call from downstream approximately 50-100 yards away. It sounded as though it was coming from the upper path running parallel to the stream. The campsite (#20 - Pine Loop) was unique as it was created in the middle of the upper trail. In other words, someone walking the trail would actually walk right in the middle of the campsite. The call was very unusual. It sounded initially somewhat canine. When I first heard the second call I was unsure of my original impression of the first call coming from upstream. Carl and I are both avid outdoor/camping enthusiasts. Carl 50-60 years old and has been an outdoorsman most of his life. I am 30-40 years old and have been camping many times as a child, with Carl twice per year for the last 10 years, and with my own family. We have both heard many identifiable animal calls while in the forest. This was an animal call that was unlike anything we had ever heard, or seen on any documentary or while camping. To describe the sound this animal made is difficult. It began the call as a canine type \"howl\" followed by a \"whoop\" or \"bark\" repeated several times. This was NOT a coyote or wolf. The pitch was much deeper and tonal quality gave the impression of something larger than a coyote or wolf. The animal made 2-3 of these \"howl/whoops\" and then was silent. During the silence Carl and I speculated as to the source. We immediately ruled out coyote and wolf as we had both heard those animals in the past. We heard no movement of the animal during the silence - but we were talking/whispering to each other and could have missed any movement sounds. 30-45 seconds after the downstream calls, what we believed to be the same animal let out a call the truly defies description. The animal was now almost directly in front of us if not slightly downstream. The sound appeared to come from the lower path running parallel to the stream just in front of us. This would make the animal approx 35 yards away between the campsite and the stream. The call was another \"howl/whoop\" combination repeated 2-3 times. It was so loud that the echo from behind me was almost equal to the original sound in volume. It was a \"blood curdling\" call. Clearly the animal was either posturing or warning us. I felt the call was directed specifically to us. The call was almost human - but would have had to be a very large tall human. The depth and volume of the call indicated to me an animal of a minimum of 150 - 200 pounds. For the first time in my 38 years, an animal call triggered my \"fight or flight response\". I immediately picked up a large knife and felt an almost over-whelming urge to loudly scream back into the darkness and to rush toward the sound. My adrenaline was pumping. I said to Carl that I felt the sound resembled a large human imitating a wolf. That the call was very \"exaggerated\" and was clearly meant to scare us. We speculated that someone might be playing a hoax on us. Carl responded that he felt this was a close description of the sound. Just as he said those words, not more than 5 seconds after the end of the loud call in front of us, we heard a second animal make the SAME call from 150 yeards or so UPSTREAM. When we heard the second animal make an identical call, we knew we were not dealing with a human prank. I am a musician. The second animal was not a human being. The second animal's tonal characteristics and depth matched the first animals almost identically. We humans have such different voices. I would have been able to differentiate the two human voices from each other if it was a prank. When we heard the second animal we knew we were hearing something neither of us could explain. It was NOT human, it was NOT a coyote or wolf, it could not be explained. The second animal seemed to be giving it's location to the first. The first animal seemed \"male\" or parental. The second animal seemed \"female\". Within 30 seconds, The first animal seemed to have moved from in front of us and was now approx 75 -100 yards upstream and on the opposite bank where it met up with the second animal. Both animals then gave 2-3 howling/whoops. Immediately following both animals began a series of completely different sounds. These were very spooky sounding. The sounds were very fast, gutteral and rising and falling in pitch. It sounded like a language to me. It sounded as though they were having a very emotional verbal argument. It was almost like a cross between a gorilla's grunt and a witch's cackle. Then it sounded as if both animals ran further up stream and over the bluff. The enitre series of calls lasted approximately 5-7 minutes. Incident #2 10/17/02 approx 9:45 -10:00 PM. I had gone into the tent to sleep at approx 9:30. Carl followed a little later - approx 10-15 minutes. Immediately after Carl entered the tent we heard one animal make the same \"howl/whoop\" combination 2-3 times and then silence. It appeared to come from the upstream direction about 100-150 yards away. Incident #3 10/18/02 appox 02:00 AM I was awakened by a very loud crashing sound. I heard the sound 2-3 times before I woke Carl up. The sound appeared to some from slightly upstream - maybe 20 yeards or less. The sound was VERY loud. It sounded as if very LARGE (minimum of 20 pound - possibly 100 pound or greater) boulders were being purposely thrown in the stream. The boulders were so large that the sound had to parts. The first was the object hitting the water, the second was the object hitting the river bed itself. It was a \"Splat-boom Boom\" cannon type sound. Carl had been snoring loudly (as do I) prior to waking up. This sound happened at least 12 times over a 5 minute period. I stated to Carl - \"This shows intelligence and strength\". I believe it was still trying to scare us off. Immediately after the last boulder impact we heard one of two animals make a very brief \"howl/whoop\" (1-2 times). It was as if the animal wanted to place his signature on the boulder throwing. Incident #4 10/18/02 While exploring the lower path 20 yards from our campsite, Carl discovered a large log blocking the path. This water soaked log was completely out of place. It did not come from any surrounding trees. When I attempted to pick it up it crumbled in my grasp. We did not see the log on the path on 10/17/02 - however it was dark and we could have missed it. It appeared to also be a \"message\" - as though something wanted to block our path downstream. Incident #5 10/19/02 10:00 AM While walking on the upper path downstream approx 40-75 yards from our campsite, Carl and I found 2 foot prints. They were approx 14 inches in length. The heel and ball of the print appeared very human like - very similar to \"Big Foot\" prints and casts I have seen in various medias. However, the toes were very different. The clearest print showed this to be a THREE-TOED Creature. I am NOT CRAZY. I could not believe only three toes. The toes were very human if not \"pod-like\" in appearance. We took several pictures of the clearest print. We did not have the materials to make a cast. Carl felt the print might not even lend itself to casting. We did get several pictures of the prints. We could not identify any other charateristics from the prints. I will say this - as with the loudest call from directly in front of us - I believe whatever made these prints is very large. A minimum of 6.5 feet tall and 250 pounds. More likely my \"instincts\" tell me it is 7-8 foot tall and 350-500 pounds. It appeared from the angle of the prints that the animal came down the trail and was alarmed/suprised/angry to see our camp blocking the middle of the trail. The trail was hard packed and yielded no prints. The prints found were just off the side of the trail and in very soft and somewhat wet soil.  Incident #6 Unlike the evening of 10/17/02. The evening of 10/18 and 10/19 brought scattered rain showers. Depsite the rain, the forest was NOT eerily quiet as it was on 10/17. Crickets, frogs, etc. were very loud on 10/18 and 10/19. Strange!",
  "classification": "Class B",
  "county": "Douglas",
  "state": "Missouri",
  "location": "-92.1527,36.7548",
  "location_details": "Mark Twain National Forest Campground along the North Fork in the Devil's Backbone recreation area just outside Dora, MO in Douglas County off route CC. Campite #20 in the \"Pine\" Loop."
}