{
  "reportId": "21659",
  "title": "",
  "date": "",
  "observed": "in july of 2005 my friends and I were staying at the caravel hotel in chelan. We were staying with a friend and his family. After the few days were up, my friend and I decided to stay another day and sleep in the car that night. That night we drove to the top of a hill through some pretty thick woods on some really unkept dirt road until we reached a small clearing. We hung out for a while sitting on the hood of the car smoking cigarettes and watching shooting stars, looking for UFO's, and listening to animal noises. We'd often hear something then speculate what it was. Then all of the sudden we heard a very loud raspy scream/roar. I immediatley expected it was a cougar but about 1 second after the screech we heard 3 deep thuds in the earth as if someone was slamming a huge tree trunk against the ground. the thuds had an even rythem like someone knocking on a door. These thuds were immediatley followed by another scream and 3 more thuds, then a 3rd scream and 3 more thuds again. after the 2nd scream we immediatly started scrambling to get into the car. We sat in the car silently, listening for quite a while. Then began speculating what it could have been. I am extremely skeptical by nature and did not allow myself to seriously consider the possibility that the animals was a sasquatch or bigfoot or some other unexplained creature even though i could not explain to myself what could have caused the scream in conjunction with the loud thumps. Trying to seem level-headed and unafraid, I just decided to go to sleep. An hour or 2 later I was awakened by my friend who seemed to be panicking a little bit. He told me he heard another sound and that we had to go. As we were driving he explained that he had to piss really bad for a while but didnt want to go outside the car. Evetually, he just decided to get out but was startled by a rustling in the bushes nearby (this time to the right of the car) and another scream (i'm not totally sure he actually heard another scream). we then drove all the way back down at 3 or so in the morning and slept parked on the side of the road. I'm aware that animals can make some pretty weird noises at night but this was just insane. the thuds were the most confusing part though. Unless maybe a 10 foot tall grizzly bear was slamming a tree against the ground? It sounded fairly diliberate, as if warning us. It couldve been a human just messing with us but we were far from houses or any good reason to be in the woods. I also really doubt a human couldve made the screaching noise because it was extremely loud and primal sounding. I never thought about reporting it because it just doesnt seem possible and i figured there HAD to be a logical explanation.  -Chase S.",
  "classification": "Class B",
  "county": "Chelan",
  "state": "Washington",
  "location_details": "it was up a dirt road that wound up hillsides into woods. very close to downtown chelan."
}