{
  "reportId": "2915",
  "title": "Campers hear unfamiliar vocalizations at night in the Everglades",
  "date": "2001-03-01",
  "observed": "In march of 2001 There was about 5-7 guys on a camping& fishing trip in the everglades national park.We were camping at a romote campsite in the park called the \"Watson Place\" on the chatham river. The campsite is about 3-4 miles up river from the mouth that meets the gulf. The campsite is on an old shell mound that the indians used to call\" Bad Land\".The site is only accessed by boat and it takes about an hour to get to the site from the nearest ramp in chokoloskee. The national park butts up to Big Cypress Preserve. The weather was dry & cool. One of the nights five of the guys decided to do some night fishing in the backbays of the everglades,They left the camp and you could hear their motors running for miles back in the bays. They had been gone since about 2- hours when the other person at the camp turned in for the night. I was fishing off the bank relaxing & waiting for the guys to get back.It had been about an hour since the other person turned in.It was around 11:30 at night when I heard the most piercing scream I have ever heard in my life!.....It made the hair on the back of my neck stand up stand up!!! I have heard panthers scream and bobcats and this was a more high pitched sound!I was turning all the lamps on in camp whem about 30 seconds after the first scream, I heard a second. same exact sound. I estimated the sounds to be about 75-100 yards. I thought to myself \" this cannot be a person, I would have heard their boat coming from miles away and the island is filled with razor sharp mangroves with oysters & barnicles all along the banks\"The only place to get off is the campsite. I did not hear anymore screams that night! About 20-30 minutes later I heard my buddy,s motors coming in the distance. When they got to camp I told them about what I heard and not one of them laughed or did not take me seriously. The landscape is Mangrove islands with lots of shallow bays.Florida has been in a drought for years and the everglades have been real dry in the interior.",
  "classification": "Class B",
  "county": "Collier",
  "state": "Florida",
  "location": "-81.3142,25.84875",
  "location_details": "The national park service will give you information to the watson place."
}