{
  "reportId": "24544",
  "title": "Motorist has a nighttime sighting near Karnak.",
  "date": "1999-10-02",
  "observed": "I was driving back to my home at night.  It was 1999.  Not sure what day of the week, but it was a week day.  I was driving at night back from a friend's house in a town close by.  At the time I resided in a small village in IL named Karnak pop only about 650.  I was driving back from another small village named Grand Chain.  I decided to take the \"back roads\" that night like I almost did every night.  It was around 11 PM.  It was fall, because I had my windows down, all four of them in my four door Corsica.  The road I was driving on was a red gravel road, (not sure if it still is, a lot of the roads in that area are paved now.) so I was taking my time and watching for deer who infest the area.  I have hit deer before, so I was being very very watchful of animals along the road, and I estimate my speed was around 20-25 MPH.  I went up a small hill that had a long but even plane.  As I started going down the hill I noticed eyes off to the side of the road.  I know most reports I have seen do not describe \"bigfoot\" with \"glowing animal eyes\" but this did and they were very bright.  I started slowing down but didn't slam the brakes because it was still many feet away, and I knew I had more than enough time to slow down my car.  As I crept closer I could tell the thing I was seeing off to the side was much, much taller than a deer.  I felt a wierd sense and panic come over me so I started rolling up all the windows in my car and locked my doors.  As I started to get even closer the creature started to make its way across the road.  I have never seen anything close to it, or have I felt as much terror as I at that moment.  It made its way and stepped onto the road about 20 feet away from my car, (by this time at stop).  This was not a slow or quick glimpse.  It walked across the road and turned and looked at me.  I would have to estimate it was 7 feet or more tall.  Very heavy build.  It had hair covering the body, but not matted or curly like you see in shows or movies.  The hair was long, almost like it was combed and took care of.  The eyes like I said before glowed in my headlights.  I realize most reports do not have this feature, but I watched the creature up close with bright lights on.  As it turned and looked at me it stopped walking and stared for a good two or three seconds.  I didn't know what to do.  I knew if I floored the gas and hit the creature it would wreck the car, it was massive.  I had the STRONG feeling and presence of the creature.  It may have been because it was all so shocking and frighting, I wont rule that out, but at the same time it was a wierd sense it was making me feel.  It started walking (on two legs) and crossed the road.  I have read reports of sightings were people smell a strong smell, but I NEVER smelled anything at all.  My windows were rolled down to start with, and nothing strange was going on at all.  I think what I saw was a \"bigfoot\" even though the eyes, hair, and smell parts don't match other people's stories.",
  "classification": "Class A",
  "county": "Pulaski",
  "state": "Illinois",
  "location": "-88.9963,37.289",
  "location_details": "Two or three miles just outside of Karnak.  I don't know the name of the road.  I think its called Hillcrest RD, turns into 6th street once you get into town."
}