{
  "reportId": "16994",
  "title": "Daylight sighting by fisherman at Lake Chopaka",
  "date": "2007-05-23",
  "observed": "My father, grandfather, and myself were on a fishing vacation that spanned many areas in the northern part of the state of Washington.  One of our pit stops was at one of our favorite lakes, Lake Chopaka where the trout are huge, hungery, and numerous.  I was out on the lake with a tired arm and a grumble in my belly so I slowly headed toward camp. I arrived at camp and fixed myself a sandwich, the time is around noon.  As I sat and ate my sandwich I scanned the lake to figure out where I would fit amongst the other anglers when I returned to the water.  About halfway through my scan, my eyes stopped on what I thought was a guy trying to get cell phone service (yes the giant phones of 1996 did kinda work at the top of the small hill) on a little hill directly across from the boat launch.  Upon further examination I thought it was odd that the person was wearing a fur coat.  At this point I went into the camper to get some binoculars so I could get a better look at the \"bear\".  Upon even further examination, this time at 12x zoom I thought it was odd that the bear had really long arms, walked on two legs just as easy or more so than myself, and had a relatively short head with ape like features for a face.  I watched for probably five minutes or so as the creature lurked around the tree line at the top of the hill, and just like that it stepped over a fallen tree and disapeared into the shadows of the trees.  Confused and thinking myself delirious from the ravenous hunger developed from a long morning of hauling in heavy trout, I placed the sighting in the back of my mind. Out on the lake again, I was prepared just incase the \"ape bear cell phone guy\" showed it's self again.  Sure enough at about 1300 (1:00pm) or so movement caught my eye near a copse of trees by a rockslide on the bigger hill across the lake.  I gave it a good look at 12x and sure enough it was the same thing I saw about an hour before.  And after about 2 minutes it disapeared from view into the copse of trees it was lurking near.  My dad asked me what I was looking at and I told him \"Sasquatch\" and he gave me a head shake and said I was crazy.  So here I am now writing to you, the only people I have told this story to other than my dad, about the 6.5' to 7' tall, dark reddish brown fur covered, bipedal, short headed, ape faced, no necked, long armed, NOT A BEAR!,  sneaky creature that I saw at Lake Chopaka on 23rd, May 1996 at or around noon and again around an hour later.",
  "classification": "Class A",
  "county": "Okanogan",
  "state": "Washington",
  "location": "-119.7085,48.9588",
  "location_details": "From Loomis head north on Loomis-Oroville Rd. turn west onto Toats Coulee Rd. follow around until road heads south, turn heading west onto Chopaka Mt. Rd. and follow it in a north westerly fashion up the hill until it forks at Chopaka Lake Rd. and follow it until it dead ends at the DNR camp area at Chopaka Lake. First sighting the creature was around: 48 54' 53.31\" N  119 41' 42.42\" W Second sighting was around: 48 54' 48.08\" N  119 41' 26.34\" W"
}