{
  "reportId": "9368",
  "title": "Photographer hears early morning vocalizations near Lake Oroville",
  "date": "2004-09-21",
  "observed": "In the early morning hours of Tuesday, September 21, 2004, I drove towards Lake Oroville (approx. 25 miles from my house) to see if I could get any photographs of the lights of the Valley before sunrise. As I drove, I stopped a couple of times to take photos. It was extremely dark at the time, since the sun was not yet up and the area is against the mountain side to the North and North East sides. I turned my truck around stopped with my truck pointing toward the South West looking out over the Valley. My passenger side window was rolled all the way up but the driver side window was down. I had only been sitting there a couple of minutes when I heard a loud, very angry sounding \"roar\" coming very rapidly toward the back of my truck on the passenger side. I was quite startled (to say the least.. I think I might have screamed) and immediately looked back toward the direction of the sound but could not see anything but blackness. I then threw my truck into gear and took off rolling up my window as quickly as possible. It has been less then 48 hours since the incident happened and I am still very upset and more then a little traumatized. What frightened me the most was that the sound came from above the height of the cab of my truck and nowhere near the ground. It began behind me near the far edge of the road and lasted about three to four seconds then ended abruptly right at the back of my truck near the tail light on the passenger side. I could tell that whatever was making the sound was approaching very quickly. The sound was quite loud and very angry sounding and can only be described as a cross between a lion's roar and the sound a tire makes spinning in deep gravel. I have never heard anything that sounded like it before in my life. I do not know whether it was a bigfoot or not, but if it was a bear it had to be standing upright and at least 7 feet tall. I have since found out that the only bears in that area are small black bears that are not aggressive. I am a 44 year old mother of four and Grandmother of two. I will glady agree to take a polygraph test to confirm what happend to me.",
  "classification": "Class B",
  "county": "Butte",
  "state": "California",
  "location": "-121.5027,39.55249",
  "location_details": "Take Hwy 70 North from Marysville, CA approx. 30 miles to Oroville. Take the Oro-Dam Blvd. exit East through Oroville and follow the signs to Lake Oroville."
}