{
  "reportId": "29612",
  "title": "Vocalizations recorded and possible footprint found near Sugar Creek.",
  "date": "2011-06-23",
  "observed": "I was just outside and my 3 yearold lab was spooked by somethig like I've never seen. Barking--in a fear sound-- and running in circles! Wind is in the west and that is the direction of her concern. Only other time I've seen this was 2 years ago when she was spooked smelling the air. I could smell it too. It was like the worst locker room smell mixed with road kill. It took her 3-4 days to settle down. Tom The witness first contacted the BFRO with this report on June 23, 2011. On July 19, 2011, I met with him at his house. I interviewed the witness that day and had him explain what types of things he had been experiencing. Since then, this location has been the site of an on-going investigation with a long-term audio recorder left in the woods near his house. I interviewed the witness again in late October 2011, and the content of the two interviews follows: The first name of the witness has been changed. Stan - When was the first time something happened that you didn’t understand. Tom – It was a year ago, so it was probably early June of 2010. It was a Saturday, a friend had stopped by. When I am outside my dog Lulu roams the property, sometimes she will go back into the tree-line but she usually stays close to me. At one o’clock in the afternoon we were in the shop talking and doing stuff. When he was getting ready to leave I called for her. She was real nervous, her tail was tucked. There was a light breeze from the south and she was facing towards the south and acting very unusual. Tom - I figured it was a deer, a coyote, something back there. I walked back a little ways and she wouldn’t move, she just stayed here by the side door, very nervous. I finally said, let’s go in. My friend had left. I opened the door and had to raise my voice to get her to come in, which was unusual because she always wants to stay right near me. So I raised my voice and she came in and she ran straight down the steps into the basement and hid. I first thought when she went down that she was looking for a toy or something. After ten minutes I went down and found her, she was hiding behind the furniture in an unused room, cowering, and I reached down and she wouldn’t come to me. I reached down to touch her and she was shaking. Tom - I made her come back up for awhile and then we went back outside and repeated the same thing five or six times to about  8 o’clock that night. We had Lady Asian bugs and I am apparently sinus sensitive to them and that night around 9 o’clock I got my sinuses cleared up and we stepped out that side door, still had a breeze from the south, and she instantly panicked and went into that cowering motion, still shaking and standing low, not up like a dog does. Tom - I stood there and thought about it for a little bit and got a good whiff of it. The best description I have is that it was like the worst locker room stench or sweaty clothes that sat in a hamper for two weeks mixed with maybe road kill, bloody violent. It stood the hair up on my back. I sat back and thought wow, the trees are two hundred feet away, what is back there that smells so bad. And at the time she laid down in the yard, facing the south and was real nervous. She would look over her should behind her and then she would get up and face the other way because the wind currents were changing and she kept doing that. So we went back in for the night. Tom - Next morning I got up and went to church and breakfast, came home, got dressed and walked back in there. She walked with for a ways and then she turned and ran back up here to the house. Tom – From that time on there have been few deer and coyotes around. Prior to that I could see deer most every morning out back or down the roads. I think I have only seen one deer on my property in a year. Last night was the second time I’ve heard coyotes in a year. And usually if I grilled chicken out they would be howling, they would smell it and they’d be singing. Stan – After that initial time did you smell it again last year? Tom – I never noticed it again. About a week before, my nephew called and said there are footprints in a subdivision south of Chatham. I said that bugs me because a few days ago she (Lulu) was out back behind the brown shed barking in defense and I stepped out to see what she was doing. She had her nose up, she was following the wind currents I think, because she was running in circles, tail was tucked and she was real nervous. And I called her and she looked towards me, like she was ready to come to me and then she would jump like something spooked her, an animal, like you through a rock at her.  She did that for a couple of days when we were out. It was in the west that time and she was facing west. Stan – Have you ever felt like you were being watched? Tom –  Yes, just about every time I see her doing something like that, a few times I’ve been outside, I get that feeling. Stan – Have you ever had anything thrown at you, like rocks or anything. Tom – No. Stan – What about sounds? Tom – Last night, it was probably after 10, I think it was 10:30 or so I had been watching TV and I noticed she was restless in the house. I asked her once “Do you have to go potty?” Usually she would come up to me and she would give me a “Ruff” and we would go. She wouldn’t do that last night, she just looked at me like “keep guessing”. About 10:30 I said “Come on let’s go potty and then we’ll go to bed. We stepped outside and she immediately faced south and froze and I got the feeling while she was doing that that somebody was starring at me. Tom – So I stepped back in, grabbed my cellphone and my big spotlight and she was still outside. I stepped outside and started walking south towards the treeline, but she stayed right by that door. Now normally a dog will follow its master, and I got about half way between the pool and the treeline and stopped and stood there a little bit. And I could hear (it was real quiet you could hear crickets) stomp, stomp, stomp, stomp. My hair stood up, I thought “What in the world is walking in twigs and branches?” And I said “Who’s there?” and I stopped, and I’m thinking “a couple of my friends know and are they pulling a prank?” And then I think I said it again “Who’s there?” like that. Tom – And I waited and there was a “Whoo-oo” sound like that came back at me, probably not that loud because it knew I could hear it whatever it was. Right after that, west of here, and I would say a good half mile coyotes started screaming and yelling. Now, I don’t need to be out here alone, I don’t have a gun, I don’t have a knife. My dog was spooked, she was staying up at the house. So, I came back in, started turning the light off, fifteen, twenty minutes passed. Tom – I have a little sound amplifier and headset and you can adjust the volume. I went quietly out onto the deck, left her inside, and I sat for fifteen or twenty minutes listening. I could hear some footsteps same interval steps that was west of me now back in the trees. I said “There is something back there, but I’m not going to go look after dark not when it’s something powerful. Tom – Anyway when I came in from that I went to check email and Facebook was up with the link for Chatham for the story they just published in the paper about footprints and Messing With Sasquatch. Stan – So did you hear any other vocals. Tom – After I heard the footsteps and I called out and it made the sound back I started walking back up to the house. I heard what sounded like children playing and they weren’t very far away, like a couple of little girls giggling or talking. Now there are no kids back there, I know there can’t be. The next house is a half mile down the road or so. My dog Lu, started out to me and I said “Who is that?” and she froze and came right back to the house when she heard it again. Stan – So it sounded like kids playing? Tom – Like little girls talking or playing. Stan – No crying, more as a conversation? Tom – I don’t know how I would describe it, it wasn’t understandable, it wasn’t “I want that toy.” It was a whining, high pitched voice like a little girls would be. Stan – Thank you for allowing me to interview you Tom. Tom – You are welcome Stan. On Sunday, October 23, 2011, the witness had an unusual experience at his home and the next morning found a large footprint outside his living room window. He took pictures with a tape measure along the footprint. Tom was also able to see all the toes in the loose dirt. But it's always difficult for photographs of footprints to show very much detail. My interview with Tom concerning this incident follows: Tom – I have an L-shaped couch and I am sitting on one end of it, the other end is under a window, and that window is on the east side of my house. We are watching the World Series, it was probably around 9:30 and Lulu, my dog, raised her head and then looked at me with big eyes like “Did you hear that?” And then she turns and looks at the window and I go “Yeah, I heard it.” And I said “Go ahead and get down.” So she got down, came out on the floor and laid down so she could watch the window. Tom – And we heard the noise several more times, and she got up wandered around the house and smelled floor, and walls and was just nervous. Tom – Then the next morning we went outside and there was a footprint out there. Now let me back up a little bit, Friday I pulled some rose bushes and raked the landscaping right there next to the house, so it was all fresh. So, that footprint happened I believe Sunday night. Now this scenario where she is on the couch and we hear this noise, this has happened seven or eight different times this summer. Stan – Can you describe the sound. Tom – It just sounds like a creak, like somebody is leaning against the wall on the outside. And I’ve got vertical blinds and they’re turned to block the light where I am sitting but when you are outside you can look and see the TV if you are tall. I can’t see the TV when I am outside. I am six foot tall. So for someone to look in that window has to be more than six foot tall. Right footprint found the 24th of October 2011 showing a length of 14 inches. Stan – I know you had a ruler next to the footprint, how long did you think it was? Tom – It is 14 inches long. Stan – And the width was? Tom – 7 inches wide. And the footprint is curved, it almost looks like a broken foot or something, I don’t know how to describe it, but it’s not straight like ours. Where ours has an arch this looks like the footprint is curved. Stan – Thank you for allowing me to interview you Tom. Tom – You are welcome Stan. Right footprint found the 24th of October 2011 showing a width of 7 inches.",
  "classification": "Class B",
  "county": "Sangamon",
  "state": "Illinois",
  "location": "-89.66525,39.6395",
  "location_details": "The Sugar Creek Covered Bridge area is about a mile northwest of Glenarm."
}