{
  "reportId": "1690",
  "title": "Hunters hear unusual animal stalking them at night.",
  "date": "1996-11-01",
  "observed": "I will begin by saying that I am an avid extreme hunter and outdoorsman as is my companion on this trip.  We have hunted together for many years through all sorts of terrain and conditions, and have developed a certain uncanny sense for each other and the mountain. Normally I would not entertain writing this, but I have again been awaken by the re-occuring dream/nightmare of this mis-adventure.  The incident began after some brutal unsuccessful elk hunting on the Bethal Ridge above the Oak creek.  We are both local and know the mountain better than most. We decided to head over to the Cowiche were I had tagged a nice young bull the year before. The area supports a fair local herd and is extremely rugged. We had access to an area through a friend that owned some property and lived a very primitive lifestyle up there. Frank is his name and being a little eccentric his tales of bigfoot and not being caught on Divide ridge after dark were scoffed at by myself and hunting partner Justin. Anyway, we headed straight up the ridge in my hunting rig in late afternoon to pitch camp. We encountered three other rigs coming back down as the sun was setting. They were driving at a high rate of speed. I new one of the guys, he's a logger up there, and he stopped to warn us of the Divide Ridge after dark deal. I said thanks, see ya, and he proceeded back down the mountain, fast. Justin commented about being a bunch of wimps. We found a fair sight to spend the night. As some weather was coming in, we picked the heavily wooded very dense north slope to put out our bedrolls. The place had an eerie feel to it and I dismissed it as being in my head. We were gathering wood by flashlight for a fire when we both stopped and simultanously looked at each other. \"You smell that?\" \"Yeh, it's probably a couger kill\". A very strong rancid odor, not like rotting meat decay, just a putrid smell. We got a fire going and I put on a pot of venison chili. Justin started building the fire bigger and bigger. This was uncommon for him. I asked him. He stated \"something ain't right up hear tonight\" and I said I agree. We both know fear feeds on fear and dismissed it at that. Then we heard the first whistle/howl. The first one was distant and we could here clearly due to no wind and the cold. When elk call each other, people not familier with wapiti can mis-interpret these calls as whistles. This was no elk. Justin got out his cow elk call and responded with a short set of chirps. I got out my Weatherby and .44 Magnum. Something was not right. There was no initial response to Justin's cow calls. I put some more wood on the fire. Then came the second shrill howl, in the creek bottom right below us. It was loud and like nothing else we have ever heard and believe me when I tell you we have hunted every manner of \"known\" species in these mountains. My hair was literally standing on end. Justin said \"we're outta here right now, cover me, I'm pitching camp\". He started packing tarps and gear while I sat listening and watching, heavily armed. Justin is one of the most fearless men I have ever met. He was white with fear. Next thing we heard was feet walking in the snow, very loud crunching. Justin just about knocked me over getting to my rifle. The scarey part is, we have crashed enough hooved ungulates through the woods to know the sound of four legs crunching snow. This was very deliberate walking, not crashing or running. I screamed out that we were locked and loaded and who ever is out there to come into the light, hoping someone would. The crunching snow stopped. Now both Justin and I are very seasoned and responsible hunters and probably the last ones to shoot at noises in the dark, but this had gone far beyond that. There was something standing out there in the dark, large and not scared of us, which for any manner of \"known\" species in our mountains is unusual.  This silent standoff went on for about two minutes. We could see nothing outside the light of the fire and lanterns. Now mind you this creature was close enough that we could hear it walking in the snow, so we knew it was still there, but there was no smell. I called out one more time and we fired one shot from my pistol into the air. Then all hell broke lose. There was a loud short grunt and running feet crunching in the snow, and we started firing reloading and firing. We did not stop shooting till we were loaded and well on our way. After a harrowing drive off the mountain at night in the snow, which I do not reccommend to even experienced drivers, we made it back to the my ranch. My wife took one look at us and knew something was truely wrong. Justin refused to talk the whole drive off the mountain. And to this day refuses to talk about it. I have no desire to go back up Divide Ridge to investigate. It is 3:00 A.M. and I'm am writing this after I was awaken again by this same incident. I am still an avid hunter, but I stick to Bethal Ridge. Make no mistake, this incident has changed my perspective. I would encourage anyone interested in this to spend some time on Divide Ridge, good luck.",
  "classification": "Class B",
  "county": "Yakima",
  "state": "Washington",
  "location": "-121.1458,46.5602",
  "location_details": "North slope of Divide Ridge, South of Rimrock lake, north of Strobach Springs at the \"headwaters\" of Short and Dirty Creek."
}