{
  "reportId": "22890",
  "title": "",
  "date": "",
  "observed": "Editor's Note: The original submission is not from the witness, but rather his mother – who he called right after he had the experience. A BFRO investigator subsequently interviewed the witness. Those notes are shown below. Hence, this is not a second-hand report (only first-hand reports are allowed in the BFRO database, with very limited exceptions). Original submission: I am writing this for my son David. He called me this morning about 1:30 AM. He was excited and upset and told me and his dad that he finally believes us about Bigfoot. He was on the I15 going south when He came to some fog he told me he put his fog lights on so he could see better with out his main lights being on. He stated that he saw some eyes glowing so he turned on his head lights and he saw a bigfoot running in front of his semi truck. He swerved to keep from hitting it. After he got the truck under control he pulled off to the side was he was spooked out. He said I know for a fact that they exist now. He has always been skeptic about them. He said it was like looking into a gorillas face. They had eye to eye contact. Only it walked upright like a man but was hairy all over. His leg was the size of his body he told me. so he asked me to right this for him. He is a true believer now. Notes from Investigator’s Interview with the Witness: This interview took place on August 21, 2008. I talked to the witness on the phone for about an hour and he described what he called “a hell of an experience”. He told me he used to drive truck all over the United States (but doesn’t do it anymore). He told me that when the experienced happened he was carrying a load of potatoes from Idaho. He was on I-15 southbound toward Saint George, Utah. At around 1:30 to 2:00 a.m. the witness was going up an incline on the road and drove into a small patch of fog and turned his fog lights on. The fog wasn’t heavy at first, but as he reached the top of the hill and dropped from tenth gear down into ninth gear, the fog got heavy. At about this time he noticed the reflection of something’s eyes – he thought a deer - off to the side of the road, and he turned his bright lights on. At this point in our conversation the witness told me he had always been skeptical about bigfoots. He’s an avid hunter and spends about eighty percent of his free time hunting and fishing, but had never run across a bigfoot or any evidence of one - and thus didn’t think they existed. But, the witness said that when he put his lights on bright, even though he didn’t want to believe it, he was seeing a “bigfoot, sasquatch, or whatever you want to call it”. It went striding across the road - from the witness’s left to his right - with big, long strides. The witness almost hit the creature and had to swerve to the middle of the freeway to miss it. He somewhat lost control of his truck, and almost wrecked the truck. He managed to get his truck back under control and, after about another 200 to 300 yards, pulled off to the side of the road and came to a complete stop. He kept looking back in his mirrors - not wanting to believe what he had just seen. He says “it scared the hell out of me” and he says his thought at the time was “I’m getting the hell out of here”. The witness then drove away from the scene, scared and shook up. He drove another four-hundred miles and was wide awake the whole time. The witness said the creature was initially about thirty to forty yards away, when he first saw the eyes, and that when he turned on the bright lights it was only about twenty feet away. He also stated that at one point in the experience the creature turned and looked at him. The witness emphasized several times the point that he hadn’t believed in bigfoots before the incident, despite the fact that his step-father had claimed to have had a bigfoot encounter (see \"Other Stories\" below). He says “I was probably one of the biggest skeptics”. Right after the witness’ experience he called his mother and step-father to tell them about his experience. He has no doubt that what he saw was a bigfoot. He says he’s seen a lot of bears before, and actually hunts bears every year, and he says he knows for certain that the upright creature he saw wasn’t a bear. The witness estimates he only saw the creature for about ten seconds, but he was still able to relate some information to me about what the creature looked like. He said it looked almost identical to the creature in the Patterson film footage. He says it had black hair, and that it had big eye brows - like you would see on a gorilla. The witness saw the creature eye to eye from up high in his big truck and thus estimates it to have been at least eight to ten feet tall. He thinks the weight may have been between 600 and 800 pounds, and he says it appeared stout. It had long, lanky arms – proportionally longer than a human’s. I asked the witness if the creature was running and he said no – it was just striding, with long strides that covered a lot of ground. He said two to three steps, and it was across the freeway. I asked the witness about weather conditions and he said it was brisk, with snow on the ground. The witness was sincere in relating this experience – at one point saying “I swear up and down I know what I seen - I know what I almost hit - it looked right at me”, and later adding “I know what I saw and it freaked me out”. He said he’s a lot more alert now to what’s around him.",
  "classification": "Class A",
  "county": "Millard",
  "state": "Utah",
  "location_details": "right on the I15 south side of the freeway."
}