{
  "reportId": "7031",
  "title": "Lady sees large hairy creature on the side of the road",
  "date": "2003-06-28",
  "observed": "It was late June and I was driving home around 2:00 in the morning on a dirt road I use for a short cut from a friends house. It was dark, and cloudy I guess because there was no moon or stars out. I had just crossed over the creek and around a few curves when I saw something huge close to the side of the road. As I proceeded to get closer I turned on my brights. I realized this thing was standing on two feet, and kinda hairy, but looked as if it were humanlike. It looked to be 9 or 10 feet tall, larger that anything I wanted to stop for.  Its back was turned to me as if my lights were blinding it. This was like no human I had ever seen. I pushed the gas pedal as hard as I could, swung the car to the far left, and went around the thing as fast as I could. I never looked back, my heart was pounding because I was so frightened. It was enormous.   I had never really seen anything like that before. I had wondered if my mind was playing tricks on me because I was tired. I never mentioned this incident to anyone I just stopped traveling the road. Up until just a few weeks ago I wouldn't ride down this road even in the daylight. The reason for me to go back was absolutely amazing. My father  made a discovery of his own. Large footprints, feces, and a trail into the woods not far from where I had seen this \"thing\". I mentioned my story (about that night) to my parents when they told me about the discovery they had made. I went to the place with them to help cast the prints, take pictures, and collect some of the feces. If it hadn't been for their discovery, no one would have ever known what I had seen. I still don't travel that road at night, but have become braver to do it during the day.",
  "classification": "Class A",
  "county": "Tuscaloosa",
  "state": "Alabama",
  "location": "-87.31821,33.26035",
  "location_details": "Withheld at witness' request"
}