{
  "reportId": "3338",
  "title": "Long trail of 13\" long human-like footprints found in deep snow and rough terrain",
  "date": "1998-01-05",
  "observed": "I was backpacking alone last weekend (January 5 and 6 1998)when I ascended into a snow and ice encrusted box like canyon. The snow and ice had stuck around for several days and was quite deep in this secluded section of the trail. As I was ascending the steep switchbacks, I came across a series of large bare human footprints in the snow. These footprints continued intermittently (because there were patches of rock and solid ice as well as snow)for about a mile and a half of steep trail. The tracks were headed North on the trail (in the same direction that I was headed). Since I was alone and would be spending the night alone, I convinced myself that the  tracks were simply the work of hoaxsters. I could not allow myself to become frightened by what I saw by believing in their reality. I also refused to let myself take a picture of the tracks, as that would lend credibility to them in my mind (remember- I was backpacking totally alone and unarmed). The tracks were slightly larger than my hiking boots (which are rather large- i would say the tracks were approximately 13 inches in length). After my excursion, I wish I would have taken pictures of the tracks, as I feel someone trying to propagate a hoax would have had to be incredibly committed to hike into that difficult terrain and plant the tracks on those incredibly steep and treacherously icy switchbacks. It rained that night, and subsequently melted much of the snow. The tracks were gone when I descended the next day, however I did photograph a fresh bear track in the same canyon. Had the footprints been there as I was heading out, I would have photographed them.",
  "classification": "Class B",
  "county": "Swain",
  "state": "North Carolina",
  "location": "-83.5214,35.5605",
  "location_details": "On the Appalachian Trail in western North Carolina, approximately four miles north of the Nantahala Outdoor Center (Swain County)"
}