{
  "reportId": "10889",
  "title": "Teens find footprint in swampy ground near Interlochen.",
  "date": "1984-02-11",
  "observed": "In February of 1984, I was wandering around an old junkyard with my best friend and three others (one girl and two other boys). My friend and I were both 14 at the time; the ages of the other kids ranged from 11 to 13. The junkyard was in an open area that was surrounded by a house and woods to the west, a rarely used railroad to the north, another house and Riley Rd to the south, and a very dense swamp to the east. I should note that the two houses were not easily visible from the junkyard: they were about 100 yards or more away. The junkyard was closest to the railroad and the swamp. The entire surrounding area was very sparsely populated--mostly woods and swamp. The junkyard was filled with old appliances (TVs, ovens, dryers, etc.), and furniture---as well as old magazines. My friend and I happened to find an old issue of Penthouse without the others seeing us, so we decided to go off and find a secret hiding place for our discovery. We headed off towards the woods and swamp to the east. We were just inside the woods near the swamp and we stopped to survey the immediate area for a good hiding place. I glanced down at the snow-covered ground near my friend's foot and immediately all the hair on my head and neck stood at attention. Right there, just inches from his boot was an incredibly huge \"human\" footprint. It was pristine. It was very fresh. It was about 18 inches long. The track looked completely normal except for it's size. Five toes, ball, arch, heel. Just like a bare footprint would look in the sand on the beach---except this one was in frozen snow. And it was about half to three quarters of an inch deep. Mine and my friend's tracks were barely visible---only a couple millimeters deep. (We each weighed about 150 to 160 pounds.) It was a right foot and there were no claw marks whatsoever ahead any of the five toes, as a bear track would exhibit. The ground around the track was patchy with frozen snow. There had been a thaw a few days ago, but now the weather had turned very cold again, but with no new snow, and the bare ground was quite frozen. I was quite knowledgeable--even at only 14 years old. I knew what to look for to determine a track's validity. I had spent the better part of my childhood in the woods---playing, hiking, exploring, etc. I knew the difference between fresh tracks and ones that had been distorted from melting. This one was definitely fresh. We looked for more tracks, but only found one other--about ten feet away---closer to the railroad. It was just outside the edge of the woods--also in snow and also a right foot. It was also about 18 inches in length. I also remember looking for hair samples, but to no avail. To this day I am still puzzled as to why we did not find any tracks of the left foot---and only found two tracks at that. The ground was frozen and the snow-covered areas were sparse near and in the swamp. It looked as if something/somebody came out of the swamp heading east and then turned, heading back into the swamp. We searched the surrounding area for more tracks, including several hundred yards of snow near the swamp's edge to the east and to the south, but found nothing. I really wanted to go into the swamp to look for more tracks, but it was nearly impenetrable. The swamp was filled with downed trees and overturned stumps. It seemed to me that we could only follow these tracks if we were either very tiny (like a squirrel) or very tall (say 8 or 9 feet) and very strong. We eventually gave up after several hours and headed back to my friend's house, which was about a half mile to the west. We told the others not to tell the adults as they would not believe us. Sure enough, neither sets of parents believed that we had encountered anything extraordinary, and did not want to be bothered with such nonsense. We never collected any evidence from the site--photographic or otherwise. To this day I have never returned.",
  "classification": "Class B",
  "county": "Grand Traverse",
  "state": "Michigan",
  "location": "-85.77714,44.64535",
  "location_details": "About a half mile west along the old railroad (which has since been torn up) from M-137 in Interlochen. (About halfway between Riley Rd and M-137.) It was on the left side of the railroad."
}