{
  "reportId": "8460",
  "title": "",
  "date": "",
  "observed": "There were two Incidents in the same area a week apart. The first time was about 2:00 p.m. or so.  I was checking out an old placer claim. I felt like I was being followed. I could hear twigs being walked on.  The funny thing was, it stayed behind me always. I felt like I was not alone, like I was being watched.  I looked but could see nothing. I was alone. I thought nothing of it. The second time was the next weekend. My friend and I were prospecting and camped over night. There was an old cabin that had fallen over. All that was intact was the roof [A crawl space].  About an hour after dark with a lantern and a low campfire burning I heard what sounded like a woman screaming \"down the canyon\". This is hard to describe but it changed pitch and direction. It lasted about a full minute or so, without taking a breath and went from a high pitch to a deeper pitch to a bear like sound and ended like a wolf. It was loud. As it changed direction realized it was very tall and very close, just out of the light maybe 50 feet away. I jumped up after realizing how close it was and it was directed at me. I grabbed the fire axe.  Then, it left as quietly as it came. We never saw it. My heart was pounding, scared to say the least. About 30 minutes later, about a quarter mile on the other side of camp. A wolf howled again. The next day we realized something had been sleeping in the old fallen cabin and an impression was in a small sand bar at the creek.  It was square and fairly flat with a little out cropping like a twig or a small toe on the right side with the corners kind of round like heels. I don’t know if it was related or not. In fact, call me naive, but a year later I was at home in a room away from the TV.  A bigfoot program was on.[not paying attention]. I heard the recording of the sound one makes and the hair on my arms stood up. It was exactly the same sound! At that time, I worked and lived in the mountains. I don’t spook easy but this one got my attention.",
  "classification": "Class B",
  "county": "Clearwater",
  "state": "Idaho",
  "location_details": ""
}