{
  "reportId": "30783",
  "title": "",
  "date": "",
  "observed": "I can't exactly say it was a BF encounter, none of us but 1, saw something and 2 out of 4 people heard \"the noises.\" I will explain my story and let you decide. Thank you. September 23, 2011, Myself and a group of friends decided to go camping late one night near the, White River. We took about a 40min walk to get to our campsite.(it was a little after 11pm.) 5min after we arrived, we heard an Elk Mating call from across the river and thought it was pretty cool, didn't think much of it. About 30min in, after we get the fire going, we heard another unexplainable \"yelp\" sound that echoed off. It was only one time, from a distance, possibly 1/2 of a mile or less out. We all looked at each other as if one of us could explain what it was but we couldn't and again, didn't think much of it. About a few hours later after roasting marshmellows and havin a good time, we decide it's time to hit the hay, one guy, the only one of us who drank too much, was already passed out. (There was 4 of us!) My best friend and I crawled into the tent and the 4th guy decided to stay outside for a little longer. After 2min or so he called out to us, \"I keep hearing something over by the river, like it's really close to us.\" He then grabbed the cheap flashlight from our tent and pointed it in the direction he heard the sound and then, \"Oh my god, I see something by the river, I can't make it out but it looks big.\" (we've camped at this location before and nothing unusual has ever happened.) Now, I aint dumb, I felt like he was just trying to scare us becuz he likes to do that when we're out camping and he has before but he's never made any pranks like this, he looked pretty white in the face, eyes where all wide like he was really scared. After he was done observing, he climbed into the tent with us and decided to call it a night but every so often he'd peek his head out to check and kept talkin about what he saw. It was scaring me a little. 2-3 hours probably passed and both 2 guys where out cold, me and my best friend were still awake, we were too shook up about what he saw. Then out of no-where, we heard this LOUD KNOCK on a tree, right next to our campsite, close to were our fire was. Scared the living hell out of us. We kept very quite and still, didn't speak a word! After a long while passed we didn't hear anything unusual and my friend was drifting off to sleep. I was too scared. I think I stayed up for another hour and that's when I got the living daylights scared outta me! Just outside our tent, I could hear something walking closer to us, like something with 2 feet. Sticks were cracking and I could hear lite footsteps on the ground. Like it was trying to be quite not to wake us. I heard it brush the tent a little. I was paralized with fear. My best friend was laying next to me. I woke her up, going insane with the noise. I didn't speak a word to her, just looked at her and feeling fear and she knew something was wrong. Within 10 seconds after waking her, the crunching of the sticks started again and the lite footsteps followed. We woke up the guy who complained of seeing something. He peeked his head outside the tent and saw nothing, (it was also very dark, you wouldn't of been able to make out things 4 feet from you.) About 10min later, we all layed quite and remained a alert. Then, the snapping of sticks came back but it started going away from us until eventually, we didn't hear it anymore. When dawn approched I finally felt safe to sleep, We woke around 11am and i started to investigate. I looked around the tent and on the ground. Didn't see anything unusual, no footprints, I didn't really have a lot of time to investigate becuz everyone wanted to leave. I also wanted to try and mimic the crunching sound I heard, (I'm not very good at analizing things either, broken sticks would seem natural to me.) I walked out toward the river bank were our guy friend said he saw something, didn't see any footprints, if something was there, it would of left behind a track in the mud. Our tent was set up over hard ground and low brush. If you think this could of been a possible BF encounter or something else. Let me know! I don't think I'll be camping out there again.",
  "classification": "Class B",
  "county": "Pierce",
  "state": "Washington",
  "location_details": "You can find our exact campsite if you go in-between The Loggers Rodeo and Glacier Middle School. You should pass a Military Base on your left. Keep straight. Park your car behind the left of the bridge. Go across the bridge and keep straight onto the paved cement trail. At the very end, you'll see another trail on your right. Follow it until you reach a small orange stream. Cross the stream that leads to the river. Follow the exposed river bed all the way to the end, (going \"right\" after you exit the orange stream.) Toward the end you'll reach a flat sandy area. On your right, there will be another small trail that goes off into the trees. That's our campsite, you'll know if you see a fire pit surrounded by 3 logs."
}