{
  "reportId": "26403",
  "title": "Man sees large, hair-covered figure while riding on train near the Cascade Tunnel",
  "date": "2009-08-04",
  "observed": "My wife and I just returned from a trip out to Seattle via Amtrak. We took the ‘Empire Builder’ out of Chicago, all the way to Seattle. On the morning of Tuesday, August 4th, around 8:00am, I was sitting in our ‘sleeper compartment’, on the port side of the train as it exited the long, Cascade Tunnel. I was just relaxing with my head back against the seat, looking out the window, letting the scenery pass by. The train was moving about 40mph and the landscape rose sharply up the mountain. (I was facing toward the rear of the train.)  About a mile west of the tunnel exit, I suddenly glimpsed a ‘huge’ figure, standing in the trees, up the grade about 50 to 75 feet from the train!! The woods were quite dense and I only saw the figure for a brief moment but it was unmistakably a Bigfoot!! He, (it) was standing on the sharp incline, looking down at the train, with his right hand on an Aspen tree!! (Because of the speed of the train, I only glimpsed it but I’m positive of what I saw!!!!)  The area seemed to be very remote, desolate and wild!! A minute or two later, the landscape dropped off into a steep canyon where I could view the Skokomish river below. It looked to be full of large boulders and the flow was quite rapid and steep.  The Empire Builder passes this same spot daily. It occurs to me that this animal might have developed some curiosity with the train and may visit the spot quite often. It was quite a shock to glimpse him!!! Quite a thrill as well!! Of course, I exclaimed to my wife immediately. (There was no chance she could see it because of her position and the speed of the train). I have ‘reluctantly’ told my family and a few close friends of the sighting. They are understandably skeptical.  ",
  "classification": "Class A",
  "county": "King",
  "state": "Washington",
  "location": "-121.1859,47.70178",
  "location_details": "Within a mile west of the west side of the Cascade Tunnel. Just after the sighting, I viewed a sharp drop in the terrain, to reveal a river below that was full of boulders and had 'white water' rapids."
}