{
  "reportId": "391",
  "title": "Blocking of walking trail",
  "date": "1999-05-12",
  "observed": "Hello: This incident has me curious.  I did not see a Big Foot, but I may have seen evidence of one.  This happened over a year ago, about May of 1999.  It was not until a recent conversation with a person who knows a little about Big Foot traces, that it occurred to me that I might have seen the results of a Big Foot. I was working up at Canyon Park, in Bothell, WA, a corporate park that is in a region of rapid transition from country to suburban.  There are walking trails around the corporate park, and some are quite wooded.  I would walk one of these trails out for lunch each day; the trail can easily bee seen from the road and office buildings on one side.  A stream runs on the other side. One afternoon in May 1999, I came across a tree lying directly across the trail.  The diameter of the tree trunk was about 5 inches.  The tree was freshly snapped off and was about 25 feet long (a young tree).  At first I was confused, because it was fresh, not sawed but snapped.  I could not find where the original tree trunk was located.  It took me a couple of minutes to find the trunk.  The tree was snapped off about ten feet up, cleared from the trunk, and laying directly across the trail as to block it.  I was completely dumbfounded as how or who could have climbed up there, snapped it, and done that!  I brought out a friend from work the next day to look at it, and we both were completely perplexed.  It was a calm spring, and there were no winds even close to the strength it would take to snap that tree.  There were no markings on the ground to indicate vehicles or a cherry picker bumping into it; we looked.  Lastly, it did seem to be placed directly on the trail to block it. We pulled the tree over to unblock the trail. I was telling a friend about it not to long ago, it never occurred to me that it could have something to do with Big Foot.  It would have taken Herculean strength to break that tree, and there seems no logic to doing it around an uninhabited corporate park trail.  I never bothered to look for footprints. I bet the tree is still lying there.  At least the ten-foot tree trunk would still be there.  Sorry if this report is so cold; had I known what I was looking at, I might have looked for footprints or even perhaps could have checked for hair samples. What do you think?  Big Foot or just some big animal (Bear) or kids swinging in a tree?  It is a corporate park completely cut off from where kids play, so I doubt that.  Too massive for kids to break as well I think.  Very perplexing and very close to civilization too. Murray Stockill Mstockill@aol.com",
  "classification": "Class B",
  "county": "Snohomish",
  "state": "Washington",
  "location": "-122.1914,47.79111",
  "location_details": "Off Pacific Rim Blvd, in Canyon Park.  Walking trail that skirts office buildings along North Creek."
}