{
  "reportId": "5909",
  "title": "Two Hikers Have Close Encounter Near Genoa",
  "date": "1984-09-15",
  "observed": "In Sept. 1984 my friend and I were hiking on the east side of the Sierra Nevada Mtn. Range above Lake Tahoe and the Carson Valley above the town Genoa.  Both of us grew up in this area.  Although in high school I was kind of a cut up, my friend Linda, graduated valedictorian of our class 5 years earlier.  She is very logical.  We have often hiked this trail that basically goes straight up the mountain and over to Tahoe.  It is a strenuous hike.  When we parked our truck at the trailhead there was another car parked there as well.  We were 1/4 the way up the trail when two teenage boys came running down the mountain towards us.  The trail was extremely steep and they were running for all they were worth.  They stopped long enough to implore us not to go any further up the mountain as they had seen a monster or something.  There was an old deer hunter's cabin at about the half way point and we told the boys that we were only going to go that far.  (We thought they were drinking or on drugs) We shrugged off the incident laughed and joked that we wished we had what they were \"smoking.\" We reached the cabin without incidence sat down on the bluff that overlooked the Carson Valley we split a soda that we had brought and I took out my recorder (flute like instrument) and began playing some little tunes on it.  We were alone on the mountain we thought. After about an hour of putsing around we decided to head back down the trail.  I kept smelling dog doo or something dead.  I even checked my shoes.  We were near the creek gathering pine cones for an art project, I was facing downhill, Linda was facing uphill, we were examining a particularly perfect cone when Linda looked up and exclaimed, \"Oh, my God it's a bear, no....it's a guy in a bear suit!\"  I looked up and couldn't believe it, we were a stone toss from a 7 ft. hairy dude.  He looked directly at us and to this day Linda and I felt something pass between the three of us.  He stood across the creek from us.  His hair was the color of dry pine needles and covered his whole body with the hair thinning just on his chest and face. He had a large broad chest, but not breasts like a female, his arms were hanging at his sides nearly to his knees and when he walked, he took long strides and his arms swung freely as he walked. He didn't seem to fear us although he began to walk straight up a pine needle covered slope, barefooted, without slipping. As he moved away Linda grabbed my arm and began dragging me down the hill I couldn't take my eyes off him and he never took his eyes off us.  I do not feel to this day as he meant to harm us but instead I feel he was just as fascinated with us as we were with him.  His face seemed almost serene with very intelligent eyes - his face resembled an orangutan. He had large eyes and a flattish nose I sketched a picture as soon as I got home and Linda confirmed that I had captured his likeness - I wished I had a camera on me that day.  As we continued at a fast pace down the hill he remained on the ridge above us paralleling in the same direction. We reached our truck and could still see him crouching on a granite boulder at least a football field distance between us.  I yelled up to him that he was very cool but he shouldn't be scaring the crap out of us locals.  He stood up on his boulder and Linda told me to shut up and get in the truck.  We were strangely disturbed that afternoon and evening.  We thought of going to the forest service or the sheriff’s dept.  But crimeny sakes, who would've believed us?  Plus in our community they would just want to shoot him. We have since hiked there many times.  Always hoping to catch another glimpse.  We are married ladies with kids and we take the kids up \"Bigfoot Canyon\" periodically in search of our elusive friend. A few years ago the wind blew down some trees during a storm and exposed an area that we had not seen from the trail before.  When we went up to investigate we found a large boulder and some older pine trees with branches low to the ground around it.  You could duck down and go under the trees near the wall of the boulder and it looked as if something or someone had made a natural shelter there.  The pine needles had all been tramped down and it seemed to be away from the prevailing winds.  A great place for deer, bear or perhaps a bigfoot.  We hope so.  I will never look at life on this earth the same way.  I have seen bigfoot and not only does it make for a great tale around the campfires at night, it fuels my imagination about every little sound I hear when I am in the wilderness.  I am intrigued.  I only hope that no harm comes to the Bigfoots.  I believe that the great creator of all life shares the sight of the Bigfoot with people who might grow from the experience. I know Linda and I have both grown.  Even if we share the experience with someone who doesn't believe us - it really does not matter.  We know what we saw.  He was so close in proximity it was obvious to us that this fella belonged here.  He was as natural as the sky, creek, trees and the deer.",
  "classification": "Class A",
  "county": "Douglas",
  "state": "Nevada",
  "location": "-119.8458,39.00056",
  "location_details": "Go to the town of Genoa.  Drive north on Foothill Rd. turn left on Centennial past the cemetary.  The road ends up behind some residential homes but where the road ends the land belongs to the Forestry/BLM and is the start of the trail head.  It is a tough hike but eventually you will come to the remaining foundation of the deer hunter's cabin.  It was in this vacinity where we met this large, hairy, smelly guy near the creek. Going uphill the creek will be on your left."
}