{
  "reportId": "32249",
  "title": "Memory told of close encounters while working as a fence contractor near Cassia",
  "date": "2007-04-10",
  "observed": "Hello, I contacted someone from your organization about a year ago regarding my encounter in central Florida back in the middle 80s. I was called away to work and was unable to continue with the call. With that said, I would like to finish sharing my experience. I was working as a fence contractor in central FL during the 80s. We had obtained a job to build 10 feed plots for deer in a remote area off of hwy. 44 near the Blackwater Creek area of the Wekiva River Basin. The acreage is vast and was utilized for big game hunting. Since there was a deadline, we had all of the fence material trucked in and we set up camp at the end of the access road. This allowed us to be onsite until all work was complete. On the second day of our stay, we (myself and a helper) were surveying and clearing a fence line in the early morning hours, it was still misty with little light coming through the trees. There was four of us total working, so we split up into two teams to knock out the 10 plots. While my helper and I were clearing brush we were commenting and joking about an odd odor (skunky/sulfer like) we had been smelling a few minutes before reaching the site of the first plot. As we were pulling a string line, abruptly, a dark, bipedal form stepped into our fence line about 60 yards ahead of us. At first we thought it was one of the installers working with us, but as it moved closer to the clearing you could clearly see it was not a human. It appeared to be mostly covered with orange/brown hair, un-human long arms and an odd shaped head (wide, pointy and large) with a very short neck. Once it stepped out, it seen us as well, and when we shouted out the names of the other workers it quickly vanished into the treeline. We viewed the creature for what seemed to be 60 seconds or so before it bolted off. My helper and I were stunned at what we had seen. We spent a few minutes trying to rationalize it but there was no doubt we witnessed something extraordinary. I was carrying a side arm so we walked up to the clearing but could not see anything through the trees, however we did hear something moving rapidly away from us for a few seconds. That was the first of two encounters. The second encounter happened on the fourth night of our stay. All four of us were at camp which was set up on the bank of Blackwater Creek, about 15 feet from the waters edge. That area of the creek is approximatly 12 feet in width from bank to bank. We had began to cook dinner and were still carrying on conversations about our sighting of a hairy creature two days prior, with the other installers ribbing us saying we must had been drinking on the job and such. There was a cooler that we had tied to a rope and placed in the creek to keep the contents cool. As we were eating a loud splash from across the creek startled everyone. One of the other installers ran down to the creek and found that our cooler was gone, as well as the rope and stick it was tied to. We all walked down to the creek bank but there was no sounds other than the normal water movement. The missing cooler was chalked up to raccoons or an alligator. As we settled back into eating, one of the guys walked away to relieve himself, as he returned to the truck everyone looked at him, he was silent and all the color was gone from his face, he just looked at me and said \"I'm sorry, I will never doubt anything you tell me again, ever\". Not sure what he meant at the time, I asked him what happened, he quietly turned and pointed, saying \"someone or something was standing on the other side of the creek watching me pee\". It was obvious he was actually scared speechless. I grabbed a spotlight and we all walked down to the spot where he was standing. As I was hitting the treeline with the light there was no sight of any movements, eyeshine or anything so I stepped as close to the waters edge as I could. As soon as I turned the light back on and the beam hit the other side of the creek, we heard a loud grunt, almost similar to a pig, I panned to our left and that's when it all happened. A large bipedal, hair covered animal stood up from behind a group of palmetto bushes. It stood fully erect, the light shine of the eyes were almost gold, it reacted to the light hitting its eyes like a person would, by throwing it's forearm up in front of its face, let out a chilling sound (not a grunt, more like a short howl) unlike anything any of us had heard, it then turned and fled, vanishing like before. All of that happened in just seconds and all four of us witnessed it. We immediately packed up our gear, went to a motel and stayed at the motel until the job was finished. Three of us later went to the FL fish and wildlife office and reported what we had seen. It was during that report when I first heard the term \"skunk ape\" or even that there had been other sightings of this type. I can honestly tell you, without any doubt, it was not mistaken identity. I grew up as a hunter and outdoorsman and I know what bears look like and also how they act in the wild, it was not a bear, it was definately a primate of some type. Till this day I am effected by the encounters.",
  "classification": "Class A",
  "county": "Lake",
  "state": "Florida",
  "location": "-81.48534,28.85982",
  "location_details": "From I95 south take the LPGA BLVD exit near Daytona, turn right, follow to end and turn right onto International Speedway BLVD (17/92), continue on 17/92 into DeLand, Turn left onto 17, turn right onto 44 west, continue on 44 approximatly 10 miles. Cassia is a very small town, look closely for the sign. Once in Cassia, the area where this took place is now called Camp Boggy Creek, I believe, which will be on your left, a sand road. It is just before the Blackwater Creek bridge (small bridge). Unknown who the land owners are now if any."
}