{
  "reportId": "1089",
  "title": "",
  "date": "",
  "observed": "I had a little pony I was riding and I was supposed to meet a friend (Holly) by this little village.  I was riding bareback that day, and as my pony (King) came to the top of this hill, (we were on a little back road) he suddenly stopped dead and braced himself and put his ears straight forward.  (As though he were looking and listening to something)  I looked down the road, and about 400 feet away, I saw this big reddish brown thing on the road, (which happens to be the same color as Hollys horse)  and it was moving toward us.  Keep in mind this all happened so very quickly, but at the time it seemed like everything was going slowly. My first thought was, oh, Holly must have got thrown and her horse is heading back to the barn.  But as I was thinking this, the thing was getting closer, and I could see it was very big, it had LONG reddish brown hair, and it's arms were swinging back and forth as it walked toward us.  (It had very long arms)  As I suddenly realized that this was Bigfoot, my pony (on his own) reared up and turned at the same time, and took off running back down the hill we had just come up.  Believe me, I had to hang on, my biggest fear was falling off, and Bigfoot 'getting' me.  I made him turn into this ladys yard at the bottom of the hill, and I yelled and screamed till she came out, then she went in and called my uncle.  My Uncle showed up, and followed me in his truck till I got the pony back to the barn, then he had me get in the truck and we went back to where I saw Bigfoot.  He got out and looked at the woods along the road, and he did find a place where the branches had been broken as if something had left the road and went into the woods.  This was all reported to Stan Gordon, many years ago. The only things I can really say, as far as being descriptive, are that it was very, very quiet that day.  It also seemed as if my pony and I were hit at the same time with the knowledge that this was not something 'normal' coming toward us.  We both reacted together, (thank goodness cause being bareback, I almost slipped off). As far as Bigfoot himself, he was very tall, but also very broad, a stocky or sturdy kind of build.  He had reddish brown LONG hair all over, although his head seemed like there was less hair, and it was small in proportion to his body.  I did not see his face.  His arms were very long, and they just swung back and forth as he walked.  For some reason, those long arms stand out in my mind.  Anyways, it doesn't matter to me anymore (after all these years) if anyone believes me or not.  I know what I saw.  Oh, and when I saw Holly later that day, I HAD to ask her if she had got thrown off her horse while out riding.  She said no.",
  "classification": "Class A",
  "county": "Westmoreland",
  "state": "Pennsylvania",
  "location_details": "I don't know know the names of the roads, all I can say is it was on the outskirts of Keystone State Park, Derry Pa.  This is a little back road that leads to the village of Superior, Derry Pa."
}