{
  "reportId": "19354",
  "title": "Woman recalls childhood incident -- red eyes looking into window near Withlacoochee River.",
  "date": "1993-07-01",
  "observed": "It was the summer of 1993, and I was five years old. I know my age at the time seems discouraging, but I know what I saw, and I can recap the whole thing like it had happened yesterday. It was a late evening and my family and I were playing around in the living room of our single wide. I went down the hallway to the back bedroom. That was my bedroom at the time and my brother and I kept our toys in there. We had one smaller window and beneath that is where we kept our toy chest, and in front of it was a chair. I went into the room, sat on my legs in the chair and opened the toy chest. I grabbed all kinds of legos, and after I had grabbed the last lego that I could have possibly held, I sat up straight and there in the window were two piercing red eyes. I just stared at them. My arms let go of the legos and they dropped back into the chest. I stared at those eyes for minute and than ran down the hallway. I had no idea what it could have been. I yelled over and over again that there was a wolf in my window. But my parents just assured me that it was probably the dog next door. Okay, we lived in a mobile home meaning it was on blocks, and no dog, even on their hind legs could peek into the window. That window was set high off the ground. And it wasn't like it was eyes looking from below. These eyes were in the middle of the window, so whatever it was had to have been tall enough to be able to look in. They were like human eyes but not quite. For years I tried to figure out what it might be. I thought maybe an owl..but they have yellow eyes, and there were no trees close enough for a bird or animal to perch on and be that close to the window. I mean, it was right up against the window. It still gives me goosebumps to this day. And this is the same exact story I have been telling since that night for years now. And I can't get it out of my head.",
  "classification": "Class B",
  "county": "Marion",
  "state": "Florida",
  "location": "-81.78879,28.99487",
  "location_details": "Located in the Florida Highlands off of State Road 200."
}