{
  "reportId": "1831",
  "title": "Foot steps heard while walking on trail at night",
  "date": "1994-09-15",
  "observed": "Myself and my brother both had separate encounters with it in the Spring and Fall of 1994, respectively. I first encountered \"something\" in the spring of 1994 when camping with a group of friends in the woods bordered by Lyons rd to the west, the Florida Turnpike to the east, Sample road to the south, and the Winston Park development to the north. I left the camp alone at about 1:00 am heading east, towards the Turnpike on a trail. I began to hear what seemed to be footsteps in the woods maybe 5 - 10 yards to my right. I'd also like to say that I smelled a musty odor, but I could be inserting that into the report - it's been awhile since I had the encounter, and my recollection isn't as clear as I wish it were. Regardless I continued to walk, and the footsteps were remaining parallel with mine, and it bacame clear that whatever was two my right was walking on two feet from the stepping pattern. I started to get a little frightened, because the area where the footsteps were coming from was a thicket of Brazilian peppers - difficult to walk through during the day, and nearly impossible to manage in the night. I heard it move closer, and I turned around, and walked briskly back to camp. I woke my friends, and we went back to find it, although it was gone at the time. I remember leaving with the impression that I had encountered a sasquatch (which must be because of the scent), although I wrote it off as a figment of my imagination - that it must've been a farmer or a vagrant in the woods. I preceeded to forget about the incident, and never mentioned it again. About six months later, my brother was in the same woods, maybe a half mile from where I had my \"encounter,\" walking at night with a friend. He turned a corner from one trail to another, and \"bigfoot\" was standing at the intersection of the two trails. He said that it had reached out for him, and he and his friend ran off. He told me about the experience, and I then related mine. We had a running joke for awhile that there was a \"monster in our backyard.\" I'd like to be able to have my brother provide his report, since he had a sighting and is a better and more credible witness than I am, but he passed away at the end of 95 (I believe I might be able to find the friend, however) Regardless, I wanted to report the incident for a few reasons - first - it's a very unusual area to encounter an creature like this - the area is surrounded on all sides by a significant amount of development. While there remained a good deal of open land, including a tomato farm, a tree farm, Tradewinds Park, and some undeveloped land, it didn't strike me as being an area where one would have thought to find a creature like this - there doesn't seem to be too terribly far for this thing to go without being spotted. Further, given the amount of development that has gone into the area since, its range is becoming severely limited. Still, the 1975 Broward report happened about a mile or two west of where my brother and I saw it, so it must have found a way to adapt. It's possible it could move along the turnpike and the sawgrass expressway somewhat unnoticed, making it over to the nearby landfill, as well as Quiet Waters Park, although it appears unlikely that it could've gone too much further without being caught in the middle of suburbia. Given the amount of development that has since gone into the area, it's range is further being restricted. It might be a very lucrative area to investigate. At the rate development is going, if it still back there, it's going to be encroached upon sometime soon.",
  "classification": "Class B",
  "county": "Broward",
  "state": "Florida",
  "location": "-80.17845,26.28585",
  "location_details": "Lyons halfway between Sample and Hillsboro, roughly where the Wiles rioad extension is being built."
}