{
  "reportId": "23732",
  "title": "Sundown sighting by motorists near Rhode Island state border",
  "date": "2008-05-15",
  "observed": "I was driving northbound on route 146. I was driving with my sister (the only other person in the car) and she was looking down at her I-Pod and was in the front passenger seat. The traffic was average not too many cars but a few, and I was doing about 65-68 mph.  I looked about 3/4 of a mile ahead and saw something off to the rightside of the highway not on the highway but near the woodline on the grass. At first it looked like someone possibly in a gilley suit but then as I got closer I couldn't believe my eyes because it looked just like what you hear about and see artist renderings of a bigfoot like creature. It was too tall to be a person in a suit approx. 7-8ft tall and very broad with black hair. I couldn't see any specific facial features or chest features as it turned into the woods when i was about 1/8 of a mile away. It was walking parralell to the woodline then took a 90 degree turn into the woods. When I saw this I immediately slowed down to about 50mph and looked intently into the woodline by this time I was able to get my sisters attention (she was listening to music on the I-Pod looking down) we both stared into the woods and Icouldn't see anything but see thinks she saw something black moving in the woods. I still can't believe what I saw, there was no cars parked on the left or right shoulders of the highway. The creature did not appear to be running the entire sighting lasted for 7-8 seconds. I am very sure of what I saw it was a dark haired looked very much like a bear walking on two legs.",
  "classification": "Class A",
  "county": "Worcester",
  "state": "Massachusetts",
  "location": "-71.58914,42.01496",
  "location_details": "The location was on route 146 north bound lane on the right side shoulder of the highway near the woodline it was approx. 1/2 mile to 3/4 mile from where route 146 enters massachusetts from Rhode Island boader. Just before the exit for S. Uxbridge N. Smithfield."
}