{
  "reportId": "46624",
  "title": "",
  "date": "",
  "observed": "I want to start with tonight, while it is fresh in my mind. My girlfriend and I let the dogs out to the bathroom around 1am. She instantly said she thought she heard something in the valley below our home, and shined a flashlight down into the valley. I looked, and my German Shepherd was looking across the valley as well. I figured it was probably a deer, and we walked on out into the yard. I notice the German Shepherd was sticking close to her and her little dog. He seems to think it is his job to protect them both, and does quite well. So it isn't so unusual for him to follow them, but it was just a little odd at how close he was staying to them. I had forgotten to close the shutters on my chicken coop, (I have shutters that close over the wire) so I walked over to my garage and went behind it to the coop. As I was walking around the garage I heard this loud call/howl. I can not, in any way, shape, or form, even remotely able to describe it by typing this out. I can still hear it in my head, but would be lucky to even try to mimic the sound. It called out once, kind of low, then so loud it filled the area, but with the same vocalization both times. It was so out of place that my girlfriend instantly went into the house with her little dog, and I came back to the yard to check on them. She left the little dog in the house and came back out. She told me the little dog actually ran to the door and wanted in the house when he heard it. I downplayed it to a point, so as not to frighten her any more than she already was. We went back into the house and I got my other dog, and put his leash on him. He is kind of a problem dog, and I have to take him out separate from the other two. He sometimes goes wild on the leash, jumps, pulls and tugs etc... trying to get to our cats (which were no where to be found tonight) and it is just a lot easier to take him out alone. He behaved perfectly tonight, and just kept looking for something out in the darkness. He actually acted as if he didn't even want to go out at first. Just a few minutes after taking him outside, the calls started again. This time they were a little further from my home. The first time they were on the hill opposite my home, maybe a hundred yards away. The second time they were maybe two hundred yards away, and I could hear the cattle in the field closest to them calling out for each other and sending out their alarms. The calls kept up for a good two or three minutes, and quite frankly sounded like some sort of challenge. One of my neighbors has a bunch of hunting dogs they keep outside. They normally bark and go off at anything and everything. Tonight, you wouldn't have any idea they were even there. Not one of them made as much as a whine. They were completely silent. We have coyotes all over the place, and I hear them pretty much every night. A couple times a week I will even hear them in the day time. I'm \"very\" familiar with the sounds the Eastern Coyote makes, and this was no coyote. I am an \"avid\" outdoors type, and have spent more time in the woods then most. I know most of the sounds or calls any of the local wildlife make, and I have never heard anything like this in all my life. I'm well aware that a small animal can sound much bigger then it is in the quietness of night, but this thing was un-mistakenly large. Just the amount of lung capacity it would have to have to make that vocalization would dictate that it was fairly large. You may think I'm crazy to make such an issue about some sounds in the night, but had you heard these calls, I would imagine your mind would be spinning much the same as mine. As I said, I am an avid outdoors type. I've sat on a river/creek bank with no one around many nights, alone and in the middle of the night. The only thing I ever worry about is maybe someones dog running loose and running into it in the middle of the night. There are times I've sat out alone every night for a week straight. There are times I have gone into the woods five days a week for a month straight. Yet this thing tonight made me nervous to even step back out onto my deck to grab a paint-brush I had left in paint on the porch. There are some other things that have happened, and I will get into those now. I just wanted to describe all this first, while it is fresh in my mind. I live in East Jessamine County. This is one of the highest areas in this part of the state, and very lowly populated for the Central Kentucky area. I have a few neighbors, but only one that is fairly close. Our home sits at the top of a mountainous region made up of about eight peaks that look like hilltops. I think the area is fifty feet too short to be a mountain, but it is pretty much the same thing. My home sits right in the middle of those peaks. You go almost to the top and turn down my driveway and drive down to the house. The home sits on a flat area and over-looks part of the valley area between the hills/summits. There is a creek that runs through the middle and flows until it runs into the Kentucky River, which is about a mile away from my home. The area is a mix of woodland and pasture land with some cattle. This is the part of the river called the Palisades, with high rock walls, hundreds of feet high. On the other side of the river is Madison County, and there are no homes for at least a few miles. Last summer we heard what we thought was a small animal making noises on the roof. I ended up getting on the roof to find a leak, and there was probably fifty or more small rocks on top of my roof. I assumed it was the neighbors kids, even though I had never seen them in our yard, or even on my property. I thought maybe they had snuck over one day when we were gone. The neighbors moved though, and the rocks continued. I had no idea what was doing it. We kept smelling a very foul smell, but it was only once in a while. We smelled it mostly at night, but a few times during the day. Then one day about dusk I smelled it when I was walking to my garage, which is about thirty yards from my back door. I ignored it, but a few minutes later I heard an awful scream. This sounded like a scream of rage, and snapped me right out of my thoughts and had my full attention in an instant. It was nothing I have ever heard, and after tonight, I feel that it was from the same creature. We let the dogs out one night last summer and my girlfriend shined her light into the valley below our home. There was a set of glowing red eyes looking right back at us, and they were about eight feet high. I know they were eight feet high because there was a post sitting right beside where the eyes were, and the post is eight foot tall. There are actually four post there, made from an old light pole. The people who lived here before us used it as a dog pen, but I just have some blackberry bushes in it and it seems to protect them more from the deer. Not long after that is when I actually saw it. It was early fall and about 11pm. I was outside with one of my dogs/the mixed breed. He saw something and was looking down into the valley, so I started looking as well. I have the yard fairly lit up, and the moon was putting off quite a bit of light. A large doe walked by right on the fringe of the light, about 25 yards from where I was standing on my driveway. A few second later. it walked by, right behind the doe. It came from behind a cedar tree, walked through an open area about 30 feet, and vanished behind another cedar tree. I had a side view of it for all of those thirty feet. It was the same height as the tree it vanished behind, and I later measured that tree at eight feet tall. The whole body was covered with hair about two inches long, but the hair on the head and neck area seemed to be pointed in the same general direction, and just a little longer then the body hair. It either had no neck, or the hair kept it covered, as it looked like a block shaped head sitting on the shoulders. The creature's arm moved as it walked, it made no noise at all, and it walked very much like a man, only much too fast to be a man in some kind of suit. A man would have to run to move that fast, and this thing was walking, and walking deadly silent. I'm pretty sure the doe had no idea it was there, as she was just casually walking along. The creature never dropped to all fours, and I don't believe it is even possible for a bear to walk on two legs that easily. This thing had no problem walking on two legs, and did so as easy as a man. In-fact, it moved a lot easier than a man could through that area. From my side view, I could also see that it had no snout like a bear, and the face seemed to be flat. The body was huge and bulky, yet moved easily and effortlessly. I would estimate it at five hundred pounds, easy. I'm a big guy and it was two feet taller then I am, and the arm I could see looked to be around three times bigger then my own. It was big.  The chest area was not shaped like that of a bear either. It was much more flat, as in up and down, and did not protrude outward like a bear on its hind legs. You could see this things huge muscles moving as it walked, even in the low light. I fought with myself over what I saw, but I saw what I saw. It could not have been anything else. I had much too good of a view. I have no intentions of trying to harm it, but I don't go outside at night without my shotgun anymore, and carry it with me if I am even going to be away from the house in broad daylight. The next day I went down to where I saw it, and found a partial print that was twice the size of my hand. It was that back half of the foot, and I can not even imagine how big the entire print would be. I wanted to make a cast of it, but have no idea how to do that. I looked up how on the internet, but didn't have the items to make the plaster. I do have some pictures of human-like feces I have been finding around the farm. I have also had some blackberry bushes just completely vanish, and one of the piles of feces was found right where the blackberry bushes vanished. I don't think I took a picture of the partial print because it wasn't very defined in the hard ground. I may have, but will have to check my old phone. There is more, but I think I have covered most of what I can remember. I started keeping a journal, and have the dates and times to some other things that have happened as well. It seemed to have vanished for most of this summer, but now seems to be back for about the last month. I had gotten a little lax, but wont be after those calls tonight. They very much sounded like some sort of challenge being issued, and I felt it in my bones. From what I gather, it seems to come up from the river area sometimes, and even tonight when I heard it off in the distance, it was heading back towards the river. I have no proof, but it is my opinion that it comes up here to hunt, or feed on the berries that grow everywhere.",
  "classification": "Class A",
  "county": "Jessamine",
  "state": "Kentucky",
  "location_details": "Please do not post this online."
}