{
  "reportId": "20981",
  "title": "Two Fishermen describe a possible bluff charge outside Wellborn",
  "date": "1994-06-15",
  "observed": "A friend and I were fishing for catfish in a creek at night (unsure of the time). One of us had brought along a flashlight and a pellet gun for snakes (the flashlight later ran out of power). We had been fishing for a little while, even after the flashlight had died, by watching the tips of our rods for movement. We were talking about something, when my friend Daniel heard something, and asked me \"Did you hear that?\" I said, \"Hear what?\" (I thought he was joking & trying to scare me) He responded, \"Listen, there it is again\". At that moment we were both quiet for about 3 to 5 seconds. I then heard something moving off towards the northwest (I would guess about 100 feet). We couldn't see anything because of the density of the woods around us. Initially I thought that it was problably a cousin that had walked back to where we were, but realistically I was attempting to rationalize the situation. It was walking towards us, slowly, but fast enough that it made no break in the sound produced as it walked through the leaves. I said,\"Hey, who's there? (at a moderate level of voice because we had been whispering before) As soon as I spoke, the thing stopped (you could hear it stop walking as it reacted to my voice). I then thought, maybe it's an armadillo, just as my friend asked, \"What the hell is that?\" I responded, \"I don't know!\" Before I was through saying the word \"know\", this thing bolted towards us, and it sounded like it was running as fast as an average man could run through the woods. We both freaked out and screamed as this thing ran towards us, now realizing that this wasn't an armadillo. When this thing got about 20 feet from us, a surprising thing happened; the things split (there were two of them). One ran past me towards the southeast, and the other one ran off towards the southwest (you couldn't see crap, but you could tell that they were big and massive by the sounds they made when they hit the water, splashing as they ran, hearing them leave the water and then breaking fallen tree limbs and stuff as they continued running [deer don't do this]. We both stood there in fear and disbelief, listening to them until they were about 150 yards away, before we ourselves started running in the opposite direction. With no bears in the area (especially ones that are bipedal), there was only one explanation for what was out there with us that night.",
  "classification": "Class B",
  "county": "Suwannee",
  "state": "Florida",
  "location": "-82.87125,30.26682",
  "location_details": ""
}