{
  "reportId": "580",
  "title": "",
  "date": "",
  "observed": "I will post my story, although I am not sure what it was that I heard. I was counseling at a summer wilderness camp one summer after college and was up late one night talking with two campers and a co-counselor.  We were sitting in the middle of a dead-end dirt road, surrounded by a small farmer's field, small lake and very thick woods and hills.  We heard a horrible screaming  coming from the woods next to the field, about 50 feet away.  We all jumped up and immediately shined out flashlights in the direction of the sound but did not see anything.  The night was too dark and our beams too dim.  The girls got scared and ran into the cabin to hide.  My co-counselor and I stood outside for about a 1/2 hour listening to the screams, which came at intervals throughout the entire time.  I have never heard anything like it.  It sounded like something screaming in death.  I cannot describe it; it was a very large sound.  I am an outdoorsperson and know the sounds that most animals make, and I had never heard anything like that before and had never heard anything since, until I was browsing around on your website and discovered your recorded sounds.  I downloaded the most recent scream (not the howl) and it sounded exactly like what I heard that night.  I listened to it over and over again to be sure that it was the same sound and although I am not certain what it was that we heard that night, it certainly is the same scream.  We heard it for only about a 1/2 hour that night; there were no answering screams.  I heard a similar scream about a week later from a distance away.  This time I was alone.",
  "classification": "Class B",
  "county": "Somerset",
  "state": "Pennsylvania",
  "location_details": "I don't remember specific directions, although I-76 is not far.  The nearest small towns were Boswell and Jennerstown.  They are too small to be on most maps.  The area was in the Laurel Mountains.  There are a few ski resorts (some closed down), retreat cabins and very thick woods with many backroads.  It is a very hilly and wooded area."
}