{
  "reportId": "44721",
  "title": "Motorist nearly collides with a large white animal at night near McPherson",
  "date": "2014-03-29",
  "observed": "On 3/29/2014 at approximately 9:42 pm (I know this because of cell phone records) my daughter and her friend and I were coming back from a trip to Manhattan, KS on Burmac Road between McPherson and Burrton, KS after the S curve in the road.  I remember seeing the lights of a home in the distance and out of the corner of my eye I saw something white.  When I turned my head the large white animal was running at a high rate of speed towards my car.  It looked like he was going to hit the passenger side of the car.  This animal was gigantic, when it ran into the ditch it still looked taller than my car which is a 2009 Dodge Caliber.  It looked like this white animal was flying through the air at a high rate of speed.  When it hit the ditch we got a great look at the face and the features and its size.  It was really fuzzy, especially in the face and it had dark sunken eyes and a mouth that was not visible and the nose was not distinct.  The most memorable feature was the eyes....they were very black. It was on two legs but when it approached the ditch it used its front hands/paws for leverage.  It seemed extremely muscular and fit. When I first saw it, my daughter and I were talking, she had just said, omg my phone just died....I saw a flash of light and looked and said what the heck is that........?  My daughter said I don't know and she started screaming.  At this point she said she saw three images the first sighting for her he was on all 4 appendages the second time he was on two legs and the last time he was at the window.  We all agree that there was a ton of fur...!  When I thought it was going to hit the car I grabbed the steering wheel and jerked to the left.  The fur was about six plus inches long and had a weird pattern, I only say this because I am a cosmotoligist and hair growth pattern matters.  When I jerked the steering wheel to the left I almost went in the ditch on the left side.  I looked back but it was gone.........nothing was in my rear view mirror.  I instantly called my ex husband and left a voice mail and that was at 9:42pm he called back at 9:45pm and then told him that what we had witnessed 20 years ago I had just seen again only bigger and without the teeth!  He said I was freaking out and he was right! One of the most noticeable things about what we saw was that right after we saw this creature there was a tractor in a field and after Dutch Ave. there was a fire in a tree line.  When I saw the fire in the tree line my first thought was.........now I know why that thing was running.  At this point I really never want to see this thing again!",
  "classification": "Class A",
  "county": "McPherson",
  "state": "Kansas",
  "location": "-97.41755,38.19744",
  "location_details": "after the s curve and before Dutch Ave intersection"
}