{
  "reportId": "28144",
  "title": "",
  "date": "",
  "observed": "The following on-site interview was conducted by Stan Courtney.  The first name of the witness has been changed. Stan - How long have you been coming to this location? John - A couple months now. Stan - What type of experiences have you had here? John - Well, everytime I've been out here, including the first time, I wasn't out here very long, we started hearing wood knocking all around us in the woods. And in different areas, it was like it surrounded us. And along with the woodknocking we heard what sounded like logs being thrown, usually like heavy chunks of wood tossed. Stan - How many different locations would you say that was, two or three? John -  Oh no, I would say 10 to 20, it surrounds the area. It's almost like there are several of them. Stan - Did you feel like it was being done in relationship to you being here? John  - Yes, I felt like something was protecting the area, and it didn't want us to go into the woods. It seemed like the woods was its area and it wanted to let us know it was in there and to stay out,  that is what I got the feeling of. I got the feeling of fear to go into woods. Stan - Have you had the feeling of being watched? John - Oh definitely, all the time, it's like a set of eyes are on you constantly. I'm feeling it right now in fact. [ The small rural cemetery in Shelby County, Illinois] Stan - What were you telling me about the large cat you saw here? John - I did not see the cat personally, we have heard from the neighbors that there have been a lot of large cat sightings here, including in one tree in this cemetery. We have heard deep cat-like, growl like the little growl they do in the back of their throat, we have heard that twice out here, at two different locations inside the woods. We have heard hissing out here, but we also have heard curding yells, of which I don't know what they were. But, I am an avid hunter and I've never heard anything like it. Stan - Were they loud? John - They were fairly loud. Stan - Did they sound cat-like? John - No this wasn't cat like. This was more of a human-like sound coming from the chest cavity type yell. Stan - And how far away from you? John - I would say 200 yards back off in the woods. We heard those in the same area where something had charged through there and it was something very, very large and it stopped when it got right to the edge of the cemetery. It just like stopped before it stepped foot in the cemetery and we never heard again. We never heard it go back in, it just vanished and we never saw anything either, but it was something big coming through the woods. It was definitely like a bluff charge, but at the time we thought something was going to come out and plow us so I guess what ever it was, was a bluff charge. Stan - And what about the screams? John - Actually they were on separate occasions, the screams were about a week apart, different times. The night I heard the charge is the night we heard wood knocking in the woods back in the same area of the cemetery. I picked up a walnut and I threw it into the trees, and you could hear it going through the trees, I was a baseball player, I threw it quite a ways, you could hear it going for quite awhile. And I would say a good five seconds later that walnut got thrown back and landed three feet in front of my toes. It spooked me pretty bad. But there is nothing in the woods that can throw a walnut back at me. Stan - Any other unusual sounds? John - Yes, there are several other sounds that you can't identify out here, it throws you off guard, you hear them briefly. We've heard some grunts out here, and they're not deer grunts. There is no animal native to Illinois that grunts, they are pretty low but they are definitely a grunt. We've heard a series of three grunts in a row is the best ones we've heard. And it happened to be in the same corner that that thing charged us and I got the walnut thrown at me.  But like I said it seems to surround the cemetery and makes you think there are several of these things and they are protectors, they are protecting their home, whatever they are. Stan - When you come out does something usually happen? John - Every time, I have not been out here when something didn't happen. Which tells me, I just get the overwhelming feeling \"Don't go into the woods\". I don't know why, I think they protect the woods, I think they're saying it's okay to be out here, but don't come into the woods. The thing that baffles me is that when you hear wood knocks or the logs being thrown and when I heard that thing charge, you never hear anything running off or footsteps going with it. It's there and then it's just gone. It's like they glide or something and I know if it was a natural animal I would hear it. I am an avid hunter, I deer hunt, one of the biggest animals in Illinois woods is deer. We know if is the deer and even one deer can sound like a herd of elephants coming through sometimes. And these, whatever this is not making noises when it's moving, it's moving very sneakily, it is very intellegent in my opinion. Stan - Have you ever heard them going through the woods when they are making a lot of noise? John - No, it is always sporadic wood knocking, it can be one second we hear it here and then the second after that we hear it clear across the cemetery. It is like they are communicating somehow, and they are saying \"Ok, I knocked, now you go ahead and knock\", and letting us know they have the whole area covered. You get that feeling that you are being watched and also surrounded at the same time. Stan - Well maybe that will happen tonight? John - I highly expect it to. Stan - Thank you John for allowing me to accompany you to this location and for allowing me to do this interview. John - Thank you Stan.",
  "classification": "Class B",
  "county": "Shelby",
  "state": "Illinois",
  "location_details": ""
}