{
  "reportId": "1526",
  "title": "Couple parked on dirt road encounter hairy, man-like creature",
  "date": "1968-10-18",
  "observed": "On a Friday night, after a date, my girlfriend and I had stopped alongside a heavily wooded dirt road that had been cleared to expand the subdivision where she lived with her parents. The moon was full and the night was very bright. As we talked, I began to feel an odd sensation, as if I were being watched. Apparently she felt something too, because we both suddenly became quiet. I turned to look out the driver-side window of my car, when I looked straight into the dark face of a very large, man-like, hairy creature which had hunched down to stare at us.  It was approximately 6 feet from me. The moonlight shone on the white dirt road behind it, making its silhouette very clear. The oddest thing (as if the creature weren't enough) was that its eyes glowed faintly pale yellow in its dark face. This glow did not appear to be a reflection of moonlight, as the moon was high and to its back. Its shoulders were very broad, and it had no distinct neck - as if its shoulders sloped up to blend into its head. Although stooped on one knee, it was as tall as my car. I noticed all this in a flash (although I'll never forget it), because I quickly turned back to look at my girlfriend.  When her eyes caught mine, she lost it and began to scream bloody murder. That settled it for me - I started the car and sped away. After I left her safely at her parents house, I looked up some friends who went back with me to search for the creature. Within an hour, four of us were back waiting on the road. Dogs were barking everywhere.  We heard cattle gates being rattled across some fields beyond the woods.  We saw nothing. The next day, a friend and I returned to search for tracks. We found none on the packed sand of the road. We did find unusual signs in the woods, but most were indistinct due to a covering of pine straw. Late in the day, as we walked back onto the road, I got the same eerie feeling again.  I turned to look back into the woods. The sun was setting through the woods, and I suddenly saw the creature's silhouette between the pine trees. It was following us - silently.  I whispered for my friend to look. At first he couldn't see it, and moved back and forth to scan the thicket.  The creature mimicked his movements. After it moved, my friend spotted it.  Without speaking, we bolted, ran to my car, and drove off. None of us spoke much about it afterwards, although many at our high school heard about it and bothered us with questions. Except for a few friends, I seldom discuss it with anyone, even now. No one would ever believe it.",
  "classification": "Class A",
  "county": "Angelina",
  "state": "Texas",
  "location": "-94.76362,31.30853",
  "location_details": "USA, Texas, Angelina, Lufkin, West of John Redditt Drive, alongside a heavily wooded dirt road that had been cleared to expand a subdivision"
}