{
  "reportId": "1202",
  "title": "Series of accounts under investigation by the curators regarding reports of a large creature.",
  "date": "1999-04-20",
  "observed": "My older brother and his son decided to try and get a picture of this creature.  They took their 4 wheeler back to the second field that is just behind the one it has been seen in.  The waited for it to walk in.  After some time of sitting they started to smell a horrible stench. My brother stood up to look in the woods behind them and he saw the creature squatting down behind a tree.  My brother then moved to get a better look at it when it stood up and left.  He then went to look for it and saw it foot imprint on some leaves on the ground, he said they weren't very good but he could see that its foot prints where about 5 feet apart. My older brother, his wife and 6 year old son were riding on their 4 wheeler back in old 93 hollow.  It was between 7:00pm - 8:00pm when they saw what they thought to be a black bear walking on its hind legs.  They stopped the 4 wheeler and turned off the engine to watch it. When they did this the creature also stopped and was watching them.  My brother and His wife saw the creature and they looked at each other over a distance of around 200 feet for about 2 minutes.  My sister-in-law described it to me this way.  When it turned to face us, I could see through its legs.  Its legs were not touching together.  Its arms hung down its side just above its knees, and its shoulder and mid drift were real broad.  It had fur from head to toe. Two minutes later the creature took off into a stride across the field with its arms swinging at its side and a slight bend to its form.   At the end of the field it turned and went into the woods.  At that distance they could see it as it walked through the woods.  They figured it to be about 8 - 9 feet tall.  They said it could not have been a bear walking on its hind legs covering the distance it covered in the short time it covered it.   They watched it enter into the woods and then went home.  When they got home their son, scared from what he had just seen, started crying.  He swore to his mom he was never going to ride his bike or motor bike in that hollow ever again. The next day my brother took my younger brother and my uncle back in the hollow with him to see if they could find any tracks this creature had made.  They searched but did not find any, it was over grass and it rained most of the night.  So my older brother gave up and went home leaving my younger brother and my uncle in the hollow.  Shortly after my younger brother and uncle saw the creature.  They were in the same location as my other brother was the night before.  They watched it come out of the wooded area about 400 yards below them and cross the road.  It went down the a hill into a valley where they couldn't see it.  Then suddenly it came up on the other side of the hill and walked along side the edge of the field and entered the wooded area where it did (or another) the night before.  My brother got to see it through his binocular and said it looked like a pro basket ball player but much more muscular with fur from head to toe.  He said all he could see was its back side and it wasn't anything he had ever seen before.  My brother also said he yelled at it but it didn't faze the creature at all. Two days later, in the morning my older brother and his wife went to the same area to go mushroom hunting.  They were in the power lines when they heard a loud knocking on one side in the woods, like someone hitting something on a tree.  Across on the other side, where one old dilapidated house was, they heard something screaming.  My brother described it as a high pitch hunting dog scream.  They said this went on continuously.  My brother started to walk down toward the house to see what it was.  The closer he got the more it spooked him, so he went back and got on his 4 wheeler leaving his wife on top of the power lines.  His wife said when he started up his 4 wheeler and headed down the road toward the house the knocking got louder and the screaming got louder and more intense.  She said the one that was in the woods knocking started crashing through the woods in the direction that she was in, then stopped when it heard the 4 wheeler turning back.  My brother, who turned around because the screaming was so loud he heard it over his loud 4 wheeler, then got his wife and left the area shaken up a little.  They didn't think the creature would be there in the morning, they thought they slept during the day or something. They and other people have gone back to the same area in the two days since the last encounter and nothing was found or heard.",
  "classification": "Class A",
  "county": "Marion",
  "state": "West Virginia",
  "location": "-80.11329,39.54114",
  "location_details": "Marion County West Virginia. (near the border of Monongalia County, along the Monongalia River) Near the small towns of Rivesville and Jordan.  The nearest road would be Rt. 19. (Exact location is being kept confidential per witnesses' request.)"
}