{
  "reportId": "1597",
  "title": "",
  "date": "",
  "observed": "I am 25, and have 2 younger brothers, 9 and 14. I wanted to take them camping, just a simple outing so we chose that spot even though there are no trails as it is not too far from home and was easy to get into. Durring the evening while making our campsite, near an area where an old logging road or something was, as well as near where a tornado had recently gone through and knocked trees over, my brothers told me they heard some funny noises. I told them it was likely the road far away or something and did not pay much attention. Latter that night while toasting marshmellows, we heard what sounded like a fairly large animal close to us. I am a seasoned camper and thought it odd that a larger animal such as a dear or something might approach us and the fire so close, and thought it might have been a bear, or maybe a racoon. I have a high powered 5 watt spott light which I got out and scanned the woods arround us, but saw nothing (there were some brush and things that something could hide behind if it was trying. We then kept hearing the noises, but each time I would turn on the light and scann arround, we saw nothing. I found this odd as I have never known an large animal that was smart enough to come arround a campsite repeatedly and still remain hidden--other than a human. Then we went to sleep--my little brothers were luckaly not too nervous, and I was starting to get the clue that this might be a sasquatch incident, and as I have heard they are peacefull I was not too worried. Durring the night I was awakened by the sound of whatever was there, very distink noises, like a cross between a person, ape and ??, it was repeating a calling sequence with a deffinite pattern, sounded to be 30 yard away perhaps, something like \"hhum-umph hhur-umph\" etc, but the consonants were not well defined, it was very gutteral. The next time I was awakened I heard it start the sequence with a very load yoddeling or something, then the same pattern as before. Then another one responded from a quarter mile further perhaps, then another one responded even further--they were deffinitely communicating. I was quite nervous, as I also had a strong sense that at least one was very close to my our tents, and my little brothers were not in the same tent as me, but I called to them and they said they were fine. In the morning We discussed it, and they though it was a sasquatch without me suggesting it, though I had already concluded that was the most probable. We heard them again while having breakfast, and both my brothers saw something though I did not. We all had monoculars, and my one brother saw something near some bushes--he said when he looke at it it froze, then ducked deeper into the shadows. We all stated walking in that general dirrection, but stopped when we heard a load rock crashing down about 25 yards to our left. We left a granola bar for whatever they were and when we finally left, we found no foot prints, although the ground was hard and we did not stray from our orriginal trail. I am going back this weekend to look for more evidence.",
  "classification": "Class B",
  "county": "Otsego",
  "state": "New York",
  "location_details": "New York State, Otsego county or close by Susquahana State Park near Crumhorn Mountain"
}