{
  "reportId": "11407",
  "title": "Two young men camping in the high country, hear vocals",
  "date": "1985-10-27",
  "observed": "Sir, A good friend of mine and I were camping up on the Kern Plateau, a massive area 7,000 feet-plus in elevation on the western flank of the Sierra Nevada above the Kern River in late October 1985, (Peppermint Springs Campground is closest location). We had driven by 4X4 truck for approx. 2 miles back in from the highway. We wanted to be alone, away from a formal camping area as we had firearms and planned on doing some \"plinking\". However, we discovered that there were                other \"campers/hunters\" in the area-- but none camped close. One gentleman even joined us for dinner, as he hadn't eaten in a couple of days. He was friendly and said he worked as a handyman in the area during the summer season. As night fell, we heard several vehicles pulling out, going back toward the highway. The temperature began to drop rapidly. Later that evening, perhaps around 8:30 pm, my friend and I were sitting by the campfire sipping beers and listening to a bit of country/western music when suddenly... my friend said to me, \"Do you hear that?\" I turned down the music to listen. What we heard was un-godly. It was a loud, shrill-pitched scream. A combination growl/scream, really, that echoed for miles throughout the woods, and it wasn't human. At first, I thought it must be some drunken hunter howling at the moon. But, it was far too loud and intense. We listened again.... and again it sounded, this time closer. It was quite simply bone chilling. We immediately turned off the music and grabbed our firearms, rechecked that they were loaded and, frankly, just sat there stunned. We were armed with a 30.06 rifle, a 12-gauge pump shotgun, and a pair of .22 caliber pistols. This did not make us feel secure. It was that profound of an experience, the kind of episode where the hair on the back of one's neck stands straight up. The entire forest, I mean everything, shut down completely when this creature made those horrific screams. It remained for the rest of the evening. We also felt like something was \"close\" to us. There was just this subtle, palpable vibe. To put in perspective how spooked we were (because we heard another short series of screams around 11:00 pm) we both slept with the guns literally under our pillows. My buddy refused to sleep by the fire, instead preferring to sleep in the back of my Ford pick-up. I am an experienced bow-hunter/outdoorsman with many years spent in the wilderness hunting and camping. This is the first time I've ever related this story in print, although I have told it several times to friends. At first, they laugh, but as I go into detail they can see quite clearly that I'm not exaggerating. This was a very strange incident, indeed.",
  "classification": "Class B",
  "county": "Tulare",
  "state": "California",
  "location": "-118.5347,36.05361",
  "location_details": "Above Kernville, CA  Highway 190 north area--  Peppermint Springs Campground was within several miles of our wilderness camp."
}