{
  "reportId": "10867",
  "title": "Youths have daylight sighting in wooded area of Sarasota.",
  "date": "1981-08-07",
  "observed": "Me and my brother and our cousin (11, 10 & 12 years old at the time) used to frequent a neighborhood across from ours called Acorn Circle. It was a heavily wooded area that only had about three homes at the time. On the Southeast side of this neighborhood there were no homes at all and was especially a favorite spot of ours to play since it had a few curiosities about the area. Just to describe the location a bit; this wooded area had a nice canopy of trees and was somewhat darkened even in the bright daylight. There was this large mound of eroded dirt that had a patch of sunlight directly coming through the tree canopy. About 15 feet away there was a large drainage ditch that was about five foot across and four foot deep, someone at one time had placed a log across this ditch in order to cross it. On the other side there was an old VW bug and van that had been there so long that small trees were actually growing up and through them. Further back from this was the scarce remnants of a burned down house, we rarely explored back further than this due to the increasing darkness, heavy foliage and swampy ness. On the day this sighting occurred my cousin and myself were playing on the dirt mound with our matchbox cars while my brother explored just a short distance away to the left of us and the VWs. Suddenly we were jolted to the sound of a loud crack as if someone had stepped on a stick; we immediately looked to the direction of the VWs where the sound came from. There approximately 10 feet to the right of them was a large human like figure. I roughly estimate that it was around seven feet tall; its color was not really distinguishable due to the poor lighting. Its right side was slightly obscured by some small trees on the bank of the ditch. We stared at it for about a minute or so and then started conversing with each other wondering who or what this thing was that was just standing there watching us. I remember one of us supposing it was a bear standing up but that was quickly batted down since shoulders were clearly visible, it simply looked like large hairy man. None of us recall seeing a face or any other clear details considering that all that was really visible was a jagged hairy silhouette against the dimly lit woods. At one point I remember saying “I bet it’s Bobby (an older teenager that lived in that neighborhood) trying to scare us” I shouted: “Hey Bobby stop playing around, we know it’s you!”… but no response. Then one of us yelled out; “ok ok you can come out now, stop trying to scare us whoever you are”… again no response. As we continued to stare it slowly moved slightly to its left fully exposing itself from behind that small clump of trees, as it moved it raised its left hand up and outwards in order to grab a tree branch while at the same time leaning forward as if to get a better look at us, my brother said that when it did this that from his particular angle he could see long hair dangling from its arm. At this point we all ran as fast as we could and have never returned.",
  "classification": "Class A",
  "county": "Sarasota",
  "state": "Florida",
  "location": "-82.46557,27.28518",
  "location_details": "Southeast corner of Acorn circle; Just below and to the right of the star on this mapquest URL:(*Note - Honore Ave went through years after this incident)"
}