{
  "reportId": "6631",
  "title": "",
  "date": "",
  "observed": "On this day, myself, a friend, Eddy and 2 girls, felt like taking a ride. Before I begin I just want it noted that there was NO drinking or the use of drugs. We decided to go to Plum Island. At the time, the refuge was free to enter and the entire road was dirt. That day there was no one in the refuge, as we drove down the road,  I noticed no cars the entire 6.3 miles of the refuge, it was empty, we drove to the end.  At the last small area to park, I pulled in, across the road was a narrow boardwalk that lead to a 50 foot observation tower. We all went up. We hung around up there for about a half hour, I started hearing noises, first I heard clicking, loud clicking, then short high pitched screams, it sounded maybe 100 yards away. I took a look around, but didn’t see anything.  I noticed there was no one in the area.  I saw no birds or waterfowl.  The sounds went on for about 10 minutes or so, I felt uneasy at this point and said we should go. We all got in my car and started back out. I was only driving for a couple of minutes and I saw a very large dark figure cross the road from the marsh/brush area on the left to the right, which had heavy brush and that lead to the beach.  I immediately looked at Eddy and asked “did you see that?”  He answered “Yes!” We asked each other what it was. The girls in the back seat didn’t see anything s they were to busy talking to each other. I slowed to almost a stop where what we saw it cross the road, there was solid brush that it went into, we could see where something went through the brush. There was no sign of  it, it was gone. The figure that crossed was huge, 7 feet or more, very wide, all black from head to toe. It was a little hunched forward as it walked upright. I noticed its arms were longer than average and they swung as it walked.  It took only three steps to cross the road. The road is about three cars wide. It had a smooth stride. It did not look in my direction,  just crossed the road and it was gone. I only saw it for about 5 seconds I could never forget the image of it crossing the road. I went back there today, my children wanted to see where I had the sighting.  I didn’t make back up the observation tower because of these flies that nest in the marsh, they are Green Headed Flies, they are, as the woman in the office said, “man eaters”.  They bite hard. As you drive down the road, they follow the car, dozens fly around the car. So the kids didn’t want to get out and get eaten by them and neither did I, so I didn’t get up on the observation tower to take a look. I have told a few people what I saw and they think I’m nuts.  My father looks at me strange because he knows I don’t make up stories like this, I don’t lie, so he just looks at me when I talk about it to him. I know what I saw, and I saw what I saw.",
  "classification": "Class A",
  "county": "Essex",
  "state": "Massachusetts",
  "location_details": "The sighting was in the Parker River National Wildlife Refuge in Plum Island. Directions to the wildlife refuge are as follows: Route 1A going towards Newburyport from Rowley, turn onto to Rolfe Lane, there is a sign saying “Plum Island”, you come to a light, go straight, at the end of street turn right onto Plum Island Turnpike, water will be in front of you.  You will pass a small airport on the right, you will soon go over a bridge, you want to take the next right onto Sunset Drive, the marsh will be on the right, follow road to the gate and office, this is the beginning of the Refuge.  The refuge road is 6.3 miles long, and is a dead end.  The sighting was in the Pines Trail Area(very near to the end)."
}