{
  "reportId": "3564",
  "title": "",
  "date": "",
  "observed": "During the summer of 1996 I was living on 83 acres that used to be farmland, now pretty much neglected by the owner.  I was actually living in a trailer that was right next to the road that led to the property. There was a fairly large house, a barn, and the trailer. The rest of the land was wooded, some parts fairly dense. I never felt right there, I'm not sure what it was. I always kept the windows in my room shut, and covered with blankets...for some reason I felt like I was being watched all of the time. There was plenty of land to do whatever with, but I could not bring myself to explore in any way, at least not by myself,  it just felt weird. Especially down the embankment directly off of the road leading to the property.  All of the buildings stood on higher ground... which dropped starting at the road, running behind the trailer where I lived. One evening we built a very large bonfire, about 60 or 70 ft. from the where the land started to descend. The fire had been burning for about a 20 minutes, when I heard an extremely loud vocalization. It sounded like a bird at first, but then upon listening more intently it distinctly sounded like a person shrilly screaming, like that was a sound intentionally being made. I dismissed it, thinking it to be a large waterfoul or something mundane...until it started to circling around us, on the land farther down the hill. It started from an area at the beginning of the property, which was woods and farmland all around, behind the trailer, and up further into the acreage. It seemed that whatever it was, was upset about the fire. I don't know any animal that would come CLOSER to the fire if it was upset by it. I thought that I knew what it was, but didn't want to think about it. Later, on a television show, I heard vocalizations believed to be Bigfoot. I actually started to cry, because they sounded just like what I heard. Now I know why I felt so uncomfortable there.",
  "classification": "Class B",
  "county": "Franklin",
  "state": "Pennsylvania",
  "location_details": ""
}