{
  "reportId": "15430",
  "title": "Mother describes possible sightings by her children outside their rural home in Auburn Township",
  "date": "2006-08-04",
  "observed": "We moved to this location two years ago.  We only lived here a few weeks and my four year old came running into the house and said he didn't want to play outside anymore.  He seemed upset but not extremly frightened. When I asked him what was wrong he said he saw a monkey man looking at him through the trees.  I went out and nothing was there.  I looked around the area but didn't see anything.  My son took me to the tree and showed me where someone or something was looking at him from between a fork in the tree. That was two years ago.  Yesterday my oldest son aged 15 was standing in the living room and glanced out the picture window. He said something huge and black ran from some trees we have there to beside the garage.  I was kidding and said, \"Is it bigfoot?\" And he said very seriously, \"yeah, I think it was.\"  I ran out the back door which is toward the opposite side of the garage than where whatever it was would be standing.  I ran behind the garage and to the other side but nothing was there.  I live near a heavily wooded area and the woods are close to the house behind and to one side of it.  The garage blocks the veiw of the yard and you can only see the front/side from the window. Whatever it was would have had plenty of time to run into the woods. Tonight my son's friend Bobby was visiting for the night and was outside getting things ready to build a fire when he called my husband from his cell phone to the house.  He thought my husband or son was playing a trick on him and trying to scare him.  He told him to come out and when my husband went out to him Bobby told him something big was running from tree to tree looking at him.  He said it was black and even though it was dark he saw the outline of the face.  Which is why he thought it was my husband or son. This would have been about 40ft ending to 20 ft away from him. He said it came from right outside the tree line from the yard and then went into the treeline running from tree to tree looking at him and getting closer to him. Like it was trying to hide from him but still keep an eye on him. When my husband came out Bobby turned away to ask him if my son was playing a joke.  When he turned back it was gone.  They came in and told me so we went out with the camera and took some pictures of the woods in the dark.  I don't know if I got anything or not. Whatever it is, from descriptions given to me, its about 6'-6'4 and since everyone says its about the size of my husband or son...husband is 6' 215 and son is 6' 240.. Note, the porch light was on and you can see the edge of the treeline because of the light.",
  "classification": "Class B",
  "county": "Geauga",
  "state": "Ohio",
  "location": "-81.27506,41.38199",
  "location_details": "Location edited at the request of the witness."
}