{
  "reportId": "24988",
  "title": "",
  "date": "",
  "observed": "Before describing the incident I thought I should give you some personal background. After my family had a suspected nighttime visit from a juvenile sasquatch about a dozen years ago, I’ve developed a keen interest in the subject and have read hundreds of sighting reports in the BFRO site. By learning what to listen for and following up leads, I have identified my own research site in the northeastern US where I have had a string of auditory encounters/interactions that have included woodknocks, screams, stalking, and a possible infrasound experience. I’ve located a number of stick structures on my site. I’ve joined my state BF association for which I have investigated an alleged Class B sighting. I have also hiked other areas of my state in the company of others more experienced than I, and have observed tracks and learned where to look for them. I should tell you that when I have had the experiences described above, such as a scream directed at me in the dark from 40 yards away, or a single baseball bat, hollow sounding “thwok” on a tree just over a slight rise in the terrain at a similar distance, or the stalking foot steps perhaps 50 feet away, my first reaction is to go into denial, with my mind first racing through various possible alternative scenarios to explain the sound. After that, once I have realized that the other scenarios are unlikely explanations, I have a natural tendency to dissociate from the fear reaction, I remain calm, avoid looking in the direction of the sound, and simply move away from the area at a deliberate, but unhurried pace, to avoid showing fear. Often, the fear kicks-in hours or days later. I have never felt threatened during an incident.  I was very excited when I was invited to visit an elderly friend who lives in the mountains of western North Carolina, as I knew there were some notable sightings in the general area as well as a BFRO expedition. I arrived after dark on a Tuesday and discovered that my friend’s summer home is located at the top of a mountain. Her “development” consists of about 60 homes tucked away in the woods on steep slopes accessed via a series of narrow gravel and macadam roads. My first thought was – they built this development in a likely squatch habitat. Apparently an effort was made to keep the environment natural and retain most of the trees. It really was like staying in a tree house. At night time, it was possible to see only the two neighboring homes, one located 50 feet from my friend’s house and the other perhaps 50 yards away. Her house has large picture windows, front and back, through which the occupants could easily be observed at night. Indeed, as we sat watching TV after dinner, I began to have the creepy sensation of being watched, although my friend told me that neither of her neighbors was in residence that night. After the news, about 11:30, I told my friend I was stepping outside from some night air, when in fact my intention was to have a look around and listen to the woods. I took up a position in the shadows on a flagstone walk which spans the front of her house, standing beneath the low overhang of the roof. The area in which I was standing was not well lighted, but I observed that my friend had spot lights facing away from her home on both sides, lighting the space between the homes and partially illuminating the road in front of her house. The front of the house faces up the slope and the house itself sits below the road level. In between, on a slighting higher “terrace” is a curved gravel driveway in which our two cars sat. I peered around the side of the house and noticed the house was on a very steep slope. The front of the house was tucked into the mountainside, but in the back half, the foundation was exposed and the deck jutted out over the slope, supported by several wooden “legs.” I wasn’t outdoors more than five minutes before I was startled by what sounded like answering wood knocks: a single thump that came from the woods at the one o’clock position, followed by another “answering” thump  5-10 seconds later, coming from about three o’clock. The sounds were repeated every couple of minutes for perhaps 15 minutes and it sounded as if the second knock was changing positions slightly. I estimate that they were a couple of hundred yards away from my position. Noticing a wood pile next to my friend’s house, I picked up a thick log and added a third knock by whacking a nearby tree. I noticed that the first knock came again quickly, almost in answer to mine. After few repetitions, the knocks stopped. There was a slight breeze that evening that gusted through the trees from time to time. On one such occasion, I heard what sounded like a small stone hitting the roof that overhung my position. I told myself it was a probably a  tree branch falling on the roof, but when it happened a second time perhaps 15 minutes later during another gust, my eye caught the trajectory of a small stone whizzing overhead from the brush on the other side of the cars and bouncing off the roof above me. Then from the corner of my eye, I caught a flash of something gray moving to my side of the road. I told myself it was my imagination. The wood thumps resumed. This time, I did not feel secure in leaving the shelter of my position, so I did answering stomps on the flag stone. The knocks kept coming but the intervals between them were longer. After about an hour of being outdoors, I decided to go inside. I noticed that my friend kept the lights on all night. Next morning, when I asked her about the lights being on, she said that since her husband passed away about two years before, she worries about someone breaking into the house. There had been some break-ins during the winter one year at the home of a neighbor, which unnerved my friend, even though the perpetrator had been apprehended in the midst of a break-in. I asked about the wildlife of the area and was told that there were plenty of deer and occasional bears were in the neighborhood. Late in the afternoon of the next day, I went for out for exercise, running the steep looping roads around the development. As I set out, I observed that the woods across from the front of the house where I’d been standing on the previous night, had some of the most dense brush I have even seen. As I ran downhill through one of the undeveloped areas, one with a road and a no houses as yet, I had that sense of being observed. I paused at an intersection where two roads intersect with a trailhead, noting that the well-maintained trail on the left side of the road seemed to become a game trail on the other side; however, to reach the game trail from the road, you would have to scale a steep 12-feet high bank after crossing a shallow drainage culvert. Yet the game trail seemed to be frequented by larger animals. Inspecting the bank, I found what appeared to be the impressions of the front three-quarters of two, human-like foot prints jammed into the soft dirt of the bank. I could feel the impressions left by the toes. That night after TV, I again went outside and smoked a cigar this time. I heard the thumps again coming from the same general direction, that is, northeast and uphill from my position. I heard a plaintive, eerie howling coming from the south, behind the house. It sounded every 30 seconds of so for perhaps 20 minutes. I told myself it could be a dog tied outdoors. I decided not to interact that night. I just had a feeling that it was not the thing to do. Finishing my cigar, I went indoors, read a book and turned off the light. I do not know how long I had been asleep before I was startled awake by what sounded like heavy foot thumping on the roof, which was separated from the ceiling of my room by a narrow crawl space. As I sat up in my bed, I heard another couple of thumps that sounded as if they came from the area over the closet. In my sleepy state, I reasoned that perhaps my friend in the adjoining room had bumped the wall in her sleep. Soon I was fast asleep again, only to be scared awake by what was clearly pounding on the walls of my room that was so loud, my first thought was, “Someone is breaking into my room!”  I sat up in bed and threw on the overhead light in my room. Now I remembering thinking, “This has to be a visit from bigfoot” because of the loudness of the sound and the fact that the walls of my room are fairly high above grade, due to the steep slope. I was in a bit of denial about this and was exhausted from the day’s workout on mountain roads at higher than normal altitude for me (almost 4000” above sea level;) although I tried to stare out the window to see if a form appeared,  I quickly fell back to sleep. Then I was awakened again by what sound like hands being slapped on the roof or walls, more lightly this time, and moving in a away from my position down the slope. I did not feel threatened and had a feeling that the maker of the sound was leaving for the night, I had that distinct impression. I heard nothing more. Next morning over breakfast, my hostess asked me if I had been awakened by that that “awful pounding” on the roof. We traded our stories. My friend told me that nothing of the sort had happened before in the 25 years she and her husband had lived in the house. She had had raccoons in the attic of her Florida home, which required the services of a pest control company, but she maintained that she had never heard anything so loud. She was concerned and asked me what I thought it might have been; I pleaded ignorance, and said I would confer with the neighbors, a couple in their late 50s who had arrived the previous night for a stay of a few days. The husband dismissed the noise, saying that it might have been made by critters moving indoors away from the cold. However, I was later told that he checked the crawl space and found no evidence of an animal infestation or occupancy. Before leaving my friend to continue on my trip towards eastern NC, I inspected the area around her house for footprints. I found none, but I discovered that a tall tree grew up through the back deck through a hole that had been cut for it. The tree would provide easy access to the deck and roof, while the low roof in front would make the roof accessible from that position.",
  "classification": "Class B",
  "county": "Mcdowell",
  "state": "North Carolina",
  "location_details": "Do not post location on line other than to say “near Blue Ridge parkway”. Incident happened on private property in an area where vehicular traffic would be obtrusive and cause concerns."
}