{
  "reportId": "6418",
  "title": "",
  "date": "",
  "observed": "I was turkey hunting with a friend of mine on some land on the banks of the Duck River.  I have heard of no reports of Bigfoot in the area nor seen or heard of any signs of Bigfoot around there so this is probably nothing, but this is what happened. There are few houses in the area. There are many small valleys, dense hardwood forests, and a lot of crop land planted mainly with soybeans or wheat.  It was a good place for turkey hunting.  I saw 20 or 30 the day before the season opened.  I was about two miles deep in the woods from the road where my truck was parked.  It was getting dark fast so I started walking back to the truck on a dirt road. It got so dark that I could not see ten feet in front of me.  Shortly after I started walking down the road, something started walking in the woods near me.  It sounded like it was about one hundred feet away.  I could not see it at all.  I smelled no strange smells either.  Whatever it was, it kept a constant pace with me.  At first I thought that it might be a deer because I knew there were no bears in that area.  I wasn't worried about whatever it was at first because it was not coming any closer.  It was just keeping pace.  I still thought it was probably a deer until I heard it step on a fallen tree.  When it stepped on the tree, the tree snapped in two. It sounded like a rather large tree also.  I know this because I lived on a farm most of my life, and we would clear land with a bulldozer and tractors so I knew what different size trees sounded like when they snap in two. When I heard that tree break, that got my attention because whatever broke it was extremely heavy.  I got a little scared too because all I had was a shotgun. I decided to see if it would keep up with me if I ran so I ran for about one hundred yards, and it kept up but got no closer.  I stopped running though because it was so dark I was afraid I would trip or hit a tree.  This thing followed me for about ten minutes and when I started getting close to the road, it stayed further following completely. We slept in the truck all night so we could hunt the next day also, but we heard no screams or strange noises as reported by many people so I have no idea what it was.  The closest Bigfoot reports I have seen are from counties North and Northeast of there.",
  "classification": "Class B",
  "county": "Humphreys",
  "state": "Tennessee",
  "location_details": "Southern part of Humphreys Co. Tennessee.  Nearest town would be Bakerville.  Nearest main road would be Highway 13 This is Northeast of The Tennessee National Wildlife Refuge  (Duck River Unit)"
}