{
  "reportId": "17240",
  "title": "Backpacker hears possible vocalizations near Mt. St. Helens",
  "date": "2006-07-05",
  "observed": "I took a 3 day/2 night solo backpacking trip in Washington state, up the Ape Canyon Trail, around the base of Mt. St. Helens, and through the Muddy River drainage this past July 5th through 7th.   On the  first day of the hike at around 1 pm, as I made my way up the Ape  Canyon Trail, I was surprised to hear a series of \"whooping\" calls, a  series of 5 whoops in a row spaced at intervals of about 30 seconds to  1 minute apart, 5-7 sets over the course 10-15 minutes.  The calls (bwaaahh-bwaaahh-bwaaahh) sounded as if they were emanating  from the bottom of an oil drum, the tone being deep and bodily palpable, even though sounding maybe a mile or more away in the direction of the canyon, and somewhat north of the trail. It struck  me as unnaturally deep and projecting (although not overly loud) and unlike any animal call I had ever heard before (I have hiked and camped in forest and wilderness areas for many years).  I did not hear any  other calls during course of my hike, save what sounded like an  enormous owl hooting near my tent site on the edge of the Muddy River drainage on my 2nd night, at around 2 am.  It was very loud and I was not inclined to get out of my tent for a look-see.  One other thing I found intrigued me though.  On a game trail that slips off of the main trail, just down hill from a ground spring adjacent to the trail 1-2 miles from the trailhead, I came across a couple of downed trees approx. 4-5\" in diameter, twisted or snapped off and laying across the trail in a cross-x pattern. The trees were placed on the trail between the spring and a small meadow farther down the hill.   There were no signs of a lightening strike, no evidence of chopping or sawing was apparent, and the trees looked otherwise healthy and normal, and looked as if they had been pulled over and broken off toward the top of the tree.",
  "classification": "Class B",
  "county": "Cowlitz",
  "state": "Washington",
  "location": "-167.131,46.19328",
  "location_details": "From Cougar, Washington, drive North on HWY 83 to the Ape Canyon trailhead, hike for 1-2 miles, keep a lookout for a small ground spring off the trail downhill to the left.  A game trail runs downhill past the spring"
}