{
  "reportId": "3655",
  "title": "Daylight sighting near rural church on Rt. 31, east of Parkersburg, near Cairo",
  "date": "2001-11-12",
  "observed": "There is a church where I attend services. We were practicing our Christmas play on the evening of November 12th 2001. It was about 8:45 p.m. when we finished practicing, when myself (age 17) and 3 other teenagers (15, 14, and 16) decided to go for a walk, while the adults stayed inside to talk. My cousin ran ahead and hid behind a pine thicket. These pines are in someones yard, they are probably about 12 or 13 ft. tall, and they are all in a row and real close together. Myself and the other two decided to turn back and head toward the church, not realizing that my cousin was not with us. We were to the end of the pines and starting up the church driveway, when she came running out from behind the trees screaming at the top of her lungs and stating that she had seen something. Just as I turned around, I saw a Very Tall and muscular looking figure walk out from the trees, and cross the road. It was about 7 to  7 1/2' Tall and slightly hunched over swinging it's arms well below it's thigh area, almost to the knees. It turned it's whole upper torso area and glanced at us while it was walking up the hillside. After we got into the car my cousin, still very petrified, stated that when she was behind the pine trees, something about 5 feet away from her pulled back a branch on one of the trees as if to get a better look at her. She stated that it's eyes were very far apart and sunk deep into it's face. She said the hand was 3 times the size of my uncles hand,(he is a large man, and he is her step father). She said that the hand was covered on top with coarse looking hair and it had black fingernails. She said she didn't smell or hear anything.  She said the reason was, that her face was so cold and her nose was plugged up and she couldn't have smelled nothing anyway. She said the creature was very tall about 7'-7 1/2' tall and very muscular. It's forehead was sloped and the top of its head looked like it had tufts of hair coming into a peak. Note; (This is exactly the way she described it to my family and hers.)",
  "classification": "Class A",
  "county": "Ritchie",
  "state": "West Virginia",
  "location": "-81.16211,39.21833",
  "location_details": "24 miles east of Parkersburg"
}