{
  "reportId": "819",
  "title": "Sightings by hunting guide in Pike National Forest",
  "date": "1999-09-11",
  "observed": "My name is Jeff [D.] and I live in Colorado Springs, CO. I have been a big game guide for several years and I am in the process of opening my on outfit. I must admit I have always been skeptical about bigfoot until now. Two years ago in 98 I was packing in clients into the Pike Natl forrest. Myself and another guide along with four clients were on our way out and got a late start. With only a few miles to go we were in total darkness along a trail. My horse stopped with out command and got very anxious. I assumed it was another animal or at worst a mountain lion. I eagrly tried to get him to move forward and he would not. I got off my horse and led him up the trail. Coming around a bend in the trail a creature standing at least 7 foot tall and covered in dark hair crossed the trail not twenty feet infront of me. It walked on two legs and was out of sight in two or three steps, but what amazed me was that it didn't make any noise as it disappeared into the very steep valley below. Another thing I found disturbing was the faint smell in the air. I hunt and guide hunters for mostly elk and 9 times out of ten I will smell them before I see them. This was no elk, bear, or mountain lion. After the incident, I was careful to lead the horses to one side of the trail not to disturb any tracks. The next day after getting my clients to the airport I returned on foot and was shocked to find a track, I placed my foot beside it and it was at least another 8 to 10\" past my boot. I wear a size 10. No one has ever spoken about the incident and no one will admit what they saw.I've tried several times to talk about it but know one will admit it.I have held this secret inside until now.Last year while hunting in the same area alone I had a close encounter and was able to observe in length of what I saw that night. I was hunting in a remote camp that is a 1/2 days pack in on foot. No one else hunts this country and I have never seen sign of people in the past. I had made camp at the bottom of a valley that held some remarkable bulls in it. There is a stream that runs through the valley and at the top, it is cut off by large cliffs that unless you are a professional rock climber is un passable. Through out the valley runs a series of beaver ponds and I was camped at the last one at the bottom. I arrived at the valley around 4:00 pm and set up my camp. I started a fire and prepared dinner. After a restless nights sleep, due to the anticipation of big bulls, I woke up at 3:00am and fixed breakfast, gathered my gear and was off by 4:30 or 5:00am. I hiked up the valley to a area I have always seen elk. This particular morning the wind was not coming down off the mountain instead it was swirling. I decided to sit on top of an out cropping and use the height to my advantage and try not to spook any animals. As the sun was coming up, I bugled several times looking for a response. I heard a bull elk respond in the same direction that I took coming up. I quickly started to glass the area in search of the bull. As I was working my way up the valley I heard the bull again. I went with my glasses to where I thought I had heard the bugle and when I glassed around the beaver pond that's when I saw it. I saw a very dark object squatting beside the beaver pond. At first I hought it was a bull lying in the pond. The creature stood up and was looking around. When he looked at me or in my direction, I got the feeling he knew I was there, and a feeling of excitement and terror filled my body. The creature was again around 7 foot tall maybe taller but not much.And it had short dark brown almost a reddish coat. It had facial features of that of a human, with the exception of a human nose. It was smaller and looked as if it sat on his mouth.Another feature that stood out to me was the size of it's hands. They were long and were like 1/2 the size of it's forearm. For the first time ever I was truely scared. Not of what I saw but of not ever really seeing anything like this before and having to face a reality. After at least 5 minutes of observing the creature he turned and walked through the creek towards my camp. He then turned and walked up a ridge and stopped and watched my camp or at least in that direction. After he moved off I got down off my perch and ran to my camp. I packed my gear and have yet to go back in there.",
  "classification": "Class A",
  "county": "Teller",
  "state": "Colorado",
  "location": "-105.1058,38.8922",
  "location_details": ""
}