{
  "reportId": "7802",
  "title": "Teenager hears vocalization at night and has possible sighting not far from Sabine River.",
  "date": "2004-10-03",
  "observed": "There are three incidents in roughly the same location to report.  These incidents happened on our friends 400 acre ranch. During the first incident, my son, 14, was invited to his friends ranch earlier this summer or fall, 2003.  The closest city to this ranch is Tyler, TX.  The ranch is very large and out in the middle of nowhere.  This area is a very wooded area with some hills and trails. On the first occasion my son and a friend were riding on a 4-wheeler on a trail where there was a fence running parallel with the trail.  My son said they were going approx 20 miles an hour and he could hear loud footsteps keeping pace with the 4-wheeler.  His friend who was on the back said that he also heard the footsteps and could see the trees \"moving\". On the second occasion, my son was invited to go camping on the ranch with his friends from his youth group.  They were driving the 4-wheelers up to the camp spot after dark.  The camping spot was roughly the same area where the first incident occured 3-4 weeks earlier. Coming around a corner, my sons friend said the lights from the 4-wheeler picked up \"glowing eyes\" about 7 feet above the ground that my sons friend saw.  The friend said that he didn't see great detail other than the \"glowing eyes\" and a bushy or hairy face. The latest incident at the same ranch occured at around 12:00 am at night on 1/15/04.  My son and his friends were riding 4-wheelers again and one of the 4-wheelers got stuck in the mud.  My sons friend went to get a chain or rope to pull the 4-wheeler out of the mud.  My son said he heard a loud moaning sound off in the distance.  His friend who was with him did not hear it because he said he was thinking about something else and wasn't paying attention. My son described it as one long moan.  He called me the morning of 1/16/04 and told me about it.  I remembered the BFRO website and knew there were sound recordings there that we could compare. On 1/19/04, we listened to the four recordings on the BFRO website and my son indicated that it sounded exactly like the one with the 3 long, deep moaning sounds with the dog barking in the background. We have always been interested in Bigfoot.  Our next step may be to take a recording of the moaning sounds out to the site at night and play them to see if we can generate a response.",
  "classification": "Class B",
  "county": "Smith",
  "state": "Texas",
  "location": "-95.41817,32.51556",
  "location_details": ""
}