{
  "reportId": "10034",
  "title": "Hunter hears wood-on-wood knocking",
  "date": "1989-11-04",
  "observed": "This incident took place during the first Oregon elk season in 1989.My hunting partner had business to tend to in town and had to take leave of our camp for a day.  He had taken my truck and left me at camp with his truck and camper. I departed camp on Saturday morning, proceeding at a slow pace to the north/northwest.  Neither of us had seen any elk since opening day, the previous Wednesday, so I wasn't hopeful of success that day either. I had proceeded a short distance, less than a half mile and one hour elapsed, when I became aware of a sound that captured my interest.  It was the sound of wood on wood striking.  Upon hearing the noise, I paused to evaluate its possible origin.  It seemed to be between 200-300 yards distant. I at first thought of somebody chopping wood. There is an unimproved road that travels the approximate route I had taken.  However, that road starts where I was camped and nobody had been by in a couple of days.  Also the sound was in groups of 3 or more whacks.  As fast as you or I can say aloud, \"whack, whack, whack\", is as fast as the sounds were materializing.  I deduced that to rule out chopping wood with an ax, as someone using an ax typically takes a full backswing and then must extract the ax from the piece.  Both of those acts take too much time to explain these sounds. Later, my dad said he thought it must have been forest grouse.  I tentatively took this for the truth until I myself heard forest grouse a few years later and the sounds were not the same. The sounds continued, never varying direction, but always staying ahead of me as I walked, though I was catching up.  Finally, I reached a place where the sounds were no more than 50 yards distant, though the maker remained hidden by a rise on the opposite side of the intermittent creek I was overlooking.  I sat down on a log to plan my next move and the sounds continued.  There was just something so unusual about them that I was becoming very uneasy.  I decided, in spite of the .300 Winchester magnum in my hands, to retreat to F.S. 16 and return to camp. I was so shaken by what I had heard that I stayed in the camper the rest of the day to await my friend's return late that night.  Later in the afternoon and into the night, I repeatedly heard a noise like a vehicle crossing a cattle guard at low speed (20mph).  It was a low rumbling sound. Indeed, there is a cattle guard on F.S. 16 that can be heard from the camp site and initially this is what I thought I was hearing.  What is noteworthy is that this sound was not coming from vehicles on the road.  I could also easily hear and see trucks on F.S. 16 and few occurrences of this noise could be attributed to passing vehicles. These noises continued into the night until I went to bed.  My friend returned and the rest of the trip came off without incident. For years, I tentatively assumed that what I heard had a generally recognized origin.  In June of 1995, an interest feature on Bigfoot in the Oregonian newspaper described \"tree whacking\" as a communication medium of Bigfoot creatures.  At that point, I was quite certain of what I had heard. ",
  "classification": "Class B",
  "county": "Crook",
  "state": "Oregon",
  "location": "-120.2782,44.0639",
  "location_details": "This occurence took place in the Ochoco National Forest in the Maury Mountains.  The incident was below the Tower Point fire lookout, near the intersection of F.S. 16 and F.S. 1750"
}