{
  "reportId": "2430",
  "title": " Incident near a horse corral in the mountains of eastern Kentucky, 10 miles north of Hazard.",
  "date": "1977-07-01",
  "observed": "I was young about 12 or 13 and I had gone to spend a few weeks with my uncle and cousins, they lived in a secluded area. Only our family lived in this holler and the houses were fairly spread apart. Well my uncle worked night shift in a mine down the road so that left me and me cousins and aunt at home nights alone. It was a clear hot night about 11:30 PM my cousin  and his mom and me were the only ones up and we were watching TV Just about 30 ft from the back door there was a corral with my cousins pony in it. We were watching TV when all of a sudden the pony went absolutely crazy so bad we all jumped up to see what was going on. Just by the way it was carrying on we thought it was a bobcat in there with it (which isn't unusual to find around there). Me and my cousin both grabbed frog gigs and thought we would just go out and it would run off, feeling real confident we went out and when we rounded the porch and could see we both just about messed our pants. It wasn't a bobcat. It was big and it was on the other side of he corral headed away like it heard us and was leaving. I swear this to be a true statement. It stepped over a four rail fence as I would one of those things you put in a doorway to keep a child out. All I ever saw of it was it's back, it never looked around at us. It stepped over the fence and in a mere moment it crossed the dirt road and leaped across the creek and up the side of the hill. After it left the corral and the light wasn't so good it was by knowing the terrain and the sounds that it made moving, is how I know what it did.I had another cousin who lived around the bend in the direction it went who's dog disappeared that night. It was chained up and the chain was ripped out of the dog house so if what ever it was took the dog it took chain and all. No way that dog did it and a person wouldn't have had the brute strength to do that, it was a strong setup. Remember I was 12 or 13 and we didn't know much about bigfoot or such. But I promise you that thing was 7 to 9 ft tall and as wide as 2 men standing shoulder to shoulder. No sound as heard as far as a scream and no smell was noticed but we sure saw something and it wasn't a bear, my family was and is raised in the woods and we are all good woodsmen even at that age we had spent all our lives hunting, fishing and exploring those hills and this was something very unique.I thought about someone playing a trick on us but everyone knew that if you did something like that you could easily be shot and I have no doubt that it was a real animal. I didn't sleep at all that night and I wasn't really afraid ( I was but I was more curious) it left a feeling that night that I can't explain. We looked for foot prints or anything the next morning but all we found was where it jumped the creek and dug in to the hillside going up it. Not much more than a big slide of dirt. No one ever said they saw it again and no noises heard. It was really dry and dusty that time of month. I won't really talk about this much because no body I tell other than my family believes it. But I wasn't alone when I saw it and I know what I saw.",
  "classification": "Class A",
  "county": "Perry",
  "state": "Kentucky",
  "location": "-83.25562,37.37814",
  "location_details": "It is in the mountains of Eastern KY,about 10 miles north of Hazard. If you travel south out of Jackson towards Hazard hwy. 15 is about 20 miles down on the right,you take a right and go about 4 miles to the holler my family lives in. Very dense area almost cant walk around because it is so overgrown"
}