{
  "reportId": "10934",
  "title": "Young family on afternoon outing find footprints east of Pendleton, Oregon",
  "date": "1996-04-30",
  "observed": "My husband and I lived in Walla Walla, WA during the '95-'96 school year, and often went exploring in the nearby Blue Mountains.  Nearly every little diner and gas station seemed to have \"bigfoot\" plaster casts on the wall that \"were found 1 mile from here.\"  I thought it was all a big joke intended to boost tourism.  I did NOT believe in Bigfoot. One Saturday we were looking for an out-of-the-way place to explore where we wouldn't run into anybody.  We were driving down a remote track, maybe it was an old logging road, and finally had to stop when it crossed a large stream that was too deep for our little Geo Metro.  Since we were miles from the last sign of civilization, and since we couldn't go any farther, we decided to do some exploring right there. I remember getting out of the car and immediately feeling an intensely eerie sensation of being watched.  It was the kind of \"being watched\" that made the hair on the back of my neck stand up.  I've never experienced that feeling either before or since.  The really odd part was that I could pin-point exactly where I thought I was being watched from, even though I couldn't see anything.  Just on the other side of the stream was a small, steep, tree-covered hill.  The weird sensation of being watched was coming from a point about half-way up that hillside, probably 40 feet from the stream. I knew there wasn't anybody else out there because we were so far out in the wilderness, so I figured it was all in my head. We started poking around the streambank (the stream was probably 15-20 feet wide) looking for Indian artifacts, animal tracks, wildflowers, anything interesting. The ground was soft enough for our car tracks to leave a bit of an indentation in the ground, but too firm for us to leave any tracks.  It was very grassy and weedy along the stream banks where we were. After about 20 minutes of poking around, I came across a huge footprint indented about an inch deep in the grassy ground.  It looked like a flat-footed human print complete with 5 toes but it was approximately 16-18 inches long.  And it made an indentation in an area where, at 150 pounds, we couldn't make ANY tracks. I couldn't believe I was really seeing this footprint, so I called my husband over to verify it.  He confirmed that I wasn't seeing things. I briefly scouted around and found 2 more tracks but by this time I was really getting scared.  Those huge tracks coupled with that eerie feeling of being watched nearly unnerved me.  We practically raced each other back to the car, and by that time I was on the verge of panic.  I just wanted to get the hell out of there.  I was also an instant believer in Sasquatch. A friend later asked me if I'd gotten pictures of the tracks.  I told her that I couldn't remember if we had a camera in the car but that even if we'd had, you couldn't have paid me to have gone back for a picture.",
  "classification": "Class B",
  "county": "Union",
  "state": "Oregon",
  "location": "-118.0603,45.80374",
  "location_details": "Upon further discussion with the witness' husband, it was determined that the incident occurred east of Pendleton, OR in Union County.  Witness could not pinpoint location off existing maps due to the many years since the incident."
}