{
  "reportId": "7870",
  "title": "Frightened teen deer hunter feels stalked by large hairy bipedal animal",
  "date": "1996-10-01",
  "observed": "We were camped at an old abandoned mining town and mine near Deadwood Res. in Oct. 1996. Our son had an encounter with an unidentifiable being. My husbands company was helicopter logging near an area that was once an old town and mine out in the forest. It was opening day of the deer season, and our son, who was 14 at the time, got up early to go hunting near camp. We were near Deadwood River, which was little more than a creek. He took out with his rifle to see if he could get a buck that morning. He crossed the river and went up a hill to where he could get a better look at the river and flats below. Our pilots were camped down the river about a quarter mile from our camp.As our boy was looking down towards the pilots camp, he observed what he thought was a bear down on the flats near the river. He thouht that it was a little unusual that the 'bear' was walking very steady on it's hind legs more like a human. The more he watched it, the more uncomfortable he began to feel. As he was watching it, it suddenly looked up and started staring back at him. He felt sudden fear race through him as he felt it's eyes lock onto him. He told us that he has never felt that feeling before or since then. He said that it was very dark in color and was very tall and hairy,  After it had stared at him for a time, it proceeded in walking towards where he was standing. Realizing that it was moving in his direction, he turned around, and started racing for camp as fast as he could. When he got to camp, he ran into our fifth wheel trailer, shut the door and locked it behind him. He then closed all the curtains and blinds. He was absolutely scared to death that the thing that he saw was coming to get him. He wouldn't come out of our camper at all until I took him home two days later. He kept the door locked all the time, and the curtains drawn, even in broad daylight",
  "classification": "Class A",
  "county": "Valley",
  "state": "Idaho",
  "location": "-115.5833,44.41666",
  "location_details": "Scott Mountain Road, North east of Garden Valley, Idaho, near Deadwood Res.  Go about seven miles north of res. to the old abandoned Deadwood Mine on the east side of the road. There, you will find two old buildings that served as an office and boarding house for the miners. No one has lived there since the forties."
}