{
  "reportId": "7785",
  "title": "Family in small boat hears animal retreating and finds prints",
  "date": "1963-07-15",
  "observed": "I have been reading your site for the last couple of years, and thought I'd share some experiences I've had over the years. Nothing particularly groundbreaking, but it may add to your database. I have been interested in Sasquatch/Bigfoot since I was a small boy growing up in Central Oregon hearing stories from my uncles and their friends about the goings on in Northern California in the 50s' and 60s'. While there was a lot of skepticism about the possibility of such a creature existing, there was also an underlying acceptance of the possibility that it could exist. My family, and most of the people I knew, spent a lot of time in the woods hunting, fishing, and camping. My grandfather and uncle were expert hunters and woodsmen, and taught me those skills from the time I could walk. In the first 20 years of my life, most of my free time was spent hunting, fishing, camping, hiking, and exploring the wild areas around my hometown. In 1963, my grandfather, mother, brother, and I hiked in to Teddy Lakes in the Three Sisters Wilderness area to go fishing. In those days the Forest Service kept a wooden rowboat at the lake for people to use. We took the boat out and fished for awhile and decided to explore the far end of the lake. There is a small cove at that end of the lake with an island at the mouth of the cove. The cove itself is shallow and swampy. As we rowed around the island we could hear splashing on the other side, and thought maybe had disturbed a bear or an elk. When we rounded the island, the animal was gone, but the ripples in the water were still evident. We took the boat over to the shallows to examine the tracks the animal had left to determine what it was.  Most of the area between the island and the shore was maybe 5 or 6 feet deep up to within about 50 feet of the shore where there was about a foot  of water over soft mud. What we saw has stuck in my mind for the rest of my life. There was a clear line of tracks where the animal had emerged from the deeper water and walked through the shallows leaving very deep tracks on the mud. It looked like the tracks of a very large man, only wider, longer, and deeper. It was clearly the trail of a two legged creature taking large steps leaving about a 15\" track very deep in the mud. My grandfather and I pondered those tracks for a long time trying to come up with an explanation for what made them. All I can say for absolute certainty is that it was not a bear, elk, or any other animal known to live in the area. We tried to follow the animal into the woods, but lost the trail in the deep forest litter. The reason those tracks have stuck in my mind for so long are two fold. While I was only 9 years old at the time, I had spent several years learning the tracks of the animals in the area, and felt very confident in my ability to identify the maker of the track, when it was made, where the animal was going, etc. I had absolutely no idea what made that track. My grandfather, who was an absolute expert hunter and tracker also could not identify those tracks. We had many discussions over the years as to what that animal was, and never did come up with a plausible explanation. As I have learned more about the Sasquatch from reading books over the years, I have come to think it might have been our elusive furry friend. Another important point is that before rowing over to the island, we had been fishing in the lake for an hour or so talking most of the time. This is a small lake, and any wild animal would have heard us and left the area well before we rowed to the island. The tracks were made by a very large animal. The large animals known to exist in the area are bear, elk, cougar, and deer. All of those animals flee at the first hint of people. It is true that cougars will occasionally observe people from concealment, but I have never known one to swim out to an islad to watch people fishing in a boat. Whatever the animal was, it was watching us from the island and only left when we approached. We didn't smell or hear anything other than the sounds of the animal moving through the water as it went through the shallows. Another incident happened in 1970 or 71 while bowhunting for deer in the Swampy Lakes area West of Bend. I had driven to Tumalo Falls and walked from there in the general direction of Swampy Lakes. I had been out since before dawn hunting and just hiking around, and had stopped around noon to have some lunch and rest. It was a sunny day, with the sound of the wind in the pine trees, and an occasional bird calling. I was having a nice time soaking it all in and thinking about where I was going to go that afternoon. All of a sudden, I got this overwhelming feeling of being watched, and became very anxious. I am not one to become overly excited especially when in the woods. I am very comfortable in the wilds, and had spent countless days in situations just like that day. It is in fact where I feel most comfortable and at home. Anyway, I could not figure out why I was feeling nervous, and began scanning the area carfully to see if I could spot an animal. I didn't see anything, and had just about got myself calmed down when I heard a twig snap in some dense jackpines maybe 60 feet from me. There was something walking in there and it definitely had my full attention. I was now standing with an arrow nocked in my bow trying to see what was in there. Whatever it was stayed out of sight, and didn't make any more noise. I stood there for about 5 very long minutes trying to decide what to do next. I was feeling a little silly about being so scared, and decided to investigate. So I walked around the thicket where the noise came from thinking I could see better from the other side. I didn't go more than a few steps when there was a snap from a branch breaking inside the thicket. It was loud enough that I knew it was a large animal. It was all I could do to keep myself from taking off at a dead run. I was an hour or two from the nearest trail, and maybe another hour from my car. I knew that I couldn't outrun any animal that was making the noise. The fact that I was so scared was what was confusing me the most. It made no sense to me. I have had bears come into my camp at night, and not had anything approaching the overwhelming fear that I experienced that day. I really didn't have any fear of mountain lions or the back bears in the area. We didn't view them as dangerous at the time. Besides, mountain lions don't make noise. You are never going to hear a mountain lion walking throug the woods. They don't snap branches. Bears can be noisy when they are eating and haven't detected you. All of the bears that I had come upon at that time had run as soon as they saw me. This animal was observing me from cover and knew I was aware it was there. I decided that exiting the area was the best call. I gathered my things in my pack and deliberately walked away, keeping a close watch over my shoulder. I did not want to appear panicked and encourage whatever was in there to persue me. I had the distinct feeling that I was being followed from a close distance, and would hear a occasional sound of something moving through the woods. I would turn around to face whatever it was, but never saw anything. This went on for a good hour or so, and then stopped. I walked the rest of the way to the car and drove home. This is the first time I have recounted this experience. The reason I  bring it up at all is that other people seem to have had similar experiences. In 1973 a close friend of mine came by my house after a deer hunting trip. He told me that he had seen a big foot while hunting that day. I asked him what he saw and he told me that while sitting by a log at the edge of a clearing, a large hair covered animal 6 or 7 feet tall  walked across the clearing in broad daylight about 50 yards in front of him. He told me he shot the animal with his 30-06, it let out a scream and ran into the woods. I grilled him for awhile about the details of the encounter, and I believed he was telling the truth. This happened in the area of Wickiup reservoir south of Bend Oregon. I was very angry with him for shooting the animal, and he wouldn't speak to me about it for a long time after that. I have lost touch with him, but I know some people who may know where he is if you want to follow up. About a year after that incident, another man told me he had an encounter near Three Creeks Lake Northwest of Bend. He and another man were sitting on the tailgate of their pick up after a day's deer hunting, waiting for a third man to return. It was after dusk. They said that they smell a foul odor, and something shook the bushes and threw branches and stones at them. At the time, I didn't pay much attention to this story, but it does seem consistent with some of the behaviors described in John Bindernagel's book. The last incident happened at Fish Lake near Bluff Creek in September of 2002. I had been on a solo backpacking trip from Elk Meadows to the Dillon Divide area, and was spending my last night at the lake before leaving the area the next day. I hadn't seen any sign of Bigfoot, but had a great trip exploring some beautiful country. It was about 11 at night, and I was about half asleep in my tent. I heard a very loud whoop that sounded like it came from directly across the lake. The sound went from low to high, and lasted a couple of seconds. What was striking was the volume. It was louder than an elk bugling. I hope you find this useful.",
  "classification": "Class B",
  "county": "Deschutes",
  "state": "Oregon",
  "location": "-121.8829,43.8628",
  "location_details": "Location details for all of the incident are included above. I'm glad to supply further information if you deem it necessary."
}