{
  "reportId": "23730",
  "title": "Bowhunters get unexpected response near Boston",
  "date": "1978-11-15",
  "observed": "Myself and two buddies were bow hunting a tract of land we had used for quite a few years. This is about a 500 acre patch of hardwoods that borders the Kentucky Turnpike. We always camped in an old abandoned barn right off Nelsonville Rd just a few miles out of Boston. It was a cool November afternoon and we had decided to do some scouting. We had walked a set of railroad tracks about a mile back into the middle of the area we always hunted. We made our way off the tracks and were slowly working thru the woods. The area is mainly gentle rolling hills and bottoms. We were spread out about 100 yards apart and had just topped a small ridge. About 200 yards down in the next bottom something caught my eye. I noticed something black moving quickly through the woods and it was out of site in a matter of seconds. I thought it was pretty odd as there were no bears in this area of the State back then. And we had never noticed any farm dogs or other livestock this far back in the woods. When we met on the tracks to head back to camp I asked my buddies if they had noticed anything strange while scouting and neither of them had seen anything. I casually mentioned what I had seen and left it at that. Later that evening back at the barn, we had finished supper and had turned in to our sleeping bags to call it a night. It was cool and clear and the local farm yard dogs were carrying on pretty good and the katydids were really putting up a fuss. As the area was really loaded with fox and everything seemed to be pretty active I decided to try and call one up from inside the barn. I pulled the cellophane off a pack of smokes and squeezed it between my thumbs and started a series of calls, sounding like a rabbit distress call. This tactic had worked well for us in the past. This evening it worked a little too well. After about 5 minutes of me screaming on the call the local dogs were really worked up good and sounding off like crazy. What happened next, I’ll never forget till the day they lay me in the ground. From way off in the distance a low moan started up that grew into a load mournful roar that sent shivers down my spine. We all sat up in silence for a few seconds and noticed that not a single dog or katydid was making so much as a peep. The woods had become dead silent. Not believing what we’d just heard I let out one more blast of calls from the makeshift varmit call. Again it started up low and grew into that same roar like sound. This time really put the fear of the Lord in us all. My buddies were begging me to stop and it really didn’t take too much convincing. The hair on the back of my neck and arms was standing straight up and goosebumps had come up all over me. I put the cellophane away and got as deep down in my bag as I could. None of us said another word and sleep was nearly impossible. We all three lay in that barn dead silent till morning light.  Needless to say not a one of us dared head out that next morning in the darkness for any deer hunting. We got up, packed and headed out of there as fast as we could.  I was 17/18 years old at the time and had spent nearly all of this time in the woods and on the water and had never ever heard anything like what we did that night. I am now 48 and have moved off to another State but still spend every possible minute I can in the woods. To this day I have never heard anything like we did that night until I came across your website. When I listened to the 1994 Moaning Howl from Columbiana County Ohio chills ran down my spine. Absolutely 100% no doubt that this was the EXACT same sound we heard coming from the patch of woods that night. My wife and kids think I have lost it when I tell this tale to them and play that recording back over and over to them.  But I can say with certainty that what I heard some 30 odd years ago in that old barn is a perfect match to the Ohio recording. .",
  "classification": "Class B",
  "county": "Nelson",
  "state": "Kentucky",
  "location": "-85.67188,37.7755",
  "location_details": "Highway 61 ends into Boston Road..Take a left on Boston Road, down about 1/4 mile take a left on Nelsonville Rd. We were about 3 miles down Nelsonville Rd"
}