{
  "reportId": "1388",
  "title": "Hiker encounters huge, upright animal at creek on Grass Mountain",
  "date": "1990-06-18",
  "observed": "I had been camping out on Grass Mtn. for 3 days while staying at my grandparents in Enumclaw for the summer break. I was heading up a small feeder creek (Don't know if it has a name) trying to find the headwaters. Just exploring. I was about an hour from my campsite when I noticed a \"dead animal\" smell that was very strong. I didn't think too much about it, but it did stink. I kept on moving up the creek for about 10 minutes? before I heard something moving through the brush on my side of the creek directly in front of me. I couldn't see it at first but it seemed to be coming in my direction. I was scared that I might have walked up on a bear kill or something because whatever it was wasn't backing away or keeping quiet. It was about 50 feet ahead of me when I first saw it. I don't know what it was but it was tall and very muscular, like a linebacker. It had reddish brown fur and huge shoulders. But I don't remember seeing a neck. That's what stands out the most. I remember thinking that somebody must be making a movie or pulling a prank or something up here, but I was in the middle of the woods. I just couldn't accept what I was seeing. WALKING through the Damn woods right in front of me!! Needless to say I started to back down the creek. I backtracked through the path I'd been cutting and was moving pretty good. I'd been heading back toward camp for maybe 20 minutes? when I got cold chills all over my body. I hadn't been able to walk away from that smell. It seemed to be moving WITH ME. I had been running like hell down a cut path and it was out there in the underbrush keeping right up with me. I just dropped my day pack and started running the best I could down toward my campsite. I made it back in about 15 more minutes. I was all torn up from the briars and underbrush. I only stopped long enough to get my breath back. I realized that the smell had come all the way down to the campsite. It was as strong as when I first ran into it an hour earlier. I think whatever animal I ran into up there had followed me back. But it didn't show it's face again ( I think it was just trying to scare me off it's territory?) I didn't even pack up my tent, I didn't want to be up there by myself any more. I immediately left the mountain and left my Grandparents two days later.",
  "classification": "Class A",
  "county": "King",
  "state": "Washington",
  "location": "-121.7713,47.1826",
  "location_details": "Grass Mtn. Apparently Near Cyclone Creek."
}