{
  "reportId": "40995",
  "title": "Possible sighting of animal playing peek-a-boo at Argyle Lake State Park.",
  "date": "2009-07-15",
  "observed": "When the sighting happened we had come down into a bottom near a stream.  The main thing we first noticed was that the entire woods had gone silent.  Before we had heard bird calls and insects throughout the woods.  The silence was really unsettling and we felt like we were being watched.  We got a little unnerved and began to walk quicker towards where we had parked the car.  As we walked the road back we could hear something about 20-30 feet behind and off to the side of us moving through the brush and undergrowth.  Then at one point we had a rather nasty smell blow through the area, similar to a skunk or fox when they musk or spray.  At one point we know it crossed the road behind us and rather quickly because the noises changed which side of the road they were coming from.  At one point we were certain it was going to walk out into the open right in front of us but then all the sound stopped for a short period of time until we went down the next hill.  When we got ready to go around the last bend to where we had parked I took a look back and saw \"something\" squatting on a point next to a dead blackened tree which stood  around three to four feet tall.  The top of it came to right around the top of the dead tree and it was fairly wide.  The only thing I could misidentify it as was a black bear and they haven't been seen in our area for well over 50-100 years.  I caught a quick glance at it and then turned back around told my friend I saw something and to just keep walking quickly straight ahead and for the car.  Once we got around the bend we ran for the car, jumped in and took off.  Since then we've never really talked about it.",
  "classification": "Class B",
  "county": "McDonough",
  "state": "Illinois",
  "location": "-90.78947,40.45428",
  "location_details": "The following sighting occurred at Argyle Lake State Park"
}