{
  "reportId": "23908",
  "title": "Camper describes possible stalking at a camp near Scare Canyon",
  "date": "2006-09-07",
  "observed": "Back in 2006 my husband and I were out just kind of exploring and looking for a good camp spot up on top of Monte Cristo, maybe 5 miles at most from Ant Flat Road. (Thats a dirt road that cuts off of the paved road and takes you to Hardware Ranch). We finally found a really amazing spot at at the top of Scare Canyon. It was grassy and had tons of Aspen trees. So we parked and got out of the truck. Down from us and through the trees about 50 yards was a \"watering hole\" for cattle and such. We decided to stretch our legs and walk down to it. When we got there I noticed that it was REALLY quiet, but I just kind of brushed it off. We spent about 10 minutes at this pond and then walked back. We made dinner and just sat around talking until about 10:45pm. Thats when I got scared. Our dog was whining and whimpering, she was running all around our campsite and could not be comforted. She is a medium sized dog (red heeler and chow chow mix) and she has been around all sorts of big game before. She has never acted this way. So I get into the back of the truck where we were sleeping and Lady (our dog) jumped into the truck with me, hid behind me and was shaking. At this point I was trying to coax my husband into the truck so we could just go to bed. He finally got in about 20 minutes later and he went straight to sleep. I and the dog, on the other hand, did not sleep. Lady kept looking out the window and kind of growling/whining. So I sat up and what I saw freaked me out! In the light of the full moon I could see a VERY tall dark figure standing about 25 yards from us. At first I thought maybe it was a moose looking either at us or away from us because it was tall and skinnier than if you saw a moose standing sideways. I was scared but very curious, so I sat staring for maybe 5 minutes. It finally moved...It took about 4 or 5 steps in the direction of the stock pond. Thats when I realized it wasn't a moose or any other four-legged animal!! I got a bad feeling in the pit of my stomach and just laid back down. I couldn't sleep after that! So I laid there for a little while and sat back up..it was gone. I didn't get much sleep that night. I never noticed any smell or heard anything besides our dog. Also, we were the only people in the area at that time.",
  "classification": "Class B",
  "county": "Cache",
  "state": "Utah",
  "location": "-111.6348,41.49955",
  "location_details": ""
}