{
  "reportId": "15520",
  "title": "Possible vocalizations heard periodically over the years outside Lexington",
  "date": "1998-11-15",
  "observed": "For many years when i was young until I was in my late teens, I lived in a heavily forested area my family owned, around 38 acres. My whole life I had always heard my family (who lived in the same general area and still does) and many neighbors talking about \"The Noise\".  That's all we ever knew it to be.  It was a very loud and spine chilling howl. I heard this myself, usually when I was out hunting, it would be around early evening just starting to get dark, id be walking back to my home to my house when id notice everything would get very quiet, then suddenly it would let out a bone chilling scream that sent me scurrying as quickly as possible to my home. I remember this noise actually frigthened my father who wasnt scared of anything. This sound happened so frequently that when i was in the woods or outside in my yard and i would hear no animals or birds i would actually brace myself and start heading to the house. I had several animals, horses, dogs and goats, My dogs including the one i deemed my guard dog would all sit in their houses and whimper before and after the scream, My horses would head towards the open pasture or head for the barn and whinny, but this was only after a few seconds of silence. the goats were usually kept in the barn due to there hoodini like escape attempts. I think the most frightening moment took place when i was in my upstairs bed room closeing my windows up for the night it was late summer going on fall, i cant exactly remember what time but it was probally around 10 at night since i remember my mother going to bed, what made this esspecially disturbing was just as soon as i closed the shade on the last window,it screamed and it sounded like it was right under my window, i ran to my moms room where she was sitting up in bed looking because she had also heard it. We hunted it several times as i grew up and never found anything but it always let us know it was still there, the area has grown up from what it use to be alot more houses than before. My cousin still lives there and last time i visited i asked him if he still heard it and he said he heard it from time to time but not as much as usual...I should also add that i remember my brother was riding his bike in the woods and swore up and down that after he heard the noise it sounded like it chased him through the woods and kept very good pace with him, the reason i think it is a sasquatch is because i found some known vocalizations on the Internet and ive played it for my family and we all agree it was exactly what we use to hear.",
  "classification": "Class B",
  "county": "Davidson",
  "state": "North Carolina",
  "location": "-80.2068,35.87885",
  "location_details": "[Specific directions removed at the request of the witness]"
}