{
  "reportId": "17265",
  "title": "Possible bigfoot scream heard by hikers in Rock Canyon, in the Wasatch Mountains",
  "date": "2003-03-15",
  "observed": "Me and 3 of my friends were hiking up Rock Canyon.  It was around 10:00pm and we were about 1 1/2 hours up the canyon, just before the rock canyon camp ground.  I remeber that there was no snow in the valley but once we got that high up, there was about 6 inches of hard, crusty snow on the trail.  I remember we had to talk louder than normal to hear one another over the loud, cruch of our feet walking on the crunchy snow.  We heard a noise that was so loud, but so far away it easily silenced our loud conversations with eachother and we instantly stopped in our tracks on the trail and looked at eachother as we all hear this loud noise.  The noise started off sounding like a loud motorcycle way off in the mountain range and then in morphed into a mechanical like scream.  I wish I could impersonate it so you can hear somewhat of what it sounded like but all I have are words.  The noise lasted for about 15-20 seconds.  It was SO LOUD but so far away you could hear it's massivness echoing throughout the entire back mountain range.  When the noise stopped, we all instantly started running down the mountain and didnt stop till we got to the bottom.  We were all 20 years old plus and we ALL heard something unlike anything we have ever heard before that was scary enough to make us all run down the mountain.  We all talked about it once we left the canyon and no one could think of any logical explanation or animal that could have made the noise.  To this day will all admit we heard something up Rock Canyon that night, we just dont know exactly what it was. About a month or so after this happened, I got really curious to what this noise could have been.    So I started researching noises on the internet to see if I could find a match.  I listened to Bear screams, mountain lion noises, wolverines, (even though I dont think they are native to utah) pretty much every animal that I could think of that could possibly make the noise we heard.  Nothing I researched came close to sounding like what we all heard that night.  Then I came across a Bigfoot audio.  I figured I'd give it a try, so I listened to it.  I got chills up my spine when I heard these bigfoot audio screams.  It sounds so simular to what we had heard.  It didnt perfectly match the noise we heard but it is the closest noise that ive found to come close to what we heard that night.",
  "classification": "Class B",
  "county": "Utah",
  "state": "Utah",
  "location": "-111.5986,40.26705",
  "location_details": "If you hike up the Rock Canyon trail.  It is about 1 1/2 hiking distance from the parking lot.  It is where the trail splits to go to the overlook trail and the campground trail.  This is where we heard the noise."
}