{
  "reportId": "7452",
  "title": "Campers Hear Unusual Evening Sounds",
  "date": "2003-11-16",
  "observed": "Last Sunday (November 16, 2003) My friend, my dog and I traveled from Portland, OR to Northern California for some late season backpacking. We stopped at the Aikens Creek campground (West of Orleans, CA and just west of Bluff Creek on HWY 96) at approximately 6:00pm, as it was too late to hike in anywhere that evening and the Six Rivers NF website listed it as one of the campgrounds open through November. As we neared the pay station a sign deferred us to render payment directly to the campground host, and as we approached the host's site it became clear that the site was vacant with just a few small items left behind. So, we took the liberty to drive in and explore the portion of the campground that was open. Driving near the Southern edge (nearest to the Klamath river) we smelled a pervasive \"skunky\" odor, but thought nothing of it at the time. Eventually we pulled into a campsite (second or third from the entrance at the foot of a large hill). Our intent was to get out of the pickup (leaving the dog inside), get on our rain gear and set up the tent as quickly as possible, as it was already quite dark and raining. Just after donning my rain gear, however, I heard some distinct \"hoots\" from within the woodline which were decidedly not owl-like nor quite human-like, but could be most accurately likened to those of an ape. I asked my friend if he had heard that, but he had not, as he had two hoods pulled up over his head. I quickly scanned the woodline with my head lamp, seeing nothing out of the ordinary through the dark and rain. We began setting-up the tent when I heard it again. \"There.\" I said, \"Did you hear it that time?\" \"No.\" he responded, but he did pull his hoods down. Shortly thereafter we both heard another set of \"hoots\". \"What do you think that is?\" he asked. I have had a casual interest in the Sasquatch phenomenon since childhood and find its existence to be scientifically plausible. I am also quite comfortable in the wilderness, having spent much of my life in the outdoors from Alaska to Costa Rica professionally, academically and recreationally, but I never honestly expected to experience anything first-hand with such a creature. So, being educated and reasonable, I declined to respond. As we continued, we began hearing other noises. First we heard \"whacking\" sounds of wood against wood (more probably stick against tree). Perceiving this \"hooting\" and \"whacking\" as a less-than-friendly display, we became a little nervous and contemplated leaving; but curiousity and the dread of packing up, moving to an unplanned location and reconstructing in the dark, while already soaked; compelled us to stay. So, we continued constructing the tent between periodic scans of the area. The \"whacking\" continued and we noticed it would come from different locations in short sequence (too short for one individual to move from point A to point B). Again my friend asked: \"What do you think that is?\" I gave the guarded response: \"I'll tell you what, I've spent alot of time in the woods and observed alot  of animals, but I've never heard anything like this.\" I assume he read through the evasion to the meaning of my response, given the ubiquitous usage of the word \"Bigfoot\" , and images thereof, in the surrounding communities and some casual conversation we had had on the subject during our drive. Shortly before turning in for the evening, I heard a short series of what sounded like heavy footsteps on the rocky terrain of the hillside, in the rhythm of a two-legged walk. Turn in we did, however, with senses piqued and dog tucked securely within the tent. We slept intermittently and restlessly hearing sounds throughout the night.  Most frequently we heard the \"whacking\"; most regularly a rather hollow-sounding report originating from a point some distance to our Northeast and up the hill. We would, however, periodically hear closer and clearer \"whacks\" from varying locacations to our general Southeast; once hearing a disturbingly close and firm \"whack\" from our South/Southwest. I awoke, once, at approximately 3:00am and heard distinct, single-note \"whistles\" from the general direction of the distant, hollow \"whacking\" which were, again, decidedly unbirdlike, yet not quite human. Soon thereafter we were all startled upright by a \"crack\" followed by loud rockslide, terminating distressingly close to our location. My friend informed me he had heard two other, smaller slides earlier that night. After all was quiet for some time (except the perpetual \"whacking\") we eventually slumbered down again, awakening to sunlight and (finally) quiet surroundings. In the daylight we observed that the hillside was quite steep, rocky and slightly parabolic in shape, and the rock slide ended up in our South adjacent campsite, leading us to conclude that: 1. Inspection of the hillside would be dangerous and turn up little or nothing in the way of footprints; 2. Sounds could have originated from well up the hill and carried down the \"amphitheater\" hillside; 3. If it were people playing a prank, they must be extremely dedicated to risk their lives negotiating that hill in the dark and rain and to wait in the woods any given night for the off-chance campers might come by in November; 4. Though rock slides may naturally occur there on occasion, they certainly must not occur on the order of three a night or someone would implement measures to ensure no one camp in that location; 5. Maybe that \"skunky\" smell we had encountered just previously was not a skunk. At any rate we drove on the next morning to the Willow Creek Ranger's Office (making no mention of the events) to inquire as to open trails. We were instructed that much of the back country road system (and corresponding trails) was closed due to the Port-Orford Cedar Root disease, but that we could drive into the Horse Linto Creek area and hike along the closed roads. We took that advice and spent the next five nights uneventfully. We decided to return to Aikens Creek for the final night (Saturday, Nevember 22)  to take advantage of the open, flat space to dry wet equipment and see if we could observe anything further. We picked an open site midway between the foot of the hill and the highway, layed out equipment for drying, then decided to day-hike somewhere nearby. We drove up Bluff Creek Road to its closure at the road junction to Fish Lake then hiked 1.6 miles down that road.  I payed close attention to the steep clay roadsides, and once noticed what could have been a partial footprint of a large, humanlike foot from the heel (about 4\" in width) to a point about 6\" forward (and perceivably midway along the length of the foot. I found, however, no other footprints or enough context to draw any real conclusion about the impression. That night, back at the campground, we kept a large campfire and kept some down and dead cedar boughs nearby to throw in for quick brightness if needed. At one point , my dog suddenly barked and charged towards the trees at the edge of the campground just  below the freeway. I halted him and went to investigate, but found nothing unusual. Though better prepared we neither saw nor heard anything further that night. We returned home however with a new awareness.",
  "classification": "Class B",
  "county": "Humboldt",
  "state": "California",
  "location": "-123.6581,41.23528",
  "location_details": "Aikens Creek campground, immediately West of Bluff Creek on HWY 96"
}