{
  "reportId": "39620",
  "title": "Motorist has two possible sightings on the Appalachian Hwy. near Gadsden",
  "date": "2013-01-27",
  "observed": "My first sighting was in December 2012. It was about 12 midnight and I was on my way home. It was raining, not to hard but steady. I was going down the highway through the country side and on each side of the road up ahead were guard rails with woody swamps on each side. My headlights lit up the reflectors on the guard rails all the way down them. About mid way down the rail I saw a black space, almost like a gap in the rail. Once I got a little closer I realized it was some type of animal. It looked hairy, and as if it were standing over the rail crossing it. But before I got close enough to see, it had went into the woods. But it was big and I honestly didn't really know what it was, so I didn't think much of it until, about a week or so ago. I was leaving my house heading to work, it was about 8:30 or 9 in the morning.There was a very lite rain. I pulled out onto the highway (same one I had the first sighting on) and as soon as I pulled out about 200 to 300 yards I saw something weird looking on the side of the road, something out of place. As I started down the road it slowly walked out on the highway and took its time walking across the road, then stepped over the guard rail (same one as first sighting). It did this with ease. It walked down the ditch and into the woods. At this point it was about 150 yards in front of me. Its pretty open where it walked out so I got an okay look at it, but it was still a couple hundred yards out. Things that caught my attention were the way it seemed to walk. It had short legs and a longer upper body. Its head stuck up away from the shoulders. The arms hung beside it and hands were nearly touching the knees. It was all black. At first sight I was just like, that's a man, but the closer I got the more I realize how different it looked. How much bigger it appeared. Plus it came from the woods, walked across the road into a swampy area. With no cars or anyone around. It just seemed out of place to me. That's what made me focus on more detail. You could tell it didn't have clothes on because it was just one slick figure. Not baggy from jackets/ pants/ etc. Not to mention it was rainy and around 30 degrees that morning. Whatever it was, I had never seen and I hunt all the time in the woods. But I will say it was defiantly not a bear or any human I've ever seen before. This thing was big and it gave you a chill just seeing it. I'm going back tomorrow to see if I can find any hair that may of caught the rail or any tracks, just anything that catches my eye. I want to believe they are really out there and seeing this was amazing. Thanks for your time",
  "classification": "Class B",
  "county": "Etowa",
  "state": "Alabama",
  "location": "-85.86473,34.04129",
  "location_details": "Appalachian highway heading from Hokes bluff to Gadsden Alabama right pass the Appalachian bridge, between Cotes Bend and the Coosa River"
}