{
  "reportId": "20028",
  "title": "Hunter recalls unusual and persistent vocalizations at Carson Lake on the Grand Mesa",
  "date": "1987-10-15",
  "observed": "A friend and I were hunting on the Grand Mesa on the Lands End side.  We had hiked down Kanna Creek Trail to look for game. We had spent most of the day on stand and hiking.  We made our way back to my truck. We decided to stay the night so we could hunt in the AM and then go home. We were getting things set up for camp. Building a fire getting food out to cook. I had a Pop-up camper and I had just got it up and situated when my friend said \"What the heck is that sound!?\". He had never spent much time in the woods as I had so he was freeked out instantly. I came out of the camper to see what the problem was.  Then I heard it. It is the hardest thing to explain how it sounds but, here it goes. It sounded like a scream. Deep in sound, very loud and it lasted for long periods of time with the sound going up and down in volume.  It also sounded angry for some reason. At first I didn't give it much thought. I had heard a Mountain Lion screem and that will make hair stand up on the back of your neck. I have also head bears. But bears do not do that sort of thing.  They are quiet most of the time. As this sound is going on and on and on pausing for short moments as if to catch its breath, my friend is realy freeked out by now. I said to him it is just a Lion or two lions or a lion and a bear fighting across the lake. This did not calm him down much. I had my sidearm on me still. So I pulled it out and shot off a round in the air during the screeming.  Silence.  See I told him, we scared it away. I started to go about getting food out so we could eat. Now it is a little darker and you can't quite see details across the lake but you can still see. not even a minute later after firing a round off in the air, the sreeming started again. This time closer but still across the lake, louder and it seemed more pissed off! As if it was very mad we were here. Now we could here like bush being raked or shook but we could not see it. Just hear it. Now, I am getting freeked out because of what just happened. It came closer! Now, you would think a gun shot would scare game away not bring them closer. My friend is now really freeked out and wants to leave. NOW! I tell him \"We have highpowered rifles and we will be safe\". The whole time we are talking about leaving, the screeming is going on. I gave in to him wanting to leave and started to pack up camp. This took some time for us to do. Maybe 5 minutes or so. During this time the screeming was going on the whole time. Got everything loaded in a hurry buttoned up the camper and we got in and started it up and left. It is now dark and headlights the only lights besides the stars. The drive up and out of the lake has a few switch backs. I stopped at one to see if the screeming was still going on. It was not. We then drove out of there and down the mountain not saying a word. We had stopped to get a bite to eat and we just felt unsure of what we had experienced. Both of us decided not to say anything to anyone. I know I didn't say anything to anyone about it for a long time. I am unsure if my friend has said anything to any one. I have watched shows on TV about BIGFOOT since. Some of the shows had taped sound of what they said was BIGFOOT. To me it sounded like what I had heard.",
  "classification": "Class B",
  "county": "Mesa",
  "state": "Colorado",
  "location": "-108.1098,38.9969",
  "location_details": "At Carson Lake. The lake sits on the edge of what is called Lands End on the Grand Mesa."
}