{
  "reportId": "698",
  "title": "",
  "date": "",
  "observed": "Dr. and Mrs. E. were riding in their private sleeping compartment in the train from Chicago to Portland, a near annual event to visit relatives in Portland. He was closely watching the clock, since the train had left with a delay and, consequently, needed to make numerous, unscheduled stops to let other trains pass. With admirable honesty they admitted to them both having been near naked. During the afternoon, about 2 pm, the train made an unscheduled control stop about 10 minutes train travel West of the Dalles, OR. Looking diagonally into a snow-covered clearing in the woods between the train and the Columbia River, they saw a dark sasquatch stepping into the clearing, accompanied by several \"dark birds\" of an unidentified species. The sasquatch hunkered down to look at the train, and got up once or twice to walk a few steps and hunker down again. The hair on its legs stuck out on the surface of the snow \"like bellbottom pants\"; when hunkering, its arms were outside its knees and it rose without assistance from the arms or hands. The E.'s felt secure within the train and were not seen by the sasquatch [tinted windows]. They could exchange mutual questions over the 8-minute period that the train stopped, verifying their mutual impressions of its reality and configuration. Contrasty lighting precluded detailed viewing of features of the animal. The conductor admitted obliquely to seeing it, too, but the geometry of the terrain precluded viewing by others in compartments ahead or behind that of the E.'s. They could not alert others during the event because of their dishabille. The train left with the sasquatch watching. They both stated their absolute conviction that what they saw was a sasquatch.",
  "classification": "Class A",
  "county": "Wasco",
  "state": "Oregon",
  "location_details": "About 10 minutes by train W of the Dalles, OR, along the Columbia River. The Dalles are about 80 miles E of Portland. The region is in the transition zone between open desert grasslands and the forests on the E side of the Cascades."
}