{
  "reportId": "24399",
  "title": "Elk hunter watches large and small upright animals cross beneath power lines.",
  "date": "1982-10-20",
  "observed": "I felt uneasy the entire morning. I felt as if I were being watched. I had left camp alone and heavily armed. My friend and I were on an Elk hunting trip. As I walked through the forest, I found myself looking back over my shoulder for no apparent reason other than feeling like I was being followed. I stopped by the creek to watch the salmon and have a bite to eat. As I was eating I was watching a clear-cut area where the power lines ran down ridge. This clear cut was about seventy-five yards wide and was covered with light colored grass about knee high (2 feet). I glanced down the clear cut just as something large, dark and upright moved across from left to right. It took this thing about ten seconds to cross. It was about two hundred yards away from me. It disappeared into the trees beyond the clear cut. I thought at first it might be another hunter, but dismissed that thought when I thought about the fact that it was all dark colored and didn't appear to be carrying or packing anything. After it crossed, I picked up my rifle and scanned the area where I had last seen it. I saw nothing and put the rifle down and resumed eating. Moments later as I was watching the point where it had disappeared, it came back out. This time it was moving back to where it had first come from (from right to left). I got my scope on it, as it entered the forest again. I had a 9X scope. I was able to determine it was hairy and resembled a large man (est. 8ft tall). I could not make out any facial detail. I'm sure it did not know that I was watching it. I'm a twenty-four year career Army Veteran. At the time I was a Staff Sergeant with twelve years of service. I was trained in survival techniques and as a scout for a number of years; I could determine distance and area details better than most civilian men. This time I kept my scope on the point where I last saw it enter the woods. It came back out only this time it had a partner! The second creature was about half the size of the first. It looked just like the first creature only smaller. With the big one leading, they both crossed the clear cut and disappeared into the forest. I went back to base camp and told my friend about it and he replied with \"that explains why there's not game in the area.” My friend was a retired Green Beret Major. He suggested we pack up and move to a new location far from the one we were in. We made no attempt to track the creatures. I was all for leaving!",
  "classification": "Class A",
  "county": "Polk",
  "state": "Oregon",
  "location": "-123.6956,45.06881",
  "location_details": "About five miles south of Hwy 22 on an old logging dirt road.  We were camping on the western most side of Polk County."
}