{
  "reportId": "11496",
  "title": "Lady has two Northern California sightings, over a 20year period.",
  "date": "1997-07-15",
  "observed": "I have seen Bigfoot two times. The first time was one summer in the late 1970s. My friend and I were camping in the Tahoe National Forest in California. We were camping out of a station wagon, as we did not have a tent. My friend was cooking on the Hibachi, and I was sitting on the tailgate of the station wagon watching him. We were in a newly planted area of seedling pines. The surrounding that area was old growth pine trees. I looked over at the old growth area and there stood Big Foot. He was about 5' tall, and hairy all over. His eyes were large as if he were use to living in darker environment. I told my friend to turn around slowly, and look, as he did the Bigfoot melted out of sight back into the forest.  After we had gone to bed for the night around 2:00 AM in the morning, something hit the station wagon so hard that it rocked back and forth. Scared me half silly. The windows were clouded inside with moisture, and the night was dark.  The next time I saw Bigfoot, I was at Lake Shasta in the late 1990s. Wayne, Ginger the dog, and I were bass fishing on the lake, and the weather was warm. On the shore was Bigfoot walking down towards the water. When he got there he swooped his left arm down into the water as if he were checking a trap to see if there were any fish in it. He stood up and walked up the steep hill without any effort.  He was huge.  From the boat he appeared to be at least 7 to 8 feet tall. He had long shaggy hair, very dark brown. While all of this is going on Ginger the dog was going berserk. She was running around the boat yelping and howling. I told Wayne there is Bigfoot. He did not see him. The place where we had launched the boat was in the Jones Valley Resort area. When I tell people I have seen Bigfoot, and they think I am crazy. I'm not. Cousin Bob went out fishing with Wayne not too long after that. He said he saw something also. He said he didn't know if it was a turkey hunter in disguise or what, but it walked up the steep hill with no effort.",
  "classification": "Class A",
  "county": "Shasta",
  "state": "California",
  "location": "-122.1667,40.75",
  "location_details": "The Lake Shasta sighting was up the Pit River arm of Lake Shasta, which is East of the Jones Valley Resort."
}