{
  "reportId": "11273",
  "title": "Youth has sighting along abandoned railroad line on edge of West Frankfort.",
  "date": "1979-08-17",
  "observed": "It was summer, late 70's, I was about 12.  I lived a block West from railroad tracks, which ran North/South, and about 1/2 mile North of my home was the edge of a wooded bottomland which is referred to as Middle Fork, which runs into the Big Muddy River to the West, and has an abandoned railroad bed running West/East just inside the woodline.  The edges of which were littered with dumped appliances, etc., that the garbage service wouldn't take.  I had heard of the reports of the Big Muddy Monster prior but didn't give it alot of thought at the time. Inside the edge of the woodline mentioned there is an abandoned railroad bed (no rails, etc., and as you travel along it becomes raised to a point of about 10 feet at the end where it runs into a field and drops abruptly) which \"us kids\" used as a bicycle / motorcycle trail.  One day nearing dusk I was riding my bike through the neighborhood and decided to go down the trail.  On the trail you could either go North into the woods or South back into the residential area.  As I was turning onto the path a pair of kids came out on their motorcycle.  As they passed the driver yelled, \"There's a hobo chasing us!\", and they continued on.  There was a hobo village nearby, but it was on the East side of the tracks and farther North, and I had never been bothered by them before so I figured the kids were messing with me. I turned onto the trail and went West, toward the field wanting to make a circle back to the residential area.  At about midpoint on the trail, which is about 6 ft. above the ground on either side, I approached a place where some washers and dryers had been dumped.  Behind one of the washers, which was on it's side, I could see the outline of a \"person\".  I came to a stop as the thing stood up it came to where at full up it was looking me in the eye from about 20 ft. away.  I could make out the outline and see that it's groin had cleared the washer and that it was covered in hair.  There was a slight breeze and I could see the hair moving somewhat in the wind.  The sun was to it's back and cast a shadow on it's face but I could make out the shine in it's eyes.  I could tell where the nose and lips were but not with any great detail.  I do not remember seeing ears.  I did not smell anything.  It was broad built, what I could see, and the arms were long.  It had a small head but I could not tell if it held it's head upright or slightly down. When it became erect it reached up with it's right hand/arm and grabbed a sappling near it.  As it grabbed the tree it grunted slightly, like as in disgust, not mean, and then shook the tree.  Not vigorously but it shook it easy enough.  With that I turned back East and took off with all I had. As I exited the trail nearing a road I slowed and turned to look back.  The creature had walked up onto the trail looking at me.  It then turned and walked back into the treeline and I took off home. After telling my friends, they all thought I was \"nuts\", unitl they started to hear of other acounts, both prior to mine, and after...then nothing more was ever said. I went back to area a few years later and back to the spot of the sighting.  I am 6 ft. tall and using the surrounding trees, estimated the creature's height at 7 to 7 1/2 feet. The area of my sighting has since been built up somewhat and cleared out but still exists as it did for the most part. There is also an area East of the tracks which has had some strange happenings in it.  I, along with some friends, had the feeling of being watched while in that portion of the woods but no encounters.",
  "classification": "Class A",
  "county": "Franklin",
  "state": "Illinois",
  "location": "-88.929,37.91",
  "location_details": "North edge of town, trail can be accessed from N. Anna St.  Trail is just North of intersection of N. Anna St. and 10th St., trail leads to the West from roadway."
}