{
  "reportId": "30051",
  "title": "Vocalizations and tense sighting reported by couple hiking and camping near Trout Lake",
  "date": "2004-08-14",
  "observed": "This is a compilation of experiences over a period of years in the same area (1988- 2009) - feeling of being watched, wildlife silenced, tree breaks, strong smell once, numerous late night vocalizations, rock knocking, things being thrown near our tent and an actual daytime sighting. Some of the things I mention here I didn't know were typical when I was experiencing them, but now do, since I've read other sightings on BFRO's and other sites. My husband and I have been camping and caving in the Trout Lake, WA area for about 20 years and are both very experienced in the outdoors, particularly in the Northwest. We've gone primarily to this area for caving for many years. The first encounter with something unusual was in 1988-89 on a caving trip in this area as we penetrated the forest, heading toward Mt. Adams through some old clearcut to visit a familiar cave. Birdsong of various types is always present, but as we made our way toward the tree line, the birdsong and even insect noise seemed to cease. I looked up, no indication of foul weather or damp wind, indicating rain. Our group ( I think 7 or 8 of us) was familiar with the deep woods and a couple people noted that this was strange. For some reason, we all stopped in our tracks, even though no one had heard anything; everyone was looking around at each other and listening. Something seemed wrong. Then, I had a very strong sense of being watched from further in, not too far away, but did not tell anyone else. I have a feeling the others sensed this as well, and we all pushed quickly on to get to the cave, sticking close to one another. This happened on several caving trips over the years, but not in the same location; the proxmity, however, was fairly close- all within about a 5 mile radius. Another time, around 2002, my partner and I were dispersed camping alone, right next to a very seldom-used forest road in the same area, east of the main forest road. We got out of our vehicle to begin setting up camp as we had done several other times in this area and noticed an almost vomit-inducing stench. It was not the smell of something dead, it was like a combination of sun-baked garbage and feces. We decided that perhaps some local had driven back here and dumped their garbage, but then about 5 minutes later, the smell just went away?? I had no idea about the smells encountered by others at this time, so I blew it off. We walked, sniffing around the area a little and there was nothing, so we decided to camp there anyway, thinking that something must've just been carried on the wind, but it was still strange as to how strong it was. We've also heard some late night sounds when camped at Peterson Prairie many times. Some dismissed them as coyotes. These sounds were like whoops, with several animals at once. I remember silently filing through the animal sounds that I'd heard in the wild: (elk, coyote, deer, cougar, wolf, owls, marmots, bear, human) in my mind and came up blank. Nothing matched. Still we tried to dismiss them as coyotes and went to bed. But it was like something was making the initial sound and the coyotes were answering. But then later in 2003, another type of sound in this area made my blood turn to ice water. It was August, about 11:30 at night at Peterson, as we wanted the \"luxury\" of camping at a site, instead of dispersed, where there was running water and outhouses. We were dousing the fire and about to head into the tent when from the north, about 1/2 to 3/4 of a mile, it seemed, there began a howl. Not a wolf or coyote howl, but it almost reminded me of those emergency sirens you hear in rural towns. The pitch was quite low and then it raised to a higher tone and was held there for about 6-10 seconds, but was still low in tone. I thought about Pavarotti and some very skilled baritones that I'd heard in concert. I came to a sickeningly horrifying conclusion that in all the years of voice I'd studied and heard, not one human had ever uttered something at this tone, nor could they do it at this volume. The lungs of whatever was doing this had to be absolutely huge, and as in the forest, it echoed a lot, but it was *not* echoes that made it sound strange. I looked at my husband, who was also startled and looking at me, and then we looked at some of the other campers across the scrub from us. They had stood up and were motionless, looking back at us, then looking in the direction it was coming from. I asked, \"What IS that?\" to my husband, who said he didn't know. We remained standing and it continued for about 2 minutes, then ceased. In all the years we have camped and caved in that area, (or anywhere, for that matter) we had never heard anything like that. No human lungs were capable of that power. I have pretty much always been a die-hard tenter/backpacker, but that night I couldn't sleep in the tent. I was too frightened with the realization that what I had just heard was impossible- impossible! No creature existed that could make that sound-- unless-- no way-- NO WAY! Then I remembered that this area had quite a few sightings of Bigfoot over the years. I just could not accept it, but I also could not sleep in the tent, so we got our bags and pads and slept in our truck that night. I barely slept, and was very glad to be leaving in the morning! I was shaken for quite a while. We went to the Mt. Adams ranger station in town that morning on the way out and asked if there were any reports of \"unusual animal activity\" the night before. The ranger looked at me like I was under the influence. I never said the words, but I knew she was thinking it. She said she had not heard of any, and by the way, just what was it that I thought I heard? I never answered. Well, terror and curiosity sometimes go hand in hand-- we decided to go back to the area in 2004.  We camped at Peterson, as there was no freaking way I was going to camp dispersed, just the two of us, in that area now. So we're there, visiting our favorite caves in the area and early the last afternoon, my husband and I decide to go cave hunting. (What was I thinking? But it was broad daylight, so...) We trekked down a side forest road that was so overgrown with vine maple and had large tree fall at the beginning so that you couldn't drive it anymore. We bush-whacked through the grown-up vine maple in the remnants of a clearcut and split up and had planned on coming around to meet each other, as we knew this particular forest road curved around a bit. I'd had enough bush-whacking after a while and decided to just meander down the forest road on some more even terrain. So I headed toward the mountain on this road with my husband off in the deep bush to my left. I noticed how warm it was and it was quite still- it was an uncomfortably hot day. Nothing but the sound of my boots crunching on the packed gravel. Then I heard the gravel move behind me, probably about 20 yards. I took my time turning around, thinking that it was a probably a cow, because this was an open range area, and as weird as it seems seeing cows in the forest and clearcut, this was not uncommon at all. It had sounded heavy. Then I felt faint, like I was going blind & seeing colors and shot up with some halucinogen all at once- I watched as a HUGE, hair-covered, dark cinnamon-colored human-like thing cleared the ditch in one stride, glided into the tree line in one more lightning step and then stood absolutely still. There I was, by myself, in the middle of this isolated forest road with a hairy (it seemed almost like semi-glossy fur?) cinnamon-colored shoulder and arm unhidden by the tree it was behind. The shoulder was absolutely massive, as was the arm, which was so long, it was almost as tall as I am. If I look, for example, at the door jamb in my office here, I'd put the shoulder's height at just under the bottom of the jamb. I could see the contour of muscles under the hair/fur. It was obviously very strong. The hair/fur appeared to be about 2-3 inches long. I couldn't see the full hand as it was blocked by some undergrowth. And there it was, standing stock still, watching me- did it think it was fully hidden? I've heard about people being paralyzed with fear and could never imagine that, but that's exactly what was going on. I thought I was going to die very soon. I just really had no idea what was going to happen. I was completely defenseless. I wanted to move, but couldn't, I was frozen. I thought it might chase me if I ran. I could not turn my back on it. Survival mode must've kicked in somehow, because I remembered my training about bears. I began to back away very slowly and spoke very quietly and was even tempted to leave my pack for it. It still didn't move, and just stayed there, still as stone. I must've backed down that gravel about 100 yards and since there was no movement still, I decided to risk it and yell for my partner- there was no other way out of there. I yelled for help at the top of my lungs and he answered, \"Where are you??!!\" I somewhat meekly called, \"Here..\", afraid then that my additional shouting might have the opposite effect of what I wanted and agitate the creature. A few minutes later my husband came crashing through the underbrush, a look of panic on his face. He asked what was wrong and I told him a bear- he looked disgusted and was angry. He asked where and I pointed and it was gone. He asked if it had exhibited agressive behavior. I said no, but he looked worried and started to look around and we headed away from the area. We cut through the vine maple in the opposite direction of my encounter and hightailed it back to the car. As I thought about it afterward, I noted that there was no smell during this encounter to warn me, but there was also no wind that afternoon and it was very warm. It took me 4 years to even tell my husband what I saw. Fortunately, he's a pretty reasonable person and believes (with astonishment) what I've told him. Recently we've listened to recordings on the web of what people think are Bigfoot, and some of them sound just like what we've both heard in the area. The combination of smells, feelings & those sounds never fully registered as being connected until we found some Bigfoot sites on the web. We realized that we've experienced alot of different things in the area that were likely a Sasquatch nearby over the years. In 2009, we camped in Peterson Prairie again, in August. I had alot of reservations about camping in a tent there due to my previous encounter in the area, but I thought with all the other campers around (6-7 sites occupied), (and right next to the obnoxious camp host RV) there wouldn't be a chance. It was raining, which was unusual for that time of year. We pulled into the campground in the evening and set up the tent in the site just north of the camp hosts. We made dinner and called it a night, with it still raining. Something woke me at about 2:30am. It was what sounded like two rocks being knocked together, south of us, down the mostly dry creekbed. I was listening for sounds of clothing, car or camper doors, or soft voices, thinking someone was up really late. After listening intently for about 5 minutes through the sounds of light rain on the tent walls, there were no sounds of \"human\" movement nearby. Then the rock knocking again. Just a couple times. I wanted to wake my husband to have him hear, but the sleeping bags make so much noise and I couldn't be sure he'd be silent when waking, (I also didn't want to risk becoming an item of interest to the rock knocker.) I was then shocked and terririfed by what I heard next. Something \"whooshed\" nearby and then I heard a thud on the ground. I was astonished. What can possibly be moving so fast through the air that it would make a loud whooshing sound? I listened for any sound of leaf noise in case a tree limb had fallen, but no undergrowth impact noise nor leaf noise, as I've heard before, when a limb falls. What could possibly be whooshing so strongly through the air that I hear it and then I hear an impact nearby? Something was being thrown or beaten on the ground. Based on our experience in the area, I was pretty sure it was rocks or pieces of wood. But how freaking big (and close) did it have to be so I could hear the \"whoosh\"? That was terrifying. I was literally afraid for our lives, if one of whatever it was hit the tent. I listened for footfalls or scrub noise to see if I could tell if something was coming closer. No foot falls, but another whoosh/thud. I was out of my mind with fear, thinking we'd be hurt or killed by an impact through the tent. How is it that I didn't hear something close by, either breathing or moving? It must have been from quite a distance. I didn't sleep the entire night. My husband woke up around dawn and I was still wide-eyed in my bag. He asked me how long I'd been awake and I told him the entire night. I then told him what I'd heard and he'd wished I'd woken him up, as he believes me about my encounter and actually wants to see/hear one. I told him that I didn't want to risk becoming even more of a target by making noise during the night, so I remained still. We now have a micro camper that we're going to start using to camp/boondock with, as we're both getting older, so a trip down to Skamania/Klickitat County is soon on the books. I'll feel a little safer in it, but you never know how interesting it might look to a night time visitor- I hope not too much so. A parabolic mike and some night vision binoculars might come with us, too. Fear and curiosity-yikes.",
  "classification": "Class A",
  "county": "Klickitat",
  "state": "Washington",
  "location": "-121.6314,45.96112",
  "location_details": "Deleted by investigator at witnesses request"
}