{
  "reportId": "26393",
  "title": "Man experiences loud yells and tree-shaking while deer hunting near Ashville",
  "date": "2006-11-20",
  "observed": "It was fall of 2006 - Hunting season and I was in the woods on a farm in Ashville, FL.  I had been in the tree stand approximately 2 hours and not seen any deer.  I have been hunting most of my life and am familiar with the woods, sounds and environment.  Approximately 4:30 pm as the light was fading, I heard two loud, distinct \"cries\" or \"yells\" that I have never heard before or since.  I could tell the general direction and distance was approximately 150 -200 yds in front of me.  As I sat there looking, the wind was blowing at my back so I did not notice any unusual smell, but anything downwind from me may have smelled me.  About 10 minutes later I heard the \"yell\" again.  Possibly a bit closer ~ 125 yds.  I remember a large Oak tree about 50 - 75 yds in front of me.  There was a small sapling (8 - 10 ft tall) next to the large tree, with surrounding grasses about 2-3 ft tall.  About 10 min after the last yell I noticed the sapling being whipped back and forth.  I took special notice due to being on \"alert\" from the noise - and further the sapling was violently shaking side to side - not in a constant direction.  Almost like something grabbed the tree near the base and started to  push / pull creating a whipping effect near the top.  I looked at the tall grasses surrounding the area and they were not blowing in the same manner.  This tree appeared to be moved by something. I thought at first it may have been a squirrel that jumped on the sapling - but it shook for about 30-60 seconds - then stopped, then again for another 30 seconds.  Since I did not see anything, I sat there (somewhat in disbelief) armed with a high powered rifle. After a few minutes I was so un-easy I got down and slowly exited the woods.",
  "classification": "Class B",
  "county": "Jefferson",
  "state": "Florida",
  "location": "-83.649,30.59612",
  "location_details": "A farm very close to 146 & Hwy 221 intersection - Ashville, FL."
}