{
  "reportId": "3085",
  "title": "",
  "date": "",
  "observed": "The sighting occured many years ago when I was in the boy scout, attending a big boy scout camp at Camp Bradley north of Red Fish Lake, Idaho.  My group were mostly contained of deaf scouts.  We represented the Gooding Troop #32.  There were six of us including my brother who was the only hearing person that hung around with us.  During our break time, at around noon time, we wanted to go out and explore some of the lakes around Camp Bradley.  We were told not to go to the third lake, probably because it was too far and the trail was not maintained, etc.  As curious and mischievous as we were we decided to go to all three lakes.  We passed the first lake which was the main lake for the camp and then passed the second lake.  We were heading toward the third lake and the trail got smalled and the forest became more densed.  We were all signing in sign language, talking to one another at a different pace.  Three of us, including myself out of six, saw this huge two-footed creature walk swiftly across the trail / path approximately 75 feet away, from our left to our right.  The three of us that saw this creature stopped quickly and looked at eachother to see if we saw the same thing and if our eyes were not playing tricks on us.  Just as soon as the three of us reacted in almost the same way, we all realized that it was really something.  The other three that did not see walked a little bit further and stopped to see why the other three of us stopped walking.  We immediately told them what we saw and what appeared to be a bigfoot.  The other three looked at us as if we were joking or making things up.  It was a bit of struggle for us to convince the other three but very shortly later they realized that we were really shakened up and frightened.  They started to believe us.  Some of us suggested that we hurry back to the camp but most of us wanted to see this bigfoot so we walked very slowly to the site where the bigfoot had crossed.  We were visibly very nervous but we were also pretty gutsy kids at that time and we wanted to show our brave side but on the inside all of us were scared.  Right when we figured where the bigfoot had crossed, we looked on the right side of the trail and saw a small meadow in middle of densed forest.  We saw nothing.  We walked maybe 30 to 50 feet further into the area but saw nothing.  The three of us were still visibly shakened up as we tried to describe what the bigfoot looked like to the other three that did not see a thing.  Between the three of us we had exactly the same description.  The description is this tall, approximately 7 to 8 feet tall bigfoot was broad in weight but yet it was tall and agile. The most impressive figure was his legs which was massive and quick.  The bigfoot did not look at us so we were not sure if he even knew we were there or not.  He was focused on getting from point a to point b.  It is possible that he'd have seen us before we saw him and figured he's got to get out of there quickly and focused on getting away.  I do not know if the bigfoot had heard us and prompted itself to get away because most of us were deaf so we could not possibly know if we are being noisy or not.  This happened so many years ago but the image in my head is so clear as I still remember exactly what I saw.  I do not have any doubt that this creature is definitely a sasquatch species.  What I saw in my eyes had  exactly the same description as many other have described, brownish thick hair, tall and strong, walk on two feet almost like humans but it definitely was not a human and could not possibly be a human in an outfit because we were in middle of densed forest where one would not find any human activities for many weeks or even months.  I say those things as God is my witness.",
  "classification": "Class A",
  "county": "Custer",
  "state": "Idaho",
  "location_details": "The exact location of sighting occured close to the third lake from the Boy Scout Campground called Camp Bradley.  There is a small trail that will take you to the first lake and onto the second lake and then into dense forest ground where a much smaller lake is, known as the third lake.  The bigfoot sighting occured a little before the third lake."
}