{
  "reportId": "4403",
  "title": "Late night encounter by young campers in Maple Valley Wa",
  "date": "1975-07-31",
  "observed": "July 1975 - Renton - Aqua Barn Ranch campout property on the north side of the Cedar River. A group of 75 kids age 7 to 17 and the camp personel.  From a huge pasture area all the campers walked down a trail that was thick with blackberry bushes and was lightly treed with alder, etc.  The trail was about 200 yards long.  At the end of the trail, there was a circular clearing about 150 feet in diameter.  This is where the group set up camp.  There were 3 trails out of the clearing.  The one going to the pasture, one going to the river (over a little rise and about 100 feet away from the clearing) and one trail that deadended 50 feet up.  This is where the campers were to relieve themselves.  A group of 4 twelve year old girls were going to relieve themselves down this trail at about 11pm.  From deep in the berry bushes, we heard something moving.  It sounded like the animal would move a little ways, then stop.  We could hear branches and twigs snapping.  We couldn't figure out what it could be because it was such a thicket of berries.  No human could be in there without getting massively scratched.  We listened for quite awhile and noticed whatever it was was moving closer to us, but it was still a ways away.  Getting scared, we ran back to our sleeping bags.  There was a big circle of girls in their sleeping bags and our group of 5 was off to the side, near the \"bathroom\" trail.  I listened for a long time from my sleeping bag & noticed the animal was getting closer.  I got up from my friends & moved into the center of the circle of girls!  I fell fast asleep.  One of my best friends did not.  What Jane heard as she lay awake was whatever it was, eventually came out of from the berry bushes.  There were 2 of them.  They communicated by making soft cooing noises to each other that sounded very much like pigeons.  Jane was laying on her stomach in a goosedown sleeping bag with her head on her arms & was petrified.  She could not look up at what was in our camp because she was afraid of what she might see.  She said the two creatures moved all around our camp.  If someone stirred in their sleeping bag, they would stop moving & make no noise.  She could hear them get in our boxes of food.  They continued exploring our camp for hours, intermittantly calling softly to each other.  All the while she is stiff as a board in her sleeping bag.  Then to top it all off, one of them steps on the end of her sleeping bag & she feels the whoosh of the air coming up to her feet.  She moved her feet.  Whatever it was reached down and lightly touched her back!  She - even MORE petrified, just layed there, hoping it wouldn't hurt her or carry her away! I woke at dawn from the center of the big circle of girls & got up to go relieve myself.  Jane was laying in her bag exactly as I described.  She hadn't moved & the down bag was literally soaking wet with her sweat.  I believe she was in mild shock.  She dull-ly told us what happened to her, but she was so wrung out, there was little emotion she showed.  My friends and I walked all over looking for some sign of what she said happened but since the ground was dry, there weren't any distinguishable footprints.  Later when we got back to the Aqua Barn, Jane layed in bed the rest of the day to recover. Our group, to this day, calls this incident \"The thing that came to camp!\"  Since I was not greatly affected by this, it's fun for me to recall.  Jane and I talked about this incident in 1990 and she IS NOT happy to relate it!  She literally started sweating and got a little shaky as we talked about it.",
  "classification": "Class B",
  "county": "King",
  "state": "Washington",
  "location": "-122.0375,47.40667",
  "location_details": "The Riley family owned the Aqua Barn Ranch on the south side of the Cedar River in Maple Valley and another large property, just a little ways east of the Aqua Barn, but on the north side of the Cedar River"
}