{
  "reportId": "15187",
  "title": "Resident reports numerous incidents in his neighborhood outside Allen, near borders of MI, IN and OH",
  "date": "2006-04-11",
  "observed": "It was early april here in southern michigan, I was sitting watching tv around 2:30 AM and was preparing to go to bed when I felt like I was being watched. I live in a rented 12x70 2 bedroom trailer.   I was sitting at my pc looking across the room at the tv, when I felt odd and noticed in my peripheral vision that I couldn't see my neihgbor's outside light. That is when I turned to look straight out the window, the window was about 4 feet from me, and I found myself staring straight into the big , yellowed, bloodshot eyes of a sasquatch.  It looked like it was hairy all over -  I saw a hint of reddish, light brown colored hair on the forearm and shoulder.  The lighting on it was poor and I couldn't make out any facial features besides the eyes and it was staring right back at me. I have been living in this trailer for 6 months over winter months with no signs of anything strange going on around here. Well I jumped from my chair and threw off the blanket I had on my legs and stared right at it for a second and then realised my front door wasn't completely shut and locked.  I hurriedly reached for the handle to shut it and lock it and when the door handle met my hand, I tried to push it closed but it wouldn't move.  It was actually pushing the door open on me! After trying to move it, it wouldn't budge, so I gave in and sprinted to the back of my trailer and shut the bathroom door behind me and listened. I didn't hear anything actually enter the house, and after a few minutes of quiet, I exited the bathroom and entered my bedroom and got my gun and woke my wife. We both walked quietly back into the living room and the door was opened half-way, but there was no sign of it. I called a friend on the phone to come over to use his truck lights and my flashlights to search around but there was no more signs of it that night. The next morning I looked for tracks but there were none.  I did however find something like hairy, muddy fingerprints on the window pane.  I snapped a couple shots of it, and I stood where it was and determined the height to be around 8-81/2 feet tall. Since that night, both my wife and I have heard loud, mournful vocalizations in the middle of the night.  We have both gone out to investigate when we hear them and we hear loud, very large sounding \"things\" moving through the brush and weeds, shaking weeds, and we have smelled an awful, dead-skunk like smell on a couple of occassions in the early mornings. My friend and I have sat in a vehicle for a few hours in the early night, 11 PM-2 AM, and have heard brush and movement thru weeds attracting dogs close by to bark, and have had rocks or sticks thrown at the vehicle we are in. Also we were using a million candle spot that night we had stones thrown, and my friend swears he saw something \"manlike\" walking across our field of vision but we didn't get cameras or spot on it fast enough.That night I mention, which was 7-12-2006, was a full moon night so we had good night vision for a ways. My friend has also had large footprints in his driveway and has a local friend of his son has seen a pair of eyes, really high up and not very far away in the weeds while he and my friend's son and another boy were out jumping on a trampoline in the early evening one night 2 yrs ago and now he won't go out at night, and he is 16yrs old. My neighbors have been calling the police a couple of times a year, always in spring or summer, about \"someone\" or \"something\" walking and sneaking around their yard at night. This has been happening for about 8 yrs total now.  This property was all wood and scrub, and thick brush till around 8 yrs ago when the landowner cleared it up. The landlord's nephew said he saw a \"man\" walking through the yard around 11:30 AM 4 weeks ago and he thought it might have been me, but it wasn't.  We went to the area he saw it in during daylight and I was much shorter then what he saw. The landlord's wife was walking around a trailer in the middle of the property during the afternoon and felt like she was being watched and then she heard something very large run away through the brush just around the corner of a trailer where she was walking. This property is about 20 acres; he cleared about 10 of it and has 3 rental trailers on it.  I occupy one at the south end of the property, and he lives in one at the north end of the property.  The one in the middle is vacant, plus a couple of tool, supply  trailers(12x70 each) which he keeps shut and locked but the doors keep coming open and  there is some damage that we can't explain that looks like some of the siding was pried up or something tried to rip a piece off.  Also there are deep scratches around this piece of siding. The landlord and I have heard something tossing around some wood studs he has stacked up in the middle of his property and also we have heard what sounded like a long pipe thrown into weeds banging on a piece of wood. Since the first night I saw this big guy, I have heard it give out vocalizations like I have never heard before.  I have been an outdoorsman my whole life and I swear these were sounds like no other animal in this region would make.  Both my wife and I have heard what sounds like a pair of \"bigfeet\" walking thru woods by my house, dragging something and grunting back and forth at each other.  This occured around 5:45 AM. We hear it/them at least once a week, but around full moon times it seems to do more yelling and moving through brush when I go out to investigate.   I have tried vocalizing back from my front yard and both my wife and I heard something yell back across the field when I did it.  When my friend and I staked em out, just before we called it a day, I tried to yell a vocalization and that is when a few minutes afterwards I heard something in the brush and a rock hit the back of my van we were sitting in.  This was around 2:30 AM. [Edited]",
  "classification": "Class A",
  "county": "Hillsdale",
  "state": "Michigan",
  "location": "-84.7802,41.9773",
  "location_details": "Largely wooded, farming community, this property is at western end of long wooded, swampy like area close to Indiana and Ohio borders, around 30 miles to each."
}