{
  "reportId": "23030",
  "title": "",
  "date": "",
  "observed": "We were on a camping trip to Eagle Lake, California I woke up in the early morning around 3 a.m. to a yell. I thought I was dreaming at first and then it repeated. I didn't want to wake my wife so I whispered her name and to my surprise she answered me by saying, \"That's Bigfoot, isn't it\"? I kinda laughed and said \"I think it is\" we've both heard recordings of it on TV, but this was our first \"live\" experience. Not all recordings we've heard are the same as what we heard. This was a deep human/ape yell, and it lasted 4-6 seconds. Then a pause like it's filling its lungs and it would let it rip again. As in other reports, I've been camping all my life and heard all kinds of animal sounds. When you hear this one, you know it's something different. Actually, it's beautiful in its own way. I listened to the same yell on the home page of this website just today. It was hard to determine how far off the yells were, but if I had to guess I would say maybe a mile? About 10-15 minutes later we had an even better gift from the creature. Just up the hill from our campground we heard a loud bang. It was so loud, the only way I can describe it was that it sounded like a car drove into a tree. It was a very loud BOOM! Then one of the campers, who were camped at the base of the hill where the BOOM came from, said three words. I will not say what he said. They did make a fire and I'm sure they were scared. The next morning they were packed up and gone by the time I got up around 7. The campground host had their lantern on when I got up to listen to the yells at 3 a.m. I think they heard the yells too. I asked them the next morning and they said it might have been sirens. I could tell that she was trying to keep it quiet. She doesn't want folks to be scared to camp, or maybe she just didn't want to believe it herself. The next morning I took a drive across the Hwy 36 from the campground with my boy. We went on a dirt road just for fun to look at the terrain while my wife fixed breakfast with my daughter. The dirt road we were on was numbered 31N17, and we only went up a few miles and headed back to camp.  But it was up in those mountains off that dirt road somewhere, where the yells came from. The “BANG” was in our campground so it, Bigfoot, had to have crossed Hwy 36 to get on our side. Another note: it honestly sounded like a log connecting with a huge Ponderosa pine, and it was very, very loud.",
  "classification": "Class B",
  "county": "Tehama",
  "state": "California",
  "location_details": "Going east on Hwy 36 from Red Bluff, and just east of the town of Mineral, California, and before you get to Hwy 89 there is a campground on the south side of the highway. On the north side of that highway there is a forest road that is numbered 31N17."
}