{
  "reportId": "12576",
  "title": "Elk hunters find series of tracks in Mt. Zirkel Wilderness",
  "date": "1978-10-18",
  "observed": "At the time I was a resident of Steamboat Springs, Colorado. Each elk season we would put up an elk camp about 15 miles (horseback only) northwest of Strawberry Park in the MT Zirkel wilderness area. On the opening morning we were kept in camp by a rather heavy wet snow that did not stop until around 10 AM at which time the sun came out and we saddled up our horses to take a quick look for elk tracks, intending to return to camp for a quick lunch.  On my return to camp I cut a set of tracks that looked like a big barefoot person had passed by. The tracks were about 12 to 13 inches long with only four toes that I could see and a broad arch and heel area. I returned to camp and brought the camp cook back to look at them since they crossed the creek only about 100 yards from our tents. I decided to follow the tracks and found where the creature had stood on the other side of the creek milling about as if trying to decide where to go. The tracks led uphill through the black timber, which I followed for about half an hour.  The tracks had begun to interest my horse a great deal.  He kept sniffing the tracks and became more and more skittish until, in an area of several big blow-downs, he refused to go any further and began to show signs of panic which of course was transmitted to me.  I took a hard left into a big avalanche area which I followed for about 300 or 400 yards.  The black timber which I had just left began to turn into Aspens so I cut back hoping to reacquire the track. Whatever it was was still in the black timber (Spruce trees) and I didn't have much heart to go in and look.  End of story. I am an experienced woodsman, have spent lots of time in the high country on horseback, had a pack of Plott hounds for bear hunting, and have never encountered any tracks like these.  And the horse in question I had was a great mountain horse, was not gun shy or spooky in any way.  His skittish behavoir and was the biggest reason I gave up the hunt on the tracks. He lived to be 40 years old and was with me from the time he was 9 months old.",
  "classification": "Class B",
  "county": "Routt",
  "state": "Colorado",
  "location": "-106.7084,40.55415",
  "location_details": ""
}