{
  "reportId": "4980",
  "title": "Night sighting near Sandyville",
  "date": "1988-06-15",
  "observed": "My friend Marvin and I were on a double date with our girlfriends. We had planned to take them to an old collapsed train tunnel. We had gone there earlier to \"set up\" a little scare for them in the way of fake blood and an old torn shirt that we hung from a tree branch. I lot of teenagers hung out there on the weekends to party. No one I knew of had ever gone into the tunnel to where it had collapsed. There was about 10-12\" of standing water in the tunnel all the time and it was very dark inside. To access the removed railroad tracks leading up to the tunnel you had to go up a dirt road past a gas well and through some very deep brush. I made it up to within a quarter mile from the tunnel when I couldn't go any farther in my Ford Granada with its tall snow tires. It was about 11:00pm on a Thursday night. We all got out of the car and with one flashlight started for the tunnel. The area leading up to the tunnel is heavily wooded with high banks all the way around. We made it to the tunnel entrance conveniently shining the flashlight on the fake blood and the torn shirt creating a scream from the girls. My friend and I came clean with our prank and talked the girls into going on top of the tunnel opening with us. We climbed up the hill to the left of the opening and sat on top of the tunnel for awhile. I guess it was around midnight when we decided to leave. I didn't acknowledge what happened for the hour we were there then but the next day I realized how they were all connected. My girlfriend heard twigs snapping while we were sitting on the tunnel and I told her what did she expect we were in the woods. Next was the awful smell. We all smelled it and laughingly blamed it on each other. The smell was overwhelming. I again offered a reason in my most manly country knowledgeable voice. \" It must be the stagnate water in the tunnel \". Well the movement in the woods continued and the stench hung in the air but we didn't notice much while \"making out\". Anyway we decided to leave and made our way down the left side of the tunnel. I guess we were about halfway back to the car and Marvin said \" Did you guys hear that?\". We all stopped to listen and heard it. It sounded like a herd of elephants coming through the trees. We all looked at each other and the next thing we heard was a split second of silence and then a very loud thud. We started running to the car. It sounded like a giant dog running behind us. A low growl and these foot steps that I swore I could \"feel\". We got to the car and I opened the door. The girls dove into the backseat and I heard Marvin's door close. It was then that I glanced back toward the tunnel. I don't recall who was carrying the flashlight but whomever it was had dropped it about 150 yards back. What I saw will forever be in my memory. These huge legs covered in reddish brown hair and one hand came into view. The size of the legs were enormous but the hand looked like it could completely wrap around a basketball. The nails were long and blackened and the palm was hairless and appeared to be very callas. Well I jumped into the car and slammed my door. Someone yelled lock the doors. One of the girls was looking back and yelling \" There's something coming at us \" . I had gotten the car started and was standing on the gas pedal. My heart was racing and the girls were screaming. Marvin was yelling something about a turn to the left when the car pitched to the right. I don't know for sure but it sounded like something hit the car when it slid. Well I got the car righted and drove like Jeff Gordon for the next fifteen miles. When we finally slowed down and our heart rates slowed down to normal we started to talk about what had happened. My girlfriend said we were all probably running away from a deer that was more scared than us. They all started laughing and talking about how scared they were. Marvin and I dropped off the girls and went back to my house. I asked Marvin over coffee what he had seen. He said he didn't see anything. He figured the crashing through the trees was a deer and was glad I played along since the first attempt at scaring the girls didn't work as well as planned. I didn't say anything about what I had seen feeling I would be teased if word got around. I sure am glad I found this site.",
  "classification": "Class B",
  "county": "Tuscarawas",
  "state": "Ohio",
  "location": "-81.34993,40.62147",
  "location_details": "This happened in Sandyville Ohio in Tuscarawas county just off of Jenny Brick Road (I forget the county road number)."
}