{
  "reportId": "23645",
  "title": "Sighting by motorist in the Great Smoky Mountains National Park, not far from the park entrance.",
  "date": "1970-04-01",
  "observed": "In late spring of 1970 while traveling south between Gatlinburg, Tn and Cherokee, N.C. on Hiway 441 somewhere near the state line in the Great Smokey Mountains National Park. We sighted a very tall hairy creature. We were crusing down the road wondering if we would see any bear and as we rounded a curve there was this creature coming from the right side of the road down grade from some small trees and bushes that still had leaves. It moved across the road directly in front of us and after entering the bushes on the left side of the road angled off the same direction we were traveling. We could still see it's head for a few seconds before it dissapeared. I would guess the height to be somewhere in the 7+ foot tall range. It had a very long stride and walked like a human swinging it's long arms with it's stride. It covered the distance of 100 ft or so in seconds. It never looked at us, there were no noticable features that stood out. It was tall, slender, smooth clean straight hair that coved the whole body and it's head just seemed to come out of the body with no noticable neck. We were flabergasted at the sight of it and tried to convince ourselves it was a bear. But we knew it could not be because of the way it walked and it's height, no nose protruded nor could we see any facial features as it never even looked at us nor showed any sighns of us being there. We were crusing along probably around 45 MPH with almost no other traffic on the road that day. It happened so quickly that my wife never had time to pick up the camera in her lap and get a picture.",
  "classification": "Class A",
  "county": "Sevier",
  "state": "Tennessee",
  "location": "-83.53575,35.68449",
  "location_details": "From Gatlinburg,take Hwy 441(Newfound Gap Rd) towards Cherokee,NC.Just past the park entrance sign is where the sighting occurred."
}