{
  "reportId": "5650",
  "title": "Driver has early evening road sighting on Interstate 84 southeast of Pendleton",
  "date": "2004-10-05",
  "observed": "I was returning to my home in Kennewick, WA, after delivering Christmas gifts to relatives in southern Idaho.  It was early evening (around 5:45 pm), and I was driving in the westbound lanes of I-84.  I had encountered heavy, thick fog at the top of what is locally known as \"Cabbage Hill\".  It also began to snow.  The roadway was snow-covered and slick.  Traffic was moving quite slowly (20-30 mph).  Trucks were moving especially slow due to the steep roadway, poor visibility, and slick roads.  Traffic was backing up.  There were 5-6 vehicles, including mine, travelling as a group, with 2-3 in the left lane and 2-3 in the right. The westbound lanes make a sharp turn to the right, straighten, steepen their grade, go through a cut in the hillside, and make a turn to the left, crossing Patawa Creek.  This was in the vicinity of milemarker 222.  There is a guardrail alongside the exposed side of the westbound lanes when they are not protected by embankments. As we were driving on the straight section between the curves, I could see the brake lights of the vehicles in front of me come on - the red glow getting brighter.  I assumed we were either getting closer to the left turn and people were slowing, or there was some slower moving trucks ahead.  I was in the left lane, and slowing down, putting more space between me and the car in front.  Suddenly, I saw a large creature sitting/leaning on the pavement side of the guardrail - this would be to my left.  It appeared to be watching/waiting for traffic go by.  It's head turned from side to side, but I didn't notice detail.  I looked at it as I drove by, and noticed that it appeared to be covered by long hair, or a long fur-like coat, which was covered/streaked with snow.  It watched me drive by. At first I thought there must be an accident or stalled vehicle ahead (there were none behind me that I had passed), because why would someone be standing/sitting in that location, watching traffic?  I was puzzled by what I saw, and noticed there were no vehicles stalled/parked below the location, either.  The more I thought about it, the more I realized this was crazy.  Why would someone be there?  Except for the interstate, this spot is fairly isolated; farms/ranches are quite a long distance away.  The terrain is very steep and rugged.  The weather was quite cold, damp, inhospitable.  If this was a \"person\" stranded or seeking help, he/she/it did nothing to atract attention or to get someone to stop.  This was definitely not the time or place one would encounter someone out for a leisurely \"stretch of the legs\". I don't disbelieve in Sasquatch.  I know there will always be hoaxes, and logical explanations for things that seem unexplainable.  But I also know there are things yet to be \"discovered\", and new discoveries are made regularly.  The more I thought about this, the more I began to think that maybe I did see what my second reaction said I saw.  I called my wife on my cell to tell her.  She got a big kick/laugh out of my story, said something about maybe I've been driving too long and should take extra care in travelling the remaining distance to home.  When I got home, I retold my story to my family/friends.  That \"understanding\" smile has been the usual reaction.  But some have also said, \"Who knows?  Maybe you did see Sasquatch!\".  I finally convinced myself to report this to your site.  Maybe I'll discover I wasn't the only one to see something extraordinary that night.",
  "classification": "Class B",
  "county": "Umatilla",
  "state": "Oregon",
  "location": "-118.6131,45.58982",
  "location_details": "Left lane of westbound lanes, near milemarker 222, before roadway goes through cut in rock and then crosses Patawa Creek, guardrail on left (downhill) side of left lane.  The area is known as Cabbage Hill - steep, winding roadway south of Pendleton, OR on Interstate-84."
}