{
  "reportId": "24767",
  "title": "Motorist recalls possible early morning sighting north of Mt. Vernon",
  "date": "1991-11-15",
  "observed": "After reading the FAQ section, I have finally decided to tell someone of my \"sighting\". I am not saying for sure it was a bigfoot, but after reading the article you posted about   the young bigfoot caught on a game cam that some people say was \"just a bear\" made me realize that what I saw may have been a young bigfoot. My sighting was actually \"the near miss with a car\" experience. I am honestly not positive of the year, but it was near 1991 or 92. I was driving home from work, alone, about 1am. I had just turned onto the road I lived off of and was going down the first hill. Half way down, something ran across the road in front of me. I hit my brakes, natural instinct, barely missing it I was sure, and then I kept going.  It was merely seconds, but I knew what I saw was not something normal. It was on all fours, but the body and head seemed parallel to the ground, unlike the bears I have seen in zoos. (They seem to have a downward slope from their hip to their head.) The body was not large at the back half but evenly proportioned. The legs seemed to be easily defined. Not real thick at the top tapering down. The only way I can describe it would be that the legs came from the hip, no flap of skin coming from the belly region to the leg to make them look bigger at the body and it seemed the bending when it ran came from the hip and knee area. The thing that has bothered me all these years, the one thing I knew that separates this from your typical animal was the head. It was the way it looked in my direction as it ran. 1) In my experience, most animals running across the road like that don't even look at you.  2) What has bothered me the most, and I couldn't put my finger on til recently, was when it looked in my direction, it didn't turn it's head \"normally\". It brought it's head up a little, but it turned it sideways to see! (picture yourself on all fours, looking at the floor. Without lifting your head, look to the left. That is how it looked my way.) I did see two eyes and a mouth, it happened too quick to get a detailed look , but I saw a face, a face that did NOT have an extended snout. Lighter colored than the rest of the brown colored body. It seemed hairless, but again, I can't be positive how hairless it was. I had a radio on, so if there was anything to hear, I didn't hear it. The next day I drove past where I saw it and saw no signs of anything. Not then , or since then. I am from Muscatine, Iowa originally. We lived not too far from the river, right beside the levee actually, and back in the seventies there seemed to be a migratory path going thru the area. I recall hearing about an encounter with a neighbors dog, and going fishing at night only to be loaded very quickly back up into the truck by dad to leave the area because of large branches breaking in the woods. But in all the stories I have heard, I never realized that a young bigfoot is known to run on all fours so I never made the connection until I read your website. I have always assumed they walk on two legs all the time.",
  "classification": "Class B",
  "county": "Lawrence",
  "state": "Missouri",
  "location": "-93.73122,37.19201",
  "location_details": "Directions omitted upon wtiness' request"
}