{
  "reportId": "2919",
  "title": "",
  "date": "",
  "observed": "I was camping at the Rubicon River with a couple of friends of mine, a place where we have camped relatively regularly for the past 5 or 6 years. Normally when I am there, I see many ground squirrels and chipmunks.  Occasionally, I will notice a few deer, especially near the campsites (from sloppy campers).  Normally, there are several birds in the area too. We arrived late in the afternon and realized that the area was unusually quiet.  No animals were scurrying or foraging. By nightfall, the area was nearly silent.  The only noises were the occasional cars passing on the bridge. We decided to do some exploring up the river after breakfast.  It was still quiet.  we wanted to find good rocks for climbing and jumping into the river. About a 1/4 mile upstream, we stopped at a formation that came up from the banks about 30 to 40 feet.  We free climbed and sat up top to check out the valley. Directly across the river (north facing bank), the rocks were very dark, moss covered and looked fairly tough to climb.  There were also many trees and bushes. There was a deep crevasse near the water level that was 4 to 5 feet wide and full of growth.  we thought that it would be fun to find a way across the river and climb it.  At that moment, my friend Jeff noticed a rustling behind the shrubs in the crevasse.  He got our attention and we all checked it out.  A moment later, we saw a large, hairy figure move into an opening in the crevasse, in a crouching position.  It was crouched on the two rear feet and the front right paw was grasping a tree (to maintain balance?)  The hair was dark brown, and all over the body.  Although we didn't see it stand up as it moved up the crevasse, we could tell that it was well over 6 feet tall, probably closer to 7 feet.  The face of the creature had no snout, but rather a flat face, much like a primate.  The rear paws looked much like human feet, but larger, maybe a foot and a half long.  As it went higher into the crevasse, it entered a darker area thick with trees and manzanita, at which point we lost it. At this time, we decided to leave and get back to our campsite as fast as possible, always glancing back to see if the creature was behing us.  Once we reached our site, we decided to cut the trip short and head back home.",
  "classification": "Class A",
  "county": "Placer",
  "state": "California",
  "location_details": "From Auburn, Ca... South on 49. South on 193. Turn left onto Main st (in Georgetown, CA). This becomes Georgetown-Wentworth Springs Rd. This road passed Stumpy Meadows Lake (on the right).  About three to four miles, past it, turn left (first paved left possible).  I believe that it goes to Hell Hole Reservoir.  After dropping several hundred feet, the road crosses the Rubicon river.  The first trail on the right (immediately after crossing the bridge) leads down to the river (and our campsite)."
}