{
  "reportId": "16448",
  "title": "Possible vocalizations awaken campers in Clark Fork Campground",
  "date": "2001-09-25",
  "observed": "I noticed a report on your website from September of 2001 at the Sand Flat campground (State of California, County of Tuolumne). The hair stood up on my neck when I read this due to the similarities with my experience. My experience occurred the same month and year at the Clark Fork campground, about one mile Southwest of Sand Flat. My wife and I arrived at the Clark Fork campground on Thursday, September 20th 2001. This was our first ever September camping trip (we usually go in mid-August). We were surprised at how few people were in the campground compared to our 4 previous trips to this area. One factor that probably lead to the extremely low occupancy was that the 9/11 terrorist attacks had happened the week before. Out of 88 camp sites, probably only twelve were occupied. We set up our camp in the “B loop” and settled in. The B loop is our favorite of the 2 campground loops. It has a slightly nicer setting (more pine trees, nicer bathrooms, etc.) and is closer to the “wilderness” than the A loop. But on Sunday the 23rd, the two retiree campground hosts told us the B loop was closing for the season and that we would need to move to the A loop of we were going to stay. After relocating to the A loop on Sunday morning we noticed that there was only two other campsites occupied. All other campers had left. One group was a young couple with two very young children, the other was two older men in their 60’s or 70’s with a trailer. I had never seen so few people in this area. It was really nice to practically have the whole place to ourselves. It was very quiet. Sunday night it rained hard, and we spent most of Monday morning patching our leaky tent and drying everything out. On Monday night, we did as we always did before bed: played cards and listened to the radio. We climbed into our tent and went to bed at about 10:00 p.m. Late that night after 2 a.m., I slowly came out of a deep sleep due to high-pitch noise which I initially thought was a wounded coyote. After I was fully awake, the noise got much louder. It was clearly a “screaming” sound rather than howling, yipping, yelling, or shouting. The screaming appeared to be coming from the Clark Fork River area, north of the access road which leads to the campground. The sound got progressively louder and was obviously not from a canine. I wondered if any human being could make a sound so loud, long, and hideous. The sound changed pitch and tempo many times. My wife woke up about a minute into the screaming. She asked, “Why is that man screaming?” I had no idea what could have made such a sound but it was very unsettling. My wife said it sounded like a man was being murdered out in the forest, but then commented that a person couldn’t make a sound like that. Whatever made these sounds had to have an enormous lung capacity. The screaming went on for about 5 full minutes before it stopped. I laid awake for a while, nervous and wondering what it could have been. Frankly I didn’t want to know. As I drifted off to sleep about an hour later, I was awakened by a very loud metal-on-metal “bang” coming from the closed B loop portion of the campground. It was obvious to me that the sound was one of the bear-proof dumpster lids being lifted up and then dropped. I’ve heard the sound many times. Now that’s fine and dandy, except that it was 3:00 a.m., bears can’t open the dumpster lids, and there was no one else in the area where the sound came from. The B loop was closed. This really bothered me. I did not fall asleep until almost dawn. I laid clutching a pistol with my heart racing every time I heard a rustle outside of our tent. I refused to leave the tent until it was light. I have heard hundreds of coyotes throughout the years, both in the Sierras and in the California desert, and this screaming was not a coyote. As for the possibility of a mountain lion making these sounds, I would bet my life that it wasn’t a feline. I’ve heard mountain lions make some strange noises, but the bottom line is that a cat sounds like a cat. It’s easy to distinguish between noises a feline, a canine, or a bear makes. The screaming that my wife and I heard was none of these.",
  "classification": "Class B",
  "county": "Tuolumne",
  "state": "California",
  "location": "-119.801,38.3958",
  "location_details": "Popular area off Highway 108 corridor. Clark Fork campground is located next to the Clark Fork (river) near the Carson-Iceberg Wilderness in the Stanislaus National Forest."
}