{
  "reportId": "4158",
  "title": "Brothers encounter a large, very well-built, man-like creature",
  "date": "1988-10-15",
  "observed": "This story I have never told anyone, except friends and family. I have been a outdoorsman all my life.  A reptile hunter has always been one of my hobbies,so I can say when im out at night with my spotlight looking for snakes in the desert, along cuts, arroys, or canyons, I have to make very sure what I am looking at cause I could step on a rattler or other dangerous critter. This happened to me one night in 1988. A friend of mine had a deer lease up by throckmorton and wanted me and my brother enlaw to go with him to set up camp. Upon arrival, we went through the gate, picked a good spot in the clearing and removed the trailer camper from his truck. We started a fire had a few beers. after we all got our wind back, our one friend said he was going to bed, as he had to set up his feeders in the moring and scout for deer. Me and my brother inlaw decided to take the topic. maps and go explore the many ponds around to try and catch bullfrogs, or see what we could find.  The first pond had a few but we decided to go to a bigger one down the trail abit. since we had mag lights before we left camp are friend warned us about the gamewarden seeing us using lights out on the deer lease. Anyhow  we started to walk to the other pond following the topic maps that we had. We had gone about a quarter mile when we notice something hiding behind a tree. Me and my inlaw stopped. Saying what the hell is that. At first we thought it to be the gamewarden. We had our lights right on it, standing like a human looking around the tree at us. We decided to get a little closer. It didn;t move. My inlaw said whistle at it. So I did.  I whistled twice, wht. wht.  Upon that it steped right out in the road. Were talking a four foot side step. I had seen some men before but this was one strong one. I'm six ft it was seven or alittle more. heavy eyebrows, yellow eyes with red in them. The midbody was short compared to the legs, which were long, arm down to the kneecaps. covered in light hair head was gray hair. No hairy creature like you here. This was one lean machine, like a cougar is. I mean We were close enough I could see the muscles on this man. Anyhow it starting to walk for us. It took about two or three steps. I mean four foot steps. not in a run but in a walk. I told my inlaw Im running, he was In shock, stairing at the thing. I hit him and turned and said come on. He was running backwards with his light on it. I told him come on. We maid a quarter mile in seconds flat, knocked on our friends camper door wanting the gun, telling him this thing was right behind us. He wouldn't give it to us saying we saw a deer our cow and closed the door to the camper. Me and my inlaw were sleeping by the fire that night and we wanted to make sure it was gone. So I got a hoe and he got a bushwacker and we went back to the area we saw it to make sure it was gone. We saw know sight of it again, so we went back to camp. The next morning we did the deer thing  with our friend as he laugh at us the rest of the trip. My inlaw won't even talk about it. not even to me. I know what I saw. I have seen cougar, badger, deer, and many others in the night with lights. It was human I wouldn't had shot it if I had a gun. It didn't want to hurt us, or it could have caught us easy. It seemed curious as we were of it. There was a noise like a thumping or something I can't explain, it was gone when we went back to. Its been ten years or more but I remember it like yesterday. never reported it because I thought he should be left alone.",
  "classification": "Class A",
  "county": "Throckmorton",
  "state": "Texas",
  "location": "-99.18778,33.16972",
  "location_details": ""
}