{
  "reportId": "30634",
  "title": "Night hikers possibly stalked near Bee Tree Preserve",
  "date": "2011-05-14",
  "observed": "In mid spring of this year, I was hiking through the woods with a friend in the middle of the night. Making our way up onto a trail, we stumbled upon a picnic table and decided to sit down and rest. We were startled to find the whole ground glowing green around us. Using my headlamp, we attempted to spot whatever was causing these little glowing green dots. At the time we had no clue what was causing this to happen, but we later realized that firefly larvae were lighting up the forest floor. Seeing the glows coming more intensely from a nearby hillside deeper in the woods, we decided to scan the the hillside with our headlamp. As soon as we shined the headlamp, we caught a pair or grapefruit sized bright green (with a slight hint of gold) eye reflections peering over the crest of the hill. We stood in shock, never removing the light from those eyes. \"Maybe its a deer,\" she said. A few moments later the eyes raise up to be about 5 off the ground and rotate slightly more towards us. \"See,\" I say, \"It is just a deer.\" As soon as that last word leaves my mouth the eye reflections stand up another 4 feet to be standing at a towering 9 feet. It slowly occurred to be that I had never seen eye reflections of this color and that the closest thing might be a bear. Suddenly I hear a slight rustling behind me. Swinging the light around we caught the reflections of two more sets of eyes. They too were grapefruit sized and green, but were spookily sneaking up on us from behind. I get caught in a frenzy of shinning the light back and forth between all three sets of eyes until they just quietly disappear. we hurried out of the area, terrified, and made our way south to a different hiking area to take the whole situation in. Again we noticed firefly larvae, but when we began to approach the woods (which in fact are connected to the last area by water system) a bunch of creatures began running around in the woods, breaking branches and shaking bushes and trees. Later, upon watching one of your videos and discussing the experience with some knowledgable peers, I realized that I had experienced a sasquatch encounter.  Returning to the same spot some 2 or 3 months later with a few buddies, we were able to catch the same eye reflections for a very short period of time.",
  "classification": "Class B",
  "county": "Baltimore",
  "state": "Maryland",
  "location": "-76.6691,39.6946",
  "location_details": "I don't want to include directions in this report."
}