{
  "reportId": "15926",
  "title": "Possible vocalization/intimidation at Ouabache State Park",
  "date": "1990-07-01",
  "observed": "This happened at Oubache State Park near Bluffton Indiana either the summer of 1989 or 1990. I was working as a night watchman at the front gate and had been watching television when I decided that I needed to get something out of my Ford Bronco. The area leading up to the park is heavily forested with trees that had been planted by the Civilian Conservation Corps during the Depression. The road leading into the park was about a third of a mile long. As I stepped outside the booth and was crossing the road to the parking lot, I heard the most terrifying scream that I have ever heard in my life about 250 yards to the southwest of my location. At the same time that I heard the scream I also heard a tree snap and break and fall to the ground. The tree sounded to be quite large. The weather that night was very calm and there was no wind at all which could account for this tree falling down. I quickly turned around and headed back for my booth and sat down to think about what just happened. I felt like I was in a daze for a few minutes as I was trying to think what a logical explaination of this event could be. I sat there for about 45 minutes and after I had settled down a bit, I decided that it must have been my imagination playing tricks on me and I proceeded to head back out to my truck. I was walking toward my truck and had gotten to the exact same spot that I was in previously when I heard the horrible scream when I heard it once again and this time it was about 50 yards away from my booth. I once again quickly retreated to my booth and sat there until daylight. Once day light arrived I walked out in the woods to investigate but found nothing out of the ordinary. I didn't walk far enough out to find the tree as I was still quite unsettled by what I heard. I have heard screech owls and bobcats but nothing, absoultely nothing, that compares to the sound that I heard that night. I can't say to this day what it might have been, but this has bothered me for about 16 years and I still think of it evey now and then. Reading about some of the other sighitngs that people have heard and the sounds that they said this creature made makes me think of my own experience and I wonder if I too actually had an encounter.",
  "classification": "Class B",
  "county": "Wells",
  "state": "Indiana",
  "location": "-85.5045,40.7219",
  "location_details": ""
}