{
  "reportId": "11040",
  "title": "Vocalizations heard by expeditioners on Olympic Peninsula.",
  "date": "2004-10-21",
  "observed": "This happened during the October 2004 Washington BFRO Expedition on the Olympic Penninsula. It was the first night of the expedition and my brother and I had been asked (as well as two other team members) to go to a location that had a recent sighting reported by [a local law enforcement officer]. The objective for the night was to walk a portion of the mountain road while making occasional wood knocks with hopes of attracting a sasquatch. By the time we arrived at the location and prepared all of our gear it had become completely dark.  We started walking down the mountain road.  After about 5 minutes of walking we heard two short grunting sounds that came from the woods to our left (south of the road).  The grunting noises were very deep sounding, had some power behind them. There were a few moments of silence and blank stares between us. We continued down the road, wondering if the thing would make more noise. We continued doing wood knocks as we walked. A few hours passed as we continued to walk up and down the 3/4 mile stretch of the road, knocking every 20-30 minutes.  Then we were contacted by radio from another team that was positioned approximately 3-5 miles from us along the banks of [a river]. The river team had apparently been hearing wood knocks coming from somewhere between their location and our location. They wanted to check if it was our wood knocks they were hearing. To see whether the river team could hear our wood knocks, we made some loud knocks and asked if the river team could hear us. The river team asked us to repeat the knocks a few times. After a few tries they said they were not able to hear our knocks at all, so whatever they were hearing was closer to them. We continued back up the road.  Not longer after climbing back up the road we heard what I could only describe as a scream that came from the southwest of us, approximately 250 - 300 yards in the woods. The \"scream\" started as a low, deep moan and went into a very high pitched screech lasting at least a few seconds.  It was very unlike anything we had ever heard. We were shocked because we had hunted in the Pacific Northwest for years and knew every kind of large animal sound. Several minutes of silence went by and we decided to proceed up the road further to where the truck was parked.  After reaching the truck we unloaded some of our equipment. We were ready to start heading back down the road again when we heard the second scream. This time the scream was much closer, within 50 yards of us and on the opposite side of the road from the first scream.  The scream again started as a low moan and reached a very high pitched screech.  The volume and power of the scream was amazing, it made every hair stand on end.  The scream probably lasted a few seconds, but was so loud that I was expecting this animal to come through the trees at any moment. All four stood there in complete shock at what we had just heard.  We eventually gathered ourselves and continued walking up and down the road for a period of time, wondering what was going to happen next. Nothing further happened that evening. My brother and I are experienced outdoorsmen.  We have spent most of our lives in the woods in and around the Pacific Northwest.  We both are very familiar with the calls and sounds of all of the known animal species in the area, especially elk, deer and bear.  The screams we experienced were not any animal that either of us, or any of the others in our team, had ever heard before. If any of us had heard something like this before we sure would not have forgotten it. We'll definitely remember what we heard on this trip.",
  "classification": "Class B",
  "county": "Jefferson",
  "state": "Washington",
  "location": "-124.3324,47.5532",
  "location_details": "[Details removed]"
}