{
  "reportId": "4187",
  "title": "",
  "date": "",
  "observed": "My experience was with my finding \"tracks\".  I am a runner who has a cabin and property in the Salmon River mountain area off of HWY 93 on the North Fork of the Salmon on the Hughes Creek Drainage.  One of the areas I like to explore in the spring when the spring comes are the \"fire roads\" off of HWY 93 up into the mountains that surround the Lost Trail Pass. I decided to go up into the \"Twin Creeks\" area. I made my way up an unused fire road which was surfaced with a very fine dust. This dust showed my footprints distinctly, which I noticed on my way down, particularily. I went up approx. 3 miles and turned around. During my outing, I made a distinct sound with my drink bottle which, when emtied it, I filled with rocks and rattled.  This is because I did not want to surprise any bears which might be in my vacinity. About 1 miles after I turned around, I had been retracing my own footprints and watching carefully so as not to fall, I realized that I had crossed a new set of tracks traversing mine diagnally across the road. THEY WERE NEW! THEY HAD BEEM CREATED SINCE I HAD PASSED GOING UP! I halted myself and assessed what I was seeing and I will never Know a feeling of such acknowledgment. I could not believe, or rather I DID believe that what I saw was beyond my comprehension. I am a college graduate and teach for a natural science school in Utah and everything that I knew did not fit what I was seeing. TWO sets of prints, one was at least 13\"-14\" long and 5\" wide and the second set was a miniture of these.  NO INSTEP, and five distinct toes at the top. The great toe was very broad. Needless to say, I ran out of there instinctually, faster than I have run in my life.  When I discussed this with my local friends (family) I was met with silence and not doubt... I had never  given the idea of Bigfoot a second thought and now I don't know what else to consider.",
  "classification": "Class B",
  "county": "Lemhi",
  "state": "Idaho",
  "location_details": "This location is about 8-10 miles south of the Lost Trail pass summit. Twin Creeks campground road turnoff and about 3 miles up the fire road that proceeds left up the mountain to overlook the North Fork of the Salmon River."
}