{
  "reportId": "56826",
  "title": "Close daytime sighting on a ranch in the Canadian River Valley",
  "date": "2014-07-14",
  "observed": "I had just loaded some oil drilling equipment to haul back to the oil company yard for them. I had been driving down the lease road going through a very large ranch on the Canadian River Valley in the Texas Panhandle. It was about 7:30 p.m.  I was driving very slow, approximately 10-15 MPH, because the ranch has speed limits on their lease roads and the roads are very rough. This location is on private property and out of respect for the landowner I will not disclose the location. It is a very desolate area, about 23 miles to the nearest town. There are very few homes in the area with about 5-10 miles between homes. It was unusual weather for mid-July. It was warm but overcast with clouds and a breeze coming out the north. It was still very bright for it was over an hour before sunset. I was driving along noticing how heavy the plum bushes were loaded. We haven’t had a good crop of Sand Plums in several years on account of the severe drought that we had been suffering from. I noticed out of my peripheral vision what looked to be a very tall and very thick butt of a bull. I kept thinking this was very unusual to see a river ranch bull that is so large and thick. I have only seen this type of bull on the show circuit, I have showed cattle in 4-H and FFA and my kids showed cattle also, I grew up on a dairy farm and we also raised beef cattle, I have raised cattle for over 40 years and been around many different breeds of cattle, yet this one was exceptionally large. As I got closer to this bull I starting getting a clearer look at it.  Bulls this thick typically don't have much of a tail head, they are pretty flat topped, but this one did. As I got closer I realized he didn't have a tail at all.  The hair was wrong and too long for a bull. It was brown with a reddish tint on the ends as if sun bleached. This bull has 4-6 inch long, bleached out strawberry blonde, matted hair hanging just above mid-point on him. I then notice that I couldn’t see under this bull, and that it’s very wide at the ground level. This made no sense. By this time, there was no brush between me and him to block my view of this thing! He was standing in the open on bare ground. There was a large shade tree; the cattle used a good bit because there was no grass around the tree. Then it HIT me, this is a Bigfoot. I cannot believe it. Not 70 feet from me. My pickup and trailer are a total of 65 feet long so it was pretty easy to figure the distance to him. I realize I caught the big fellow out in the wide open. I knew I was coming up on a curve in the road and I could drive off into a deep ditch so I looked up to stay on the road, hitting my brakes to stop. I didn't take my eyes off of him for more than 2 seconds, but that was all he needed. He was gone. There is a small canyon about 30 feet to the south of where he was.  I believe he went that direction.  I jumped out of my truck and ran down to the end of my trailer to try to see this massive creature again, then I realized, with its size and speed that was probably not a good idea. As I walked back to my truck, watching my back, I knew where he had been standing and that there was probably footprints and knuckle prints there that I could take pictures of, I had my camera with me, and I’d have proof to show my family of what I saw. But I also knew he could be on top of me in 2 seconds if I went over there. I had my phone and my camera with me but it never entered my mind to grab them while the creature was standing there in front of me. I have always heard of these being described as massive creatures. Truly that is the only way to describe it. The shoulders and arms were massive. I didn't get a good look at its face because I was too busy  wondering why I couldn't see under it, so I focused more on the lower half. But I did notice the contrasting colors of its face. It was lighter around the eyes and darker over the nose and I think I caught him with sand plums in his mouth because of the red tint in the lip area. He looked to be at least 5' 6\" tall down on his knuckles and could be easily taller than that. He was very wide, I am 6'3\" and 235 lbs and he was at least 1 1/2 to 2 of me in width. Down on my knuckles I am on 3 feet tall. I know their arms are longer than humans, but this still makes him a very tall boy! I have had to estimate the weight of cattle most of my life and was always been within 10 -25 lbs of guessing them correctly. And I would estimate him weighing in the neighborhood of 850 lbs. With that said he could easily weigh more because of the shear muscle mass that I could see.",
  "classification": "Class A",
  "county": "Roberts",
  "state": "Texas",
  "location": "-100.6767,35.93985",
  "location_details": "Directions will be given to investigator."
}