{
  "reportId": "14037",
  "title": "Possible stalking and vocalizations near Frozen Camp",
  "date": "2006-05-16",
  "observed": "It was the summer of 1983 or 84 and I was working for a company during the summer months trying to pay my way through college.  I worked 58 hours a week so I had little time to do anything else besides work.  I had purchased a tent and decided to go camping one Saturday night (it was in August as best I can remember).  Because of the hours I worked, this was the only night I could go camping (I also went to church on Sundays but I had plenty of time to get up and make it to church – service did not start until 10:00 AM). After arriving home from work on the Saturday (date not known exactly) I planned to go camping on, I packed my backpack with all the necessary items for the short stay including my new tent.  I left the house and hiked the mile or so to the area where I planned to camp.  Also, my dog accompanied me.  He was a fairly large collie dog weighing about 80 pounds.  This dog was very intelligent and to my knowledge was not afraid of any animal (this is an important fact to this incident).  I had never seen him back down from a fight. The area was forest (a mix of pine and eastern hardwoods) and consisted of 1,050 acres.  I knew this area well because I had hunted it for approximately 4 years.  I also hunted a farm directly adjacent to this property which consisted of 450 acres.  This area is surrounded by old farmland as well as other stretches of forested land.  I made camp on top of a ridge that was relatively flat for the area. After setting up my tent and camp, I made a fire pit (It was the dry months and I did not want to start a forest fire) and started a small fire to cook on. At approximately 9:30 PM I turned in for the night.  At around 10:00 PM I was awakened by an “animal” call I had never heard before.  I can only describe the sound by saying it was big and had the lung capacity of a lion or an elephant.  It literally shook the forest and my chest. I have pretty much heard everything there is to hear in the eastern forests (life long hunter and geologist – I have literally spent years in the woods) and this was so completely different there was nothing at the time I could compare it to (recently, I heard the male gorilla recording that was posted on the BFRO web site and it sounded eerily similar). At first I was unsure of what I heard because I was half asleep.  The first time I heard the call it came from about 20 yards off to my left.  15 seconds later I heard the same thing directly behind my tent still about 20 yards off.  By this time I am setting up putting on my pants and boots.  Again, about 15 seconds later, I heard the same call off to the right of my tent about 20 yards off.  My hair was literally standing on end.  At this point, I was somewhat concerned that I was not hearing my dog bark or growl.  He was sleeping outside the tent and appeared to have left.  I grab an eight inch hunting knife and a wimpy flashlight I had with me.  When I pulled the tent flap back to shine the flashlight on whatever was making the noise, I noticed my dog backing up with his tail between his legs, the hair on the nape of his neck sticking straight up growling just barely audible. He could see what was making the noise but I was unable to make out any thing besides trees with the flashlight I had.  Whatever was out there, the dog kept his eyes on it.  I believed to this day that dog would have protected me to the death.  As I have already stated the hair on my body was standing on end and I was extremely afraid (I am 6’ 1”,  220 lbs and don’t scare too easily).  I believe whatever was making the sound was doing so in a threatening manner. I left all my gear and only took the knife and flashlight for protection as I hiked the mile back out of the woods.  My dog constantly looked back.  He walked beside me the whole way out and would not leave my side.  I had to cross a couple of fields and I never saw anything following us but there were also stands of trees that ran beside the fields in the direction my dog was looking. After church the next day, I went back and got all my gear and it was exactly like I had left it.  There was also food that was left untouched.  I scouted the area for tracks but found none.  As already stated, I was in thick woods and there was a heavy covering of leaves and such.",
  "classification": "Class B",
  "county": "Jackson",
  "state": "West Virginia",
  "location": "-81.5784,38.8317",
  "location_details": "Edited out at request of witness."
}