{
  "reportId": "13515",
  "title": "Late afternoon sighting in the Pine Barrens",
  "date": "2006-03-09",
  "observed": "This sighting had happened when me and my girlfriend were driving on one of the dirt trails off Route 72.  We had just gotten on the trail and I wanted to stop for a second.  After being stopped for a few minutes, I looked up and noticed my girlfriend looked like she had just seen a ghost.  She said that she just saw something tall and light brown walk across the road we were on.  So I said it was probably just a deer or something. I got out and looked around, and I saw some bushes moving and heard some rustling.  As soon as I turned my head I saw this face of an animal about 6 feet high looking straight at me through this big pile of brush.  The face itself was black but the hair was a dark sandy to light brown color.  It looked like the face of an ape.  The hair on the top of its head was somewhat long. After looking at it for a few seconds I shook my head to see if i had seen what I thought I had, while I was doing so the animal had run away.  I saw it running for a second but then I turned back  to my car and got in.  Once I was in I asked her what she thought she saw.  She said that it was the same thing she had seen when we went camping six months prior to this. We went camping near Tuckerton but we had taken a detour to Apple Pie Hill.  There is a ranger lookout tower there, so went to the top and she looked down and said what the hell is that.  I pointed my flashlight in the direction but didn't see anything.  She said she saw something running in front of the tower and it looked like the same thing she had seen. But once I had gotten back into my car I looked around for it again but didn't see it.  So I put my window down and started driving, I could hear something running toward my car so I stopped and turned off my car again.  I still heard something coming my way, it sounded like a human or something running on two feet as opposed to a animal on 4 feet galloping through the woods.  After a few minutes of listening she was getting nervous so I had turned around and headed home.",
  "classification": "Class A",
  "county": "Burlington",
  "state": "New Jersey",
  "location": "-74.3749,39.7962",
  "location_details": "Edited out at witnesses request."
}