{
  "reportId": "4788",
  "title": "Screams heard in the Great Dismal Swamp",
  "date": "2000-07-21",
  "observed": "After finally getting my twelve campers to sleep I left them with my co-counselor and took the short walk to the showers.  The time was 11:00 pm and everyone was asleep or at least in their cabins.  It took me 3 minutes to walk to the showers and on the way I didn't notice anything unusual.  After my shower I stepped outside at approximately 11:25 to walk around to the other side of the building.  At this point I recall the sounds of the forest being stilled or a little subdued.  I also noticed that there were no sounds of the junior staff coming from the bunk house or pool as was usual that time of night, but it didn't make much of an impression on me as I entered the other side of the building and grabbed my laundry basket. Coming back outside and rounding the building I heard something that stopped me in my tracks.  It seemed to be coming from a wooded area west of the bunk house and my initial thought was that it was junior staff playing around, laughing, and yelling.  But the sound seemed to be coming from one individual and was carrying very far.  It was a really loud howling changing into a type of whining bark and then ending almost like a hoot.  It was a sound that puzzled me because I am knowledgable in the sounds of wildlife and had never heard anything like it.  I also knew somehow that it was impossible for a human to make that sound, yet it sounded eerily human. Since I only heard it once I sucked it up and started walking out of the circle of light streaming from the shower building and towards the girl's cabins.  Of course my cabin was the last one on the end and of course most people had forgot to turn on their porch lights.  None of this bothered me though until I heard the noise again.  It was a little closer and louder and it frightened me that it wasn't just a one time thing as it immediately \"called\" again after the second time.  I wasn't afraid I was going to get attacked or anything but it would be nice to be indoors so I started walking faster. The sound was repeating itself again and it sounded as if whatever was making it was getting still closer and paralleling my path.  I finally decided to break into a run and quickly reached my cabin, entering it.  The time that had elapsed from when I first heard the \"call\" til when I entered my cabin was probably a minute and a half since I ran some of the way back to my cabin.  I also didn't hear anything else after I got inside but that may be due to the fact that I put on my discman to calm my nerves.  Also, the number of \"calls\" I heard in the elapsed time were about seven, some flowing into each other near the end. The next day I told the camp director and a few other counselors what had happened but they brushed it off as being a turkey or a dog and even though I didn't know what it was, I knew it wasn't one of these two.  Being a prankster and practical hoaxster wasn't on my side because many thought I was joking.  When I wouldn't relent with my story I was poked fun at and so I think anyone else that may have heard anything may have been discouraged from saying anything. I didn't make this report sooner because I didn't discover the website until a few months ago and I have been searching the internet for sound clips of wild animals to maybe rule out or make a possible connection with what I heard.  Everything I listened to was worlds away from what I heard, except for sound clips of supposed Sasquatch that were available on this site and some others.",
  "classification": "Class B",
  "county": "Chesapeake City",
  "state": "Virginia",
  "location": "-76.28729,36.5884",
  "location_details": "The location was on Bunch Walnut Road, on the North side of the Northwest River about 1/4 of a mile away from the river."
}