{
  "reportId": "27184",
  "title": "Mother and son have a possible early morning sighting near Eagle Creek",
  "date": "2010-01-14",
  "observed": "On Jan 14th, 2010,  I was taking my son to school on Hwy. 36, outside of Sanders. We were following a Ford Ranger and were probably 30-40 foot behind it. I noticed something run quickly in front of that truck. I did not see the thing run from the opposite side of the road, though obviously that’s where it came from. I noticed it when it was right in the middle of the road. I’m guessing that the truck is between 5’ and 6’ tall. From my view, behind the truck, I could still see about 1’ of the thing over the top of the cab before it came back into full view and went up into the woods that run right by the road. During the second or two that it came back into full view after crossing in front of the truck, I was able to see it’s silhouette fully in the headlights from the truck. It was on two legs, dark in color, wide (depth of the body, from back to chest-I don’t mean the broadness of the shoulders as I saw it from the side), large legs and very tall. Because of it’s position and it being dark out, I was not able to see the face or front of it.  I’m not able to give any description of  the fur or hair that was covering it either. I wish I could tell you that I saw a Bigfoot. Since I can’t say that for sure, I will tell you what I did NOT see, for sure. I did not see a deer, elk, bear or man. The truck in front of me hit his breaks during my sighting so there is no doubt to me that he saw it as well. I should tell you that this thing crossed closely in front of him. It wasn’t like it was a great distance in front of him. I wanted to run up and talk to the man in the truck when we got to the end of the road but didn’t because I didn’t want to scare my son (who is already afraid to play outside out house by himself). As soon as this vanished from my sight, my little boy gasped and yelled, “Did you see that?”.  I responded calmly telling him that I had and asked him what he thought it was. He was unsure but said that it was big and quick. I didn’t ask any more questions at that time as I didn’t want to scare him or lead him in any way. I wanted to see what he would say about it after the ‘shock’ (?) had wore off. I asked him again this morning (Jan. 21st) what he thought it was. He said that he didn’t know. I asked him what size he thought it was and he said medium sized. I told him that I was a little over 5’ and told him to guess a size in feet and he said around 5’.",
  "classification": "Class B",
  "county": "Carroll",
  "state": "Kentucky",
  "location": "-85.00044,38.63813",
  "location_details": ""
}