{
  "reportId": "46520",
  "title": "Homeowner has possible encounter while in his yard near Ocean Shores",
  "date": "2014-03-15",
  "observed": "I went out to get a couple empty plant pots located at the north corner of my house. I had some stacked up in a box. To the north and behind my house, the neighbors dog was barking like crazy from inside their fenced off back yard... There's thick barrier of brush between me and the next lot facing west so I couldn't really see the dog. I grabbed the two small pots and stood up and yelled at the dog to \"shut up\" just then the bushes in front of me started thrashing like crazy and deep growl/grunt/exhale emanated from behind them. It was surreal as sound seemed to penetrate right through me, whatever it was, it wasn't happy. Instinctively, I started to cover the distance to my shed about 35 feet and while I was on my way, I could feel/hear the ground pounding as \"whatever\" was moving for cover in the brush to the south. It was like \"boom, boom, boom, boom then it crashed into the woods and there was loud sound of sticks/branches breaking... I ducked to the shed and just stood there, confused as to what just happened. I waited for what seemed to be a few minutes, grabbed a sledge hammer for some protection and was just about to make a break for the house, when the bushes and branches behind the shed started snapping, again; it was like a buffalo was charging through them... So, I stayed put and I was getting kind of freaked out. Then there was silence for a few minutes and I made the dash for the house. Once inside I grabbed my Mossberg 500 loaded with \"00\" buckshot and headed back out on my back deck. There was nothing to see and even the dog was quiet... I thought about looking for tracks but, I reasoned it out that whatever could make the ground shake like that would be best left alone. I'm a cautious person by nature. I would have chaulked this up to maybe being a bear except for the pounding foot steps that shook the ground... I've had bear run past me before in this yard as I've been here for 19 years. There was no tell tale Squatch smell as the wind was blowing from the South West... However, two days later, there was a horrible musky skunk smell coming through my bedroom window. Needless to say, I closed it... Something was still out there... I've told this story to a few friends and it got me some weird looks... After recently reading \"The Hoopa Project\" and the many incidences recounted with ground shaking foot falls, I say, put me down for a class \"B\" incident that was too close for comfort... I think twice about going out to the mail box now.",
  "classification": "Class B",
  "county": "Grays Harbor",
  "state": "Washington",
  "location": "-124.1526,46.96114",
  "location_details": ""
}