{
  "reportId": "25860",
  "title": "Early morning driver spots bipedal animal eating corn near Little John Creek near Dunlap",
  "date": "2009-08-10",
  "observed": "I was driving home from Council Grove after getting a coffee and some cigarettes, it was just after day break and the fog was kind of splotchy and lifting. I was driving slow just enjoying the morning when I saw something on the side of the road next to a cornfield so I slowed down thinking it was a deer.I still had my head lights on and could see perfectly. But what i saw was not a deer it stood up to its full height which I estimate to be 8ft.and looked right at me. It had a piece of corn in its hand and I mean a hand like a humans hand. It looked like a human being with hair all over him. I stopped my car and just starred at it as it did me, then it took off and jumped the road in two large strides. It made it down the creek bank in a few seconds.I was to afraid to look for footprints as i was by myself. I have told a few people about my sighting, but after I called and reported it to the law enforcement and was laughed at I haven't spoken of it to anyone else. I know bigfoot exist's and have tried for years to prove it as my first experience was when I was a kid. The place I found tracks back then is only a few miles from this sighting. I grew up in the country and on the same creek it ran off to. I don't know if you all are serious and will believe me but I feel better getting this off my chest and telling someone I hope will not laugh at me. I still find it amazing that it was eating corn like that. I would love to get involved with a group to help prove they exist I am a total believer now. I still can't get over how human it looked. The fur or hair was long in some spots but shorter around the face and eyes. I have drawn it out on paper many times.I thank you for having this site to let me tell my story.",
  "classification": "Class A",
  "county": "Morris",
  "state": "Kansas",
  "location": "-96.44296,38.62563",
  "location_details": "the road is called Dunlap road and the creek is called Big John I am not sure who the corn field belongs to."
}