{
  "reportId": "2996",
  "title": "",
  "date": "",
  "observed": "The late Vanwedigen and I were going fishing along the river over the Labor Day weekend.  While back packing in along the forestry trail leading down to the river, we missed a trail marker and wound up at night along the canyon rim.  We made camp on a bluff slightly below the canyon rim.  I didn't sleep well that night.  I had a feeling I was being watched and was uneasy. Breaking camp the next morning, Van went for water coming from an artesian spring in the wall of the canyon.  He found one very clear bigfoot footprint in the wet sand below the spring, about 80 feet from where we'd camped.  He called to me to come over and see.  My first reaction was this was a hoax.  Van and I examined the footprint in detail.  It was about 17 inches in length, with 5 clear toes and pressed down about 2 1/2 inches in the sand.  There was a musty smell in the area but this wasn't overpowering.  Van concluded the print was real based upon the fact it had rained hard the previous morning and you could see the pattern of the rain drops on the surface of the sand except where the footprint was.  Also whatever had the print may very well be slightly above us at the end of the bluff in some rock outcroppings.  He suggested we get out of there while the getting was good.  Van had grown up in Minnesota hunting and fishing with his dad and brothers.  I decided we should take his advice.  We left and back tracked to Van's Toyota Landcruiser.  We went over to Bass lake to fish for the rest of the weekend.",
  "classification": "Class B",
  "county": "Fresno",
  "state": "California",
  "location_details": "This incident occurred in California's Sequoia National Forest, the eastern part of Fresno County, along the North Fork of the Kings River, between the Black Rock and Lily Pad camp grounds, below Wishon Reservoir at about 37\" north and 119\"east.  The actual footprint sighting was on a lower bluff  inside a pool of wet sand about 100' below the canyon rim and about 800 feet above the river."
}