{
  "reportId": "12917",
  "title": "Vehicle passenger's daylight sighting near Hiouchi",
  "date": "1979-10-25",
  "observed": "I had a visual experience in 1979 in which I was camping about 20+ miles out of Hiouchi,CA in Del Norte County. I was traveling as a passenger with a local resident who was making a trip to Crescent City to go grocery shopping. It was @ 11:00 a.m., a bright sunny morning. As I rode along, the lady giving me a ride into town told me to look out my window to the right. I looked to see what she was talking about and I saw a very large hairy creature walking across a wide, dried up creekbed.There were no trees or anything blocking my view. It was a wide open expanse. I did not see its face because I was seeing it from the side. I only saw it on its right side. It was headed in the opposite direction that we were going. To our left I distinctly remember a \"watch out for falling rock sign.\" I do not know the area there well. I was only camping there for a few days on my way back from Topanga Canyon in L.A. to Oregon where I lived in the Cave Junction area. I will never forget what it looked like. It had long darkish brown hair that covered its entire body. It also had a pronounced crown in the shape of the top of his head. It looked extremely muscular. I was at least 500'away and I'm not real good at judging height anyways, so I don't know how tall it was. It walked with ease across a rocky creekbed. It seemed to ignore or be unaware of our car's presence on the road. We were probably traveling about 30 mph when it happened. My friend told me she sees them all the time out there near her home, so it was just a normal thing for her.",
  "classification": "Class A",
  "county": "Del Norte",
  "state": "California",
  "location": "-123.85,41.65",
  "location_details": "There  is a small concrete bridge just off Hwy 199 at Hiouchi which is between the Oregon Tunnel and Crescent City,CA. If you are travelling north on 199 going towards Oregon the bridge and road would be to your right.This paved road goes for many miles south of the Hwy. I heard some people refer to this road as the road which was supposed to have been made into a super highway.I think they were just putting me on about that."
}