{
  "reportId": "17306",
  "title": "Early morning sighting by paper carrier in rural Ridgeville",
  "date": "2007-01-14",
  "observed": "I deliver newspapers early in the morning. I was almost finished with the route and I made a left turn on to [edited]  and placed a paper in the tube. I proceeded to the next tube, and after placing the paper in it, my headlights caught something off to the far left. I observed a figure walking along the treeline along the edge of the cornfield away from my position. At first I thought it might be a man, but it was all black and it turned and I saw large red eyes staring back. I could not make out it's face, and it continued to walk away. I turned my vehicle in past the paper tube to try and get a better look. It was at this point it stopped and looked at my direction again. From my estimation it looked to be at least 75 to 100 yards away, and about 6 or 7 feet tall. The creature then continued walking away, and feeling spooked I drove out of there fast. I proceeded to finish my paper route, trying to comprehend what I had just seen. It was just starting to become ligher out, it was about 6:45am, and it was still quite dark out. This area has a lot of farmland and wooded areas, and is very rural. The whole incident occured in about 20 or 25 seconds. I felt as if I might have disturbed \"it\", for I felt an uneasy feeling when it looked my way. As this is the country, I see a lot of wildlife out at night when I deliver papers-deer, foxes, racoons, possum, and even bobcat. I have hiked and spent lots of time in the Appalachians and I know what a bear looks like and have seen bear up close during hikes on the Appalachian Trail. I know there are some bear in South Carolina, but they mostly reside in the upper part of the state. What I saw definately was not a bear.",
  "classification": "Class A",
  "county": "Dorchester",
  "state": "South Carolina",
  "location": "-80.316,33.096",
  "location_details": "Edited out per request of witness."
}