{
  "reportId": "28355",
  "title": "Hunter watches running bipedal creature, finds possible scat in the Camp Blanding Wildlife Management Area",
  "date": "2009-12-15",
  "observed": "I was out hunting small game in Camp Blanding,on the still hunt side,close to Cemetary Road,I had a friend of mine about 150 yards to my right and about 30-40 yards in front.I saw something running between us,going from my right to in front of me,it was between the two of us.It stopped about 50-60 yards in front of me and turned and looked at me,I stood looking trying to figure out what I was seeing for maybe 30 seconds,I then got down on one knee,and watched about 45 seconds,it turned to its right,my left,and was gone.It was a dark brown,allmost black,running kinda like an old man that had back problems,bent over a little at the waist.It was on two legs,not four as all other animals in the woods have.I could see the arms moving as it ran,just as a man's would when he is running.I am 6 foot tall,I walked to the spot I saw it,loooking  at the tree it was beside,and was looking to see if I could tell how tall it was.From what I could tell from what I saw,it stood about 7 foot tall.I looked for any tracks,found none as it was a swamp,nothing but water,but you could see evidence that something was there from the way the grass in the water was laid over.I called to my friend,asked if he saw anything,he said no.We both started walking,hunting more,all the while I was thinking about what I saw.We walked approx. 1/2 mile from where I saw whatever it was,and he saw a VERY large pile of feces on the ground,we both looked at it for a while,poking at it with sticks,trying to figure out what kind of animal it could have come from.We both have hunted for over 35 years each,and have never seen anything like this.We saw alot of grassy materials,and alot of berries in it.No hair,bones,or anything that you  would see from most carnivores in the woods.",
  "classification": "Class A",
  "county": "Clay",
  "state": "Florida",
  "location": "-81.91354,29.94011",
  "location_details": "Hwy 21 south to Dade Road in Camp Blanding,right on Cemetary Rd to Wilson Rd,approx, 300  yards on the right,then approx.500 yards into the woods."
}