{
  "reportId": "12802",
  "title": "Nighttime sighting by golf course worker at Arrowhead Golfcourse, aside Roxborough State Park, Rampart Range.",
  "date": "2005-10-07",
  "observed": "I work at Arrowhead Golfcourse in Roxborough, Colorado.  Me and two other of my co-workers were going around getting all of the flags at the end of the night.  As we were going around the corner for hole 13 (it backs up to Roxborough State Park), out of the corner of our eyes we saw this huge whitish grey figure that was clearly distinguished as a large human like figure.  Maybe about 7-8 feet tall.  Then we went around the corner before realizing what we had seen.  We sat for a second and I questioned my friend as to if he had just seen something as well.  The answer was \"yes\" and we turned around to go back to where we had seen it.  When going around the corner my two friends had seen it again. unfortunatley I missed the second sighting.  Acording to my friend the \"figure\" had peeked its head around the corner and stared at them.  They claim to have seen a \"shoulder\" move and then started screaming.  Once they started screaming the \"figure\" moved and was out of sight.  We put the golfcart into reverse and drove out of that area as fast as possible.  We went up to the cart barn and got a cart that was fully enclosed that had front headlights and went back to hole 13.  As we got there we stopped around the corner (just before the point in which my friends saw the shoulder move) to see if we could find footprints or anything out of the ordinary.  As we sat there, we started hearing very strange creaking noises that came from the back and to the left of us.  We stood there listening to this sound  for about 5-10 seconds and nobody was moving because we were all scared to death.  We left the area quickly.  The next couple days we attempted to look for \"it\" again and haven't seen anything since.",
  "classification": "Class B",
  "county": "Douglas",
  "state": "Colorado",
  "location": "-105.0787,39.4455",
  "location_details": "Rampart Range Road to Arrowhead Golfcourse in Roxborough Park. Hole 13 Pro Tee Box."
}