{
  "reportId": "2782",
  "title": "",
  "date": "",
  "observed": "\"The Zoobies\" -- 1992 interview with Sgt. Doug Huse, San Diego County Sheriffs Department MONEYMAKER: Okay, just go ahead and tell me about yourself, when you started working there and so on. HUSE: I started working the Alpine area (east of San Diego, California) in March of 1970. I came to the department the previous year. I was working out there in a patrol capacity for the San Diego County Sheriff's Department I was a deputy at the time and actually worked Alpine for about 2 years, from March of 1970 to April of 1972. As far as trying to recall exactly when this went down, the best I can come up with is that it was after the Laguna fire of 1970 ... September of 1970. MONEYMAKER: The Laguna fire affected which areas? HUSE: Well, it was the largest brush fire at the time in California history, and burned specifically in the Sweetwater River area from east of Alpine all the way south and west, probably another 15 miles. It was quite an extensive burn and through the area in question, Alpine, on the south side of Interstate 8. To recall the chain of events, it was extremely cold which means the time of year would've been sometime after September of 1970, probably December or January, maybe February...let's see, that would be 1971 ... well, it was definitely winter. MONEYMAKER: Was that about the time of your first contact with the key witness, Dr. Baddour (prominent San Diego psychiatrist)? HUSE: Yes, and I don't recall the reason, but Dr. Baddour was stopped by a two-man patrol unit. Baddour was traveling eastbound, which would've been from the San Diego area to what we learned later was his home in Alpine. On the front seat of his car, I don't remember what kind of car it was, he had a loaded .44 magnum revolver with a 6-inch barrel. That's the same type of gun that Dirty Harry made famous. It's the largest caliber hand gun you can buy. Of course this piqued our interest a little bit. I wasn't the contact, I was what we call the cover during this particular stop. My partner's the one who made first contact and found the gun. He secured the revolver and was asking the doctor, who'd identified himself as Dr. Baddour, why he was carrying the weapon. Baddour said it was because of a ... and I don't know what he actually said at the time, but my partner heard him say, \"Zoobie,\" ... and so from there on all our conversations throughout the department referred to whatever Dr. Baddour had seen as a Zoobie. That wasn't what the doctor actually called it, I don't believe, but that's what my partner heard and that's how the name got coined. MONEYMAKER: At the time did Dr. Baddour describe this Zoobie to the officer? HUSE: Yes, he did, to both of us as a matter of fact. He described the Zoobie as a large, upright, walking hairy creature. Dr. Baddour convinced us and later other members of my department, including one of my patrol sergeants, that in truth he'd had three separate encounters with the Zoobies. MONEYMAKER: Did Dr. Baddour say how many of these Zoobies there were and where the sightings happened? HUSE: Yeah, one sighting was made by his entire family within the confines of his yard and immediate area, and at one time they saw three Zoobies. What Dr. Baddour described to us was what he assumed was a father, mother and child with the largest of the Zoobies being over 6 feet tall, maybe 7 feet tall. The tallest was very hairy and much larger-framed than an ordinary man. What he described as the mother was about 5 feet tall, and the smaller one was about 3 or 4 feet tall. Like I said, the doctor convinced a number of us that he'd in fact seen something unusual. What happened then was that we did get involved in an investigation of the sightings. I did because of the shift I worked which was either 10 p.m. at night to 6 a.m., or what we called the evening or overlap shift which was from 6 p.m. to 2:30 in the morning. Neither of those shifts was conducive to interviewing citizens in the area, so I wasn't able to locate other witnesses, and I can't recall if I ever talked, to a deputy who canvassed the area looking for witnesses. MONEYMAKER: How many people lived in the area at the time? HUSE: There were very few homes, probably 5 or no more than 6 residences, and Baddour's was the last home on the narrow road. Going back in my memory 20 years now, I'd say his house was a quarter to a third of a mile off the main road used to get to his place, almost in a straight line due south of Alpine Blvd. That area hasn't grown much since then, no planned residential development in there. At that time the Baddour family themselves consisted of the doctor, his wife, a daughter and a son. The daughter was 17 and the son was younger, maybe 13 or 14. MONEYMAKER: Can you describe what the terrain looks like, is it actually alpine forest, etc.? HUSE: It's not a forest by any means, the elevation's no more than 2300 feet. The road goes east and up, and in about another 20 miles it eventually climbs to about 5000 feet. MONEYMAKER: Does it continue up into forested areas? HUSE: Yes it does and it follows the Sweetwater River it's about 10 miles. The Sweetwater River isn't much of a flowing river. It runs about three-quarters of a mile south of Dr. Baddour's place. Of course it always depended on rainfall, but the river hasn't run continuously anytime in the 20 years I've been familiar with the area. There's no snowfall at all. The terrain itself is quite steep behind Dr. Baddour's property, going down into the (Sweetwater) river bottom itself. It's all primarily brush and chaparral. MONEYMAKER: Any bears in the area? HUSE: I don't think I've ever heard of a bear sighting in San Diego county, and again I've been in the area almost 23 years. We have deer everywhere here along with coyotes and fox and other types of wildlife, but no bears. MONEYMAKER: What else do you remember about Dr. Baddour's sightings? HUSE: Let's see, the first set of circumstances I remember was Dr. Baddour finding damage to the house when he'd just moved in. He said he bought the house from an older German couple and all of the light bulbs, inside and out, were the yellow bug repellent type. Baddour said the German man told me that he shouldn't change them to white, that he should get used to the yellow light. MONEYMAKER: Because of an insect problem? HUSE: Baddour said the German was very evasive about that, evasive also about a lot of details regarding the house and property. The property did have some acreage, I don't recall the size but it was larger than a city lot anyway. The property had some fruit trees in the front and back yards. I don't remember what kind of fruit trees they were, but the house and trees were surrounded by a fence. One of Baddour's complaints was that fruit was being picked off the trees at the tops, but not from the bottoms. The trees were upward of 7 or 8 feet high, or maybe 10 feet high. Anyway, the fruit was disappearing from the tops of his trees and his fence was getting knocked down. He had a wind chime at one of the doors made of brass or some kind of strong metal which frequently rang in the blowing wind, and at one point the wind chime suddenly turned up flattened. Baddour couldn't explain it and we couldn't duplicate it. It was smashed. Baddour did make a plaster cast of a footprint and I know we had photographs of it, if we didn't in fact have a plaster cast of the print ourselves. But I do recall there was a plaster cast. MONEYMAKER: Do you remember the approximate size of the footprint? HUSE: I'm 6-foot-3 and I wear a size 12 shoe, and I'd have to say this one was larger than my shoe and much wider than my foot. I'd say it was about 13 or 14 inches in length, and I've been wracking my brain trying to remember if it had 4 toes or 5 toes, but I just can't recall.** [**According to researcher, Ken Coon, who visited the Alpine area in 1971, Dr. Baddour's \"Zoobies\" left V -shaped, 4-toed footprints, 16 inches long and 8 inches wide with the widest measurement across the toes. The foot narrowed down to 5 inches at the heel.] MONEYMAKER: But there's some recollection that it might have had an usual number of toes? HUSE: Yes, I do seem to remember that, but I can't bring it to mind. I know the footprint was wide overall, and less wide at the heel, but the heel was still wider than a human foot would be. MONEYMAKER: Did you or any of the officers talk to the doctor's wife or kids? HUSE: Specifically the word came back to me, and I'm not sure which deputy found out, but the daughter said she had a sighting in the early morning hours as she boarded a school bus at Alpine Blvd. That would have been adjacent to the access road leading to the Baddour house. She was getting on the bus and spotted the creature off in the brush. There's some very thick, very tall brush along the road there. MONEYMAKER: Do you remember any details of what she saw? HUSE: No, not really, the man who was deeply involved in this was my patrol sergeant and he's now deceased. He was so involved with it that on his days off he'd go up there and camp to the rear of Baddour's house. He'd take his older son along and the two of them would camp out in hope of getting a glimpse of one of the Zoobies. They never did. But he was the man who probably had more conversations with the doctor than any-body else. Another sighting involved three Zoobies sighted by a whole family. The Baddours had made it a habit to never go out after dark, but one night they were out with the son to call in their pet dog. In the dark the boy thought he saw the dog near a comer of the house and called out to It. Well, the dog came running back, but from a different corner, and what at first they thought was the dog turned out to be the smaller Zoobie. Apparently it had been laying down and it got up and stood and walked the opposite way, joining the other two, the larger male and female, and they all walked off into the brush. MONEYMAKER: Did they ever use words like \"ape\" or \"gorilla\" to describe the creatures? HUSE: No, they never did. Baddour was firm in his own mind that it wasn't an ape or gorilla. It was something totally different than one of those. Well, for lack of anything better we thought it to be more like the California Bigfoot, based on how it was described. Whether it was black or brown I really can't remember. MONEYMAKER: Did Dr. Baddour ever use the word Bigfoot or Sasquatch to describe the Zoobie? HUSE: Not to me, no. As a matter of fact we were assigned to make periodic checks of his residence throughout the night because most of the damage to his property was done during the night time, so my partner and I in a two-man car would drive up there and shine the spotlight around his house. Dr. Baddour was very convincing. I can still picture him coming outdoors one night dressed in his skivvies and wearing black high top military boots. That was it, a tee-shirt and shorts with those black boots and carrying that big .44 magnum. MONEYMAKER: How would you characterize the family, it sounds as though they were all educated, credible people? HUSE: Yes, I'd characterize them as exactly that. I got the impression the daughter was very intelligent, and of course Baddour himself was a medical doctor, a psychiatrist. MONEYMAKER: In our earlier phone call to arrange this interview you mentioned something about the creatures, the Zoobies, mimicking human speech ... ? HUSE: Yes, one of the lighter stories I recall happened when the doctor got home after dark one night. They had chickens there, and earlier he'd called his wife to say he was going to be late and to remind her to feed the chickens before night fall, which she did. When the doctor got home he had to exit his car, open the gate, drove through and stopped, then got out of the car again to close the gate behind him. He said that when he went to close the gate that night he heard a very low, very guttural voice say, 'Here chicky, chicky, chicky...' MONEYMAKER: That's funny and not unprecedented in the research. Are you saying the impression was that one of the creature's was imitating the doctors wife who'd called in the chickens earlier? HUSE: Exactly. It was the doctor's opinion, and we had no reason to doubt him, that the Zoobie had some type of intelligence and the capability of producing sounds like that. MONEYMAKER: Did they ever describe any other sounds or smells, anything like that? HUSE: Smells, yes. A very pungent odor, maybe like rotting garbage. You know, he did tell us he'd set up cameras around the house with trip-wires, but he wasn't able to get any photographs, at least not while I was working the area. I really can't recall but I know the doctor himself had a close sighting of one of the Zoobies, and there were probably other sightings, but I can't remember now. Of course I worked up there for just those two years, until April of 1972. After that I went to fly helicopters. So I was completely out of touch with what was happening in Alpine, and I didn't get back there until 1981. At that time I was stationed east of the Baddour home, and I didn't hear anything more. I did hear something about the Proctor Valley Monster when I started patrol in 1970, which if true I'd have to assume was on the order of what Dr. Baddour was describing. Now, a few years ago a deputy told me he saw a dark-colored, large, upright furry creature, not a bear and not human, up in some rocks north of Interstate 8, and possibly northwest of El Capitan (reservoir). The deputy told me it was a good distance away. Also, I was involved in a juvenile diversion camp (near Julian, northeast of Alpine), and a couple of counselors from another camp came down and told us they'd see something they couldn't identify in the mountains. After talking with them it was concluded that what they'd seen was probably a Zoobie. Another thing we found out, during our investigation of Dr. Baddour's sightings, was that the Viejas Indians (reservation) just north of Interstate 8 had a legend about a giant hairy man that was the protector of their burial grounds, and those burial grounds were located just about 2 miles north of where Dr. Baddour lived.",
  "classification": "Class B",
  "county": "San Diego",
  "state": "California",
  "location_details": ""
}