{
  "reportId": "28728",
  "title": "Daylight sighting by a motorist near Brookfield Zoo",
  "date": "2010-11-16",
  "observed": "I am going to be honest, before this happened, when it comes to bigfoot, I have been very skeptical, because there is not enough evidence that would make me even consider that there could be a bigfoot. It was about 8:15 in the morning, I was just driving the car. I was on 1st Avenue, I had gotten off I - 55, I was heading over to visit my mother at her job. I was driving near Zoo Woods, which is some sort of forest area. I was driving and I was on the phone and I looked to my right and I saw something very, very tall, like between 8 and 9 foot and hairy. It was running through the woods. I remember the sun reflecting off the outside of the fur and it gave it like an orange tint. A Golden Retriever has that color hair, make that a little darker and with a little bit more copper-tone, more red-head feel to it. I think that would be the color I am trying to describe. I stopped in mid-traffic, I put my hazards on, I pulled over right away. I had just seen something moving through the trees, nine foot tall, orange fur, it just kind of ran through about five feet of brush. The trees were moving, I saw it.  I slammed on my brakes, got out of my car, put my hazards on, I ran over to where I saw it, because I had already passed it over, passed by it. I had to run back a little bit to go in the area where I saw it. There were broken tree branches. I couldn't see any prints, no fur, no evidence besides the broken trees. There was a terrible odor, like a musky, wet dog smell, maybe worse than that, more putrid. It was like if you are running through the woods and you are nine feet tall and you are about ten feet into the woods before the outside of the woods stopped, that's how far into the woods it was. It had arms, it was running and it was very big. I only told a couple of people, and then I let it go.",
  "classification": "Class A",
  "county": "Cook",
  "state": "Illinois",
  "location": "-87.83285,41.84136",
  "location_details": "I was headed north on 1st Avenue (IL - 171). I remember seeing the sign that said Zoo Woods.  It was about a mile north of that sign, east side of the road and south of Cermak Rd."
}