{
  "reportId": "4966",
  "title": "Large footprints, area of matted grass and sounds of bipedal footsteps noted along shores of Aurora Lake",
  "date": "1976-08-01",
  "observed": "In the summer of 1976, I (Laurie) was playing along the shores of Aurora Lake when I came upon a very large set of human like footprints.  There was two very clear footprints in clay and a lot more less recognizable in the hard soil.  My best estimate was the tracks were at least 15 inches long by 7 inches wide.  Compared to my size 8 ½ women's shoe they were enormous.  Not knowing about Bigfoot, I passed them up as a case of mistaken identity or just a practical joke.  I could clearly see the five toes on both tracks in the clay.  The one thing I remember the most, was how impressed I was about those tracks. Then, the following summer of 1977, I wanted to show a girlfriend (Jane) of mine the area where I played my entire life as a kid.  It was just after my senior year of high school when we decided to take a hike into the woods so I could show her my favorite tree I played on my whole life.  How I knew my way to this spot was by following the creek bed into the area until we reached my hang out spot.  Upon arriving at the spot, I noticed something very strange!  On the right side of the creek bed, at about 20 feet away, there was a strange matted down area that I have never seen in the 10+ years of coming here.  It looked like something had matted down all the 4 to 5 feet weeds and trees into some sort of bed or nest.  The area was at least 8 feet wide by 14 feet long.  The strange thing was that all the outer bushes and trees were bent outward from the middle as if done deliberately.  As my friend and I checked out this strange thing, we both heard the sound of heavy foot falls coming towards us.  We tried to see the source of the foot falls but the foliage was so thick we couldn't see anything.  As the foot falls got closer, the sound of breaking twigs were heard with every step.  Being an outdoor person all my life as well as an experienced hunter, I know for a fact that whatever was coming towards us was bipedal and wanted us out of there. Being very frightened, we slowly made our way back to the road via the creek bed.  Whatever it was, followed us all the way out to the road.  As we looked into the woods, we could hear it moving through the foliage not getting closer than 100 feet away.  I never mentioned the word Bigfoot to my girlfriend in fear of ridicule.  Now I knew what was responsible for the footprints found the previous year at Aurora Lake less than a 1/2 mile away.  I never told anyone about this incident until just recently.",
  "classification": "Class B",
  "county": "Portage",
  "state": "Ohio",
  "location": "-81.38112,41.31405",
  "location_details": "Portage County, Ohio near the town of Aurora.  Closest roads were Cochran Road, Colony Drive and State Route 82."
}