{
  "reportId": "7137",
  "title": "",
  "date": "",
  "observed": "My husband and I are avid fisherman and hunters and our favorite time to fish is in the late evening and at night.  On this particular night, my husband was out of town working and I decided to go fishing at a local reservoir about 3 miles from where I grew up. It was about 1 am and the fish had been biting very well that night.  So, I decided to stay a little later than I normally would have.  I was sitting on the breast of the dam fishing when I heard footsteps coming up the road, which is a dirt road aprox. 35 yards from where I had been.  There where a few houses, not many on the road, it is a small town.  So naturally I looked up to see who was walking by.  It was then that I realized that who was not the question, but what.  As in what the hell is that?  So I pulled out my flashlight and pointed it in the direction of \"it\".  The light passed over its eyes and they reflected back to me in a greenish-yellow flash.  The creature was probably 6-7 feet tall and very hairy.  It was brown in color and quite broad.  It walked upright with swift, long strides.  It was so huge in its mass, and I guessed that it would have to be at least 400 pounds.  I know that I have never seen anything like it, and prefer to never see it again!  I was definitely scared. Just at that point I was pondering on which direction I was going if this thing took off after me.  In front of me is water and at least a good 6-8 feet drop till I get there.  Behind me is a 20 feet drop to the ground.  Mind you, I am sitting on an old cement reservoir breast.  As it turned out, the creature only looked in my direction once, when the light hit its eyes.  It did not seem to notice or even care that I was there.  It never lost a step, just kept on walking and turned and disappeared into the woods not far from where my car was parked.  Thank God! I waited just long enough to assure myself that it was gone or at least not interested in me.  Then I packed up my gear, walked quietly to my car,  and drove out of there.  The whole incident may have lasted only 3-4 minutes, but the time seemed to stop.  I have since not gone fishing at night alone. I told my friends and family about this and most told me that I am crazy and laugh.  I have been teased about this for the last three years.  I don't care what any one says, I know what I saw was not human and  not a bear.",
  "classification": "Class A",
  "county": "Cambria",
  "state": "Pennsylvania",
  "location_details": "The place is Bakerton Reservoir,  you would go into Carrolltown, PA via route 219 north."
}