{
  "reportId": "8259",
  "title": "Hunters find scat and have large rock thrown at them",
  "date": "1970-11-15",
  "observed": "I am a Ph.D. environmental physiologist working for Natick Labs in Massachusetts. In the fall of 1970, I was hunting on the east side of the lake [Long Pond] in Baxter State Forest with Danny Wolfe, a vet now in Ohio, a friend from Montana (deceased) and another vet. One morning I hunted alone south of the lake, when I encountered a strange musky smell in the woods along with a foot-long black scat that looked human except for the extraordinary thickness and width. I also observed small scat that looked like a large pile of baby feces with white and yellow texture. As I proceeded on, I was confronted with the sound of thumping like a partridge on steroids drumming. The ground actually shook. The hair on my neck was raised and the pit of my stomach seemed suddenly queasy as the rotten smell got worse. Suddenly, a large dead tree came crashing down about a hundred yards in front of me. This scared the s... out of me, as the woods were deathly quiet, no wind, no birds etc. I returned to camp and was severely guffawed by the two vets, Dr. Heisel and Dr. Wolfe. Wolfe, however, agreed to accompany me the next day. We went further into the swampy woods, saw yesterday's scat and Danny said whatever it was it was certainly big to push that dead tree down. We continued until the area became quite rocky with boulders larger than our heads on all sides. Danny said this doesn't look like a good place to be because something could jump us before we could react. Suddenly, we encountered the drumming and ground shaking again. This was followed by a huge rock, which flew over our heads and impacted on a hill to our left. Needless to say, we were both speechless and Danny said whatever could throw a fifty-pound rock fifty yards was not something he would care to encounter. Even though Danny had a 7 mm mag and I had a 270, we both agreed to leave.  It was quite evident that whatever we had pissed off was clearly warning us not to go further.  We returned to camp and my two friends became believers. The hunt was a failure because there were no signs of deer or even moose in the area. We have enjoyed retelling this story to our kids and friends over the years because none of us had ever experienced anything like it in years of hunting in Me, NH, MA, Montana or Colorado. It was the scariest thing I have ever encountered in my hunting career. I have shot elk in Colorado and this year my wife and I shot over fifty pheasants and five deer. I am on the Board of Advisors of the Uxbridge Rod and Gun club, and as the Army's former expert on desert survival and heatstroke physiology (Editorial Board of Wilderness and Environmental Medicine; I wrote the survival manual for Desert Storm and Desert Shield). I have published over 200 scientific papers, abstracts, and book chapters. But this is the first time I have written about this strange encounter! I am 65 and have retired from Army Environmental Medicine as a lab director.",
  "classification": "Class B",
  "county": "Piscataquis",
  "state": "Maine",
  "location": "-68.8405,46.1333",
  "location_details": "We were camped south of Long Pond in the Trout Brook Mt. Quad of Baxter State Park. We were were walking south from the southern shore of Long Pond toward the elevation of Billfish Mt. (Baxter State Park contains Mt. Katadhin)."
}