{
  "reportId": "1772",
  "title": "Family encounters large \"gorilla\" along road west of Morton",
  "date": "2000-10-11",
  "observed": "T's Account: When I was coming from Chehalis, I was right between Brown's Mechanics and the old chicken barns, and I saw what looked like a bear hunched in the ditch. I stopped the car and it stood up, and I thought it was a gorilla... it looked right at me, turned it's head toward me, and it looked like it was hurt on it's right side. I remember I saw blood, and noticed the arm was slouched to one side. It looked right at me, as it walked across the street. It had a sad expression. I could tell it was hurt. I said to myself, \"your bigger than me, you go right ahead\" and then I drove home. It happened so fast. I didn't tell anyone this story, until my son came home telling about his teacher talking about sasquatch and encouraged me to talk to him. I wonder how many people don't tell other about what they saw. The skin was black and leathery around the nose and eyes and the ears were pointed and protruded through the hair on the side of the head. It looked really athletic and musclular from the waist down, and it's upper body was really big and strong looking. It's hands and feet were big also.  Strange things have been going on in our neighborhood from time to time. When I called the sheriff, they said this stuff has been going on all over from Randle to Morton. D's Account: We were traveling towards Morton and home. I was dozing off when Mom hit the breaks and yelled; \"lOOK KIDS A BEAR... OH SH_ _ IT'S A GORILLA!\" Mom came to a stop as it walked right in front of our car. It walked real slow looking at us and then slid down the embankment catching it's balance with it hand. it was moving toward the woods that leads to the river. Every one was real quiet. When we got home mom kept saying it was a bear. But it did not look like a bear to me. The back and shoulders were shaped like a triangle, very wide and tapered to the small of it's back, big muscles all over. Someone had shot it in the lower back. You could see the blood and matted hair. It was slouched forward and to one side, the side it had been shot on. Told my teacher about it the next day at school. It was a sandy brown and black color. S's account: I noticed it coming onto the road. It walked on two legs. It was light brown in colored and walked like a human but more slouched over, it appeared to be hurt and it was walking really slow. Mom said afterward, when we were almost home \"What was that?\" We said nothing and mom was really shaking and seemed really scared. Mom later told me to say it was bear so D. would not be scared. D. argued with mom about what it was and mom just would change the subject after repeating it was a bear.",
  "classification": "Class A",
  "county": "Lewis",
  "state": "Washington",
  "location": "-122.2963,46.5672",
  "location_details": "On Hwy 508 west of Morton."
}