{
  "reportId": "18707",
  "title": "Two incidents with two witnesses on Kinchafoonee Creek",
  "date": "1992-07-11",
  "observed": "I have 2 reports within 2 weeks of each other. 1st I was at a friends house with my brother and 3 other friends in Lee County Georgia on the Kinchafoonee Creek just off of century road.It was around the end of july 1992. It was about 45 minutes after dark,we were standing out in the driveway close to the road away from the house. you could see the front of the house real good because of the night light right in front of the house.where we stood was dark being away from the light.As we talked we noticed something come around the right side of the house,the only way to come from the direction it came was to cross the creek that bordered the back yard. At first we thought it was someone,then we realized it was not a human when it walked right under the light heading toward the left side of the house. What I saw looked to be at least 8 ft. tall,looked to be about 400-500 pounds, walking upright with a slight stoup or slump at the shoulders, but the shoulders were very wide,coverd in hair. This to me was clearly not a bear,as much as I have been in the woods I have never seen anything like this ever! We all five got real scared and jumped in the truck, which was facing towards the house.We watched it go around the house towards the left,as it went it looked in the windows on that side of the house,then it disapeared in the darkness.We tried to tell our parents what we saw but no one would belive us,they tried to tell us it was a bear,but we knew better. we  didnt file a report because of thinking no one would belive a bunch of teenagers. Experiance #2 A friend and myself were on Kinchafoonee Creek in Lee Co.between the bridge at HWY.32 walking up the middle of the creek fishing  towards Pinewood Rd.This area is covered in very thick woods on both sides of the creek with no houses around.I had told my friend about the bigfoot creature I had seen 2 weeks earlier on the creek,who was not with me when we saw it. he said he belived me,because he had heard about something like it before on the creek from stories around town. We walked for about one hr. when one of our other friends caught up with us. After about 45 mins somewhere around 1400hrs. we got the feeling like someone was following us,wacthing everything we did, we even heard movement up in the woods like something heavy walking a few times,but we passed it off as deer  being spooked. We then noticed a smell like something really needed a bath. we walked a little further to a sand bar,as we got to it the smell got real strong. This is where we noticed what looked like very fresh,really  big foot prints crossing the sand bar.This made us stop right there and head back very quickly for or vehicles. I never saw  anything  this time but I am positive this was another encounter with this creature. I STILL GET CHILL BUMPS BAD EVERY TIME I RETELL THIS STORY,BECAUSE IT SCARED ME THAT BAD. TO THIS DAY I  HAVE NOT WALKED BACK UP THE CREEK LIKE THAT ANYMORE!",
  "classification": "Class A",
  "county": "Lee",
  "state": "Georgia",
  "location": "-84.1293,31.43265",
  "location_details": "#1-Heading North from ALBANY GEORGIA on Hwy 19 turn left on century rd. then turn right on cypress point, six houses down on the left. #2-Heading north on Hwy 19 from Albany Georgia, turn left on Hwy 32 then stop at bridge and head up the creek."
}