{
  "reportId": "7272",
  "title": "Hunters endure hour-long, intimidation behavior by unseen aggressor(s)",
  "date": "2003-11-07",
  "observed": "Myself  and several others were at our deer hunting campsite, we had used the same spot for years. While we were sitting  at our campfire, we heard this mournful wail just outside the light of the campfire behind one of the campers. Next there was what sounded like a low growl then a sort of howl yelping sound, we all went for flashlights and stopped dead in our tracks when we heard the sounds of trees being snapped and branches breaking. We changed from flashlights to rifles as the growling increased. We stood there looking out into the dark for what seemed like 20 min or so then the sound started moving away deeper into the woods. At daybreak we ventured out towards where the sounds were coming from and found several small trees snapped and bushes uprooted. There were what could have been footprints but the ground was so tore up, it was impossible to tell what kind they were. Later that morning a friend of mine was out scouting for a place to put his blind and he came across a huge mound of earth that looked as though it was just piled there. He called the camp on his walkie talkie and told us to come out to where he was we could find him by following his trail markers into the woods going south off the logging road. When we got to him he was pointing his rifle towards some thickets of tag alder saying that when he approached the huge pile of sand and earth he heard the same sounds that we had heard the night before coming from that direction.To make a long story short we contacted the DNR in Harrisvile and an officer came out upon examining the dirt mound several mutilated deer and some wild blackberry bushes were buried in it. Again the ground was tore up so bad that no distinguishing footprints were apparent. The DNR officer said that what we had in the area was most likely a big bear. We have used that site ever since and have never encountered anything like that year again. We still talk about it over the campfire though.",
  "classification": "Class B",
  "county": "Alcona",
  "state": "Michigan",
  "location": "-83.51418,44.6375",
  "location_details": "Huron National Forest in the Hayes Tower area, Beaver Pond 1/4 mile away."
}