{
  "reportId": "5100",
  "title": "Hiker sees, attempts to photograph a sasquatch in the Columbia Gorge",
  "date": "2002-09-24",
  "observed": "On Tuesday, September 24, 2002 I was hiking alone on the Ruckel Creek trail near Cascade Locks. The time was about 4 p.m. I was beginning descending from the area known as The Benson Plateau. Although I am not sure of my exact position it was probably close to 45 deg. 38' 21\" N, 121 deg. 52' 24\" W at an elevation of about 3,300 feet. The trail was very dry and dusty and the steep decent required that I walk very carefully. As a result I made almost no sound at all. There was suddenly a very loud crashing sound from close by and my thoughts were that a bear had been surprised. At first I saw nothing, but the sound indicated that an animal was fleeing up the steep hillside. Then for about two seconds from a distance of about a hundred feet I could clearly see what looked like a large guerrilla running up the hill. Only the back was visible and it was black. The animal was only visible from the waist up. It had powerful back and shoulders and a very large head that rose to a distinct hump much as it does in pictures of some apes. I do not know how big it was other then to say it was a lot bigger then me. The head was particularly massive I thought. The animal apparently tripped and fell forward, but caught itself and kept moving up through the dense thicket. At that moment it turned its head enough for me to see its head and face in profile. It had a distinct nose but there was little else I could distinguish. At this point I went for my camera. This took a few seconds. When I looked up again I could see motion but could not make out the animal. There was a fallen tree about a hundred and fifty feet up the hill and it began to rock up and down at a uniform rate of about 1 HZ. It made a corresponding creaking and rubbing sound and this continued for some time, perhaps fifteen seconds keeping my attention drawn to that spot but seeing nothing but the tree bobbing up and down like it was being deliberately shaken at a uniform amplitude. Then it suddenly stopped and I could hear nothing. Then I noticed some motion about fifty feet to the right of the tree and thought I could see a face looking at me. The face seemed smaller that the animal I had saw but it still looked like a face and shoulders against a lighter backdrop. I stood with the camera ready knowing that the animal was still there and expecting it to stand up and again show itself. But this waiting game went on for perhaps two minutes. Then I began to wonder if the animal was in fact gone and perhaps I was looking at some strangely shaped stump because it did not move and I could not see it well enough to tell exactly what it was. At this point I took a picture thinking I might blow up the photo later for closer study to determine if anything was in fact there. It occurred to me that I should move around a bit and try to find a better angle. But there was no better position then where I was and caution prohibited me from moving closer. When I returned to my original position I no longer could see the face. I stayed around and listened and watched for a while but noticed nothing. The trail itself was very dusty and took prints well. My own prints were very clear but there were no other prints that I could see. During the incident I smelled nothing. When the digital picture was lightened and adjusted for contrast the head that appeared to be looking at me did look like it could be real. But in the background was what could be another far bigger animal. The larger image in the background is about the right size for the animal I saw. But the front looks like a light tan. I just took the picture and that is all I know about it. The picture quality is poor. Obviously if the animals were willing to pose I might have done better. I went back to the site two times to try to locate the exact position from clues in the picture but have been unable to relocate it exactly. I wanted to get another look and take another picture from the same location just to make sure I was not seeing something that just looked like what I was trying to see. The interesting part is right in the middle of the picture and needs lightning to see properly. I did go back about two days later and explore the place where the animal might have been headed. This area is called Rudolf Spur. All I found there was a pile of shit that was flat as a pancake and looked like tar. It was the size a large human might leave.",
  "classification": "Class A",
  "county": "Hood River",
  "state": "Oregon",
  "location": "-121.8735,45.63923",
  "location_details": "On the Ruckel Creek trail, near Cascade Locks Oregon at a point somewhere between the Mark Hatfield Wilderness boundary and the first switchback going down the hill, at about 3,300 feet elevation. Approimately 45 38' 21\" N, 121 52' 24\" W"
}