{
  "reportId": "1141",
  "title": "Two six foot tall creatures seen by witness.",
  "date": "1982-07-15",
  "observed": "In the summer of 1982, I was 12 years old and went to my first Scout summer camp, near Osceola, Missouri. The entire region is part of the \"Ozarks\" with thousands of square miles of wilderness. One afternoon Myself and another scout were assigned to go to the next camp over, Camp Lonestar, to work on a Tower-Building merit badge. We got tired of this after about 2 hours and decided to walk the 10 miles back to Camp Frontier where my troop was - maybe we'd make it back in time for dinner. We asked one Scoutmaster if there was a shortcut between the camps, he said yes, and pointed us in the right direction. This trail had been used until 1970, when a flood had washed out a bridge. We proceeded about 3 miles down this trail when the forest canopy became so dense, it virtually blocked out almost all sunlight. The foliage on the forest floor was just as dense - someone standing just feet away could be lost to view. Boulders & fallen trees were so thick the trail was soon lost, but we kept going in a Northeast direction, where we thought our camp was. We then heard a crashing sound through the underbrush coming from the Southeast. We stopped to listen & thought it might be a deer, which are common in this area. It was then I saw something that scared the Hell out of me. I saw 2 \"Creatures\" about 6 feet tall, covered in dark brown fur, about 100 feet away from us. They broke out of a thick stand of trees to my left, running faster than any human being could run, over serious obstacles such as large rocks, fallen trees, & thick undergrowth faster than I ever could. They then crossed the path we were about to take about 80 feet in front of me, ran down rocky, log-filled embankment, JUMPED a 10-foot wide stream, and scrabmled up the other side. They then disappeared into the forest on the other side of the stream. I froze with fear, not believing my own eyes. At first I thought I was looking at Chimpanzees, but these things were taller and bigger than me (I was 5'6\" at 12 years old). These things seemed like they were \"racing\" each other much like children do. I saw them for about 10 seconds before they disappeared, and they definitely were bipedal, similar to Human form, and they were swinging their arms over their heads each time they jumped over a large obstacle, just like Hurdlers would in race. There was no way I was going to go any further down this trail no matter what. We were scared out of our minds, and ran back the 4 or 5 miles to the main road as fast as we could. We then hitched a ride from a Scoutmaster back to our camp. When we returned, we told our Scoutmaster everything we saw. He didn't believe us - neither did anyone else. To this day I think of it, knowing that there is no way a human being could run that fast over logs & boulders & down a steep ravine like that in fur suit in 99 degree weather. When I read some of the other sightings in the southern part of Missouri - I know that there are still Unknown primates in that area. For anyone who has ever been in this region, the forests are so thick & there are so many limestone caves, ANYTHING could be hiding there.",
  "classification": "Class A",
  "county": "St. Clair",
  "state": "Missouri",
  "location": "-93.5577,38.0944",
  "location_details": "Near the H. Roe Bartle Scout Camp"
}