{
  "reportId": "4887",
  "title": "Family has strange experience in Golden Trout Wilderness",
  "date": "2002-09-03",
  "observed": "My family and I were at The Golden Trout Wilderness Packing Station in the lower Sierra's over the labor day weekend. We were there for horse back riding which we have done for the past 4 years. The time was approximately 4PM when my wife, son, daughter, Sierra(daughter of the owner of the pack station), and myself became aware of a high pitched \"whooping\" call coming from a distance down the forestry access road approaching the station. The kids started to call back in the same manner. We all guessed it was an approaching hiker or horse back rider approaching the station and calling out for fun. The calling continued for the next 15-20 minutes and was percieved as getting closer. My son became bored with the game and went on to something else to do. The calling continued and I observed that it passed the station and finally grew faint towards the trail head entering a section of the golden trout wilderness area. My daughter went to the access road just adjacent to the mule packing platform to greet the caller upon their arrival. The call grew louder and that was the reason for her appearence at the road at that time. She observed a being and was afraid of what she saw. When I asked later that evening whom had come down the road she was timid in her response. I thought this odd and continued to question her. She was afraid to tell us what she saw because she thought we would accuse her of lying. She has just turned eight. Her description was as follows with little lead in by myself or my wife. We are both physicians and trained in the scientific method. We tried or best not to \"bait\" her answers: The thing was bigger than me (>7 foot) and had a long beard. When I asked her what he was wearing she answered nothing. I then asked her what color was his skin and she answered that she could not tell because he was covered with hair. All over I asked, yes, all over. I then asked if his arms were short or long. She answered long. I asked did he see you and her answer was no. I asked if he made the sound we had been hearing and she stated not at the time she saw him. I then described three different gait patterns by example and she picked the long stride and lumbering type verses the noraml human gait or small steps. She stated that he had a big mouth and walked quickly. She was brief and direct with her answers and I believe she saw something not typically human in form. She has no imaginary friends and has been taught that lying will only hurt the one who lies. I was a bit spooked and fearful for my family's safety for the rest of the night.",
  "classification": "Class B",
  "county": "Tulare",
  "state": "California",
  "location": "-118.5272,36.10556",
  "location_details": "Golden Trout Wilderness Packing Station - it's web site is under the same name."
}