{
  "reportId": "30384",
  "title": "Cousins view a large biped figure on opening day near Virginia City",
  "date": "1978-10-21",
  "observed": "On the morning of October 21, 1978, my dad, uncle, cousin and I awoke in preparation for opening day deer season. After spending the night in my Grandfathers cabin up Alder Gulch, we geared up for an early morning hunt. My cousin and I rode in the back of my uncles pick-up truck with my dad riding shotgun. We planned on hunting the ridge to the west of my Grandfathers cabin. We had to drive about 2 miles south or as I would call it (up) Alder gulch to get to the road that goes to the ridge. We missed the turn to the ridge road, but quickly realized our error. Upon finding the correct road we progressed up the gradual slope climbing and meandering through mostly pine and some meadows dominated by waist-high sage brush. Of course, being opening deer season my cousin and I were being vigilant scanning every opening and meadow. My cousin and I were hanging on to the cab of my uncle's truck due to a slight uphill grade. To our right was an open hillside meadow covered with thigh high sage brush surrounded by pine trees. We both were scanning the meadow when my cousin said, \"there's another hunter, (slight pause) why is he wearing all black?\" All I could do was stare and keep staring. My cousin looked over at me because I had not said anything. We both viewed the animal for about 10 seconds. About 250 yards out in the sage brush meadow was a bigfoot. We banged on the cab so my uncle would stop. The pick-up came to a quick stop and as luck would have it, there were pine trees blocking our view from the sage brush meadow. We immediately said to back-up. As we backed up my cousin and I expected to see the bigfoot still in the meadow but there was no sight of him/her.  We both looked at each other in disbelief and questioned each other as to what we saw. Make no bones about it the animal had the distinctive dome shaped head with no neck broad shoulders and solid black. The animal was facing us and slightly bent forward and looked as if it was resting it's right arm on it's right knee. It occurred to me that he/she knew it got caught out in the open and was just going to stay motionless and hoped we would drive right by. The closest tree line was about 50 yards away from the big foot and it had taken us only about 15 seconds to get back to were we could see the sage brush meadow again. We didn't see the big foot again.  We didn't tell our dads until later on and just kept it to ourselves. My cousin and I continued to hunt deer that morning with a constant thought in the back of our minds of what we saw earlier. We did separate from each other as we hunted the ridge and I did get an eerie feeling that I was being watched. Hustling to find my cousin down the ridge and put the feeling of being watched behind me I heard a gun shot. My cousin did get a nice mule deer buck. This was about 2 to 2 1/2 miles from our sighting. I have hunted most of my life and have seen most animals that live in these woods. My cousin has been hunting all his life and knows every animal there is in these woods as well. We will never forget that morning and talk about it with each other occasionally.  I hope to possibly get another chance to witness another big foot and get one on video.",
  "classification": "Class B",
  "county": "Madison",
  "state": "Montana",
  "location": "-111.563,45.12266",
  "location_details": "Upon entering Virginia City via Hwy 287, take a right if your coming from Nevada City, or a left if you came in from Ennis, up Alder Gulch. This is the first place in Montana that gold was discovered, so there is a monument a short was up the gulch.  I was 16 years old at the time and my cousin was 25, so quite a few years have passed since this sighting happened. My Grandfather's cabins are about 8-10 miles up Alder Gulch and the road to the ridge is another mile and a half from my Grandfather's cabin. My Grandfather no longer owns the cabin."
}