{
  "reportId": "22815",
  "title": "Campers hear loud vocalizations near Kennedy Meadows",
  "date": "2008-01-09",
  "observed": "It was the summer of 1986 and I was camping with a friend in a small campsite where we had been several times before. It was a few hundred yards off the road before Fish Creek campground, near Troy Meadows area on the Kern Plateau, up the road from Kennedy Meadows. The public campground was about 1 ½ miles as the crow flies from us. I believe it was a Wednesday so there were not many other campers on the mountain, and we were on the first day of a motorcycle riding trip. We had spent the day gathering wood, setting up tents and testing out our old motorcycles. Two friends were to join us the next day. As my friend Bob and I settled in around the campfire, we talked of the loop we were planning to ride the next day. We were camped in a clearing in the trees. There was a large meadow 100 yards on the other side of the trees. Bob’s dog Duke, a large male Irish setter, was taking turns getting petted. It was getting late and we were winding down. Just then we heard it. The sound was part yell, part growl. It was extremely loud and echoed through the valley. Only a very large pair of lungs could have produced the loud, high tones and deep throaty growl. This sound struck fear in me that I will never forget. It continued for several minutes and seemed to be at the edge of the meadow. It is hard to describe the intensity of the sound. The best I can do is to say that it started off sounding like the yell of a howler monkey, fading into the deep growl of an enraged grizzly bear. We stoked up the fire without saying a word to each other. Next we heard a branch break just outside the light of the campfire. I looked at Duke and saw him staring at the area where I had heard the branch break. He was shaking from head to toe. Next we heard leaves move about fifty feet over from the last sound. The dog turned straight at it. Again, it was just out of the light of the fire. Bob and I were scared like never before. Our fear was emphasized by the fact that his large male dog was frozen in fear, fixed on one area in the darkness. By the look in his eyes, I believe he could see what we could not. Several minutes later, the dog slowly broke his stare for a minute. Bob and I were able to talk after this point. All we could come up with to explain the noises was that it was large, not a bear, and very angry by the sound of it. We never calmed down that night. We abandoned the tents and both slept in Bob’s Ford Bronco, Bob with his 357 lying across his chest. The next day, we waited until we heard other cars and far off bikes before we started really walking around. Later our friends arrived and we kept the camp loud all of the next night. I have camped, hunted, fished and rode dirt bikes for my whole life. I have played it cool with bears outside my tent and seen a lot of the backcountry. I also work in the outdoors. I have never heard an animal like what we heard that one night.",
  "classification": "Class B",
  "county": "Tulare",
  "state": "California",
  "location": "-118.2084,36.07081",
  "location_details": "Take Sherman Pass Road past Kennedy Meadows General Store.  Continue on towards Troy Meadows. We turned on a vague dirt road within a mile of the entrance to Fish Creek Campground. Our camp was close to the old Jackass Trail connector."
}