{
  "reportId": "12736",
  "title": "Student hears vocalization near the Cuyahoga River",
  "date": "1986-04-16",
  "observed": "I lived at the Kent Village Apartments as described in Reports #4967 & #7832 around 1985-86. At that time there was a small wooded patch between a residential road that led back to a small housing development and the road that led to the apartments.  I would often walk from the Music and Speech building at KSU late at night after play rehearsals and cut through a little path in the trees as a short cut home. It was a warm night and very foggy, I walked home with another student who had been in rehearsal with me. We joked about the creepy weather \"nice night for a murder\" and chatted about this and that as we walked along.  We walked throught the patch in the woods and halfway through we heard the most unearthly shriek.  We looked at each other and bolted out of the woods to the parking lot of the Giant Eagle grocery that was there at the time. I was so scared a remembered the incident for years. Although I put it down to some animal, like a wildcat. I discovered the website and read report #4967, but never put two and two together until listening to a vocalization recording that sounded exactly like the scream we heard that night. Then report #7832 showed up and their encounter took place around the same time I lived there.  I just felt I needed to tell someone that I heard something too. I also believe something followed my father and I in the Mohican State Forest as we walked along the river one hot summer day.  The land sloped upward from where we were and I thought something was up there above us because the bushes kept moving as if something was making it's way through the brush parallel to us.  I got scared and wanted if we could go back to our cabin.  I told my Dad I was tired and hot and couldn't walk anymore. This was late 1970's, I was probably 11 or 12 at the time.",
  "classification": "Class B",
  "county": "Portage",
  "state": "Ohio",
  "location": "-81.33134,41.15845",
  "location_details": "The area is located on Rt.59 just east of the Kent State University campus."
}