{
  "reportId": "24494",
  "title": "Possible nighttime encounter while raccoon hunting outside Valley Head",
  "date": "2008-08-02",
  "observed": "A friend and I were out training my red-tick coon hound on Saturday Aug. 2, 2008. We drove up a familiar dirt road. We drove to the end and were on our way back when the dog had struck out of the back of the truck. I got out, turned on my mining light, and walked to the back of the truck. I opened the tailgate and let the dog loose. I stood beside the truck watching the dog sniff around in the road for a minute or so. I was shining my light around in the woods around me, when I saw a set of eyes looking at me. The eyes were a bluish green color and appeared to be 5-6 foot off the ground. I stood and watched it for at least 2-3 minutes wandering what it was. I hollered at my friend who was still sitting in the passenger side of the truck to come and look and tell me what he thought it was. We both stood there watching it, trying to figure out what it was. The creatures eyes would blink every now and then but it did not show any fear toward us or the dog. It was about 40 yards or so from us just enough so you could not see its body. We wanted to get a closer look so we decided to walk toward the creature. We only had 1 flashlight and for us to get closer we had to cross a small ditch and a broken down fence. I was trying to hold the light on the creature’s eyes, and hold the light so my friend could see so he did not fall. As we struggled to get across I noticed the eyes disappeared. We hollered for the dog to come with us and we walked approx. 40-50 yards to where the creature was standing but did not see anything. We stood there for about 5 minutes talking and letting the dog sniff around, but he acted a little nervous. We started walking back to the road. When we got back to the road we were about 60 yards from behind the truck. As we were walking back to the truck, I was hollering for my dog to come on, and I shined my light up in the woods where we left from, and the set of eyes returned. We looked at it for about 15 seconds then noticed a second pair of eyes this time, The second pair of eyes were orange- red color and seemed to be taller than the first set. At this time we were spooked and made our way swiftly to the vehicle. When we got to the vehicle, we got inside and I shined my light out the window and both sets of eyes were staring at us blinking and showing no fear. I started up my truck and hollered for my dog to come on let's go. The dog jumped in the bed of the truck, I jumped out, ran to the back, and hooked the dog up. I ran and got back in the truck, I shined the light out the window on the creatures, still staring at us, and my red-tick coon hound seen the creatures standing in the woods and started barking with every breath. The creatures continued to stare at us blinking and showing no fear. We decided it was time to get going. We started driving down off the hill. We drove a couple hundred yards and the dog was still barking with every breath. From the way the dog was acting, I felt they were following us. I shined my light uphill beside me and sure enough, there they stood. I watched both of them follow us for about 1/2 mile.",
  "classification": "Class B",
  "county": "Randolph",
  "state": "West Virginia",
  "location": "-79.98,38.55",
  "location_details": "dirt road on a mountain, far from civilization, doesn't see much traffic"
}