{
  "reportId": "6058",
  "title": "Sol Duc River fisherman experiences large animal crashing through heavy brush",
  "date": "2005-04-05",
  "observed": "Date: Oct. 2000. Location, lower Sol Duc River, FS Marker D2000, north of Hwy 110. This event happened during one of my many fishing trips to the Olympic Penninsula. I traveled this forest service road D2000. This is an off road private forest area owned by Rayonier. I fished the first turn out many times. Often at the first turn out, which is pretty isolated, I would hear big thuds when I would be outside my vehicle working on my fishing setup. It sounded like a huge rock bouncing back and forth, starting slow and then speeding up only to then abruptly stop. If I could describe it, I would say it went, Thud (2 seconds pass), then Thud (two more seconds would pass) then the thuds went quicker. Overall, it was Thud...Thud...Thud.Thud.Thud.Thud.Thud. Then it was silent. I thought it was odd, but I was armed with my Colt .45 and fearless. I was alone as I often was in those days. So that day I decided to go further down the trail, proud of my 4x4 and it's capabilities I reached the end of the road that had a 4x4 trail that ultimately ended near the river. When I fish I'm stealthy. I'm real silent when I approach the river. So after I parked and walked down to the river I started casting. I fealt kind of odd and frightened and I shrugged it off as just being alone in the woods. After my second cast I decided to have a cigarette. Dang nicotine! As soon as I used my lighter I heard a large crack in the bushes across the river from me. This was probably a distance of 40 feet. I looked up, startled to see the thick bushes moving alot across the river, but not too worried because I had the river as a safety buffer. It was thick brush and I thought it was an animal sleeping in the bushes. I saw a big brown figure moving in the bushes but I couldn't make out any details. The bank where the bushes were had a slope above it that was probably a 30 degree angle. This posed an uphill path for the figure in the bushes. Then, the next thing I know I see a tree, in the brush, probably two feet in width (not too big, but not too small)that suddently cracked and fell up the hill! It was apparent that whatever I saw had run into the tree, probably startled by my presence because about 10 feet away from that tree was another tree, that cracked and fell up the hill in the path of the brown creature hastly departing the bushes. After that, the creature was gone into the deep brush and forest adjacent to the river. I was convinced this was Bigfoot. Never in my life had I experienced a tree cracking and falling up hill or the sight of something that large that had moved so quickly. I immediately pulled out my gun and ran back to the truck. I drove very quickly out of the area with my heart racing.",
  "classification": "Class B",
  "county": "Clallam",
  "state": "Washington",
  "location": "-124.5301,47.9477",
  "location_details": ""
}