{
  "reportId": "10980",
  "title": "Man has late night sighting near Twain Harte",
  "date": "2003-12-24",
  "observed": "Christmas Eve 2003, my wife and I spent XMas in Twain Harte, CA with friends.  This area is deep in the Sierra Mountains and has plenty of snow during the winter months. We stayed at our friends’ cabin, which sleeps twelve people with no problem. The cabin is about six to eight feet off the ground and the only way in is by using wooden stairs to climb into it. There was plenty of snow and we were warned about walking on the porch. To get to the porch we had to go through the house.  The cabin was warm with the great wooden heater even though the windows had no coverings. Christmas Eve was upon us and the traditional events came and went.  After midnight, everyone eventually went to bed and retired for the night.  I was sleeping in a room by the porch and the windows like I said before, had no curtains or shades. I could see very little from all the windows except for one, which was near the outside porch light.  I could see a small portion of the porch from that window.  I went to sleep as did everyone else, but was awakened several hours later.  There was a slight movement all around the cabin like a small earthquake.  I turned over thinking just that. Moments later, I felt movement again but this time it felt like someone was walking on the porch.  I sat up to look around and did not see anything or anyone. I decided to use the restroom since I was awake and eventually found my way back to bed.  It was then that I noticed something moving by the porch light. At first, I thought it was a man with long brown hair, but then noticed that it had hair on its arms and back. After a better look, it had hair all over its body, but it seemed more of an orange-brown color.  Frightened as can be, I just kept looking at this thing.  It had its back towards me for several minutes and then slowly turned to look in my direction.  I was about twenty feet from the window so I am certain that it did not see me.  It leaned over to see through the window.  I would estimate it to have been about six foot six inches tall.  Its weight was about three hundred pounds and well proportioned.  I compared  compared the beast to a friend who is six foot two inches tall and weights three hundred pounds.  It looked fairly young like a teenage boy. There was also no odor as this thing walked around.  The face was more like a caveman but very sad looking.  I could barely see its eyes in the dark, but I noticed them when it looked left and right. They seemed to be dark brown. The beast was frightening when it turned and looked in towards the window.  Its chest was like that of a male and I am assuming that it was not quite a grownup yet.  It was searching for something but I don’t know what.  I also noticed that our friend’s dogs were no where to be heard or found in the cabin. After a quick scan of the room, it turned and headed towards the porch rail.  Eventually, it jumped from the porch, which was a six to eight foot drop.  In the morning, I did not mention this event to anyone nor did I go looking for evidence. I believe there are different species scattered around the world.  I always believe they existed but my thoughts were reinforced with this citing.  This is also the first time anyone has heard or read this story from me.",
  "classification": "Class A",
  "county": "Tuolumne",
  "state": "California",
  "location": "-120.2434,38.0312",
  "location_details": "I've only been there twice and there are so many streets to turn too that I still have no idea how to get to the cabin.  All I know is how to get to Twain Hearts."
}