{
  "reportId": "6421",
  "title": "",
  "date": "",
  "observed": "I was sixteen then, I'm 27 now but I remember this as if it happened yesterday. I was up late reading a book by Billy Graham. My dogs had been acting up all night barking and sometimes trying to get in the house. I lived on a ranch about 20  miles away from the Smoky Mountains.  It had been raining all night and I thought I heard a noise outside my back door which I was facing.  I looked up but didn't see anything in the porch light so I thought it was just one of the dogs scratching on the door. Suddenly they went wild barking and going crazy and I heard them run around to the back and I stood up to see what was wrong and as I stood I saw a figure walk by my door and stop.   What ever it was it was huge it was taller than my door which was seven feet high and it was very broad and very hairy, it was tan or dark blond at least it looked that color in the porch light. It made these funny whistling grunting sounds.  All I could see of it was its shoulders and part of its left arm. Then all of a sudden my light on the porch went out and I was petrified... in the lightening I saw it walking away so I sort of crawled over to the door to look out and I decided to open the door for a better look. When I did open the door, this odor hit me, gagging me. My dogs had ran under the house and wouldn't come out.  I could tell they were quite scared as well cause the were whining. then lightening flashed again and that's when I saw it about 30 feet away just standing there not really looking at me but more toward the house, then it made the weirdest noise, like a baby crying,  then it whistled again and in the distance on up in the woods I swear I heard the exact same whistle or cry or whatever it was. It was dark, but I could here it crashing through the woods and I guessed it was leaving.  I had moved toward the side of my door and slipped and fell on some glass and cut my self pretty bad, that's when I discovered that my porch light had been knocked out. I never saw any footprints because I had cut my knee pretty bad and had to go to the hospital, it also rained all night and by the time I could go out and investigate all I found was broken tress and branches which didn't prove much because anything could have done it. I just know what I saw was no bear.  Black bears do not get that big or that broad.",
  "classification": "Class A",
  "county": "Mcminn",
  "state": "Tennessee",
  "location_details": "Calhoun TN, near Athens, TN about 85 miles out of Knoxville"
}