{
  "reportId": "44401",
  "title": "YMCA camp guest has a possible nighttime sighting and hears strange vocalizations in Estes Park",
  "date": "2014-02-09",
  "observed": "Visual Incident: I was spending the evening at a 2 bedroom cabin at the YMCA in Estes Park. It had been a cold, snowy day, and I had gone to bed rather early (around 8 pm.). I awakened at 2:30 and got up to look out the bedroom window, through the curtains, just to check on the weather, see if stars were out, etc. I noticed that the basement lights were still on in the rather large, two-story 3-bedroom family cabin. This cabin was about 75 yards directly SE of my cabin (in back of me). I assumed the lights were still on since children may have been playing games that night, and simply forgot to turn out the lights. I looked out the window of about a half minute with this thought on my mind. I didn't see any movement inside the cabin basement, so I assumed the family had retired for the evening. Just as I was about to close the curtain, I saw a very tall, rather large, dark figure stride past the entirely of the basement, across the snow. The stride of this figure was very deliberate and determined. It did not waiver. It did not rush. The figure had long legs, and was mostly all legs. Its torso was solid and straight. It did not look human, I did not discern any clothing on it. I was puzzled at first, thinking, \"Who in their right mind would be outside in this weather, walking in the deep snow (about 1/2 foot or so deep) outside past the lighted basement of this cabin? The figure emerged from the right side of the cabin and was heading to the left side, which would have been toward the direction of the road and the next set of cabins (about 50 or more yards away). There were no other lights on at the time, but the snow held its own illumination in the dark. The basement back-lighting created the perfect silhouette for the striding figure. I only saw it swing its arms, it was not carrying anything. After I watched it pass, I closed the curtain (this episode lasted about 20-30 seconds) and then it occurred to me it had resembled images of what I have been informed about regarding sightings of Bigfoot. i did not have Bigfoot on my mind AT ALL prior to this incident. The image remained in my mind for a good while, so I got up and checked all the locks on the doors, just to feel more safe, since I was staying alone in the cabin. Auditory (Vocalization episode) The next day was especially snowy, almost like a white out. The snow was VERY thick and it was easy to get stuck, as the YMCA plows were working as hard and fast as they could to clear the narrow roads throughout the campus. It was very difficult to pass safely down some of the roads. I had just come out of the Mootz Crafts Center, and had gotten my car stuck. I was fortunate that some kind male guests spotted me getting stuck and helped to push my car out of a snow bank. They left quickly and went back inside the lodge nearby. The snow was falling quickly and heavily, and I was beginning to worry I might get stuck again. I was standing outside my car, trying to determine the best driving route to take, when all of a sudden from the back of the woods, nearby what I would determine was the Livery Stables, came a very loudly projected guttural (like from the deep part of the back of a throat) type of cry-moan. It lasted several seconds (about 4 seconds or so). I looked around to see if I could see anyone, but no one was out at all. The weather was far too severe. I stood by my car, opened the car-door, which made a squeak, and the sound uttered once again, almost exactly as it had the first time. Same loudly projected quality, carrying from somewhere back deep in the nearby woods. This time, I felt intimated and frightened. This sound did not match the sound of an elk, or a mountain lion or a person, or a kid being silly. \"The bears are all asleep,\" I thought. The message that I perceived from it was \"I am here. I can see you. This is my territory.\" I quickly got into my car, closed the door and managed to pull away out of the deep snow, leaving the YMCA campus. it was a very eerie experience,and I can still feel the chill going up my spine as I think of the impact of those howls on that very snowy day.",
  "classification": "Class B",
  "county": "Larimer",
  "state": "Colorado",
  "location": "-105.5728,40.33838",
  "location_details": "Both incidents occurred on the YMCA Campus located in Estes Park."
}