{
  "reportId": "15251",
  "title": "Multiple witness motorist sighting on Rt 36 east of Riverton.",
  "date": "1995-12-15",
  "observed": "About ten years ago I saw something very peculiar. It was laying in the middle of the road and I didn't notice it until I was about to hit it. As my ex-girlfriend and I swerved to the left lane to go around, it got up and watched us drive around it. This thing was HUGE! I'm not exaggerating it had to be close to ten feet tall, with white to grayish colored fur. I watched it watch us drive away in my rearview for about a minute then it ran away on it's legs just like a human. At that time and for a few years after I was in sort of a denial, telling myself it had ot be some kind of Polar Bear that had gotten loose form a local zoo or something. After never hearing any news story about a missing Polar Bear I put in the back of my mind always suspicioning that it may have been a Bigfoot. As for my ex-girlfriend (the other witness), I haven't spoke to her in years but I know that she saw it too, and was just as dumbfounded as I am!",
  "classification": "Class A",
  "county": "Sangamon",
  "state": "Illinois",
  "location": "-89.5,39.853",
  "location_details": "There is a lengthy stretch of road that runs alongside railroad tracks (north side of the road), between Riverton and Dawson. If you were to look at a map you will see a bend in the road. It was between the end of this bend to a mile east of the bend that I saw this creature. I saw it laying in the right lane (my lane) of the two lane highway. After we were driving away I retreated to the south side of the highway. Looking at the south side of the highway there are some trees or woods and brush which is where it was likely heading. Directions to location: Driving east of Springfield on Interstate 72 take exit #108 toward Riverton Dawson, at the top of the off ramp turn left. Head towards the flashing yellow light close to the intersection. At the intersecion turn right onto old Rt. 36 towards Dawson. Almost immediately you will begin into the bend in the road that I mentioned previously. At the end of the bend the road will be positioned close to the railroad tracks. It is between here and the next mile where I had my encounter."
}