{
  "reportId": "6938",
  "title": "Tracks and feces found in freshly turned field",
  "date": "2003-08-30",
  "observed": "My husband and some others were preparing a field for planting when he noticed a pile of pooh in the field.  He walked over to it and stated that he wondered what might have made such a large pile. As he looked around for horse or cow tracks, another person walked over to look at it and said \"Look at the size of these foot prints\".  They all began looking around and found tracks coming out of a grassy area onto a dirt road. The tracks went about 20 feet then turned left into the freshly plowed field (plowed the day before).  They proceded about 30 feet into the field. There you could tell where it paused to squat repositioning it's feet to do so and did it's business. While in this position it dug up some turtle eggs in front of it and ate them leaving broken shell behind. The feces were the consistancy of horse droppings in that they were of high fiber content and contained undigested muscadines(a kind of wild grape). But the droppings weren't in the shape of horse manure,(round ballshaped piles) but were long and cylindrical like that of a dog or human. The  feces(2) were about 18-24 inches long and about 2 1/2-3 inches across. Rather large I must say.    The tracks then turned left again into an area of tall grass, small pines and other small trees that lined a field at the edge of the woods. I wasn't able to follow them very far due to dead branchs, briars and undergrowth that blocked my progress. Plus I was wearing only sandals, shorts, and a tank top. Not prepared to trek through the woods. I took pictures of the  tracks and the feces with a yardstick for size comparison. I also took a specimen of the feces and turtle egg shells which are still in my freezer. I have a cast of a left and right foot. The right one broke trying to pick it up but is still n pretty good shape. The left one is completely intact.  They measure approx 18 inches long, 8 inches wide at the toes and 4 1/2 inches at the heels. The stride measured 3 feet from the toe of one foot to the heel of the next step. Each foot has 5 toes. A humanlike large toe on the inside of the step and each toe following being smaller than the last. There is an arch to both, showing it is not flatfooted. I took these samples to the Univesity of Alabama and showed them to a professor who is an anthropology professor in forensics. I walked away disappointed to hear him insist that what I had were Bear tracks. But he had been on a bear trip since I had spoken to him a few days prior about my find. When I arrived at his office, before he even looked at the cast he was talking bears and showing me books and pictures of bears and bear tracks.  I tried to say Bears don't have a Big toe, but he tried to make up reasons that these tracks of a \"bear\" had a big toe.  I realized this person was not going to believe what he was looking at was not a bear. It either frightened him to think it was a possible Bigfoot out there or he was embarassed to say he didn't know what it was. Just a \"Bear\".  Well there is our encounter of a Track sighting.  When I was looking through the internet for sighting reports in the Alabama area I was excitedly surprised to find the one on your sight (report#245 Class A) which is in the same general area as ours.",
  "classification": "Class A",
  "county": "Tuscaloosa",
  "state": "Alabama",
  "location": "-87.35664,33.21145",
  "location_details": "Withheld at witness request"
}