{
  "reportId": "16529",
  "title": "Nighttime sighting by motorist along US-250 outside Belington",
  "date": "2006-03-18",
  "observed": "I was alone, driving after dark from Belington, WV on US 250 North (two lane highway) toward Philippi, WV. About a mile out of town, I had just passed a small group of houses on the right. The highway curves to the right; there is a long guard rail on the right side of the road. As I was coming around the long curve, my headlights caught something up ahead, standing on the white line on the right side of the road. At first I thought it was a very tall, lanky human, at least 6’4”, with long reddish hair and a long beard, but as I got closer, I realized there were no clothes, just reddish brown hair over its entire body. The hair length and texture reminded me of a horse’s groomed mane, the hair was smoothed and not matted, and my impression was that it was a very tall monkey type animal. I did not see eyes, I got the impression it had closed its eyes when it was startled by my headlights. It stood frozen as if surprised by my headlights, very stiff, with extra long arms down by its sides. As my car went by it, it did not move, but was so close to my car I thought my right side mirror would hit it, but it did not. The incident lasted only about 10 seconds. My first thought was that it was a “skinny Bigfoot”, but that those things don’t exist and if they do exist, they are not in WV, they are in the Pacific Northwest. I kept going, as it really scared me, and there was no way I was going back to see what it was. I shook all the way home, I think because it resembled a human somehow, and because it was unlike anything I have ever seen, except in a zoo. When I got home, my daughter and her husband were visiting, we also had family from PA there. I told my family about it privately, they were skeptical, of course, and laughed about it. My husband does believe I saw something, but doesn’t have any ideas about what it could have been. I decided to look this up on the Internet and I saw there were incident reports and even expeditions for WV --- and that there is an incident reported for Barbour County! I almost had a heart attack when I saw this report was in the same area as my incident. I considered reporting it to you then, but was first discouraged from it by family. I believe what I saw was some sort of animal, and I reasoned that it obviously isn’t hurting anything or anybody, and I wouldn’t want it hunted down. I told no one else for several months, and have tried to just forget about it.",
  "classification": "Class A",
  "county": "Barbour",
  "state": "West Virginia",
  "location": "-79.95418,39.03496",
  "location_details": "Near Belington, driving toward Philippi on US Highway 250, about a mile North of intersection of Rt. 92 and US 250. Tygart Valley River is on the left.  This is near where the Tygart Valley River swerves away from the highway and starts to descend into a long \"canyon\" between Belington  and Philippi.  It is extremely steep, there are many waterfalls, etc. and is very hard to access."
}