{
  "reportId": "692",
  "title": "",
  "date": "",
  "observed": "About 7 years ago I encounterd 2 sasquatch in the blue mountians of Walla Walla WA.  I had just moved up here from Houston Tx and took my dads bug for a drive.  I went up Mill Creek Rd which led up to squaw springs camp grounds. This is a good hour and 1/2 up into the Blues on a some what graveld Rd. I belive it in July or August.  It was dusk, I had my head lights on as a came around a bend in the road. Thats when I saw them crossing the road.  One was aprox 8 ft the other 7 ft tall. They looked right at me, the head lights reflected thier eyes to be a yellow color, and the sun was out just enough to shine on thier bodies to let me know these were not bear or elk.  I came to a stop as they crossed, I got out to see if I could get anothe look as they walked of into the woods but could not see anything, nor did I smell anything odd. I looked for trackes but the ground was hard so I got back in the bug and drove home.  A week or 2 latter I was shopping at the eastgate mall and ran into a display of bigfoot set up by acouple of guys by the names of Paul freeman & Wes Summerlin. They had 2 stuffed bigfoots, I explaind to them that I had seen these 2 in the Blues.  They said they were a male and female couple that have been spotted numerous times. Freeman went on to discover miles of tracks and even shot a couple of video of bigfoot in this area. From what I can tell he even went so far as to fake quite a bit of evidence which is to bad becouse I fell he did have some legit stuff, but who really knows now.  I went on to be come friends with the Summerlin family. Even went on a seach for bigfoot with them. Wes had a lotof stories, Hair samples, photos,ect.  He never really made a big deal of it, he belived and thats all that matterd. If you asked him ? he would gladly share his knowledge with you. Wes passed away awhile ago so I dont think there is any real reachearch going on here now.  A friend and I go up a couple of times a week now and look for our self.  I know sasquatch is here, Ive seen them. The sighting have gone down since Freeman left town which has led people to belive it was fake. Its funny becouse deep down you know bigfoot is real yet the evidence you sometimes come up with points the other way even though you have seen them with your own two eyes.",
  "classification": "Class A",
  "county": "Umatilla",
  "state": "Oregon",
  "location_details": ""
}