{
  "reportId": "49309",
  "title": "Possible nighttime activity during a hog hunt on a ranch near Bryson",
  "date": "2015-07-13",
  "observed": "My son and 2 nephews went feral hog hunting in North Texas recently and we experienced noises from what we believe were 2 entities other than people.  Were were hunting a remote Texas Ranch at night with no light with the exception of a motion activated green light that would shine if an animal walked within 10 yards and 145 degree radius of the light standing 3 feet on a stick in the ground.  We were placed onto our milk carton \"chairs\" behind dead vegetation about 2 feet high and 40 yards from the light placed over a pile of corn placed by the rancher.  We sat down just before dark at 9PM and waited. I wore binoculars and glassed our area before dark to become familiar with the terrain and where the pigs might trail to the corn.  At 200 yards behind us in a brush area, I noted an animal lying down and looking towards us.  It was only a quartering appearance, but I noticed it was eating something.  I could not identify the animal, only movement and a dark hairy head. At midnight, we began to hear bipedal movement to our right about 40 yards away and a light breeze wafted an incredibly terrible smell towards us.  We hear grunting and branch breaking.  Within 20 minutes tree knocking began.  It was rapid 3-5 almost staccato knocks answered almost immediately approximately 75 yards to our left in 2-3 slower knock responses.  Whistling started and my son became very frightened.  The green light went on without any noted animal, so I aimed my .45-70 rifle at the lit ground and fired one round into the dirt near the light.  We then heard 2 sets of bipedal footsteps running away from us to our left over the ridge towards my nephews. The sound of the running was very heavy footfalls of what sounded like large animals.  We called our guide and requested to be picked up, and he arrived 30 minutes later.  My nephews reported hearing the running, and they saw one pair of glowing eyes 8-9 inches apart about 8 feet off the ground 20 yards from their boxed blind, and it scared them.  They also heard tree knocking and whoops.  They had heard my shot and said it correlated with running towards their blind and subsequent observations they made.  They were also frightened.",
  "classification": "Class B",
  "county": "Jack",
  "state": "Texas",
  "location": "-98.4,33.2",
  "location_details": "2 miles directly North of Bryson, Texas on Dirt roads."
}