{
  "reportId": "18278",
  "title": "Late night sighting by young couple in a parked car on a rural lane outside Kelso.",
  "date": "1994-11-11",
  "observed": "[Editor's note:  The initial report was submitted by a friend and co-worker of the witness. The BFRO investigator eventually spoke with the witness by phone (see investigator's notes below). The witness never typed up the report himself. The friend's version of the story is more or less consistent with the story told by the witness, so it will remain accessible here.] I worked at plant that produces feed grade Amino Acid additives.  Our company is Japanese-owned and had just expanded, adding a new plant to the existing one.  As a shift worker, we work 2 weeks on the day shift, then switch to 2 weeks nights...it's hell on the body's sleep cycle. Anyway, in November of 2000, a fire started in the new plant and as a result, some of the new hires were assigned to work with us in the old plant while their facility was being repaired.  One night, we were sitting in the lunchroom, around midnight, grabbing a bite to eat.  I made the remark about a \"less than helpful\" co-worker to the tune of, \"he's like Bigfoot, occasionally there's a sighting\", eluding to the fact that this particular co-worker had a tendency to hide on midnights and leave all the work to the rest of us.  We all laughed, but one of the new guys got real quiet and his eyes got real big and serious...then he said, in the most serious tone...that sh@% is for real!  We all got very quiet and as we calmed to listen, he told his story. Now this is a guy who was well-liked because he was such a \"crack-up\" which is what you need to have in the manufacturing sector.  He went on to tell the story of how he encountered a Bigfoot when he was on a date in Chafee, Missouri. Him and his girlfriend were parked on a narrow dirt road, just off a county road near Scott City, Missouri.  They were doing what young folks do in a car on friday nights, and when they were ready to leave, they started the car and turned on the headlights.  About 20 yards ahead, they saw a creature, frozen, looking back at them with yellow eyes.  They couldn't turn around due to the narrow lane, so he put it in reverse and backed out about 100 feet to the road and made haste into town.  He said they were so scared, they believed the creature might be on top of their car, that they drove to a convenience store where a group of people were gathered, in the hopes that if people started to scatter, they were correct in their assumption that a Bigfoot was on top of their car. We all sort of laughed at his story, but he remained serious...and I've got to tell you, this seemed strange, because he is normally a very funny guy and his face was quite sullen as he told his story. I sort of believed him and inquired from some of the others as to what they thought. Some say there is a creature in Southeast Missouri known as Yehoo man, so it's not a new phenomenom.  I've been waiting seven years now and noone in this area has posted any reports of sightings here.  I check this site every once in a while and decided to finally tell this story because I believe the young man saw a Bigfoot and I even had him take me out to the location. It happens to be close to a residence, although out in the country, and located close to a stream with trees on both sides of the lane he claimed to be parked in.  It's just another one of those accounts that will probably add to the mystery of what I believe is the last frontier of animal science.",
  "classification": "Class A",
  "county": "Scott",
  "state": "Missouri",
  "location": "-89.6075,37.286",
  "location_details": ""
}