{
  "reportId": "40371",
  "title": "Memory told of a daylight sighting at a golf course in North Bonneville",
  "date": "1985-06-08",
  "observed": "In the summer of 1985 I was 17 at Beacon Rock Golf Course in Washington state on the Columbia River just west of Bonneville dam. It was mid morning my dad and grandfather were golfing, I was playing caddy for them. It was on the second fairway, a long mostly straight hole. My dad's tee shot went into the woods and brush on the right hand side about 1/3 of the way down, I told him I would go look for it. I grabbed a 7 iron and made my way into the bushes. I was poking around, pulling back branches looking for the ball when I smelled what I can only describe as something rotten, it was really bad. I thought I had uncovered a dead animal with the club. As I continued to move brush around I looked up to see if I should go in a bit further. That is when I saw something about 10 - 12 feet away standing next to a tree. It was approx. 7 to 7 1/2 feet tall with very broad shoulders, fully covered in hair, a bit lighter brown on top and got darker as it went down, almost to a black as it got to mid chest. I couldn't see anything from the knees down due to the underbrush. I have been hunting with my dad since I was 13 and have lived in the country most of my life. I know what I saw was not a bear, I didn't know what I was looking at, but I know I had never seen anything like it. I turned to scream at my dad and grandfather, but no sound came out, I was truly terrified, I turned back to see if I was seeing things and it was moving up the hill at a quick pace, not running but walking quickly, never made a sound, other than the occasional swish of a branch bouncing back to place. I turned and ran out of the tree line never looking back. I caught up with my dad and grandfather who had walked past me up the fairway at some point, they were about half way to the green. I never said what I saw or smelled, just that I couldn't find the ball. The whole thing lasted about 15 to 20 seconds.",
  "classification": "Class A",
  "county": "Skamania",
  "state": "Washington",
  "location": "-121.9883,45.63921",
  "location_details": ""
}