{
  "reportId": "681",
  "title": "",
  "date": "",
  "observed": "My brother and I were spending the night in our grandparents' camp trailer, which sat about 20 yards away from our parents' house. We were staying there because our other set of grandparents were borrowing our bedrooms in the house for the evening as guests. Initially, my dad escorted the two of us out to the trailer and tucked us in. He locked the door as he left. That was at about 10:00 p.m., maybe 11:00 p.m. As my dad left, I turned on the light so that I could look at a book that I checked out at school that day. I laid there in bed and looked through the book. My brother was laying directly to the left of me in his sleeping bag. I was reading the book for about an hour when I noticed peculiar footsteps outside of the trailer. The footsteps were deep-sounding thuds like deer make in the woods. I used to hunt, so I was familiar with \"deer sounds\". There were always a lot of deer around our house in the night, so I paid it no mind at first. I was just thinking deer were walking around the trailer and on the lawn which surrounded the house. I continued to look through my book for maybe 15 minutes when I realized that the footsteps were not going away and were very close. This started to really creep me out. I reached up to the light and turned it off. At this point, I just listened. The footsteps continued in the vicinity of the trailer. This continued for about 10 minutes after I shut the light out. After this, the horrific started. [At this point, my story is probably going to sound like an unbelievable haunted house story, but you must believe me. After this incident happened, I never spoke of it to anyone outside of the family for years. Recently, I've told my good friends and my wife this story because now days I guess I just don't care if they believe it or not.] I was laying there listening to the footsteps when suddenly I heard what sounded like fingernails or claws gently brushing the side of the trailer and the trailer door. I was petrified. This continued off and on for a half of an hour. The next event was really creepy: The animal outside started to claw at or play with the ceiling vent in the middle and at the top of the trailer. I didn't see anything at first, but then I saw what looked like the silhouette of a long shaggy finger poking through the vent above the metal mesh screen. It reached from one end of the vent to almost the other side. This lasted for only a few seconds, and then the ceiling vent was still and silent. However, the footsteps continued around the trailer for at least an hour more. I figure it was past midnight by this time. During this period, I heard the animal trip over the trailer hitch or something like that. This was confirmed by the ping of reverberating metal. The animal continued to stay within the vicinity of the trailer after midnight. What happened next makes me believe that this animal was probably a Bigfoot. At this point, I heard a car turn off the main paved road and up our subdivision's dirt road (about a quarter mile away). As the vehicle closed on our location, the creature sprinted directly towards what sounded like an eastern direction. What I heard was deep, coherent, bipedal footsteps. This creature was very heavy, but bipedal. As it turned out, the car coming up the road turned into our neighbor's driveway. It was indeed our neighbors, and they appeared to have just come from a party by the way they were talking. They were only mere feet from my brother and I, but we were so scared that we couldn't move or yell for help. Our neighbors went into their house, and I continued to listen for the animal. I could hear the thing walking probably a hundred yards away out in the forest and sagebrush, but it appeared to be keeping its distance. I could hear the distinct bipedal footsteps. The creature did this for a couple of hours, and I was starting to feel as if it were getting safer. I went to sleep finally. However, sometime later I was awakened by the sound of something literally punching or hitting the trailer. I heard the footsteps again up close. The animal was back. It walked around the trailer as it did earlier and then it appeared to go away and I went back to sleep. During the entire event, my brother and I did not move a muscle or even say a word to each other. The next day, we stayed in that trailer until my dad finally came looking for us at 11:00 a.m. We were two frightened boys.",
  "classification": "Class B",
  "county": "Klamath",
  "state": "Oregon",
  "location_details": "About 15 miles South Southeast of Klamath Falls, Oregon. We lived at the end of a small subdivision that was relatively new (5 years) at the time."
}