{
  "reportId": "28805",
  "title": "Camper recounts late night experience and finds footprints near Interlochen",
  "date": "1982-06-25",
  "observed": "MY STEPBROTHER TOOK ME AND ONE OF MY FRIENDS ON A CAMPING TRIP UP BY TRAVERSE CITY MICHIGAN IN JUNE OF 1982 WE WERE GOING TO ROUGH IT OUT IN THE WOODS, NO TENTS JUST OR SLEEPING BAGS. ON OUR WAY UP HE TOLD US OF AN ENCOUNTER HE HAD A COUPLE OF YEARS AGO WHILE CAMPING WITH SOME FRIENDS OUT IN THE WOODS.  THEY HAD JUST CAME BACK FROM TOWN AND WERE SITTING AROUND A CAMPFIRE WHEN SOMETHING STARTED YELLING AND RUSTLING AROUND IN THE WOODS IT WAS MOVING AROUND THE PERIMETER OF THEIR CAMPSITE THEY ENDED UP LEAVING AND NEVER WENT BACK FOR THEIR TENT OR CAMPING SUPPLIES.  WE DECIDED TO HEAD TO THE SAME AREA HE HAD CAMPED AT YEARS EARLIER.  THE DIRT ROAD THAT LED BACK INTO THE WOODS WAS VERY RUGGED AND IT TOOK US ABOUT 15 TO 20 MINUTES TO REACH THE AREA.  THERE WAS A CLEARING IN THE WOODS WHERE WE PARKED AND WE WALKED AROUND LOOKING FOR A GOOD AREA TO CAMP.  WE MADE A FIRE PIT AND PICKED FIDEL HEAD FERNS TO LAY OUR SLEEPING BAGS ON TOP OF.  LATER THAT NIGHT PROBABLY AROUND 2 OR 3 MY FRIEND WOKE US UP AND SAID THERE IS SOMETHING OUT IN THE WOODS WALKING AROUND OUR CAMP AREA, MY STEP BROTHER AND ME TOLD HIM IT WAS JUST HIS IMAGINATION AND GO BACK TO SLEEP.  AROUND 5 HE WOKE US UP AGAIN AND SAID GUYS THERE IS REALLY SOMETHING OUT THERE SO WE LISTENED AND WE HEARD SOMETHING MESSING WITH MY STEP BROTHERS CAR.  WE DECIDED TO WAIT UNTIL THE SUN CAME UP TO GO INVESTIGATE.  WE GOT UP AND HEADED TO THE CAR ABOUT 30 YARDS OUT FROM OUR CAMPSITE WE NOTICED THAT SOMETHING HAD MADE A PATH THROUGH THE FIDEL HEAD FERNS AND IT ENCIRCLED OUR CAMPSITE THESE FERNS WERE THIGH HIGH AND LOOKED AS IF SOMEONE HAD BEEN WALKING ON THEM ALL NIGHT, VERY WEIRD.  WHEN WE GOT TO THE CAR EVERYTHING LOOKED ALRIGHT SO WE DECIDED TO LOOK AROUND THE AREA AND THAT IS WHEN WE FOUND A HUGE FOOTPRINT ON THE DIRT ROAD (IT WAS A SANDY AREA) AROUND SIXTEEN OR SEVENTEEN INCHES LONG ABOUT 7 INCHES ACROSS AND IT LEFT A DEEP IMPRESSION, WE WERE LIKE BIGFOOT.  WE WERE PRETTY FREAKED OUT AND KIND OF IN SHOCK FOR A FEW MINUTES.  WE LOOKED AROUND SOME MORE AND FOUND ANOTHER FOOTPRINT BY THE CREEK.  I BELIEVE TO THIS DAY THAT IT WAS A BIGFOOT THAT WE HAD ENCOUNTERED THAT NIGHT.  I HAVE TOLD THIS STORY TO MANY PEOPLE OVER THE YEARS AND I GET A CHILL DOWN MY BACK EVERY TIME.",
  "classification": "Class B",
  "county": "Grand Traverse",
  "state": "Michigan",
  "location": "-85.79052,44.66666",
  "location_details": "IT WAS BACK IN THE WOODS OFF OF THE HIGHWAY ON A TWO TRACK DIRT ROAD I GUESS SOME LOGGING HAD BEEN DONE BACK WHERE WE WERE AT"
}