{
  "reportId": "8351",
  "title": "Father describes possible late night vocalizations heard by his boys near Willis",
  "date": "1999-06-19",
  "observed": "On the first weekend of summer, 1999, two of my sons and a friend planned a Saturday night bonfire in our backyard fire pit to celebrate the end of the school year. They went out about midnight and started a wood fire to throw their books and papers into. After the fire was going, they began to throw the school stuff into the fire. The firepit is almost visible from the couch I was sitting on in the family room on the southwest side of the house. I fell asleep about 12:30 or so, and was awakened by the slam of the bathroom door at about 1:30 AM. I asked the boys what was wrong, and my younger son and his friend were crying. The oldest son was white faced and visibly shaken. They apparently heard what sounded like women screaming at the back of our yard, to the west, then north, then east, like the screamers were surrounding our yard and taking turns making the screams. The boys said that the screams sounded like they started high pitched, then descended into a low growl and were moving. I used to be an avid hunter and target shooter, but, as I moved around the country for my job, I got tired of learning new rules, etc., and stopped hunting, but I still had a few guns and police grade flashlights around the house. When we moved to this semirural area, I had a standing deal with my sons that they would get me if anything unusual happened around our property, no matter what. This time, though, they never got me up to tell me what happened. By the time I figured out that they heard something unusual (at the time I thought a local girl was being harrassed by local punks), and I got out the back door with a light, whoever/whatever was there was gone. They didn't want to call the police because they were afraid I would tease them, let alone the police, who might think they were lying. The next morning, my sons took me out back to the field behind our property, but we found nothing. The following Tuesday night, just at dusk, my middle son heard the same scream and movement in the corn field on the east side of our house, and ran in, badly shaken. Again, I ran out, this time armed as well as with a good light, but saw and heard nothing. Interestingly, the area around us is still farms with corn, srawberries, and other crops growing most of the year, even though the area is ten minutes from Dearborn, Michigan.",
  "classification": "Class B",
  "county": "Washtenaw",
  "state": "Michigan",
  "location": "-83.55718,42.15965",
  "location_details": "North of Willis Rd between McKean and Bunton roads"
}