{
  "reportId": "1163",
  "title": "",
  "date": "",
  "observed": "It happened to my older brother, who was a disbeliever at the time. He was spending the night in the Chevy Open Road camper, parked in our driveway, which our parents owned at the time. It was a Saturday night in the early summer. He considered it cool to spend the night in the camper. At that time there had been a 'flap' of sightings in the area, and WDCA Ch. 20 had been playing up on this during their midnight 'Creature Feature' horror movies. At the end of the movie, I jokingly took a BB pistol to my brother to protect himself should he encounter one. At about 1:30 am, he had shut the TV off and was going to sleep when he noticed a shadow which was cutting back and forth thru the window of the camper (it was closed curtain). The shadow was from a light in our nextdoor neighbor's yard back porch light, which was a 'clear shot' between the camper and the porch (no wind, trees to block, etc.) He got real quiet and watched as the shadow moved closer to the camper. This type of camper had a translucent plastic roof, and if a light was shone on the roof, you could easily see it, or a shadow. Needless to say, the thing came up and slowly walked around the camper, lightly tapping the sides of the camper while walking around it.He could also see the shadow of a 'head' through the roof, so the thing has to be around 9-10 ft. tall to do this. The next morning he came in at the crack of dawn and told what happened -! He didn't sleep at all and was scared stiff. We found fingerprint smudges on the sides of the van, and a handprint on the hood which was quite large, about 6-7 '' wide. There were also large toeprints in some sand which was spilled in the yard. We don't know what it was, but it was real, and very large.",
  "classification": "Class B",
  "county": "Anne Arundel",
  "state": "Maryland",
  "location_details": "Annapolis, Anne Arundel County, summer of 1970 0r 1971. At the time it was a main thoroughfare area, with a lot of wooded places still intact. The incident happened on Bay Ridge Avenue, near the SPCA."
}