{
  "reportId": "43963",
  "title": "",
  "date": "",
  "observed": "Okay here I go.. I had a sighting about 16 years ago where I live now. I was walking my husband out for him to leave for work at about 5:30 am. He was facing me on the porch telling me bye and I was facing out toward the woods. I noticed 2 huge furry things sitting by a stump in between our place and the neighbors. It is a good distance. I screamed because I was scared to death and before my husband could turn around they both stood and took off back into the woods. It did not take them not even half a second it seemed. They did not stand completely up before they bolted so I could not guess as to how tall they would have stood. They were light to medium brown and fully covered in hair. It was too quick to make out a face. Very broad shouldered and while sitting the arms did go to the ground. I begged my husband to stay home that day. It scared me so much. Definitely one of those times you wished you had seen a deer or bear or something. To this day I can not bear the thought of my son going out into the woods. I have not seen anything since. Also we had heard of a sighting in a neighboring town of someone seeing a white one. Later on that same year in another county that borders our town as well someone else said they seen one too. (white). I had heard the Bigfoot team was coming out but never heard anything else about it. I have heard of 2 other instances from other people but 1 group confirms they had been drinking and driving when it crossed the road in front of them and the other. But in 2013 while closing up our chickens me and my husband did hear something breaking big limbs off of a tree in thick brush in the woods near our place. After I went in and left him out there he said he heard the loudest holler that was of nothing he had heard before. Not from the same place but was within walking distance. They say we have big cats that sound like a woman screaming so maybe one of those in this instance. Would it constantly break limbs though. We had heard the breaking the limbs 2 weeks prior as well it just did not last as long as this time did. I say the brush was thick because we could not see through it to tell what was doing it. We had heard of a sighting in a neighboring town of someone seeing a white one. Later on that same year in another county that borders our town as well someone else said they seen one too. (white). I had heard the Big foot team was coming out but never heard anything else about it. I have heard of 2 other instances from other people but 1 group confirms they had been drinking and driving when it crossed the road in front of them and the other I do not know to believe her or not. .. I do not know to believe her or not. .. I do not want to see another one. I am very scared of seeing another one.",
  "classification": "Class B",
  "county": "Blount",
  "state": "Alabama",
  "location_details": "We live near Blountsville"
}