{
  "reportId": "31025",
  "title": "Close encounter by a hunter tracking his dogs at night outside the Seney National Wildlife Refuge",
  "date": "2010-08-15",
  "observed": "My son-in-law and I were hunting across from Clear Lake a few miles off Hwy 94 next to Green Lake. We were running our hounds on coon that night. There is a lot of country past Green Lake up into the Hickey Marsh and eventually the Seney. I had noticed partridge remains where we parked. I didn't think about. The hounds were gamey right out of the box. I cut a young hound and proven hound in. Both with a lot of grit. When they struck I had the feeling we weren't running coon but rather a bobcat. It took about twenty minutes and they treed. We proceeded into the dogs and right before the tree the critter bailed. Cats bail when they see lights like bear do at night when we run them. The dogs pulled tree and gave chase again. Treeing deeper. Way deeper. My son-in-law went to the truck to holler me out if needed. I kept the the tracker with me. I'm now in marsh with a mixture of spruce, cedar, bog and popple. The dogs treed deep. I went to a high spot to vantage my hearing on them. A thick wooded ridge. My radio tracker could barely read them and barely read the extra collar at the truck. Its range in wooded areas is about 7 miles. I kept swinging it around slowly trying to gain a good reading. I could smell something foul but thought it was myself after falling in swamp muck on more than one occasion. Again while swinging my tracker my coonlight in the direction of the antenna I noticed in the spruce a set of eyes next to the deer run on this ridge. Coon hunting you see a lot of different eye shine. I shrugged and swung the tracker, when I swung back into the trail toward the truck the trail was filled with animal twenty feet in front of me. It was around 8 feet tall long arms with fingers, barrel chested and pot bellied. The eyes were close and deep set but aggressive in its gaze, the mouth was agap. My goodness the ears were small. I froze in my tracks, I lost my training of the hounds call. We just looked at each other frozen. It grabbed a very large spruce, wrapping its hand around it. Its hair was black to brown not long, not short, the nose flat, with a face not covered in hair like its body. I really don't remember how it left. I remember the smell followed me almost all the way to the truck just up a trail where my son-in-law met me. He commented I passed gas jokingly. I was very shaken. I had a hard time reading my tracking system on the way back, I doubted my compass. It wasn't the straightest path back. To this day I haven't ran the hounds up there for or or bear since. As well it was the only time I left my hounds in the woods. In the morning after sleeping a bit I rode up {nervous as hell } to try and find the hounds by myself as my son in law went to work. Thank the lord they were treed in the beechwoods 30 feet off the gravel road with the prettiest sleeping bobcat you ever seen in the tree.",
  "classification": "Class A",
  "county": "Schoolcraft",
  "state": "Michigan",
  "location": "-86.21193,46.19183",
  "location_details": "28 miles north of Manistique off Hwy 94"
}