{
  "reportId": "12204",
  "title": "Motorist has midnight road cross encounter.",
  "date": "2005-07-07",
  "observed": "I had just got off work approximately 60 miles away and had been driving home. I saw something (I'm not saying it was a bigfoot,) large bending over (its back facing me). It looked like it was picking something up off the highway that runs over the bridge. It was pretty different than I had imagined they looked like, though. It was really tall, even bending over the way it was. It had long, straight brown hair, though, like a dog or something. I always pictured them to have black hair, but this was brown. There were things hanging in the hair, little sticks and undergrowth looking stuff, and it was really dirty. The only other thing I really remember is the smell as I drove by, it was awful! I was driving my convertible with the top down, and the smell of what ever that was - well, I can't even describe how bad it was. That's really all I saw, etc. I was driving about 60 mph and after I saw whatever that was, I sort of got the creeps and sped home and ran in to tell my husband what happened. I didn't even put the top back up on the convertible. The bridge that I saw whatever that was on is only about a quarter of a mile from my house. So, needless to say, I'm not real happy about coming home from work after dark anymore. Also, I know this sounds weird, but about a week and 1/2 before the sighting, we kept hearing the strangest scream (that's the best way to describe the noise,) and it was not one of our calves or any of our livestock, and after about 2 days of hearing this noise, it finally stopped. The next day, we found a little baby goat with the umbilical cord still attached and dragging the ground all alone - no mother goat to be found anywhere. We found him all alone in the wooded area back behind our house. When we found him, he was terrified, he didn't make a noise or anything - it took us hours to catch him. He finally bleats (cries) now, and it sounds nothing like the noise we heard before we found him. We have also lost 4 baby kittens in the last month, they seem to have just disappeared. We do live way out in the country, though. It's possible that anything could have carried them off or had them for dinner, but I feel like it's worth mentioning.",
  "classification": "Class A",
  "county": "Lincoln",
  "state": "Oklahoma",
  "location": "-97.00389,35.68583",
  "location_details": "Deep Fork River."
}