{
  "reportId": "1371",
  "title": "",
  "date": "",
  "observed": "On approximately December of 1982, two friends and myself were returning to Colorado from Texas, by car. At just before midnight, on a dark stretch of Interstate 25, heading North towards Denver (just 100 some miles before Colorado Springs,CO.) something strange caught my eye. I was seated in the passenger side of the car. A friend, Trent, was driving. In the backseat, asleep and extremely ill, was another friend. To the right, traveling at 60 MPH, the headlights caught what appeared to be a 3-4 foot, white haired ape-like creature, with a dark face. It was standing upright. My eyes caught it some 100 feet ahead in the lights, and I followed it with my eyes. It was merely standing there at the side of the road. Although I admit a childhood interest in BIGFOOT lore, I almost instantly dismissed it as such a creature. Surely my eyes were playing tricks on me. I said nothing to my friend, who was driving. My first instinct was to ask my friend to turn around and go back to investigate. Instead, I said nothing. Five minutes later, my friend pulled off to the side of the road, as he had to \"relieve\" himself. We met at the back of the car to \"take care of business\", where he expressed he was getting tired. I agreed, telling him, I, too, was tired, and was starting to \"see things\". He then told me, that he was also \"seeing things\", saying, \"Yeah, I just thought I saw a Polar Bear back there.\" A chill went up my spine, and I asked him if it was \"white and furry\". He said yes. I told him that I thought I saw a \"small white ape, with a dark face!\" Without missing a beat, he told me to get in the car. \"Let's get out of here!\" We wanted to go back to investigate, but our sick friend in the backseat needed to get home, due to his illness. He was passed out throughout the entire episode, and we didn't want to pester him with our shared \"illusion\". We're obviously unsure of what we saw. However, we agreed that it was not a coyote, and we both only saw two legs. This account was dismissed by us, until 5 years later, when \"Unsolved Mysteries\" did a feature on some unusual sightings of a large Bigfoot like creature. Their report: Along the Colorado Front range, there had been reports of a WHITE haired APE-LIKE CREATURE, roaming around the homes in the foothills just NORTH of Colorado Springs. (Our sighting was 100 some mile SOUTH). I think it important to mention, for credibility, that I have held a strong fascination in Bigfoot lore since childhood. I am not totally convinced that what I saw was what I know as a Bigfoot. The account is true, however, I believe the circumstances of the event and the accounts in that region are interesting and worth reporting here. I have never told of this event to more than a half-dozen people. I think it important to mention, for credibility, that I have held a strong fascination in Bigfoot lore since childhood. I am not totally convinced that what I saw was what I know as a Bigfoot. The account is true, however, I believe the circumstances of the event and the accounts in that region are interesting and worth reporting here. I have never told of this event to more than a half-dozen people.",
  "classification": "Class A",
  "county": "Pueblo",
  "state": "Colorado",
  "location_details": "Approximately 100 Miles south of Colorado Springs, near Pueblo; off the east shoulder of I-25 in Pueblo County"
}