{
  "reportId": "4366",
  "title": "Hikers have late night experience near Spicer",
  "date": "1977-07-01",
  "observed": "As a new High School graduate in 1977, I planned a camping trip to an area near a boy scout camp (Wolfboro) I was familar with, with my new girl friend.  As an Eagle scout and an athelete (I was recruited to play footbal at Cal) I wanted to impress my friend who loved the outdoors.  The destination was around a dammed watershed called Spicers Resevoir.  There was a dirt (logging road) turn off from Hwy 4, between Bear Valley and Angles Camp.  We drove down this windy dirt road (some 7-15 miles), crossing over a little bridge that crossed a very shallow Stanislaus River (since it was very hot during this summer month), until we reached the end of the road at the dam.  We packed about a mile down the river (?Green waters River) that ran out the bottom of the dam. Only one side of the river had a hiking trail. The other side of the river was a very steep and rocky (e.g. boulders) bank.  This was in the middle of the week, and I knew from my scouting and other trips that very few people were seen in this area.  I was setting up my camp at a clearing next to the river and my girlfriend was fishing.  It was hot, as she had a tangled line while wading in the stream. She yelled up to me that she saw somebody crossing the river above us, some distance, from the other side of the river. Effectively to warn me not to be surprised if they walked past on the trail.  Nobody came down the trail and we forgot the incident. An uneventfull evening passed.  The next day we decided to break camp and go back to the Stanislaus (maybe there was better fishing). This obviously required us to pack back to the car and drive a few miles to the little bridge crossing the Stanislaus River. We parked next to the bridge and found what looked like a fishing trail.  We packed along the trail (if you could call it that) until it was too difficult to hike.  There was alot of little pines close together and there was bigger and bigger granite boulders in our way.  We found a clearing, some 20 yards from the river. I pitched the tent next to a dried creek bed.  The creek bed was a few feet wide and the tent was a dozen feet from it.  The rear of the tent was a few feet from a slope consisting of huge boulders and small pines.  We made a camp fire when evening fell.  It was a clear moonlite night except for the thunder we heard in the distance. I remembered that there could be these rouge thunder clouds. Anyway, later in the evening when we were about to \"turn in\" we heard strong screams coming from the upsteam direction. This was in the direction where we ran out of a hiking trail. The screams occured periodically for 1/2 to an hour.  I rationalized them to be a sick or injured \"range\" cow. During my scouting days I was told that cattle roamed the area and the snow level would effectively heard them down the river valley.  We went to bed and must of only been asleep for a couple of hours when the thunder clouds were close enough to wake us.  I wanted to put some things (e.g. shoes) in the tent so they wouldn't get soaked from the rain.  Once back in my sleeping bag I stayed awake listening, when I heard two foot steps behind us on the rocks of the dried creek bed. I listened more intensley and heard two more step, then a pause. I was really scared, especially since the movie Friday the 13th had been playing. I really thought it was a person stalking us.  I attempted to peer out the back (mesh) window of the tent.  Nothing was said between me and my friend and I didn't want to alarm her, even though I was scared stiff. What I did see was a large silhouette standing and then moving (the two steps at a time) past a tree in that dried creek bed. After, what seemed like a long time, the thing moved/walked deliberately past our tent twords the river. The front part of the tent faced the river and was zipped closed. But this thing, that I believe was Big Foot, started splashing and making that strong high pitched screaming noise at the river.  I then heard foot steps come directly twords our tent and stop right in front of the tent. My hand was on my buck knife.  Then I heard it run away.  I think, after a while, we might have said something like \"did you hear that?, lets get out of here\". Day break was only a short time off and we waited only for the first sign of light.  We hastily packed up camp and drove home. We talked about maybe checking with the ranger, but we didn't.  We eventually tied the \"fisherman\" crossing the river the day before, below the dam, to maybe not being a human but a Big Foot.  This so called \"fisherman\" crossing the river was \"dressed\" in very dark clothing, my girlfriend said, that seemed odd since it was so bloody hot. I haven't changed my story in 25 years.  You could even contact my old girl friend if you like.",
  "classification": "Class B",
  "county": "Calaveras",
  "state": "California",
  "location": "-120.0397,38.45861",
  "location_details": "See detailed description"
}