{
  "reportId": "5929",
  "title": "",
  "date": "",
  "observed": "This story I am going to relate happened some 15 1/2 years ago. I have never talked to anyone about it. Not even my wife, who I've been married to for almost 18 years. She is a very skeptical person, and is a hard person to convince of anything. She knows that I believe Bigfoot exists, because I have talked to her about Bigfoot before. She is just so skeptical about it, that I know she would think I was nuts if I ever told her my story. But after having visited your web site many times in the past, and seeing the new documentary on the discovery channel \"Sasquatch legend meets science\". I now feel like I would like to tell my story. I was deer hunting in the beautiful Wasatch Mountains about 4 1/2 to 5 miles east of Pineview Reservoir in the Cache National Forest. I arrived at the magpie campground around 10:00 am. As far as I could tell, I was the only one at the campground, although the campground goes a lot farther east than I was. I parked at the furthest west parking lot, and from there I crossed the bridge that takes you over the south fork of the Ogden River. After crossing the river there is a trail that goes east, and parallels the river. I followed the trail until it branches off. At that point the trail goes south through a small canyon. The day was so nice, and I was enjoying the sounds and the scenery very much. About halfway through the canyon I made a great effort to stay as quiet as I could, because I didn't want to alert anything to my presents there. The trail up the canyon goes for a ways, I can't remember how far, but then it turns and goes west. Right after it turns, everything opens up a little bit more, and there are steep slopes on either side. Not long after I made this turn, I herd this noise. It was a noise that I had never heard before. A low grunting sort of growling type of noise. But what was amazing to me about it was the immense volume of the sound. I could almost feel the volume. I'm not sure if I can put the sound into words, but it was something like \"huuuuuuurrrrruuu\". The sound was a low-pitched sound, but it would drop off even lower at the end. I stopped immediately in my tracks, and scanned the slope to my right, which was were the sound had come from. The sound continued again, but I couldn't locate the exact spot. I just stood there, and listened. The noise kept repeating, but I wasn't able to find it. So I continued on up the trail very slowly. The noise was not continuous; there were pauses of maybe a minute or two. Then I would hear the noise again. A moose was the only thing that came to mind as the source of the sound. I didn't really care to have a confrontation with a moose so I stayed on guard, as I got closer to the sound. After going a little further up the trail I herd the noise again. This time my eyes were able to lock on to the location. Up the steep slope to my right about a hundred feet up and probably 350 to 400 feet in front of me there was a growth of thick trees and brush. The noise was coming from in that spot. I felt a little bit better; at least I knew were the thing was. I was far enough away from it that I thought if I make some noise maybe it would leave. So I start stepping on branches and kicking small rocks, but it did not leave. I kept going up the trail thinking I would see it soon, but it would not show its self. Finally I was right beneath it, about a hundred feet straight below the thick covered area. I stopped at a tree below the sound, and sat there on a thick branch. I was pretty sure that what ever was up there knew I was right down below it. Then the sounds became more agitated. I was trying real hard to see into the thick covered area using my binoculars. But I could not see into it at all. Then along with the noise some tree branches in the thick area started shacking. They were shacking about 9 or 10 feet up off the ground. I then thought o.k. here it comes. But it still wouldn't come out. I started to feel a little uneasy. I just knew that I was being watched, and what ever was watching me did not want me there. The noise started to intensify ever more. I just could not believe the lung capacity this thing had. The noise was immense. Then I really became unnerved when two rocks, about the size of basketballs came rolling out of the thick cover, down towards me. That's all I needed. I got back up and immediately headed out the way I had come. I didn't run or do anything to cause a disturbance. I just walked out as calmly and quickly as I could. I kept checking my back though to make sure I was not being followed. I could still here the noise until I got back around the bend in the trail. As soon as I got around the corner, my anxieties and fears left, And I felt all right again. I just knew that what ever I heard wanted me to leave. I was only too happy to oblige. I have hunted and fished by myself for years, and felt very comfortable by myself in those situations. But I have never heard anything at all like what I heard that day. I still don't know what was in that thick area of tree and brush growth, and I'm not sure if you will find this at all interesting. But I have read accounts where a Bigfoot would remain hid while being looked at, or while it is looking at someone. Well this was a lot of years ago, and I know that's its nothing that can be checked out now. But maybe it would help with research. Thank you for your time.",
  "classification": "Class B",
  "county": "Weber",
  "state": "Utah",
  "location_details": "Cache National Forest, 4 or 5 miles east of pineview resivore, and south west of the Monte cristo forest."
}