{
  "reportId": "9567",
  "title": "While taking dog outside witness sees large bipedal shadow next to his shed",
  "date": "2003-11-12",
  "observed": "I will tell about my visual siting. I do have an on going encounter with many sound and oder encounters which happened the same waythen Ihad the sigting. It was a winter night about 22:00hrs.I took my dog out. We were outside about ten minutes. When I saw a creature standing 20-25ft. away. Itwas next to a small building with the woods behind it.There was astreet light 50ft.behind me. Iknow it was not my shadow, My shadow stoped 10ft. short of its feet. As we looked one another over.the dog just wonted to go inside.At this time Iheard a noise to my right I turned to se what it was .Isaw nothing. Iturned back an the creature turned to look also.The smell was like awet deer but ten times worse.The creature was around 8-9ft.tall. Dark hair covered its body.It seemed to get up set becouse I did not run. It took a type of defensive posture and looked me up and down.The mood seamed to change I thought it might charge.At this point I went In side let the dog go got my handgun and went back out but it was gone.However Icould still here him in the woods. It was about 8-9ft.tall and at the least (500lbs).The shoulder span was around 4-5Ft. I this had to be alarge male. Due to the way it acted and its movement and presents. I say htis from my years of hunting and just whatching wild life.The next day I found single print that was about 5in. wide at the hill .This was the best part You could see. It was about 18-20in. long.I feel there was only the one due to the fact we had norain for weeks.The night was dry and clear. there was no wind or clouds in the sky. Ihave no dought what Isaw. IKnow what all the local wildlife looks like including the rare black bear that comes alone. Iwould be very intrested in speaking to some one from your group.This as been going on for the last three years and not slowing down. Thanks for giving me a place to report. Iknow of other people that have had encounters also.",
  "classification": "Class A",
  "county": "Sabine Parish",
  "state": "Louisiana",
  "location": "-93.50845,31.5831",
  "location_details": ""
}