{
  "reportId": "33979",
  "title": "Witness has numerous encounters and collects physical evidence over a seven month period near Christianburg",
  "date": "2009-02-06",
  "observed": "My sighting first took place on my property in February of 2009. I had numerous contacts along with various evidence found and seen on the ten heavily wooded acres where I reside. 1st sighting. Feb 6th approximately 11:30 PM. Went out on the back deck to smoke a cigarette. There was a full moon and around 4inches of snow on the ground. The temperature was in the single digits. My family have been living at this location and I am familiar with the wildlife and sounds in the woods. I first heard movement in the woods that sounded like something extremely large. The snow was crunching and large branches and small trees were being broken. ( loud cracks like a gun fire) I was saying aloud: \"what the hell is out there!). As it moved closer I could see some of the smaller tree tops shaking. This activity continued until it was about 20 feet from the woodline. At that point it stopped. The full moon reflecting off the snow illuminated the entire area enough to play a baseball game but I could not see what was within the woodline. I vocalized aloud: \" why can't I see it\". Then another ash tree began to shake near the fence line. The ten acres of woods on my property is surrounded by another 50 heavily wooded acres as well so there is plenty of mature forest and dense cover. Then I heard a loud crack and a small ash tree slowly fell along the fence line. I still did not have a clue as to what this could be. (bigfoot did not even come into consideration). After the tree fall I went into the house, locked the door and went upstairs to alert my wife and see if we could get a better look from the second floor window. I woke my wife and raised the window facing the wooded area. My wife and I both could hear movement in the woods which was clearly bi-pedal, again large branches breaking. My wife suggested that I go out in the morning and look for prints in the snow to identify it. We do not have bear in this region of Ohio so I was mystified as to what it could be. The next morning I went out to investigate and discovered 9inch wide by 17 inch long bigfoot tracks. I could not believe it! I used a carpenters square and to reference the size and took digital pictures of the foot prints in the snow. I followed the tracks thru the woods which looked like a tornado passed through. 6inch diameter hardwood trees broken over, briar brush flattened ending at the 5 foot tall barbed wire fence at the rear of my property crushed down to a foot high. The barb wire was broken and stretched out straight as a frozen rope. We have a heavy deer population and I believe it was pursuing a deer. I found a hair sample on the barb wire. ( concealed as evidence in a zip lock bag. ) From there I found additional tracks which lead me to a fresh deer kill. There is no hunting on my property or the adjacent properties. The first thing that I noticed was the legs on the deer had been removed and the lower jaw was ripped off . All of the internal organs were missing yet no entrails or blood were found. I taking pictures of deer carcass and the bigfoot prints near the deer when I noticed the lower portions of the deer legs stacked together against a large tree. all of the legs were in the same direction like a bundle of dowel rods and there was clearly an imprint in the snow where ths sasquatch sat down in the snow against this tree and enjoyed his meal and neatly stacked the lower portions by the tree. At that point I turned to take a picture for evidence when a large stick flying end over end hit me on the back of my head and knocked my ball cap off. Thats when I realized this bigfoot is still out here. I grabbed my cap and ran out of the woods to the house. This story is just the beginning of an amazing six months of encounters and upclose sightings of an eight foot tall bigfoot that was very comfortable on my property and my family. I would be happy to share the other experiences and the evidence that I have collected.",
  "classification": "Class A",
  "county": "Miami",
  "state": "Ohio",
  "location": "-84.04518,40.04342",
  "location_details": "Heavily wooded area of approximately 50 acres adjacent to rural corn field s and numerous gentleman farms."
}