{
  "reportId": "44262",
  "title": "Possible daylight sighting by a couple at Geneva-on-the-Lake State Park",
  "date": "2014-02-15",
  "observed": "On February 15th, 2014 at approximately 4 pm my wife, 2 children and I were driving into Geneva State Park. It had been frigid cold and we wanted to see how frozen over the lake and marina were.  At the corner of Padinarum and Lake Road I jokingly asked my daughter if she had “passed gas”…..I was told NO!!  My wife made a comment that the really bad smell was coming from outside.  We often times drive through the State Park watching for wildlife.  We drove slowly through the marina parking lot and stopped for just a few moments.  We noticed there was one truck in the parking lot and two others pulled closer to the lake.  They appeared to all belong to the same snow removal service as they were out of their trucks talking to one another.   As we were pulling out maybe 10 minutes later we were approaching the first curve just outside of the parking lot and I noticed something walking about 50 to 60 yards from the road and it was moving in an easterly direction.  My first thought was it was a person.  I told my wife to stop and she too saw it.  She said it was furry but at the angle I was looking I was unable to make out anything except a very dark figure that “seemed” tall and was definitely walking on two legs.  My wife later told me that she saw arms swaying. In an instant it was GONE!!!  I got out of the vehicle and walked about 40 yards in.  I was unable to spot any sign that would make me think it was anything but a person.  Although, being that the temperature was 15 degrees with a feel like temp in the low single digits I wondered why anyone would be out in this weather. There was also heavy snow on the ground.   I did see some snowmobile tracks but we always drive through the park with the windows down and nobody in the family had heard any engines at all!!  I returned to the vehicle and we drove a short distance to Crabapple Picnic Area parking lot.  We pulled all the way around the large lot and stopped just about 20 yds from the exit and stopped the van.  My wife shut the van off and we told the kids to be quiet.  My wife asked me to whoop or mimic a Bigfoot yell.  I whooped once……nothing.  I waited about a whole minute and let out three large whoops.  Something whooped back!!!!!!!  In a 5 min span of time we heard 2 distinct whoops, 1 scream, and two wood knocks.(We did NOT do any wood knocks at all)   We did NOT see anything else though.  It was difficult to control the excitement in the vehicle.  I am certainly NOT saying that my wife and I had seen a Bigfoot, but we did see a bipedal “something” and heard some very distinct noises, and finally smelled something really nasty.  I hope that if anyone else had any type of sighting in and around this area they would come forward and share it.  OR….if someone KNOWS they were walking in that area at about that time, that would be nice to know too.",
  "classification": "Class B",
  "county": "Ashtabula",
  "state": "Ohio",
  "location": "-80.96186,41.85256",
  "location_details": ""
}