{
  "reportId": "17804",
  "title": "Late afternoon road crossing sighting by motorist west of Springerville.",
  "date": "2007-02-01",
  "observed": "Although I have had very good class B encounters, this Class A sighting was something that I will treasure. On Feb. 1, 2007 I took my husband to Show Low AZ to drop him off for 10 days with friends. The weather had been bad that day and progressively worsened so that I did not take my normal route back to N.M. which is through the White Mt. Apache Res. I went down U.S. Hiway 60, it runs between Show Low and Springerville AZ.  Past a small town called Vernon, the terrain loses almost all of the juniper trees and is mostly rolling grassy hills. I have learned a type of defensive driving in Elk country, wherein you keep alert to the peripheal vision movement. Something drew my attention to the left hand side of the road and I applied brake anticipating an animal (elk, deer, pronghorn etc.). What I saw made me turn and pay attention. It was bipedal and running dead at the road. I slowed as fast as possible and watched in open mouthed awe as the creature placed one hand on the t-post (metal pole used in barbed wire fencing) and vaulted over the fence, slowing very little and continued running. It crossed the road (2 lane black top) in maybe two full strides and kept going into a narrow canyon and beyond my sight. I pulled to the side of the road and called my husband. He could not believe what I was saying. He finally asked me to get out of the car and look for tracks or hair or solid evidence (once a cop always a cop). In very unladylike words I told him no.  I was alone, unarmed and unwilling to meet something that big on a road that I had seen fewer cars in two hours than I had fingers on my hands. The creature was dark brown and had longish hair. I never saw its face full on, it had to be close to seven feet tall or more. It never seemed to be afraid or running dead out.  More like a lope or steady jog. The weather was cold and heavily cloudy, mix of precip. off and on all day. No standing snow. It was around 1530-1600.",
  "classification": "Class A",
  "county": "Apache",
  "state": "Arizona",
  "location": "-109.44,34.6",
  "location_details": "Near a place where they are putting a new bridge, and a foresty raod intersects a little past that."
}