{
  "reportId": "9392",
  "title": "",
  "date": "",
  "observed": "Our experience was in the summer of 1986 in the N.central Washington State Cascade Mts. We decided to camp at the Loup Loup pass campground which is located between the towns of Twisp and Brewster in Chelan County. It was an evening that a mild rain would occur and clear off for a short time followed by another mimor storm cell. We arrived at this campground in the mid/late afternoon. The campground had three levels at that time. The upper level was the largest and was on a large flat field. The second level was a bench with a few sites and the third and bottom level was the most remote and bordered a small creek that flowed south east. This creek bottom had very heavy brush. We picked a campsite that was away from the creek and away from the majority of mosquitos and was at the base of the middle bench level of the campground. We pitched our tent and started preparing dinner. At the time we drove in we were the only ones in the campground. Shortly before dusk we heard the first call. As we recall it was a multi-tone report that consisted of high pitched as well as deep guttural roar. I have hunted for years and this was of nothing I had heard in the past. This was not an elk, bear or cougar. At the first call our normally quiet and lethargic dog was excited and aggitated. I took him and my 45 up to the top level as the call came from our E and sounded as if it were on the top level. I got to the top within a few minutes and found nothing. There were no other campers at that time either. We were unsure of the sound but knew it was foriegn to us and was very substantial in depth and volume. After discussing our situation we decided to stay as it was well after dark. All was quiet for maybe an hr. or so then it sounded off again. Ths time it was to the S. and on our level in the brush along the creek. We decided at that point to spend the night in the car. I am unsure of the exact timing of the calls but it seems that the next one was maybe 1/2-1 hr. later. The following one was maybe  1//2- 1 hr. apart as well but the call was moving to our west and north and was moving up the creek drainage. After the third call we heard a distant call similiar to the one near us. After the close caller sounded off, the distant one did also. It appeared that the two callers were locating and moving toward each other. This went on throught the night until the two were quite close and then the calling ceased. As day broke we saw nothing. I was too cautious to enter the heavy brush in search of tracks but in retrospect I wish I had. We broke camp and left. As we were leaving we found a couple of motor homes that had camped in the first few spaces on the main level and asked them when they had come in and if they had heard anything unusual. They stated that they came in late and heard nothing. They were near the distant edge of the first level. This sound was nothing that my wife and I had ever heard before or since. I wish we would have tried to duplicate it and record it to tape but we did not.",
  "classification": "Class B",
  "county": "Okanogan",
  "state": "Washington",
  "location_details": "Head north from wenatchee WA.on hiway 97. At the town of Pateros, head up the Methow Valley on hiway 153. Before entering the town of Twisp turn right ( E ) on highway 20. As you reach Loup Loup Pass look for signs for the Loup Loup campground n of the highway."
}