{
  "reportId": "7504",
  "title": "",
  "date": "",
  "observed": "Well this was just supposed to be a fishing trip to see what the area had to offer.  I had been coming to this area for the past couple of months and started to learn it a little better.  So I decided to go exploring for some fishing holes.  All I had with me at the time was a fishing rod and a GPS receiver so I wouldn’t get lost. I parked the truck and started out on foot. I had talked to two local fishermen about what was in these rivers, and what to use. I’m from the south and this area was like a new world.  So I made my way down to the river along the side of the bank.  At times the going got a little hard but I managed.  I tried several places but the water was moving too fast, so I thought that I would try and find a slack part of the river, where the flow was a little slower.  Now these woods are a lot different than the ones I was used to, so I was a little excited about this new area. I had been walking for maybe 45 minutes and covered maybe two miles when I saw something in the distance.  At first I thought that it was just a stump, seeing that I had left my glasses in the truck.  Now my vision isn’t that bad, but I still need them for driving.  But, I started feeling a little uneasy due to an earlier encounter, plus it might have been a bear. But, being the idiot that I am, I had to get closer.  I got to within about 75 yards, because I was using the tree line as cover. That was as close as I wanted to get.  You could say that my heart was beating out of my chest it was like I had buck fever.  Well now that I was within good sight of the creature. It was easy to see what it was.  It finally stood up, and I didn’t know up until that point how big it really was. Now, I had a roommate who was 6'7” and this creature would have easily stood over him.  At the best guess I would have to say that it was 7'6” tall, and it had to weigh over 400lbs.  It finally turned to me and made me out in a second, but when it turned, it didn’t run away instantly.  It just stood there.  I guess it was trying to see what I was. We must have looked at each other for 10 seconds or so, but it felt like 10 minutes. And in that time all I could see was that the creature had dark reddish brown hair, and the arms easily hung down to the creatures knees. But within an instant something spooked it. The creature turned and looked down river, and it just took off.  Now the ground that this thing covered was amazing.  I didn’t move for a good bit, because I was in shock.  After the creature had left, I did the same, once I could get my feet working again.",
  "classification": "Class A",
  "county": "Humboldt",
  "state": "California",
  "location_details": "Going north on 101, take 254, and once you turn onto 254, off to the left, I pulled in and parked."
}