{
  "reportId": "2897",
  "title": "",
  "date": "",
  "observed": "I have had more than one encounter with BF or some thing. The incident that I am going to describe here is just one of countless that I have had. It was late, midnight or so; I was camping in a swamp with a friend of mine. We both have been to the camp sight before its near where I grew up, deep in the center of this large forest mostly swamp but the edges of the forest is hard woods. They logged it out some years back and there are many tree tops and fallen trees in the center {Swampy area, almost bog like}. You could walk for miles just on down trees we crossed darn near the whole place like that on one of our excursions out there. Any way, the camp sight is on this stream, Bear Crick, is what we have always called it. There was a big bend in it right there and some of the only high ground in the immediate area. There where two huge old trees right there also, we had a small fire going and where sitting around talking quietly. I grew up with this guy and the two of us have camped regularly since we where young. The night was normal, in the sense of animal sounds and such.  I heard it first, if I remember right.  It was coming down the creek from the South, you could just make out the foot falls, though threw this point I should add, are many deer trail, the main one follows the creek and there is one that comes in from east, which is woods/swamp. This spot was just one of many on the creek that had a major crossing point for deer. We have had more than one come threw camp early in the AM and cross there. It came closer, about 30 yards or so and that is when it went off.  Points of note: I did have a 12 gauge with me and this was the last time I took it out camping there again. We had knives also. It started to scream? Howl? Vocalize at us and while it was doing this it proceeded to tear up a tree. I could not locate exactly which tree it was though in the AM. It went on like this for some time.  I grabbed up my gun and loaded it, my friend told me to quit freaking out and said he was going to go talk to it and DID.  He went into the woods about 10 feet or more beyond the campfire and stood out there.  I could barley see him in the darkness. {It was early spring at this time)  This went on for a bit more {a few minutes or so} and then stopped.  I heard nothing more, no movement, nothing.  It just went away. We have tagged this thing with the name Monkey Beast, for that was our first thought that some strange monkey was out in the woods with us. Notes: I never shot my gun, nor did I raise or level it toward the sounds.  The night was clear.  I am going to place my bet that we where right on one of the main run ways that IT travels.  I deduce this from other incidents that have happened at that exact spot.  Stuff has happened there like this about 8 or 9 times with a witness every time, but only one.  If there where more than that we did not hear or see any thing. I would guess though that we where a lot more noise too at those times. We have camped at this locating for around 5 years and in that area for 8 or 9 years. Why I never took a camera, or video recorder, tape recorder I don't know.  I have never found any tracks either and I have spent some time looking! During this incident we where around the ages of 16 or 17.",
  "classification": "Class A",
  "county": "Kalamazoo",
  "state": "Michigan",
  "location_details": "(edited)"
}