{
  "reportId": "440",
  "title": "A daylight sighting report by an ex soldier",
  "date": "2000-10-10",
  "observed": "REPORT:  In the summer of 1977, I was in the U.S Army, stationed at Fort Huachuca Arizona.  During this period of my military career, I was assigned to the post drill team.  As part of our duties we did functions such as parades, special ceremonies, and military funerals.  Fort Huachuca is approximately 70miles south of Tucson.  I remember it was a day in July, on a Saturday morning.  We had to do a funeral in some small town in Arizona.  I don't remember the name of the town.  What I do remember is that it was a beautiful day, not a cloud in the sky, it was a perfect day.  If you know anything about Arizona, its desert, and on a clear day, you can see for miles. We loaded on to the military bus, and we started on our trip. Right out side the gate from Fort Huachuca is a small town called Sierra Vista, which is a small military town basically. There is a main road, that leads from Sierra Vista, that goes up to Highway 10, which is the major highway that runs through Arizona. I forget the highway number of the road that leads to Highway 10, but I'm sure if you look on any map, you could find that out. We turned left on the road and started to drive towards Highway 10, it takes about 15 to 20 minutes to get To Highway 10. After we got to Highway 10, we turned right, heading north on Highway 10. We were driving about 10 or 15 minutes, and suddenly, the bus starts to jerk. The driver pulls over, and there we are on the side of the road. Everyone got out of the bus but me. I was sitting on the left-hand side of the bus, or the driver's side, looking out of the window at the passing traffic. On the far side of the road, I could see a big white house, with a road leading from it. (This is very important, because I'm sure that house is still there, I think it was some kind of ranch actually, but I remember that it was all white). Any way, I'm sitting there, looking across the road, and an 18wheeler, was coming up the far side of the road, on the other side, heading south. Just as the 18wheeler past, I saw something, coming up out of the gully, on the far side of the road. I'm sure you know how when you see something, first you see it, then your mind processes what it is. My first thought was, is that a bear?  Then as the thing kept coming up the embankment, I could see that it was walking on two feet, that's when my mind then asked, is that Gorilla? I remember it was dark tan in color, with long hair, you could also see it was very muscular, and it had these long flowing arms. As it came up the embankment, it turned its head, and it was like time stopped. When I looked in its face, I actually saw man like features. It's hard to explain, but it was like a big hairy man. From it facial expression, I could tell it was frightened. It actually ran with its head looking back for a good distance.  (Note: on the phone interview, John stated that he could also see his chest when it turned to look back at the highway.)  I truly believe that the sound of the 18wheeler scared it.  Back a little ways, I told you about the white house, and the road leading from it. I sat there, for oh, at least 45 seconds, watching it run up this road. You should have seen how fast it could run, and how long the stride's were, it was amazing.  It was also a very hot that day, as days are in Arizona, but it was like it ran with ease.  Then it turned off the road to the left, and it was gone, into the desert.  I just sat there in disbelief for a long time, and then realized what I just witnessed, a sighting of Big foot itself. Needless to say, none of my friends saw it, because they were playing around on the other side of the bus. For the rest of the day, I could think about nothing but that. Later that night, when my mind was thinking clearer, I had time to make some assumptions. After my sighting occurred, I had time to think about what had happened. For some reason, this creature came down to the road, why I don't know, but I don't think it was trying to cross. From the look on its face, and the way it was running, I got the impression that the 18wheeler actually scared it. It was running full speed up the embankment. I truly think its curiosity got the best of it, until the sound of the big truck scared it. I also wondered why no one else on the bus or highway seen it, because it was so big. I don't know how it got down in the gully. But, unless someone, just by chance looked out their passing car window, I could see why it went unseen.  I also noticed that the color of it, witch would make it very hard to notice especially in the dessert. If it saw someone coming, all it would have to do is knell down, and it would go unnoticed. An assumption of mine is that this creature has learned how to go unnoticed, I truly believe it is intelligent, and can probably get very close to humans without it even being detected. Another thing I must say is, other than a picture, foot prints, video, or a dead body, it is going to be very hard to prove this creature exist. As far as shooting one, I guess that is a possibility. But, if that does happen, it would have to be out of fright, or because a person thinks it a bear or something.  I say this because, if you look this creature in the face, you are going to see so many features that a man has, that it would be almost murder to shoot one, it is just so man like in the face. From the distance I was, it would be hard to say how tall it was, but I would put it over 6 foot easily. As far as the weight, it would be hard to estimate, but I would have to guess at least 300lbs. The thing that impressed me more than the face though, was it powerful build. Broad shoulders, wide body, and you could see the muscles in the arms, and its legs were very strong and muscular. After I had a long time to think about it, I almost felt sorry for the creature, because I can only imagine that it lives a lonely life, all alone.  I do think it enjoys its freedom though, and it is truly the ruler of its domain. In the end though I truly think we will find proof one day, if for nothing but because man is expanding all over the place, and this creatures curiosity with man, might get it into a situation it can not get out of. It is going to be very hard for this creature to hide forever, but for some reason I know it will try. I have had 20/20 vision all my life.  I again, have kept this too myself all my life because who would believe such a story, sometimes I don't believe it myself. It's funny now though.  Sometimes, I'm sitting around watching TV, and I see all the shows about whether Bigfoot is real or not. And, I just shake my head, because one day, man is going to get the shock of its life, because this man/creature is out there, I know, I saw it with my own eyes.  Again, I don't want any recognition or fame, I just wanted to finally share this story with someone.  I also can not speak on the other sightings, as to their truthfulness or not.  What I do know is there is at least one in Arizona somewhere. One suggestion though is, if someone really got serious about finding this creature, with today's technology, you would think it would be easier.  One technique I think would work is to go up in a helicopter of plain with infrared heat sensor equipment.  One thing I know is that it is a hot-blooded creature, and if someone could finance it, and have the patients to track it, I think you would hit pay dirt. Oh yeah, one other thing, Unless you drug this creature, or shoot it dead, I would hate to be on the team that tried to capture it.  From what I saw, if you corner this creature, it would have the strength to rip your head off your body.  Well I guess that's it, if you have any further questions please feel free to ask. COMMENTS: First I would like to thank you for the wonderful information you have on your web site, you are doing a very good job. Though I can not vouch for any of your other stories, or sightings, what I can say is one day the hole world is going to get the shock of their lives.  Because, this man creature we call Big Foot does in fact exist, I know because I saw one with my own eyes in the summer of 1977, in Arizona. Like many, I did not believe my eyes. Till this day, I don't know why God allowed me to see this creature, and I replay the seen in my mind almost everyday. The thing I will never forget though, is when the creature turned around, and I looked it right in the face. What I saw, is the thing that has stayed with me, because even though, I knew it was a wild creature, its face is so man like it will scare you. I saw intelligence, fear, and also saw that this creature is just as curious about us, as we are of them. For years I have kept this to myself, because who would believe me, they would think me crazy, as you probably do also. But, let me say this, I'm not looking for any recognition, fame or fortune. All I know, and can say, is that this man creature does exist, and one day, we all will find this out.",
  "classification": "Class A",
  "county": "Cochise",
  "state": "Arizona",
  "location": "-110.1835,31.99003",
  "location_details": "About 10 to 15 min. northeast of the town of Benson, on Highway 10.  Accross from a white ranch house, with a road leading down to the highway."
}