{
  "reportId": "10925",
  "title": "Four men have a sighting after vocalizations cause them to leave their campsite near Lake Vesuvius.",
  "date": "1991-02-24",
  "observed": "It was an unusually warm February that year and me and 3 other friends of mine decided to go out and spend the night in the strip mines to kind of get away from things and shoot guns and just have a little fun without disturbing anyone. We arrived at the pull off about noon and proceeded to hike the 2 miles to where Crystal lake was located. When we arrived at the lake we set up a small fire and our sleeping bags on a small knoll overlooking the lake and then went down the hill to an old road and walked about a mile or so when my friend Darren found a large footprint in the clay-like mud off the side of the road, we all were amazed at how big this print was, I wear a size 12 boot and it was at least 4 inches longer than my boot. It was a very fresh track, so fresh Icould make out the loops and swirls on the pads of the toes and part of the sole. We got really nervous and a little scared because we all had a lot of experience in the woods hiking and hunting and none of us had ever believed or seen anything about Bigfoot, but We changed our minds very quickly after seeing that print. We made our way back to the camp and sat around the fire and just kind of took it all in and discussed what we had found and tried to dismiss it and go on with our trip. Later on in the evening we heard nromal woodland creatures and birds but it got very quiet and nothing made a sound for hours. We were getting scared and wondered if we should leave but curiosity got the best of us and we decided to stay the rest of the night. We ate dinner about 7p.m. and sat around the fire and talked until at exactly 11:23 p.m.(I will remember the exact time as long as I live)we heard what can be described as a cross between a bark and a scream came from below our camp near the lake shore, it was the most unnerving thing I have ever heard we all just sat and stared at each other unable to talk or move. This went on for about 5 minutes until about a half mile away we heard another answer the first with a series of high pitched barks and screams. That is when we decided it was time to go home, but we were afraid to leave the same way we had come because we would have had to walk past the area where we had heard the scream at first. We decided to walk up another level and skirt the cliffs around the back of the lake but when we make up to the steppe above us we ran right into whatever it was making the sound, I was in front and had a Maglite, the beam hit the midsection of the creature and I stopped dead in my tracks. I observed a seven to eight foot tall creature standing not more than 10 feet away from me as I shined the light up I seen red eyes. I have hunted all sorts of animals and I have never seen one with red eyes that seemed to glow in the light. I back stepped and almost knock over everyone behind me and the creature ran up an embankment and we all ran back to the fire and sat back to back until we decided to go ahead and go back to the road and make our way to the car. We made it to the raod and started walking the 2 miles to the car all the while listening to the 2 creatures yelling and screaming one was behind us and the other was on our right flank pacing us from about 10 to 15 yards. Earlier in the day we had passed a huge pile of old tires someone had dumped, But when we got to that point of the road about 30 of the tires were thrown out into the road like someone or something didn't want us to leave. When we made it to the car we  all piled in and left as fast as the car would go. We never discussed it with anyone or even among ourselves because we were afraid of ridicule and people thinking we were crazy.",
  "classification": "Class A",
  "county": "Lawrence",
  "state": "Ohio",
  "location": "-82.71107,38.60551",
  "location_details": ""
}