{
  "reportId": "1186",
  "title": "",
  "date": "",
  "observed": "(#1) Mrs. Huntington reported (after her own sighting - #3 - the following day) that her daughters have seen the animal three or four times. The first sighting consisted of four youngsters on bicycles seeing it.  The three Huntington children (Lois Huntington, 13; George Huntington Jr., 10; Scott Huntington, 8) and their friend (Tammy Sairo, 12) were riding along the road about a half-mile from the Huntington home.  They matter-of-factly reported an encounter with a chimp. Mrs. Huntington would later tell reporters: \"My 13-year-old daughter fell off her bike about three feet from him and all he did was cock his head and look at her.\"  It was described as upright and chimpanzee-like. The quiet, intelligent, reserved Lois reportedly told the Maine Sunday Telegram: \"I fell right down in front of him and all he did was look at me.  I would have known if it were a hippie or something.  But it had a regular monkey face.  You have seen a monkey before, haven't you?\" (#2) A gorilla-like animal standing on its hind legs was observed two or three times by a James Washburn.  Officers searching the area found moose and deer tracks. (Note by LC - Finding moose tracks anywhere in Maine is not unusual.) (#3) Mrs. George (Meota) Huntington, 33, of Lisbon Falls Road, Durham was driving home from a baseball game when she saw the \"ape\" peeking out from the bushes on the Durham Road. It was twenty feet away, and made a \"mad dash\" on two legs into the heavily wooded area.  The exact description of the \"ape\" was that it was a little over five feet tall, with a shaggy, black coat, and weighing about 350 pounds. She says it had a \"monkey face.\" \"Chimp-like\" was another way it was described. She coasted her vehicle so as not to scare it, but when it apparently saw her vehicle, then it ran into the woods. She reportedly saw it two separate times during this incident, as she returned with neighbors and sighted it again. She stayed in her car, as others searched the woods.  She was sitting in her car, when she saw it again, peering at her from the crotch of a tree. Soon after police were notified, the following arrived to begin a search - Androscoggin Sheriff's Department (a number of deputies), Cumberland County Sheriff's Department, the Maine State Police, and State of Maine Game Wardens.  Altogether, over thirty officers in thirty police cars searched for the animal for two hours. (A helicopter was used in a search in the following days.) Tracks found near a cemetery and not directly associated with the sighting looked human but had claws - they appeared to be of a bear.  At first, that night, some officers brushed off the whole incident as a bear sighting.  This would change. Huntington commented: \"They make it out to a monster.  I never said it was a monster.\" (#4) By Friday, 27 July 1973, several more (unidentifed) witnesses had come forth saying they had seen \"it\".  At 7:30 PM, Peter and Jean Merrill found a footprint behind the Jones Cemetery, the scene of most of the sightings. They said it looked like a chimpanzee print. Androscoggin County Deputy Sheriff Blaine Footman (sic) examined the series of prints, and cast what was described as one which was \"rather deep.\"  Footman said it was about five inches wide with \"the thumb part broken off.  Whatever made it weighs 300 or 350 pounds and I can't tell you much more.  It's definitely not a bear track.  I don't know what's going on here and I'd rather not express an opinion.\" (Reports of a gorilla suit not returned since March to a Portland area costume shop were mentioned in the press, but did not seem to be considered too related to these incidents by the central Maine authorities. By Saturday, 28 July 1973, after many more phone calls from others confirming they had seen an unusual animal in the area, police were taking the sightings very seriously.) (High level of reliability, according to Brent Raynes and David Downs who interviewed witnesses and investigated the case in 1973.)",
  "classification": "Class A",
  "county": "Cumberland",
  "state": "Maine",
  "location_details": "(#1) Shiloh-Lisbon Falls Road area, in Brunswick, Maine; half-mile from the Huntington home, in Durham, Maine.  (#2) near Durham Road, in the Jones Cemetery, Durham, Maine.  (#3) River Road, near the Jones Cemetery, at the Durham-Brunswick, Maine line.  (#4) \"behind the Jones Cemetery.\" at the Durham-Brunswick, Maine line. "
}