{
  "reportId": "45266",
  "title": "",
  "date": "",
  "observed": "Hello, this might take a moment didn't know how to contact the BFRO. I'm a Native American from Mille Lacs Band of Ojibwe in MN. I currently reside in Pennsylvania in a town name Birdsboro. I recently had weird noises and seen odd things in the woods where I go for spiritual guidance. I seen big rocks placed in a crescent moon shape and found strange scat that had fur and what kinda looked like a cat tail reed top digested in it. Then found a huge tree trunk or broken tree that looks to be placed in the gut of two trees like a football goal post. Just recently, May 29th 2014, I was with a close friend we was in this same location looking for feathers that were molted by eagles. I have a federally recognized tribal ID so am able to pick up those fallen molted feathers. But while we were looking for these it was close to sunset and was right next to a swamp then we hear \"a loud splash\" like there was a huge rock thrown in the water. We both looked at one another in shock cause we were the only two people in the woods then. I thought it coulda been a beaver cause beavers live in the swamp, but thought it was a beaver jumping in the water. Beavers don't make that loud cur-plunk splash we heard, then I thought maybe an eagle may have dropped a big fish in the water like a ,nope wasn't that cause 3mins after we heard the first splash we heard a 2nd splash the same area like 10-15ft away from us. The area is over grown and can barely make your way through in some areas. But heard the noise the 2nd time, we went to look closer didn't see or hear anything in that area but there was a path made through the thick weeds like something went through that area recently cause the tall thick weeds and brush was pushed through like a buffalo was walking through it. When we were leaving the area we heard chattering like someone was talking in the distance but no one was in the woods at the time we was. I have pictures of the log in the tree like a goal post and I can get pictures of the rock moon shape and if you read this I will give you the location thank you so much for taking the time to read my letter.",
  "classification": "Class B",
  "county": "Cecil",
  "state": "Maryland",
  "location_details": "I DO NOT WANT THE LOCATION listed as its a sacred area to Native people but I will show you what I have found and seen along with my friend."
}