{
  "reportId": "5875",
  "title": "",
  "date": "",
  "observed": "In the summer of 1986 or 87 I was doing a forest service project on Arlington road just west of Laramie Wyoming. We were working on the road that lead from the highway up to a lodge at the top of the Snowy Range mountains on the Medicine Bow National forest. I found a place about midway up the mountain to park the R.V. and to use as a work camp.  This particular time I had taken my son and nephew who I believe were 8 and 9 years old at that time or maybe 9 and 10, either way they were allowed to go off squirrel hunting with a .22 rifle while I worked on the project. I don't remember if I was working near the base or how they came to see me but they were both very excited and my son told me they had seen a bigfoot.  I have always been curious and my son was raised in the mountains and had been elk hunting with me since he was about 6 or 7.  He never was afraid of the dark, bears and anything else even at that early age.  He has never made up stories so I knew they had seen something out of the ordinary. Their story goes like this: They went out from the R.V. with the .22 hunting squirrels in the forest surrounding the camp. A short distance from the camp as they were coming back looking for squirrels they both saw this creature in a tree.  The tree was sort of in the open and had branches almost all the way to the ground.  On a thick branch only a few feet off the ground and not more than a few feet away from them was a hairy creature about their own size staring at them. The boys were a few feet apart and the creature kept moving his eyes from one to the other without moving its head.  It was holding on to a branch above with one arm and just watched the boys without moving long enough for the boys to ask one another what it was they were looking at and my son ask his nephew if he should shoot it.  All this time the creature just watched them and when they decided to leave and come and tell me the creature also jumped to the ground and ran way like a man runs ( which is how they put it). Still today both can give very detailed descriptions of the creature because they were so up close for quite a while. It was dark-almost black and with long shiny hair except for its hands and face.  It had a humanoid face and eyes. They have no aversion to talking about it especially to someone who will listen. Even today at ages 25 and 26 they still claim to the validity of what they experienced. The day they saw it and came to tell me about it they also took me to the tree where they saw it.  The ground was dry and hard and no tracks were visible. Respectfully, MM",
  "classification": "Class A",
  "county": "Carbon",
  "state": "Wyoming",
  "location_details": "Go west out of Laramie on I-80 to Arlington road. Follow the road south about halfway up the mountain. It was on the east side of the road."
}