{
  "reportId": "39578",
  "title": "Snowmobiler observes a large figure cross the trail behind him near Traverse City",
  "date": "2012-12-26",
  "observed": "Visual incident My wife and I rented a snowmobile for the day after Christmas 12/26/2012 from Roudolph Ranch near Traverse City MI.  Our first exploration on the trip were the trails from the ranch to Traverse City.  We traveled through some forest to a high wire clearing that we felt had too much rugged terrain to continue.  We came to the first road in the high wire clearing and decided to turn around.  I was driving and my wife was riding in the passenger's seat. After turning around I looked across two hills from which we had just come and noticed what appeared on first impression, to be a cross country skier, 200 yards away, coming down the second hill away from us. Immediately many things bothered me about this cross country skier.  First, it was male and it was extremely tall, maybe 8 to 9 feet in height.  (It was very male because of its wide shoulder to slim waste shape)  Second, he appeared to traverse the steep down hill slope like a down hill skier attacking the slope in parallel skier motions but in very long foot steps instead of sliding skies in downhill parallel motion. No skies were noticed.  Third, and most puzzling, was that the figure was dark, dirty rusty, red from top of head to bottom of foot except for the face which was jet black. Finally the figure appeared very unnatural in movement. The entire sighting lasted a total of maybe 5 seconds. As I drove back over the area where I saw the figure I looked intently for cross country ski tracks.  I found none.  We also did not come across a skier and the area at the bottom of the hill dumped into a very thick wooded area blocked by a barbed wire fence. At the time I thought about stopping and looking for foot prints but was afraid of asking my wife if she saw what I thought I had just seen so I moved on. Whatever I saw bothered me all day.  Later in the evening I asked my wife if she noticed the cross country skier which I had seen. She had not seen the skier.  When I walked her through the event and told her that I think I saw a Bigfoot she just laughed and continues to laugh at me today. The sighting has continued to bother me over a month later.  I'm convinced that what I saw was too tall, was not clothed naturally, and moved too unnaturally to be a human.",
  "classification": "Class B",
  "county": "Grand Traverse",
  "state": "Michigan",
  "location": "-85.44922,44.71466",
  "location_details": "I've described the location as best I can.  Follow snowmobile trail from Roudolph Ranch to Traverse City and turn around at first road crossing after entering highwire clearing."
}