{
  "reportId": "34260",
  "title": "",
  "date": "",
  "observed": "On March 3rd, 2012 something happened to me and a buddy that we can’t explain. I hadn't really thought about whether or not I believed in Bigfoot as a Biology student, but whatever this was made a believer of me. Basically, it scared the hell out of us. Me and Clay have grown up in the Norris Lake area.  We’re hunters, fishermen, backpackers, and general outdoorsmen and we’ve never encountered anything like this. Earlier that day we had decided to take my four wheeler up the lake approximately five miles from my house to a clearing and build a fire.  We got to the clearing around 9:30.  We kept hearing two owls hoot at each other from across the lake and we both kept hearing something moving in the tree line sixty yards from our fire.  We quickly dismissed the footsteps as being a deer and as the night progressed the wind started to blow really hard. At 11 pm the wind started to die down a little bit and I noticed that the woods were totally silent.  The owls had stopped hooting and the water wasn’t white capping anymore.  Around midnight we decided to leave and as we stood up we heard these sounds in the woods like sticks breaking.  We knew that if it were a deer we would have spooked it a long time ago.  I felt eyes on me and for some reason I had this random notion to make a wood knock.  I had seen the Finding Bigfoot show and thought maybe I can get a response out of whatever was in the woods.  I picked up a piece of cedar from the wood pile and knocked it against a cypress tree.  We waited for the echoes to clear and while I didn’t hear anything Clay stood straight up and started breathing heavy saying he heard a knock back.  I thought he was lying, but soon after became a believer.  I knocked again and this time I heard three distinctive knocks back.  There’s no way it could have been an echo because the reply came long after the echoes cleared.  I suddenly got scared- like shaking.  I knocked again and let out a “whooping” call.  We got one distinctive knock back and then we heard this growl… this horrible growl.  It was guttural and yet somehow primate like.  It was like a monkey whooping and a deep snarl at the same time—almost like whatever made it was using two sets of vocal chords. We started freaking out, but we really wanted to figure out what it was, so we jumped on my four wheeler and rode towards the sound.  We stopped periodically, but never heard anything.  What was strange was that we both felt strongly like something was watching us.   I mean that feeling alone was terrifying because it just felt like pure hatred.  We ended up riding back to my house without actually seeing the creature, but whatever it was- it was angry that we were there and it absolutely hated us.  True story- no joke whatsoever.",
  "classification": "Class B",
  "county": "Anderson",
  "state": "Tennessee",
  "location_details": "The location was where Mill Creek enters Norris Lake.  There is a rock outcropping and a swampy area."
}