{
  "reportId": "35437",
  "title": "Family reports possible vocalizations and unexplained activity near Mecosta",
  "date": "2012-05-14",
  "observed": "About 2 years ago, sometime during warm weather, my husband and I were sleeping with our window open.  It was very early morning, and my husband was startled awake by a very high pitched screaming sound.  I was awakened just a few moments later by the same sound.  It sounded like a terrified woman, or a child's high pitch scream.  My husband was very scared, as he thought it was our 3 year old daughter that had climb out of her window and was walking on the dark road.  He ran downstairs to check on her and found her and our 2 year old son asleep in their rooms.  While he was checking on them, I heard the scream again.  My husband and I had never heard that sound before.  It gave us chills.  The next day, curiosity got a hold of me.  I started searching online for that sound, and came across supposed Bigfoot screams.  It sounded the exact same.  We even looked up screech owl noises, and many of the other noises that people have said this scream is.  Although the noises came close, nothing matched exactly, except the supposed Bigfoot screams.  That was the last we heard of those noises until recently.  The current situation is actually happening at my dad's house, which is about 2 miles if you take the road, and maybe 1-1.5 miles straight shot, from our house.  He moved to that house about 3 months ago.  A few weeks or so after he moved into the house, he told me one morning that he heard this screaming sound the night before that he had never heard before, and that it gave him chills.  I jokingly said that it was Bigfoot.  Well, one day I was watching Finding Big Foot at my dad's house, and he heard the sound that the cast had heard in the woods, and MM said was a Bigfoot.  He came into the room and said, \"that's the sound I heard, what was that?\"  -He did not know the name or content of the show I was watching.  My dad has said that a few times since, he has heard that same sound.  He also said that his dog, who is a lab mix, usually starts growling and the hackles on his back stand up, when there are animals, such as deer, in the backyard or in the woods across the river.  However, he said there are times when the dog acts like he hears something in those areas, and will run back into the house and hide.  There has also been one time, about 12:30 at night, my husband was letting our dogs outside, and he came into the house, at little scared, and said that he had heard that sound again.  The next morning, my dad told us that he heard the scream again, about 12:30 at night, and we told him that we had heard it too.  The latest \"event\" and the reason that I reached out to MM, was because my dad had our kids over at his house on Monday (5/14) evening.  Earlier that day, he had taken a few panoramic pictures of his backyard as he was playing with his dog.  My kids went over to his house around 7pm.  He had them outside most of the evening, in and out, and then they ate dinner.  Sometime around 9pm, my dad noticed a very large limb sticking straight out of the ground on the bank of the river. He looked back at the picture he took earlier and the stick was not there. The stick is probably around 9'-10' tall.  It was in the ground approximately 9\".  I have attached two pictures showing this.  I am in the picture, and I am about 5'6\".   My husband got to my dad's house about 15 minutes after my dad noticed the stick.  He started walking down to the stick, and had a very uneasy feeling, and only made it half way between the house and the river, when he heard a rustling sound in the woods across the river. That was when he turned around and walked back to the house.  I got to the house about 15 minutes after that, and my husband and I walked down the the stick to look for footprints and found nothing.  My husband mentioned that he did not have the uneasy feeling that time.  We looked around and tried to see if maybe the limb had fallen from the tree, and while this is a possibility, I feel it is very unlikely.  The conditions would have had to be perfect for this to happen.  My dad said the next morning, that he thinks that the limb probably fell from the tree, but I'm not convinced.",
  "classification": "Class B",
  "county": "Mecosta",
  "state": "Michigan",
  "location": "-85.293,43.577",
  "location_details": "(Removed)"
}