{
  "reportId": "4972",
  "title": "Vocalizations heard by fisherman on Twin Creek",
  "date": "1978-09-01",
  "observed": "Looking at your website and specifically the Ohio incidents brought back into mind a lot of strange things that happened in our area while growing up. There were some footprints, but I am sure they were made by a guy from  a neigboring farm. There had been a lot of talk previous to this about strange things going on in the area. they included several cattle found dead in fields and their carcasses had been heavily scavenged, but there were no known large predators or dog packs in the area. No bears had been seen in this area since the early 1900's. There was some unexplained property damage to unattended buildings and barns, yet no property was taken. Also there were accounts similar to what i saw on your website reports, such as high-pitched whistles and unusual growling sounds. I myself had an unnerving experience while fishing on Twin Creek near Gratis Ohio, about 10 miles east of germantown. My dog was with me and I noticed that he was acting \"funny\", meaning that he did little or no exploring and roaming around the area I was in, as he was accustomed to doing. I thought maybe some other people were fishing nearby, because he kept looking across the creek into a heavily wooded bottoms area at the base of a 90 ft. cliff. Occasionally he would snort or growl a bit. It was approaching dark and we started home, about 1 1/2 miles through woods and a small cornfield. It was getting darker and my imagination started making me nervous, especially since the dog kept looking back in the direction we had come. Being only fifteen did not help matters either. When the trail approached a thick stand of cedar trees, the dog suddenly stopped and growled, trailing off into a whimper, and backed away. I froze, but could see or hear nothing then, from witin the cedars I heard a few twigs snap, not a loud heavy sound, but that was enough. I took off running around the cedar grove, looking back constantly for about 3/4 of a mile until I reached the cornfield behind our house. The dog stayed right with me the whole way. Never saw anything, but I don't know. That recollection never ceases to remind me how scared I was. Anyway, I don't know if this helps, I thought you might be interested. If you have any sighting info from that area of Ohio, let me know. P.S. Also, about four years before this incident, One of our neighbors who was home alone with her kids called and told my Dad that there was a lot of snarling and strange noises behind her house. This was about 11 PM and my father went over with a shotgun and found nothing, but did hear a lot of rustling off in the woods. The police were called but also found nothing.",
  "classification": "Class B",
  "county": "Preble",
  "state": "Ohio",
  "location": "-84.48506,39.64146",
  "location_details": "Near Germantown Ohio, in the area of Preble Co. Line Rd., Kiefer Rd., Twin creek/Lower Gratis Rd. area, in the mid 70's"
}