{
  "reportId": "38339",
  "title": "Possible nighttime activity at a rural home near Rayville",
  "date": "2012-11-15",
  "observed": "First off I would like to say that I am not one to normally see much of anything, I am a believer in the possibility of many things but rarely see them.  In this instance, again I didn't so much see anything as hear it. The first incident took place in the middle of November of 2012.  It was in a rural area of Missouri outside the city of Rayville.  The area is a mix of farm and woodland.  It was approximately 9pm when I drove to a friend's house.  As I was walking from my car to his door I noticed what sounded like someone or something big walking about 30 or 40 yards away from me in the woods. It was just beyond the range of what I could see into the woods. When I stopped walking it stopped walking and when I started to walk it began again.  It was only about a 40 foot walk to the door and I walked slowly as I tried to figure this out.  About half way I stopped to think and it stopped once more.  From what I heard it was a sound of only 2 feet walking and was large.  It didn't sound at all like a 4 foot creature like a deer.  I went in to tell my friend but when we came out there was no sound.  About a week later I came out again and was walking to the door and jokingly called out \"are you there bigfoot?\" and laughed to myself. As I approached the door something flew out of the woods and hit my friends car.  Later in the evening when I left, in the distance I heard dogs going crazy and the sound of something large screaming.  It has been several weeks since I last heard anything but my friend says he too has heard the sound of something walking in the woods.  I have thought about if it was a person possibly playing a joke but no one knew I was going there.  Thought about it being another animal but it sounded too big to be a deer.  It has me extremely curious so I would love some feedback and your thoughts.  As I say I am not one quick to jump to conclusions and tend to be the first to look for other causes to things.",
  "classification": "Class B",
  "county": "Ray",
  "state": "Missouri",
  "location": "-94.2908,39.20894",
  "location_details": "This happened near Rayville, Mo.  From the town of Richmond MO go west on MO 10 for about 4.5 miles and then turn down Rayville RD (RR C) for about around 6 miles till you get to Orr road.  This is a gravel road.  Follow it till you reach 144th street where my friend's house is and where I heard what I heard."
}