{
  "reportId": "22600",
  "title": "",
  "date": "",
  "observed": "Location: Taney County – 3 miles north of Forsyth – under-developed area comprising multiple 10-acre lots, heavily forested, served by a dirt/gravel road. Date: Late summer (July/August) 1998 Time: 8:30-ish pm My wife and I were living in a small \"park\" trailer (8’x30’) on our 10-acre lot just north of Forsyth, Missouri. The area is isolated, almost entirely undeveloped, and composed of heavily forested 10-acre lots. Access to the area was at that time a rather narrow dirt/gravel road which was barely able to handle two-way traffic. The area supports a variety of wildlife including possum, raccoons, bobcats, foxes, coyotes, and a large deer population. Black bears, small and scraggly, are relatively rare, but are reportedly making a comeback in the area and appear to be moving from Arkansas to the south. Both my wife and I had been to work very early in the day, and were quite tired. We were lying in our bedroom at the western end of the trailer with the windows open, reading before turning in for the night. We had small reading lamps turned on; there was still some light outside, but the sun had just dropped below the horizon/trees. We suddenly heard a long, drawn-out scream that was very reminiscent of a woman in fear or pain. Our two dogs began barking fiercely and jumping against their compound fence behind our trailer. The long cry was repeated, this time with an upward shift in tone toward the end, and I was reminded of the call of a peacock. I asked my wife what she thought it was, and did it sound like a peacock. She used to work at an amusement park where peacocks roamed freely, and she said that it was most definitely not a peacock call. When the scream sounded a third time both of us immediately came to the conclusion that someone was in trouble, and we headed for the door. I carried a big, multi-cell flashlight and went out the front door (facing south), while my wife stayed by the door, telephone in hand, prepared to dial 9-1-1 should the need arise. The only clearing that we had done on the entire property was the long driveway back to our trailer site, the actual clearing needed for the trailer itself, and the small amount of additional land clearing that was required for a well house (and access by the well-drillers for their large trucks). I moved westward, perhaps 100 feet, to the far side of the driveway clearing. There are no street lights in the area and with the sun already below the horizon darkness was falling rapidly. I shone the beam of the flashlight across the forested area from which the scream had come, sweeping it slowly left and right. There was a shuffling noise about 50 feet further west amidst a stand of several large cedars and oak trees. I swung the light to the spot where the sound seemed to originate and a dark shape moved behind the biggest of the trees. At the extreme range of the light beam I was alarmed to see two red/orange reflected eyes looking directly at me. No other details were apparent except for generic dark shadow. The two eyes were at a point well above the expected face height for a normal adult human. They blinked once or twice, then vanished as if the owner either closed them fully or turned away. It was growing darker by the second and the only clearly visible area was the cleared driveway and the partially cleared walk to the trailer. All else was in deep shadow. The shuffling noise came again, and a vague shadow moved quickly toward the southwest from behind the trees where I had seen the eyes. I attempted to use the flashlight to see the owner of the eyes, but could only see a tall shadow. It moved at a run, upright, and I initially thought it must be a tall, heavy-set man. I was still thinking that the screams had come from a female and that this must be her attacker. However, there was no one else in the area at the time. The 10-acre lots to the east and west of ours were unoccupied and completely undeveloped. While there is one house to the south, across the access road, it is set back from the road and was dark; the occupants were not home at the time. There were no further calls, screams, or noises in the forest, and our dogs ceased jumping against the fence, but continued to bark and wine in an agitated manner for another 10-15 minutes. I returned to the house and reported what I’d seen to my wife. Without additional information we decided that a call to 9-1-1 was not advisable. Within a week we were attending a gathering of the Ozark Mountain Indian Heritage Association (OMIHA) and recounted the incident to several of the men in the group. More than one described having experienced similar encounters with such an \"animal,\" and one man in particular mentioned that he had actually attempted to give chase with his hunting dogs. The dogs got fairly close to where he suspected the \"animal\" was hiding but then returned to him, tails tucked and whining, refusing to pursue it further. He, too, noted that the eyes reflected red/orange in a flashlight. After that I made it a habit to have a fully loaded Marlin 30-30 by the bedside, but the incident was never repeated; we have not seen or heard anything similar since the original incident. The area is now more populated, all the lots having been sold/occupied, and several of the neighbors have free-roaming dogs. The deer and coyote population is either greatly reduced or they have gone elsewhere to avoid the neighbors’ dogs. We still have possum and raccoons, but they, too, are far less frequent to the area. Note: The air was still; no wind. I did not detect any unusual scents, although there was obviously enough for our two dogs to detect as they were highly agitated.",
  "classification": "Class B",
  "county": "Taney",
  "state": "Missouri",
  "location_details": ""
}