{
  "reportId": "20457",
  "title": "Nighttime sighting by Air Force personnel near Seney National Wildlife Refuge",
  "date": "1977-01-01",
  "observed": "When I was stationed in the U.P.of Michigan's K.I Sawyer air force base,I travelled sometimes to see my family in the Detroit area.This was 1977-1978.A friend and I were driving on M-28,east of Munising.They may call it the Seney Stretch area.This was after an afternoon shift,so leaving the Marquette area at midnight or so would put us in the sighting area at around 1:30 am.This was winter time and quite cold.as we were driving,we both were looking down the road straight ahead.A mile or so up the road was a slight knoll or small hill and we could see the glow of headlamps from the other side highlighting the top of the knoll.Between us and the headlamp glow,we observed what we first thought was a bear crossing the road.It was at least 1/2 a mile up the road,but the headlamp glow from the other side of the hill outlined this thing quite clearly.It walked sort of hunched over until it reached the center of the road and then it stood upright and we could make out broad,manlike shoulders and arms.Bear shoulders are tapered downwards.These were broad.It then shlouched over a little and crossed the road.We just looked at each other with our jaws open.We slowed down near the area.It was cold,there were no houses or lights in the area and there was no reason for a man to be in this area in that weather at that time of night with not a house in sight.I don't remember if there was a bright moon or not,but we looked for tracks.We didn't look for long due th the temprature and the unknown in the middle of nowhere. I have mentioned this to people over the years and always wondered what it was that I saw.I never thought there may be interest in this subject in that area.",
  "classification": "Class A",
  "county": "Schoolcraft",
  "state": "Michigan",
  "location": "-85.95865,46.34575",
  "location_details": "Not sure of the county.Michigan's U.P. M-28 east of Munising."
}