{
  "reportId": "1245",
  "title": "",
  "date": "",
  "observed": "Both father and son, had gone out on a hunting expedition. My Grandfather was an avid hunter back in the Ukraine (AUSTRIA-HUNGARY) and at times would go hunting for food for several people of the town. He and his son had left long before sunrise to get to the woods some 10 miles outside of town. However a snowing during the night had acurred and slowed them down.  They had reached the woods and for 5 hours had not seen so much as a chipmunk. So they started back for town disappointed. Apon leaving the woods there was an open field with a few fallen trees here and there left by lumber cutters.  My grandfather had soon recalled that he left back his canteen and ran back for it.  In the meantime my grandfather had leaned on a tree and began to light his pipe when the fallen tree had begun to rock. He quickly jumped of of it and looked. For a second he saw nothing but then from the other side of the tree at the far end, about 15 feet away, stood up a \"large hairy man that had no clothing on\". About 7 feet tall with hair thay was black with grey in it as well. the face was black as coal and looked just like a mans witha  small mouth.His hands were huge and his was \"very large\". The being was looking at the tree like he had lost something under it. GGrand dad was shocked and dropped his pipe on the log. This got the \"mans\" attention and he just looked at his. My GGrand dad had bent down and picked up the pipe. \"He\" seemed curious so in broken english GGrand dad offered it to him holding it out, still scared because of the hieght and look of  \"him\". It looked at the pipe then to the tree and let out a cry \"that sounded so horrid that only the devil could make\". My GGrand dad panicked and screamed out in Ukrainian. He then bolted for his gun that was now on the ground in the snow. The creature started to walk fast towards another end of the woods. the 15 year old had got there and asked what was wrong. GGrand dad was gibbering in Ukrainian and pointed. they looked to see \"him\" practically at the edge of the wood. then another one came out of the wood, slightly smaller with hair \"the color of a brick\". they both looked back and walked at the edge of the woods for a few minutes before they emrged into it. They went home and spoke nothing about it except to each other. But for weeks they both had nightmare of it. 2 months later, still scared they moved away. Soon the story was released to the family and My grandfather told it to be and my brothers every so often. Never did the story change and my grandfather would never tell us such a fansticiful story to scare us unless it truely happen. When he did tell us his hair would stand on end and his hand and knee would shake. Niether would tell outsiders this story for fear of ridicule. It was always of thier opinion that \"he\" was looking for a mouse that ran under the log, being there was tiny tracks long with huge tracks of the beings. \"I must have made it loose its prey and that is why it yelled out.They never measured the tracks because of fear and no ruler (who takes a ruler hunting) but they said that the tracks were huge, bigger than my GGrand dads feet size 10 1/2.Originally they thought of it in fear but later on in life they felt sorry for disturbing it. \"if I ever did see it again, not that I want to, I would give it the food that it lost. I don't think it would hurt me. If it wanted to hurt me, it would have.\" This story to the best of my knowledge is true. Make of it as you wish. (Consiquently, for those interested, the canteen was never found. They never went hunting again after that time and after moving my GGrand dad became a butcher.)",
  "classification": "Class B",
  "county": "Sweetwater",
  "state": "Wyoming",
  "location_details": "Southern central Sweetwater county, some 10-15 miles south west of Rock Springs."
}