{
  "reportId": "41602",
  "title": "",
  "date": "",
  "observed": "Since my sighting up on Pilchuck on August 15th I had been telling people about it, especially my group of church friends. We had been talking about going up since the snow melted and we could get back up to the site. Anyway Friday July 5th we finally got the chance to go up. There was \"J.H,\" \"J. McK\", \"C.C. Jr\", \"G.C.\", \"J. Mc\", and myself, \"R.S\". \"J\" brought his Night Vision Goggles. None of them had a vehicle that could actually get to the site as I had before so we parked off the main  road and decided to hike up the road and see how far we could get. So we eventually got to about a quarter up the road and my legs started hurting, I am a bit over weight so I had to stop and rest because the group was so excited and intrigued by what we may find/ see that they wanted to get to where I saw my huge sighting last summer. So after being stopped for about 5 minutes I suggested to \"J\", who had brought a wooden broom handle, to do 6 tree knocks because there were 6 of us there. So we waited silently for about 2-3 minutes and we got a low sound of one knock from what sounded like 20 or so feet off the right hand side of the road, if we would not have been quiet we would have missed it. Then we all turned to focus on that side of the road and saw 2 sets of eye shine, one a silver bluish color and the other orange. The orange one's eyes where almost on top of each other as if it was leaning up against the tree or something or turned its head in a question like manner. Then the group decided I should try to call out to them so I decided to try some whoops. I turned my back toward them just in case they could actually see me so I could make it sound as if it came from the opposite side of the road and let out a series of about 6-8 whoops each last about 5-10 seconds in length of variant volumes then ended with a loud one that lasted about 8 seconds. After about 15 seconds or so we heard a low grumble type sound, not quite a growl but very guttural. Then a short (about 4-6 second) low whoop. By now it was about 30 minutes of us staying at this site and \"J\" and I started to get very scared of something on the road ahead of us not sure how far up the road. Eventually we started to see a very bright pair of the silver bluish eye shine up in the trees moving around, we though it was a young one. All this time the 2 off to the right side of the road were still there. There is a shallow slope on that side of the road that was some where between 3-4 feet to the height of the road then they came to about our eye height so I am guessing that they were somewhere between 7 and 8 feet tall. After 45 minutes we decided to turn back to the quarry/ gravel pit. When we were almost there we heard a low moaning sound that they do, come from the left side of the road which in this area is a hill and goes up from the road about 15- 20 feet. So we stopped and they asked me to try to imitate that sound. I tried my best but it sounded to much like a moo. Anyway I then asked \"J\" to do another round of tree knocks. No response this time so we carried on back to the quarry area. I then heard some rustling in the grass from within this open area, I asked for the NVGs and as I searched the area I saw one walking in the grass. Once it noticed that we had seen it it hunkered down and moved back into the grass. I passed the NVGs to \"J\" who had been the most skeptical about the whole thing and wanted to see what I was seeing. Eventually it got passed around so everyone could see it. \"J\" wanted to push forward and surround it and possibly catch it. I opposed that idea but said lets move in slowly so we could hopefully get a better view of it in the NVGs so we got some where around 10-7 feet from it before we had a rock thrown off to the side of us, I asked for the goggles and when I saw it, it was giving the motion that it wanted us to back off. So we slowly made our way back to the car. The one we saw in the quarry area was about 6-7 feet.",
  "classification": "Class B",
  "county": "Snohomish",
  "state": "Washington",
  "location_details": "Mountain Loop Highway, east of Granite Falls, WA."
}