{
  "reportId": "24393",
  "title": "Man remembers a late night \"camp-circling\" along with several other young Marines outside of Albany",
  "date": "1977-07-30",
  "observed": "Sometime in the summer of 1977, (it was a long time ago and I do not remember the month or date), We were camped in the woods by a creek outside of Albany Ga. at a place we called \"Skeeter Beach\". I want to submit this report because reading BFRO report #18707 reminded me of the incedent, and may have been in the same area, \"Kinchafoochee Creek\". I do not remember the highway number, but it was maybe ten miles out of the town of Albany Ga. Several of us young Marines were stationed at the Base at Albany attending an electronics school at the time. On the weekends, we would sometimes go out to this remote spot in the pine forest/swamp area outside of town. The highway crossed a clear water creek and there was a popular party area off the highway by this bridge where you could park the vehicles and then walk farther back to this area we called Skeeter Beach. We had made a dam and hand dredged the sand and gravel in one particularly nice area of the creek and had made ourselves a very nice little swimming hole. On the night of the incedent, myself and two other Marines had elected to stay the night, as it was already late and we had a nice camp fire going. we finally laid down on blankets and sleeping bags to go to sleep. In the middle of the night one of the other guys woke me up because he heard something big in the woods. I rubbed the sleep out of my eyes and sat up to listen. The third guy also woke up from hearing us talk and we all could hear something very large circling our little camp on the other side of the creek. A feeling of dread overcame us about the size of this thing we heard and we started piling wood on what was left of our fire. As the fire got bigger and bigger and started putting out more light, the animal began backing off from the camp so as to stay just out of the fire light. Whatever it was, it was big! We could hear it walking in a steady crunch-crunch that sounded to me like it was walking on two feet. I am a deer hunter,(bow and arrow), and I know how to vary my steps in the woods so I don't sound like a human. This thing had a steady gait that sounded like a man walking, but much larger. We could hear the muffled breaks of large sticks burried under the forest mat. This was no deer and I don't think it was a bear unless it was walking on two legs. As we got the fire roaring with flames licking about ten feet in the air, the thing finally moved out over the next ridge across the creek so as not to be seen. It was uncanny how the thing was intelegent enough to stay just outside the firelight. It was also uncanny how this thing turned three young Marines into a bunch of fraidy cats about to pee our pants! We never noticed any smell, but the slight breeze was at our backs making the animal downwind from us. We kept the fire pretty big the rest of the night and did not even try to sleep again. At first light, we took the biggest brands out of the fire to use as tourches, put out the fire and walked back along the trails to where our vehicles were parked. When we went back after that night, we always left before dusk and never again attempted to stay the night ",
  "classification": "Class B",
  "county": "Dougherty",
  "state": "Georgia",
  "location": "-84.02254,31.30062",
  "location_details": "Unknown, but I think it was to the North-East of town."
}