{
  "reportId": "6186",
  "title": "",
  "date": "",
  "observed": "First I want it to be clear that I am very skeptical that what I witnessed was anything out of the ordinary. I say this for reasons I will explain in a moment. Nonetheless, I am reporting this incident because even though I am skeptical, it remains possible that I did observe something extraordinary and if that is so then perhaps others did or will. So I offer this report as a possible sighting and to hopefully corroborate any other reports that you may receive involving the same area. Any such additional reports would of course then lend more credence to mine. Also I would like to indicate that I firmly believe in the existence of sasquatch and have had an ardent interest in this mystery since I was around 12. My interest was reinvigorated a year or so ago when I found the BFRO website. I  grew up in the northwest portion of New Jersey, which is an area of predominately deciduous forest with sporadic coniferous areas as well. There are open pastures as well as rugged mountainous terrain there.   An example   being the Kittatinny Ridge that runs through Sussex County and contains a portion of the Appalachian Trail. So while I don't believe this area offers the optimal environmental characteristics to sustain or attract a constant sasquatch population, I do think (as with many other species) that a transient sasquatch may very well wander into this area periodically (from areas west or north) and perhaps remain for an extended period of time. I think the reports of sightings from this area over the last 30 years or so pretty much indicate this type of pattern. So ever since my renewed interest began, I have made a point of being much more observant of my surroundings especially when driving through those types of areas I mentioned above. I should also note that I am in law enforcement and I have a keen interest in most matters of science. I accept the need for a scientific approach to investigating this and other type of phenomena and that belief is what has instilled part of the skepticism of my \"sighting\". That and the fact that my incident provides minimal information from an investigatory stand point. Also, while I indicated earlier that I felt the terrain and environment of this area could offer refuge to a transient creature, the amount of development and activity, especially where my incident occurred says otherwise. But with that said, here's what I saw. On this day I was really attempting to look beyond the road edge and peer into the woods or fields as I drove past. There is a small creek (Burnt Meadow Brook)that runs perpendicular from the roadway into that area. As I looked back about 200-250 yards or so I observed what seemed to be a human like shape standing and appearing to be looking down either at the ground or into the water (I couldn't tell from my vantage point). It was dark brown to black in color and for the short 4-5 seconds I observed it there was no apparent movement. My best guess would be that it was between six and seven feet in height. My perception was that this \"thing\" was facing opposite of my direction of travel and that I was viewing its right side. The distance was too great to observe any fine detail or to even determine if it wasn't just an old tree trunk.  However, upon passing that location on subsequent days, it was no longer present. It's possible that it was a person, but I am pretty confident it was not based on the appearance and the relative inaccessibility of the location. Due to the distance, I was basically looking at a silhouette and thus unable to note any specific anatomical features. I questioned the probability of a sasquatch venturing into this particular area considering it was during daylight hours and the location is right off a major interstate and this occurred during the peak of the morning rush. Also, the area I described is on the south side of the highway, perhaps 300-400 yards from the edge of a large commercial/retail/residential area. I should note however, that the area on the opposite (north) side of the road is predominately woods and is basically the southern edge of Green Pond Mountain which, being sparsely inhabited and heavily wooded, could offer a person or animal the ability to travel northward and westward for miles unseen. This tract of forested, relatively undeveloped land extends continuously into Pennsylvania and New York State. So I guess my implication is that if this was an animal, it most likely approached from the north side.  I have since noticed that there is a drainage culvert (to accommodate the creek mentioned earlier) which appears to run under the highway connecting the north and south sides. I do not know the diameter of this culvert however.",
  "classification": "Class B",
  "county": "Morris",
  "state": "New Jersey",
  "location_details": "I was just past the point where the creek (Burnt Meadow Brook) discharges from the culvert under the roadway."
}