{
  "reportId": "9317",
  "title": "Driver on Alcan Highway has noon, road encounter near Alaska-Canada border",
  "date": "2004-06-18",
  "observed": "My daughter and I were traveling to Tok, Alaska, westbound approx. 30-45 minutes from US Customs at Alaskan/Canadian Boarder. We were towing a 27 ft. trailer and listening to music and enjoying the view. An object caught my eye standing in the treeline south of the eastbound lane. I saw something from the waist up reaching to a higher part of a white bark tree. I did a double take and slammed on the brakes and came to a complete stop. Whatever it was had its back to us and still was reaching up with its right arm. The animal was a beautiful blond/auburn coloration and appeared well groomed as I could see the waist and well developed shoulders that blended into the head. I didn't see a real neck. I made a mental note using the tree as a height measuring device. I reached for the camera and my daughter but when we left our truck the animal was gone. We returned to our truck and continued driving until we pulled into the rest stop mentioned above. I took a tape measure from the tool box and measured a similar looking white bark tree using my mental notes....The animal I saw stood at better than 9 ft with an overhead reach greater than 12 ft.",
  "classification": "Class A",
  "county": "Southeast Fairbanks",
  "state": "Alaska",
  "location": "-141.5667,62.9375",
  "location_details": "We were traveling westbound when the animal was sighted, standing at treeline on slight rise south of eastbound lane of highway.  We continued travel westbound several miles and pulled into a rest stop on the south side of the highway. To fix a better location we were approx. 30-45 minutes west of Alaskan/Canadian Border, westbound and several miles after seeing animal, we stopped at a rest stop on the south side of the highway. Hope this helps. Also, for what it may be worth, several local natives were having lunch there and we shared what we saw with them. I believe one worked for the state road system as he was driving a state vehicle and another mentioned he was a state sponsored hunter for rogue bear. The hunter thought I had seen a grizzly, from the coloration, the height and the lack of a neck (he reasoned that the grizzly's hump, when viewed from behind could be mistakened for a head)."
}