{
  "reportId": "5267",
  "title": "Young teenager has two sightings less than two months apart in a ravine behind her home",
  "date": "1998-10-01",
  "observed": "Well, I've really been into this Bigfoot stuff ever since I saw a show about it on the Discovery Channel a few years ago. Not long ago, I asked some friends if they've ever seen ghosts, Bigfoot, or anything else unusual. To my surprise, my friend told me that she saw Bigfoot two times in her back woods. Now I didn't see this thing, I'm reporting it for her because she thinks everyone will think she's crazy if they find out she posted her story (I'm 14 years old and she's 17). I believe her because she's trustworthy and the way she described it just made me KNOW it was the truth. I've sort of \"researched\" these things a lot. I look on websites at pictures and stories and try to get a lot of info on these things. Anyway, she explained it to me like this: She has a lot of woods in her backyard that went all the way to the highway. About 20 to 30 yards from the back of her house a little cliff starts and then it goes down into a ravine. The first sighting was when she had to pick up after her three dogs (which weren't outside at this time) and throw the doo-doo away into the ravine. When she started heading down there she saw a very large six to seven foot tall animal on two legs. It had black fur and the hair was a bit longer on its head then the rest of the body. She told me that this thing looked JUST like the Bigfoot from the movie \"Harry and the Henderson's.\" When she saw it, it was walking away at a fast pace. She then obviously panicked and ran to her house and never looked back. The second sighting is a bit scarier. This took place a few months after the first one. After some time she regained the courage to go outside and enjoy her backyard again. But as she walked toward the woods she stopped dead in her tracks and sort of breathed in quickly because she was startled. Sitting/squatting on the edge of the little drop into the ravine was a brown-furred Bigfoot. She said it was holding or examining something in its hands at the time, but right after my friend breathed in, it turned around and saw her over his shoulder. My friend said that the way it looked at her with its big eyes made her almost go crazy in fright. After a few seconds, she said \"OH S**t\" and started slowly backing away. Then she fully turned around and sprinted home. Stopping close to her door, she looked back, but she didn't see it anymore. She knows what she saw and I believe her. Someday I will go over her house and check out the area and try to picture it in my head.",
  "classification": "Class A",
  "county": "Summit",
  "state": "Ohio",
  "location": "-81.62379,41.23638",
  "location_details": "South of State Route 303 and east of I-77."
}