{
  "reportId": "9642",
  "title": "Motorist has daylight sighting of two animals east of Waubee Lake.",
  "date": "2005-01-21",
  "observed": "On Friday, April 2, 2004, at about 5:00 PM my wife was returning by herself from a trip to drop off our daughter at a friend`s house west of Waubee Lake in Milford, Indiana. She was travelling east on County road 1100 North.  She approached the intersection with County road 300 East, which leads into Oswego, and came to a stop at the stop sign.  She looked left, right and briefly ahead.  Before beginning her turn she noticed movement directly ahead on road 1100 N.  She saw crossing the road from left to right,(heading south) approximately 250 feet ahead, two large, black, hair covered figures, taller than an average man walking on two legs at a hurried pace. Her first reaction was to say out loud \"what the heck was that?\".  The way they were walking very close together and hurrying suggested that they were aware they were exposed in the open and wanted to get back to cover quickly.  By the time she saw them they were in the middle of the road but she saw them take 5 to 7 steps over several seconds.  They were stooped forward and looking down and swinging their long arms quickly.  After this they entered the woods.  She said they were close enough to have scared her if they had looked her way.  Also, they were close enough to see they were not just men in black clothing as there were no divisions where shirt, pants and a hat would be; only solid black from head to toe. My wife, who is a college educated professional, then made her turn onto 300E thinking she would then have something interesting to tell me immediately upon arriving home.  When she reached home however, something else unusual happened. Instead of telling me, she apparently blocked out or repressed the experience from her memory, as if in denial.  I have been a Bigfoot enthusiast for many years and have read of this happening before to people seeing a Bigfoot.  It is like your mind refuses to believe what the eyes are telling it because it is so new, different and without a reference point. About 2 days later we were talking and I said something that brought it all back to her suddenly.  She then told me the whole experience in detail, showing signs of alarm and even imitating the way they walked. Of course I wasn`t about to believe her without asking questions.  After all I was the Biology major in college, I'm the outdoorsman and I'm the bigfoot enthusiast - I'm the one who should have seen them! I asked all the typical questions that the BFRO interviewers asked and she answered them all correctly, even adding additional detail. I asked if they might possibly be some young high school guys in all black Gothic clothes, as some of them like to wear. The answer was \"they were absolutely not men in black clothes\".  The thought also occurred to me that she was messing with me - playing a joke to mislead me, so I asked. This was the last straw; she got hurt and angry with me for not trusting her after 27 years of marriage, and I got the silent treatment for 2 days and had to do a lot of apologizing.  I'll have to just agree with her - based on the evidence, she saw 2 Bigfoots crossing the road.  Wish I had seen them! Hopefully, by learning as much as I can about this creature I will be able to remain calm enough to stay and observe it, if I ever see one, instead of freak out and run as most do.  Some may say \"your wife learned all this from listening to you go on and on about what you read on the internet.  Believe me, when she tells her story you can tell it was a very real experience for her; whether anyone believes her or not she knows what she saw, and will say so.",
  "classification": "Class A",
  "county": "Kosciusko",
  "state": "Indiana",
  "location": "-85.61,39.3579",
  "location_details": "300 feet east of the intersection of county roads 1100 north and 300 east. This is east of Waubee Lake in Milford, IN."
}