{
  "reportId": "42140",
  "title": "Hiker has daylight sighting in Goodenow Grove Nature Preserve",
  "date": "2009-10-10",
  "observed": "I decided to turn my sighting into BFRO. I will start by saying I was introduced to the BFRO by my brother. I read some of the sightings, listened to their sounds and what they thought it might be. I took it with a grain of salt. Then in 2002 while I was visiting my daughter who at the time lived in Georgia, we both heard what we thought was one. It was late and we had decided to set around a fire. It started with the dogs in the distance barking then more and more dogs joined in until we had to raise our voice to be heard. Then came this call that was so loud and the only way to describe it was a dinosaur movie because of the volume. It did it twice. we heard 4 gunshots then silence. A few minutes later we heard sirens headed in that direction. The call is close to what is called the siren call on BFRO. There were 4 gunshots. So, I don't know. I do know what I heard was so amazingly loud. Now fast forward a few years. One of my sons was visiting and had taken his 2 labs to the forest preserve on the edge of town for a run. When he came back he told me about a deer leg he saw. He said it looked like it had been ripped off the deer and not cut. It was fresh. He thought it was odd. I did too. Still I didn't go out to investigate. Fast forward a few more years. My same daughter who lived in Georgia had moved back up here and we had decided to go to the preserves for a walk. On the trail there was what looked like a footprint, bare footprint. It was about the size of a man’s size 12 shoe. At that time I wasn't into measuring anything. I did snap a picture. The following spring me and my same daughter went for a walk again in the same forest preserve and left the main trail and took a side trail to the creek to see if we could cross it. Before we reached the creek, birds started going crazy. When we got there we heard things hitting the ground on the other side of the creek and the birds were still going crazy. What I'm going to say doesn't make sense, at least to me it doesn't. Intense fear overcame me from out of nowhere. I had to fight the fear to keep from running. I didn't understand it. The creek was too high to cross so my daughter said let's go back. When we started walking away the fear went as fast as it had come. To this day I don't know if I caused it myself because of the noise from the birds and the things hitting the ground. I do know I didn't have that same type fear when I did see one. October 2009 Goodenow Grove Nature Preserve Fast forward a few more years. I and my family had gone to another forest preserve, [ Goodenow Grove Nature Preserve ], about 10 miles south of us. My son-in-law was leaving for boot camp, so we had a going away party for him and it was one of my grandchildren's birthday. They had trails, which I wanted to walk. I couldn't get anyone to go with me so I went by myself. It was fall and chilly, so there was only 1 other group out there, which was 4 people. I went down the main trail for a ways then turned off onto a side trail. It made a loop. About half way around the loop, I stopped and was looking down a small ravine. I heard what sounded like a twig snap. I stayed and was expecting a deer to come out from behind one of the bushes. Instead I heard a grunt. I'm standing there not believing what I had just heard, when I heard another grunt but louder. It sounded just like a gorilla. I turned and walked out of the loop and onto the main trail. I wasn't really frightened at the time, just a little nervous. I walked a short distance, I notice a path through the tall grasses. It was way too big for deer. I had gotten to know deer paths. These tall grasses were in front of the area I had come out of. They were about 4 and one half feet tall. I'm 5 foot. Well curiosity got me and I had to see where the path led. Sometimes I am too curious for my own good. I got to the end of the tall grasses and could see there was still a worn path but it was leading around a large bush. Now I am deciding if I want to go closer to see if the trail leads back into the trees. In order to do that it would put me closer to the trees. I took a few steps forward and still couldn't tell. I looked at my watch to see what time it was and if I had time. I had been out there for quite awhile. I then looked up to my left were the trail was going and back down to my watch. I was trying to talk myself into going closer and around that bush. I then looked up again and that is when I saw it. It was running just inside the tree line. It was brown, slender, about 6 feet tall the hair was about 2 inches long. It was a little stooped over while it was running and actually grabbed a small tree as though to propel itself. This was fall and a lot of leaves were off the trees. This and the fact that it was only about 40 feet away is why I could see it clearly. It made no sound when it ran and I can tell you it runs as fast as any other animal. It had Amazing speed. I stood there for a few seconds stunned then fear gripped me because the realization that it was running in the direction I was looking to go. I felt like I was being cut off at the pass. At that instant I turned and walked back through those tall grasses trying to look over them and telling myself don't run, don't run, if you don't want to be chased, it's okay it's not going to hurt you. Over and over I kept telling myself these things. I got to the main trail and walked out looking into the forest all the time. When I made it out, everyone was gone except my husband who was sitting there waiting for me. My heart sank. I wanted someone to go back with me. Even though it was scary, it was exciting too. My husband at that time could not walk much and I couldn't put him through that. I can tell you I was so upset that everyone was gone and of course nobody believed me.",
  "classification": "Class A",
  "county": "Will",
  "state": "Illinois",
  "location": "-87.60593,41.40762",
  "location_details": "Take 394 to Goodenow Road, if heading south take a left on Goodenow Road. Take to Dutton, there is a sign on the corner of Dutton for the preserve."
}