{
  "reportId": "29020",
  "title": "Couple describes incidents at two different campgrounds in Boise National Forest",
  "date": "2009-11-01",
  "observed": "Heard wood knocking. Heard a boulder hitting the ground. Seen something swaying and walking back and forth. At locations and descriptions below.",
  "classification": "Class B",
  "county": "Boise",
  "state": "Idaho",
  "location": "-115.8596,44.35978",
  "location_details": "Near Crouch Idaho(Valley County) about 20 or so miles up rd.# 698 is Boiling Springs Campground and a few hundred yards away is a forest service cabin and a creek right next to the campground. On November 1st 2009 around 8:00 p.m. we saw something between the trees between our sight and the rest rooms. It was walking back and forth in the clearing and swaying back and forth in the same spot when it stopped to better see us through the opening in the trees. Nothing occured to us except it maybe have been some one but we were the only campers for miles. The following year in October 30th 2010 around 10:00 p.m. at the same location we were getting spooked by the area for no reason and we actually packed up and left when again there were no other campers and we heard what sounded like a large boulder about 75-100 yards away hit the ground with a great thud. No boulder rolling or crashing down a hill but like it was thrown or dropped out of the air. No smells or sightings except a few possible 11 inch tracks in the dirt a month prior while hunting in that area. The other incident was quite interesting as well. Nearest city is Boise in Boise County going up rd. # 268 up past Arrow rock dam towards Atlanta. Willow Creek campground. It was aroung the end of August and about 2:00 a.m.. My wife and woke me and for about an hour off and on we heard what sounded like wood knocking in three different locations surrounding the campground. I explained to her what I thought it was and not to worry. It appeared that they were taking turns knocking 3-4 times a piece. Random order. Nothing else noted."
}