{
  "reportId": "7096",
  "title": "Bikers have daylight sighting near Marquette.",
  "date": "1996-07-14",
  "observed": "It was a summer day, 1996. Some friends and I were riding dirt bikes(motorcycles) on this old abandoned highway just south of the city of Marquette. The new highway (Co Rd 553) runs parallel with the old highway. We were headed north on the old 553, as we approached one of the many downed trees across the road, I noticed a movement out of the corner of my eye. The creature appeared to be croutched low to the ground. I believe it was either trying to hide from us, or was sitting watching traffic on the highway perhaps eating or something. As the creature turned it's head to see us, I realized this was something unusual and began braking.  It slowly stood, somewhat hunched, like it was trying to stay low to the ground, I instantly realized it was walking on two feet like a human. I started to get quite scared and excited. I've never seen anything like this before. It cautiously proceeded out into the middle of the roadway, stopped, stood facing me and stared at me for what seemed like 3 seconds, then looked over it's right shoulder at a 6-8ft. embankment next to the road. I believe it was planning it's escape route. Then turned and looked at me again, this time about 5 seconds. By this time I was shouting to my friends to look at the creature as they pulled up on their motorcycles. The creature had no real noticable features, it's body was completely fur/ hair covered,the fur was similar to that I've seen on a moose, very dull looking. It had longish arms and the legs weren't very long in comparison. It's body was like a gorillas, I could see a face, but the flesh was dark like the fur. All I could really make out were the eyes, They were almost aglow, of course this must be from the sunlight shining down since the sun was at our backs. The creature moving very slowly towards the embankment and then lunged up the bank with ease. I lost sight of it for a second, then watched it run through the trees with great speed and agility. It even lept over a down tree like a hurdler.",
  "classification": "Class A",
  "county": "Marquette",
  "state": "Michigan",
  "location": "-87.42407,46.47182",
  "location_details": "Take Co Rd. 553 south out of Marquette, about 5 miles south of the Ski Hill on the right hand side of the road, on old 553."
}