{
  "reportId": "7692",
  "title": "Possible brush nest, tracks, smell, noticed by DeMolay teens visiting rural home Dunellon",
  "date": "1979-10-01",
  "observed": "This incedent occurred when a DeMolay group I was a member of stayed overnight near Dunellon, Fla during my senior year in High School.  We were staying on a house on a dirt road belonging to one of the DeMolay brothers' parents.  My friend Ron and I were interested in photography, and we wanted to take some time exposure photos of stars away from city lights.  Somewhere around 10:00 or 100:00 pm. Ron, another friend Rick and I went down the dirt road until we were away from the 4 or 5 houses on the road, and took some time exposures on my tripod.  I noticed a light from a nearby house was still visible, so I moved about 30-50' further down the road; Ron and Rick stayed put.  As I put up the tripod, I noticed a foul stench coming from the woods nearby, on the opposite side of the road from the houses.  I asked Ron & Rick if they smelled anything, and they laughed, thinking I was playing a 'skunk ape' joke on them.  I said I was serious, so they moved towards me.  One said he smelled it, and then Ron said 'I don't hear any crickets chriping.'  I then became aware of the unusual silence.  Ron & Rich immediately turned and ran to the house; I grabbed my tripod & camera and followed.  We go to the house, and before going in agreed to not tell anyone, so they would not make fun of us.  The next morning, B4 breakfast, the 3 of us returned to the area.  We found the exact spot from where the trees blocked the house where the light I had moved to block came from, and there was no smell.  I pointed to an area where I thought the odour had originated, but we could see nothing from the road due to thick underbrush and small trees.  We walked up the road, found a way into the underbrush, and came back to the site.  Rick had stayed on the road to orient us back to the correct area, and when we found him throught the trees, the area directly where I had pointed to as the origin of the smell had a large [@4' x 5x] area of matted -down underbrush.  There was a hill going away from the road, and a small area for runoff between the road and the hill that was damp, and in that damp area, we found a large footprint @1\" deep and as I recall about 16-18\" long.  Ron, an offensive lineman weighing @275 lbs. barely left an impression next to it, so we knew what had left it was very heavy.  I had B&W film in my camera, left over from the stars shoot, and took a few photos of the footprint.  We planned to return after breakfast with colour film, but the group left B4 we were able to do that, and we had no choice but to leave with them.",
  "classification": "Class B",
  "county": "Marion",
  "state": "Florida",
  "location": "-82.58765,29.1299",
  "location_details": "I wish I could recall more."
}