{
  "reportId": "880",
  "title": "Rockhound startled to find he's being observed",
  "date": "1998-09-28",
  "observed": "The witness, a 32-year-old software engineer, was rock hounding on Forest Road 320 in Long Hollow (2 miles off Rampart Range Rd about 5 miles south of Devil's Head) in Douglas County, Colorado between 6 and 7 am when the incident occurred. \"I had been working site looking for rocks for about 45 min.  I was about 100 feet south from my car, which was out of sight around the outcrop. When I was walked back to my car, I saw the windshield wipers were flipped over, rubber side out. As soon as I saw this, I began looking around, scanning the tree line (about 40 feet away from where the car was parked). Just inside the woods,  I saw what I thought was the silhouette of a black bear looking at me.  I walked slowly (15 or 20 feet to my car) to the drivers side of my car watching the \"bear\" in the woods. It was about 20 feet in the woods watching and the car was between us. I got in my car, still watching the \"bear\" in the woods.  As soon as I slammed the car door it stood up. That was when I realized it was not a bear.  It ran south, still in the trees, and over the top of the quartz outcrop/mound. I saw it running for about 3 seconds before it was over the top of the mound. It took it about 6 seconds for it to move from sitting/crouching to out of sight. I started the car and drove away quickly and didn't stop untill the McDonalds in Woodland Park where I flipped the windshield wipers over. The total time watching was about 2 min, from the first sight of the \"bear\" in the woods untill he was over the top, out of sight. Description: It was in the shadows of the trees and must have been sitting or crouched down, as I thought it was  a black bear standing on all fours. I could see a black mass which did not move as I watched it. When I slammed the car door it stood up about 7-8 feet tall (it looked like a large, dark man covered in black fur) I started my car as soon as it got up and did not watch it continuously as it ran, but did see it for about three seconds. Thinking back, it just seemed curious but at the time it didn't feel that way. ",
  "classification": "Class A",
  "county": "Douglas",
  "state": "Colorado",
  "location": "-105.0652,39.21338",
  "location_details": "Starting in Colorado Springs, go west on I-24 to Woodland Park. Turn right at the light before the McDonalds, go to the Pikes Peak National Forest and continue north on Rampart Range Road until you intersect Forest Road 348. Turn left down FR 348 (Long Hollow) for about a mile untill the road turns white with quartz (use the right off-shoot road) to get to the quartz mound, drive up the right side to the top of the mound park. The top of the mound is like a circle about 60 feet in diameter. The figure was opposite the road entrance about 20 feet into the tree line. Top of quartz outcrop/mound N 39 12.803' W 105 03.878' (wgs 84 on a garmin gps 38) Made reading on a previous visit, this happened about the 6th time I have visited this site."
}