{
  "reportId": "18442",
  "title": "Memory told of being chased on a farm near Ava",
  "date": "1986-08-14",
  "observed": "I was staying all night at my friend's house located off of KK Highway in Douglas County, Missouri.  This particular friend just lived a couple of miles from my home. She had told me about how she had heard loud, \"puppy-like\" howling noises, and how she always felt like she was being followed when she went on walks in the woods that surround her home.  She smoked, and said that when she was out on these walks she would at times hear something walking behind her, but when she lit her cigarette, the sounds seemed to stop.  Well, being fifteen and stupid at the time, I came up with this idea to go find what ever it was.  I thought that whatever it was had to be scared of fire, due to her whole cigarette analysis.  So, we took some hay from their barn and put it in paper bags.  We put the bags on the ends of thick branches that we found to make these so-called \"torches\".  I secured the bag to the branch on one of these torches with my belt.  So the adventure began.  We headed across their field toward the woods.  It was dusk at the time.  The field was about the one and a half lengths of a football field (I am not into sports, so I cannot really tell you actual feet).  When we reached the edge of the woods, which is where the family dumped some trash, we looked at each other and decided this was not such a bright idea.  We turned around and headed back to the house.  When we were around midway through the field something big and grey came darting toward us from the edge of the woods.  The distance between us and it was probably around 200 feet.  I took off running, without even telling my friend what I was running from; thankfully she followed.  I didn't even realize I still had those torches in my hands, which I finally dropped when we reached the area of the barn, which was about 100 feet from the house.  We ran into the house and stayed there for about 15 minutes, while I tried to fill her in about what I saw.  After we got enough courage up, we went outside again.  We could see about midway into the field a large, grey-colored, ape-like creature squatting down in the brush of the field.  It was just squatting there looking at us.  That was enough, and back into the house we went.  That night, we heard all kinds of commotion outside.  The next morning I had realized my belt was still out there by the barn.  when we went to get it, we found the torches ripped to shreds.  My belt had been torn into pieces, with teeth marks all over the leather clasp.  There were dents knocked into an old car the family had parked in the field.  Later, my friend told me that a little red wagon that was dumped in the dump site was bent in half.  Every time I stayed all night with this friend, whatever it was acted up with this type of behavior.  My friend actually had a calf that died with its neck broken and twisted all the way around after I had stayed the night.  I told my parents about this, and my dad actually wanted to go hunt whatever it was.  I haven't told a lot of people about this, because of fear that no one would believe me.  I go camping sometimes, and I am still very alert to my surroundings to this day, because I never want to see another one for the rest of my life.",
  "classification": "Class A",
  "county": "Douglas",
  "state": "Missouri",
  "location": "-92.7622,36.94109",
  "location_details": "Western Douglas County, just west off KK Highway."
}