{
  "reportId": "46676",
  "title": "Soldier reports possible vocalizations during a morning group run at Fort Leonard Wood",
  "date": "2014-10-01",
  "observed": "I am a Soldier stationed at Fort Leonardwood, MO.  Every morning we do physical exercises such as running.  That morning we did a 3.8 mile run on the \"Engineer Trail\".  The Engineer trail is a giant 3.8 mile track that has about 10 acres of land in the middle of the circle for land navigation exercises, and towards the back of the track opens up into a giant forest that feeds into Misty Mountain and the outer section of the post.  That land behind the track is 100+ acres I'd say.  On the morning of 1 October, 2014 around 0600- 0615, we (about 15 Soldiers) started our run individually, so we were spread out being some were faster than others.  About midway through the track, we came across a barrier.  A tree about 3-4 feet in diameter that looked to be healthy, not rotten, and relatively in good shape was laid across the track.  We haven't had any crazy wind storms that could've knocked it over, but at any rate myself and other soldiers didn't think anything of it.  As i continued on my run, I encountered another tree that was knocked over but it looked as if someone, maybe some soldiers, had drug it off the road.  Same diameter as the other one, but almost as if someone didn't want us on the track.  I continued on my run and about a mile and half I reached the the back side of the track where it meets the woods that go towards the eastern side of the border of post.  That's when I started hearing a yell that kind of sounded like \"whoops\".  It must've been around 200 feet away.  I immediately stopped running and started listening.  That's when I heard around 5 different \"whoops\".  I say around 5 because each time I heard it, I had to change the position of my head each time I heard one.  3 were from inside the circle of the track, and about 2-4 were on the border of track on the backside.  Being that I was out there alone, (I was in the lead of the pack of Soldiers) I didn't want to encounter what I was hearing I started running to get away from the back side of the track and back towards the civilization side with a quickness.  I know what I heard immediately being that I google, youtube, and watch a lot of documentaries on bigfoot.  The thing was when I got back to the start point, I didn't want to mention what I had heard in fear I might be made fun of or something.  So when the rest of the group caught up and finished.  They immediately started talking about the sounds.  A few of them even mentioned \"bigfoot calls\", with a seriousness.  Most people when they talk about bigfoot, you always get the guys who are sarcastic and snobby.  Well this group of Soldiers we all agreed, there was a family of them out there talking to each other out there on the track. On top of that, I have encountered this odor before when me and my wife will go ride trails on the 4 wheeler, a musky odor.  The entire run, all I could describe the odor as is like a musky/ sewage smell the entire route.  We have ran that route several times, and normally all you smell are the trees and weeds around.  This time it was completely odorless almost to a gagging kind of way.  I wouldn't think twice about saying me and the soldiers I ran with that day encountered a family of sasquatches.",
  "classification": "Class B",
  "county": "Pulaski",
  "state": "Missouri",
  "location": "-92.5415,37.4504",
  "location_details": "Engineer trail, Fort Leonard Wood MO"
}