{
  "reportId": "28450",
  "title": "Possible footprint found and vocalizations heard in the Flying Eagle Wildlife Management Area",
  "date": "2010-10-31",
  "observed": "Yesterday, on October 31st, 2010, I was hunting in Flying Eagle WMA with a friend when I discovered something that I thought was very unusual. It was around 10:20 in the morning when we decided to meet back up and do some scouting for our last afternoon hunt on my quota. I had set my friend up a few hundred yards or so from Hwy 44 in the morning before daylight and I continued on for about 3/4-1 mi. on the edge of the swamp we were hunting. As I continued on I jumped something that ran off and sounded unlike a deer or hog but didn't think anything of it. We were sitting on ground. After we met up we started walking back towards the truck and saw a couple of wet areas (puddles) when I said to my friend, let me check and see if there are any prints leading to the water to get a drink. As I walked over there to see I looked down and noticed something out of the ordinary. I called my friend over to show him. It was a footprint, similar to a humans. Not real large but kind of wide for the length of it. It was so fresh that you could still see the thermal lines in the mud from the bottom of the foot. It was the only one that we could really make out. The heal and ball made deep impressions while the toes were not really deep in the mud in comparison. I had my cell phone with me so I took two photos of the print and one of the area we were in then he marked a tree next to it so we could find it again. It just seemed very odd to find a print like that in the middle of a swamp! We returned after lunch for an afternoon hunt. I did notice one other thing with the squirrels after we returned. I didn't go as far this time, but I noticed the squirrels barking more than usual off in the distance. It is how they warn others of pending danger. As time went on they got closer and closer to where I was sitting and then all of a sudden went silent. Just an observation! I have spent most of my life in the woods in florida either hiking, biking or hunting this was the first time I noticed something like this. It is probably human but who would be out there barefoot?? We ended up laughing quite hard about it after we named him Eddie the Yeti and I will ad this is not the first time I have heard or smelt something out of the ordinary while in the woods.",
  "classification": "Class B",
  "county": "Citrus",
  "state": "Florida",
  "location": "-82.20726,28.84542",
  "location_details": "Located in Flying Eagle WMA about 5 miles East of downtown Inverness."
}