{
  "reportId": "6983",
  "title": "Hunter has early morning sighting near Challis",
  "date": "1975-10-01",
  "observed": "We were on a hunting trip with about 10 people near Challis, Idaho, south of the Salmon River Wilderness, in October 1975. We had stopped our trucks on a dirt road on our way back to camp following our morning hunt to “work” these hillsides that converged at a stream near the road. To our knowledge, there were no other hunters in that area. Four of us went up into the hills to make a giant circle to try to scare up some game and drive them back down towards the stream where the others were waiting. Being young, I volunteered to be a hiker. As we split up, I thought three of them went up the backside of one hill while I circled the other. As I came over the ridge, I found myself on a very steep, shale-covered slope about 500 feet above the stream. As I was scared of sliding all the way to the bottom on my butt, I sat down to watch the opposite slope while my dad and the other 2 worked that hill. As I sat there, I saw what I thought was one of our hunting party walk across the slope, about 100 feet below the ridgeline. He crossed the hillside, near the ridgeline, on the hill across a large ravine from me. That hill was taller than the one I was on. I remember thinking, “boy, he is going to get shot, dressed in dark clothing like that!” It kind of made me mad because he was walking a rather brisk pace, not even stopping to look around for game. I watched him through my riflescope, and for the life of me, I couldn't see any rifle in his hands. My dad had brought along one of our neighbors who had very little experience hunting, and I figured it was that guy. After about 30 minutes, I saw my dad and his other buddy come into view. They were much lower on the slope and I estimated their range to be about 400 yards, but seemed to be smaller in comparison to the other figure I had seen earlier. We waved at each other to work our way back towards the others. When we got back to the trucks, the neighbor, of course, was late in arriving. While waiting for him, dad was joking about seeing him walking along the ridge with his rifle still in it's zippered case, as is was raining lightly. I told him that I thought I had seen him, but saw no rifle and almost shot at him as he was dressed in dark clothing. Dad said “He had an orange vest and orange cap on, and how did you see him when he was above and behind you?” I said, “No, he was above and behind you.” When the neighbor with the clean and dry rifle returned, he confirmed my dad's report. So I said, “Well then, who was that I saw?” Everyone was too tired and wet to care. We went back to camp and forgot all about it, until the other day. Now I'm starting to wonder all over again. Since whoever/whatever I saw was probably 500 yards or so from me, I had trouble making out much detail. I had a variable 3 X 9 power scope. After I saw him I cranked the power all the way to 9 and watched him cross the open hillside without obstruction for probably a full minute or so until he disappeared behind the trees. I was watching his entire left profile. He walked rather quickly and did not turn to look at me, as far as I could tell. He did not appear to have much difficulty traversing the terrain, but when my dad walked across, it looked like he was having the same problem as I was with the steep slope and rocks that slide when you step on them. It took dad forever to cross the same amount of space as this other guy, and dad appeared to be much smaller, even though he was obviously somewhat closer to me. Dad was probably 50 feet or so lower in elevation than I was. As far as estimating height, my dad is 6ft tall, and this thing was much taller and broader...but not fat...kinda “lanky”. A really rough estimate would be at least 8ft. tall, with really long arms that he/she swung like a cross-country skier as he walked., and taking rather long strides as well.",
  "classification": "Class A",
  "county": "Custer",
  "state": "Idaho",
  "location": "-114.7503,44.25028",
  "location_details": "Just north of Challis, Idaho and south of the Salmon River Wilderness."
}