{
  "reportId": "11630",
  "title": "Dusk and evening sightings around Stissing Mountain",
  "date": "1985-05-01",
  "observed": "In 1985, my friend and I were driving along Lake Rd in Pine Plains,NY. It was late afternoon in spring or early summer.  It was a wooded area with a few houses. While driving we both saw what looked like a large man move from the shadow of a large tree and cross the road in 2-3 strides. When we got up to the spot where \"it\" crossed into the area of the tall grass near the tree line, I remember looking for the \"man\" in the area. I was thinking in terms of a peeping Tom, because the \"man\" didn't walk along the road. He just seemed to materialize out from the tree like he had been standing in the shadow of the tree, next to the road, out of sight of the house. When I didn't see anyone in the brush/grass, I took note that the figure had appeared light brown when s/he stepped out of the tree shadow. I also realized that if I crossed the road, I would have to take at least 5 strides. Next incident was also late afternoon, a week or two later, in the same area (a side road near Stissing Lake/Stissing Mt). Sitting in a car at exactly dusk, my friend saw a tall, brown figure standing along the tree line next to the road, the same side we were on. There is a large ballfield on our left side and Stissing Lake beyond that, to the west. We were facing north. When she said \"what is that?\" (she didn't say \"who\"), I looked ahead and couldn't make out what she saw until I saw a movement about 100 yrds ahead. That's when I saw a light brown leg turn into the tree line and a tall, upright \"man\" walk into the tree line. We decided we didn't want to sit in the car next to the tree line about 30 seconds after we lost sight of it. We drove the car slowly up to the place we last saw it but my friend (who was driving) didn't take her foot off the gas and didn't stop. There was a small shed there in the trees that the ballfield uses to store equipment. It is about the size of 2 outhouses. It certainly could have been hiding behind it. Both times, I can say that the tallness of the figures, using the tree heights as a baseline, were definitely well above 6ft.",
  "classification": "Class B",
  "county": "Dutchess",
  "state": "New York",
  "location": "-73.66616,41.97341",
  "location_details": "Lake Rd is off of Rt 82 north and also from Rt 199 from the east/west. Stissing Mt has the highest elevation between the Berkshires and the Catskills. It still has a fire tower on it. There is a large lake at its base and there is a fish and game preserve attached on the eastside. Stissing means Sleeping Indian. There was a report of a family living at the south end (the foot of the sleeping indian)which actually ran in the Register Herald, who stated they had seen \"bigfoot\" watching them when they were outside in their yard. I tend to believe your theory about them using the Appalacian Trail routes. I live in Rensselaer Co. - straight as the crow flies up from Dutchess."
}