{
  "reportId": "28716",
  "title": "",
  "date": "",
  "observed": "On March 20th 2010 between 3:30 AM and 4:00 AM I heard a loud scream I had never before heard.  I was awakened abruptly out of a deep sleep when a very loud animal scream made me sit straight up in bed, scaring the hell out of me.  For about 15-20 seconds I wondered if maybe I had imagined it, when suddenly another long, loud screaming came.  It was very loud- and close, and it was obvious by the volume and intensity that it was something big.  I guessed the screaming to be about 10-20 feet away from the house, outside my bedroom, on the lawn.  There is roughly 60 feet of lawn between the house and the woods and the screaming sounded like it was maybe one-quarter to one-third away from the house towards the woods. The hair stood up on my neck when another long, loud scream came, and I wondered what in the hell was doing it?  The volume and intensity was much louder and deeper than a person could possibly make and it wasn’t consistent with any animal we have heard here before- Deer, Elk, Bear, Coyote, Cougar, etc. I walked into our living room where I looked out the window hoping to see better, but it was too dark in the yard and I could not see beyond a few feet.  I slid the window open to try to hear anything and about a minute later another loud scream erupted through the night but it now sounded like it was just off our lawn and into the woods.  After this scream there was a series of loud sounds that I can only describe what sounded like distressed grunts, barks, and cries followed by shorter screams.  Almost like something was possibly injured or distressed.  Then to my surprise something screamed back- off into the woods from the right, which I guessed to be a few hundred feet away.  This went on, back and forth about 10 to 15 minutes when I realized our three dogs had not been barking during any of the commotion, which was very unusual.  They always bark at animals and people that come onto the property and usually chase after the animals.  I went to the glass slider door at the back of the house and found all three dogs cowering on the back porch as close to the door as they could get.  They were all scared and acted nothing like normal. I went back to the open window in the living room and listened for a few minutes and noticed the screams and noises were getting further away and deeper into the woods.  The back and forth screaming slowly got further away and then the furthest one quit altogether.  The closest one did a few more screams further into the woods and then it too stopped.  After a while I went back to bed but was awake for a couple hours as I tried figuring out what could have made that kind of noise.  Bigfoot had crossed my mind but I really didn’t believe something like that could be- that only happens to other people.  But nothing else made sense of what it could have been. It wasn’t until recently when my wife and I talked to a person who told us she knew two people who had seen a bigfoot on our property back in the mid ‘80s that I began to really think it was possible that Bigfoot was what I had actually heard.  A friend came across this site and told me about it, and I read about other sightings and sounds in the area that made it more plausible.  When I listened to the audio recordings, the hair stood up on my neck once again.  It was the same screams I had heard here!",
  "classification": "Class B",
  "county": "Pierce",
  "state": "Washington",
  "location_details": "Location edited to preserve the privacy of the witness"
}