{
  "reportId": "1683",
  "title": "A fisherman's encounter along a trail near Patison Lake",
  "date": "1984-05-16",
  "observed": "I was just talking to a friend and he told me of this sight. I was 15 and coming back from fishing. The sun was up but was on its way down. Fishing season had opened about a month before and my rotwieler and I were walking back from the lake. We were walking on a dirt road through some deep woods that turned into two Christmas tree farms the road went through some Christmas trees that were old maybe 15 + yrs. and a younger batch 2-3 yrs. old. We were walking just out of the woods into the two tree farms maybe a couple hundred yards when I looked off to the right and saw a big brown object moving swiftly through the small 2- 3yr. old Christmas trees. It was far away maybe 400 yards and the Christmas trees were 5-7 feet high and at first I thought it was an elk moving at that distance. I slowed down to watch partly to see what it was and partly because we where going to run into each other. There was maybe 15-20 yards between the new trees and the old and when the animal was a hundred or so yards off my dog kinda whined which I thought was odd because she was not afraid of anything and looking down her hair was up and she was right up against me. When out of the small trees it came and in maybe four strides it had made it across the 15-20 yards and across the dirt road into the bigger trees It looked to be about 5-6 ft tall and was upright on two legs with hair the color of a grizzly and of the same kind as an ape but in longer strands. I only got a glimpse maybe 5 seconds but it was only about 20 feet away at the last part and didn't seem to have even seen me as it went into the larger trees. I was scared and did not follow the road by where it went into the trees but turned and crossed the small tree farm at a run with my dog right beside me. Now the questions I have are why only 5- 6 ft tall. I've heard they are 7- 9 ft tall. Could it have been a young one or a female? I also did not notice any strong smell which I am sure I would have remembered. And why would my dog be afraid? Well there is my experience and to tell you the truth I would not want to repeat it what I found to be suprising was how quiet it was around the time it happened and how quiet the creature moved. It did not seem to be running or walking but somwhere in between but it sure covered alot of distance in a hurry. When hearing elk running or dear there always seems to be crashing but with the creature it was quiet I do not remember any noise.",
  "classification": "Class A",
  "county": "Thurston",
  "state": "Washington",
  "location": "-122.7669,46.985",
  "location_details": "It is now developed into what is called Lakepoint by Patison Lake where I was fishing before the encounter. The dirt road is still there because of power lines that run over it. The woods are mostly gone because of development and the two tree farms are non existent. The nearest intersecting streets at the time where Ruddle road and Yelm Hwy."
}