{
  "reportId": "4409",
  "title": "A series of encounters on Haga Ridge near the Wayne National Forest",
  "date": "2002-05-16",
  "observed": "This is the second track find we have had since 1999. The first sighting I was contacted and I sent photos to a person who called on the phone. He was supposed to come and check it out, but never did. Okay, we have had more activity on our property and this time there are two three different sets of footprints, like a family so to speak. There is one that is very small like a young one. About two weeks ago, my mother told me to look at some footprints outside, I did not get a chance until today (May 26, 2002), the first thing we seen when going outside was our bird feeder had been bent all the way over, as to if something had pulled it down to get the birdseed. We have two of them almost side by side, the other one wasn't touched. We took the bird feeder and metal pole that it sat on inside the house. I then went back outside to look for the prints, I had found several prints ranging about seven to just over twelve inches. The toes seemed to be dug in more than the heels. What they did was follow a ravine up through our front yard, which is mud and sandstone. When it rains water goes down through there and we believe they must have been following the path down into the ravine below. The dogs bark constantly around here, and my toddler couldn't sleep one of those nights, he kept saying \"Rarrs\" which in toddler language at least his, means monster. He must have heard something outside his window, maybe a sound they make or something in that nature? The first time I submitted photos, they asked about seeing red eyes. My mother seen three sets of these eyes, and also heard the screaming, she was a born and raised country girl, so she knows what sounds are what in the country. She said she never heard anything like that in her life and made the hair on the back of her neck stand up. After hearing the sounds she quickly came in the house. She felt they were really close because of the loudness of the scream. Anyway, I hope someone can get out here quick, since we feel the bird feeder was destroyed by the track makers and they may destroy something else. As far as seeing them personally, we haven't yet.",
  "classification": "Class A",
  "county": "Athens",
  "state": "Ohio",
  "location": "-81.85331,39.28537",
  "location_details": "North of State Route 50 on Haga Ridge Road."
}