{
  "reportId": "23696",
  "title": "Huge creature stands in headlights on rural road near Leesburg",
  "date": "1993-05-01",
  "observed": "I'VE NEVER TOLD MY STORY IN A PUBLIC FORUM, ONLY TO A FEW PEOPLE, BUT BACK IN 1993, ME AND A FRIEND WERE COMING BACK FROM A CITY WHERE HE STAYED, (EUSTIS,FL), TO (LEESBURG), WHERE I USE TO STAY AND HE WAS COMING TO SPEND THE NIGHT AT OUR HOUSE, BECAUSE WE HAD A BAND TOGETHER AND WE WERE GETTING READY FOR A FEW UPCOMING SHOWS. TO LET YOU KNOW, WE STAYED IN THE WOODS, BUT ANYWAYS, WE REACHED THE DIRT ROAD TO OUR HOUSE, AND WHEN MY FRIEND DWAYNE, WHO WAS DRIVING, TURNED TO GET ONTO OUR DIRT ROAD, I THOUGHT I SAW SOMETHING STANDING IN THE MIDDLE OF THE ROAD UP AHEAD. I DIDN'T WANT TO SAY ANYTHING JUST IN CASE I WAS MISTAKEN, BUT WHEN DWAYNE SLAMMED ON THE BRAKES, THEN I KNEW THAT I WASN'T GOING CRAZY. NOW, I DON'T KNOW ABOUT ANYBODY ELSE ON HERE, BUT HE AND I, GOT A CHANCE TO SEE THIS THING UP- CLOSE AND PERSONAL, NO MISTAKING. THERE IT WAS, A BIG CREATURE STANDING \"SMACK\" RIGHT IN THE MIDDLE OF THE ROAD. I WOULD SAY THAT OUR CAR WAS ONLY ABOUT 10-15 FEET AWAY FROM THIS THING. AT FIRST DWAYNE, DID NOT HAVE ON HIS HIGH BEAMS, AND SO I TOLD HIM TO TURN THEM ON. NOW, LISTEN, WITHOUT THE HIGH BEAMS WE SAW THIS THING VERY CLEAR, BUT IMAGINE WHEN WE DID TURN THEM ON! BY THE WAY, DWAYNE, WAS CONSIDERED ONE OF THE AREAS MOST FEARED GUYS, BUT IF YOU WOULD HAVE SEEN THIS GUY AND HOW SCARED HE WAS, YOU WOULDN'T HAVE BELIEVED IT. HE KEPT SCREAMING, \"THAT'S THE DEVIL\", AND HE MUST HAVE SAID THIS, AT LEAST, 10 TIMES! TO LET YOU KNOW WE'RE BOTH PREACHER'S KIDS AND TRUST ME THIS WAS NOT WHAT I NEEDED TO HEAR AT THAT TIME.  AS A MATTER OF FACT, THAT'S NOT SOMETHING I NEED TO HEAR ANYTIME!  I WOULD SAY THAT WE SAT THERE LOOKING AT THIS THING FOR ABOUT 2-3 MINUTES AND ALSO WE WERE TRYING TO FIGURE OUT HOW WE WERE GOING TO GET PAST IT. WE WANTED TO HURRY AND MAKE SURE THAT EVERYBODY AT THE HOUSE WAS ALRIGHT. THIS THING WAS HUGE IN SIZE AND HAD TO BE ABOUT 8 TO 9 FEET TALL. IT'S EYES WERE LIKE CICLE ORANGE RINGS. IT STOOD STANDING, MOVING IT'S HEAD FROM SIDE TO SIDE, AS IF IT WERE TRYING TO FIGURE US OUT. IT HAD THE HAIR ON MY BODY STANDING STRAIGHT UP! IT WASN'T UNTIL I HOLLERED TO DWAYNE, TO STEP ON IT, WHEN WE SAW THIS THING FINALLY MOVE. AND WHEN HE MOVED, IT WAS LIKE HE MOVED IN SLOW MOTION, IT WAS REALLY CRAZY!!! WHEN WE GOT TO THE HOUSE IT WAS LIKE A STAMPEDE, BECAUSE WHEN WE GOT IN TO THE HOUSE, YOU WOULD HAVE THOUGHT WE WERE ON THE RUN FROM THE POLICE ! EVERYBODY IN THE HOUSE WAS SCARED AFTER WE TOLD THEM WHAT HAD TAKEN PLACE. WE WERE AFRAID TO TO CALL THE COPS, BECAUSE WE DID NOT WANT THEM TO THINK THAT WE WERE CRAZY, AND SO WE KEPT QUIET. WE DIDN'T NEED ANYBODY TELLING US THAT WE MUST HAVE HAD SOMETHING TO DRINK OR WE HAD BEEN SMOKING SOMETHING. I'VE NEVER, EVER, SMOKED ANYTHING, NEVER HAD AN ALCOHOLIC BEVERAGE, OR EVER TAKEN A DRUG, BESIDES WHAT DOCTOR PRESCRIBED. THE REASON WHY I'M TELLING MY STORY NOW IS BECAUSE, EVERY-NOW-AND-THEN, I STILL HAVE \"FLASH BACKS\" OF THIS AND I CAN'T STOP THINKING ABOUT IT. IT'S BEEN BOTHERING ME SO BAD LATELY, THAT I HAD TO GET ON-LINE AND DO A SEARCH ON THIS TO SEE IF ANYBODY IS TALKING ABOUT IT. WE'RE TALKING 15 YEARS AGO AND THIS IS STILL FREAKING ME OUT! ANYWAYS, THIS IS HOW I FOUND YOUR SIGHT. WE'RE SO FOR SURE ABOUT WHAT WE SAW ,THAT WE WILL TAKE A LIE DETECTOR TEST. ALSO, AS A \"CHRISTIAN\", AND A BELIEVER IN (JESUS CHRIST), I DON'T THINK IT WOULD WE BE WISE FOR ME TO LIE ABOUT SOMETHING LIKE THIS. THIS IS THE, \"GOD's\" HONEST TRUTH.",
  "classification": "Class A",
  "county": "Lake",
  "state": "Florida",
  "location": "-81.7757,28.86151",
  "location_details": "HWY.441 TO CR-473, TO LEARN RD. AND ANDREWS ST."
}