{
  "reportId": "1350",
  "title": "",
  "date": "",
  "observed": "REPORT OF A FIELD INVESTIGATION by Richard D. McCuistion, Sr., Chilton Williamson, and Keith Foster  Between 4 and 7 August 1998 we began a long term study in a drainage thought to be the summer range of the Sasquatch(s) described by Foster in the Big Foot Research Organization’s geographical data base for Conejos County, Colorado.  Our purpose was to spend at least six days in the study area to establish our presence deep into, what we thought might be, the home range of the creature and to familiarize ourselves with the area.  Exact locations within Townships 35 and 36 North and Range 4 East will not be divulged here because of the area’s importance to us as a long term study area.  Also, it is not recommended that anyone, other than serious researchers who coordinate their activities in the area with us, venture into this area because of its remoteness and the unusual occurrences that we experienced. The study area is heavily timbered with slopes ranging from about 10% (6§) to over 100% (45§) and elevations ranging from 9400 feet above mean sea level (MSL) to over 12,000 feet above MSL.  The off road terrain is extremely rough and suitable campsites are almost nonexistent.  The soils are granitic, very firm, and not particularly conducive to animals with soft feet leaving discernible tracks -- shod horses weighing 1,000 pounds or more generally left slight hoof impressions in the surface of the dirt road.  The study area is summer range for an apparently sizable population of elk (Cervus elaphus).  The cow elk and their calves that I observed were numerous, well fed, and healthy.  I believe that this population serves as a prey base for the alleged resident sasquatch(es) as well as other large predators including man.  No evidence of bears was seen on this trip, but that does not preclude them from existing there. The first twenty-one hours spent in the study area by Williamson and me were uneventful.  We found a suitable campsite that had a fire ring and other evidence of recent human usage -- possibly by seasonal elk hunters.  The campsite lay between dense forest and rising terrain on the north-northwest, east and southeast sides and a large wet meadow that drains into the _________ Creek on the west side. The meadow covers an area of about 230 acres and is oriented on a northwest-southeast axis.  It was about 250 yards wide west-southwest of our campsite. At 16:00 MDT, 5 August 1998, Williamson and I heard five distinct primate-like calls apparently originating from an 11,000 foot high ridge north of the campsite.  The vocalizations resembled those of a large man rising from a low pitch to a higher pitch before ending -- something like \"Uuuuhhhhaaaa - Uuuuhhhhaaaa\" and were similar to the vocalizations that I heard near Leadville during the early morning of 23 October 1994.  The vocalizations stopped before they could be recorded.  To our knowledge, no other humans were within four and a half miles of our campsite.  A possible hiker’s camp was observed by us as we drove into the area the previous day. It was approximately four and a half miles southeast of our camp and was next to the access road and a pack trail leading up to _______Peak.  This camp was located at about 9400 feet above MSL and the intervening, rough, and heavily wooded terrain rose to over 11,000 feet above MSL.  By road, the distance between camps was greater than seven miles.  At about 16:30 MDT, we were joined by Keith Foster and his son Andrew.  We discussed the vocalizations and it was noted that our campsite was about ______ miles from the site of Foster’s scream encounter of June 1994. At about 01:40 MDT, 6 August 1998, Williamson was awakened by an undetermined disturbance.  Since he had decided to keep his horses in their trailer that night, it may have been their movements in the trailer that awakened him.  At about 01:57 MDT, he heard a vocalization coming from nearby that sounded something like \"Ahhhh - uuuhhhh\" -- a diminutive, rhythmic, and almost conversational form of the vocalization heard the preceding afternoon.  Also, this vocalization was repeated several times and was followed by a pair of low, sharp clicks as if two hard objects or rocks were being struck together.  Foster also heard the clicks.  The vocalization seemed to emanate from a small ridge less than a quarter of a mile northeast of our campsite.  Unfortunately, Williamson was unable to awaken me sufficiently for me to corroborate his observations. After daybreak on 6 August, we observed several elk cows and their calves grazing on a bench about one half mile southwest and upslope of our campsite.  Several bulls were observed bedded down above the timberline on the east-northeast slopes of _______Peak.  After breakfast, we conducted a brief examination of the area north of our campsite, but nothing unusual was observed.  Foster and his son departed to examine the bait sites that he had established near the site of his scream encounter.  These bait sites were established in mid-July 1998 and were designed to collect hair samples and hand prints.  Williamson and I rode the horses further down the drainage following a closed logging road.  We rode about one and a half miles down-drainage before coming to the end of the closed road.  We found the road washed out and impassable by vehicle.  At the road’s end, we found a major game trail that continued down the_________Creek drainage, but we elected not to follow it because of the deadfall and snags which made going impossible for the horses.  While at this location, I took the opportunity to pound rhythmically on a hollow log with a large rock for about 30 minutes;  my effort, however, elicited no response.  We retraced our path to our campsite and rode beyond it to an old clear-cut.  The exact date of the cut is not known, but it shows up on the aerial photography taken on 29 August 1989 as a recently disturbed area.  This clearcut is now an open meadow with slopes of about 10% to 20% and is covered with a generous growth of grasses, sedges, and some pine saplings ten or twelve feet in height. Numerous cow and calf elk tracks, along with recently used beds, were observed throughout this area. At 18:03 MDT, 6 August 1998, numerous and sustained primate-like screams or roars were heard by Williamson and me reverberating around our campsite. The direction from which the vocalizations emanated could not be determined, and the quality of the calls seemed to have a definite edge or harshness over the vocalizations heard the previous day.  They sounded something like \"Rrrrraaaahhhh - Rrrrraaaahhhh!\".  These vocalizations lasted for about four minutes and, again, I was unable to record them.  The horses were securely tethered to the rear of their trailer and we turned in for the night at about 22:30 MDT which coincided with the rising of a full moon. At about 02:00 MDT, 7 August 1998, Williamson and I were awakened by Foster’s vehicle alarm system, which caused a few moments of pandemonium, and Foster shouting, \"False alarm!\".  He then advised us of the events preceding the alarm’s activation.  He stated that he had been awake when he began to hear a rhythmic rock-clacking 50 to 100 yards north of the campsite.  The sounds of two rocks being struck together began at about 01:40 MDT.  He described the sound as having a definite cadence of one strike per second and lasting for a period about twenty seconds.  He observed that the horses were fully alert , extremely nervous or frightened, stamping and snorting and both of them were trying to position the horse trailer between themselves and the source of the rock-clacking.  There were no slopes around the campsite steep enough for a dislodged rock to tumble down and duplicate the steady cadence that he heard.  Upon hearing the clacking and observing the fright exhibited by the horses, he attempted to lower the window of his sport utility vehicle in order to hear better, but inadvertently activated the alarm system which caused Williamson and me to respond to the emergency with weapons at the ready. The events leading up to the alarm were discussed, especially the horses’ exhibited behavior.  They are experienced mounts for deer and elk hunting and have been used on numerous such hunts to pack out downed game.  They have also been exposed to bear which, according to their owner, frighten them considerably.  Foster expressed the opinion that no further incidents would be forthcoming because of the noise made by the alarm and our activity and then he retired for the night.  Williamson and I decided to maintain a listening watch.  Within 45 minutes after activity in the camp subsided, the horses began to alert again and, with the aid of a sound amplifying device, Bionic Ear, stealthy, creeping footfalls could be heard.  Although the device had a directional parabola, there was enough spurious background noise from over-flying jet aircraft to make precise directional orientation difficult; still, the footfalls that I heard were definitely not the thudding noise made by the horses or other hoofed animals as they walk.  It became apparent that the horses were confirming what I was hearing and that they were giving us an accurate bearing on the intrusions.  The horses never alerted toward the meadow on our open west-southwest flank. To aid us in our surveillance, we also used a pair of night vision goggles, but despite a full moon and the unit’s infrared spotlight, viewing into the shadows wasn’t very productive because of the jumble created by branches and snags.  A four celled Mag-Lite was also used to pan suspected areas and at about 04:00 MDT red eye-shine was detected.  The eye-shine appeared as two parallel, reddish pinpoints which winked off and on at about the same visible plane as the base, and to the side of, a lone tree growing on the southwest rim of a small swale.  The swale began about 15 yards north of the horse trailer and was approximately 25 yards in diameter.  A person of average height standing in it would be unable to see over the rim and into our campsite.  The eye-shine’s color was consistent with the red or orange reported by Grover Krantz (\"Big Foot-Prints\", 1992), while the color of the eye-shine cast by the horses was lime green.  Despite a full moon and clear meteorological conditions, no grazing elk or other nocturnal animals were observed at any time during the night.  (An absence of browsing deer and nocturnal animals was previously reported by me in my report of the alleged sasquatch screams and response calls that I heard near Leadville, CO in October 1994.)  The meteorological conditions then were basically the same as on the morning of 7 August 1998.  Moonset occurred at about 05:30 MDT. The intrusions occurred at intervals of one every 45 to 60 minutes and always began with the horses alerting in a different direction toward the forest around us.  Stealthy footfalls and movements would be detected and we would wait until we were absolutely sure that an animal was close by; then we would unzip the tent’s insect netting and pan the suspected area with the night vision goggles or the Mag-Lite. An interesting, and I believe important, observation is of the horse’s behavior preceding successive intrusions.  They were becoming more accepting of whatever was encroaching upon our campsite.  Bears are ruled out because they were not observed and the horses did not exhibit the fear reaction they are known to show in a their presence. After daybreak, the area around the campsite was examined for tracks and other disturbances.  The ground’s surface was, as stated previously, very firm and fairly even, with a layer of pine needle duff under the trees and grasses and sedges in the open areas.  Rock outcrops occurred throughout, and the open areas were moist from a heavy dew and a light rain shower from the previous afternoon.  An animal’s bed was found about 90 yards north of the campsite under a tree above the northern rim of the swale.  This position or bed provided an excellent, but screened, view of our campsite. The bed was dry and appeared fresh, and I did not observe any hoofprints or footprints in or around it although the soil and duff were disturbed.  There was no detectable odor in the bed.  Foster picked up two base-ball sized rocks and struck them together to demonstrate the sound he had heard earlier that morning.  The noise he produced startled the horses and elicited their undivided attention during the demonstration.  Conclusions: 1.  Primate-like vocalizations were heard on three separate occasions between 5 and 7 August 1998.  The vocalizations heard in the afternoons of 5 and 6 August 1998 could not have been made by a human without the aid of a megaphone because of the dense forest and vegetation which quickly attenuated sound.  These vocalizations lasted for a period of not more than five minutes each occurrence and were definitely produced by a living animal and not by a tape player.  The vocalizations heard on 5 August had, as interpreted by Williamson, a \"Heads up or general announcement\" quality to them, whereas those vocalizations heard on 6 August were more like \"Now hear this!\".  The vocalization heard during the early morning of 6 August had a conversational quality to it and was followed by a pair of low, sharp clicks which were also heard by Foster. 2. The footfalls and movements heard with the Bionic Ear were consistent with the night movement techniques that I learned during my training as a combat infantryman.  The technique was, basically, to place the toe of your boot carefully but firmly, avoiding branches, twigs, or dry leaves, and then gradually shift your weight to that foot so as to minimize the sound of vegetation being crushed or soil being shifted.  It is apparent to me now that the tent’s zipper broadcast our alertness and the panning spotlight confirmed it. 3.  The horses that we had with us were, initially, invaluable as an early warning system, but they seemed to become accepting of whatever it was that kept encroaching upon our campsite.  It appeared to their owner that they were beginning to show the same interest in the intruder(s) as they did when one of us approached them. 4.  We were not subjected to the same sort of intimidation or threat displays, such as screams, and thrashing of vegetation that others have reported in their sasquatch encounters.  This difference in behavior could have been due to our numbers and the nature of our presence in the area.  We all carried firearms, we actively scouted the area, we made drumming noises on a hollow log, we didn’t hunt the elk that abounded the area, and we remained vigilant during the night. 5.  Williamson and I had the distinct impression that we were dealing with an adversary rather than a curious and semi-intelligent animal. My conclusion is based on my personal instincts and experience as a former Marine who has seen some combat and Williamson’s was based on his \"gut feeling\" as he had no previous experience with anything like this.  We independently noted the change in the quality of the afternoon vocalizations between 5 August and 6 August, the use of non-verbal communication in the form of rock-clacking, and the repeated probing of our campsite on the morning of 7 August 1998.  The rock-clacking could be interpreted as a form of close range communication intended to mimic naturally occurring sounds which would not tend to alert a quarry.  According to Foster, such communication is sometimes used by bow hunters when hunting Bighorn Sheep (Ovis canadensis) and Mountain Goats (Oreamnos americanus) because they tend to disregard the sound of falling rock 6.  The probing of a position is a complex, aggressive, and hostile act that is used to determine the strengths and weaknesses of an adversary. It is my opinion that the use of this device could only be made by an intelligent, sentient being or beings of potentially dangerous capability or intent.  Although there are no recently documented incidents of anyone being attacked by a sasquatch(es), the above described occurrences, the Ape Canyon incident described by John Green (\"On The Track of the Sasquatch\", 1980), and the reference to chimpanzee hunting behavior described by Jane Goodall (\"The Chimpanzees of Gombe: Patterns of Behavior\", 1986) caused my personal warning flags to go up.  Keith Foster’s \"gut feeling\" was that the encroachments on our campsite amounted to nothing more than simple curiosity. 7.  After considering all of the events leading up to the night of 6-7 August, Williamson and I decided to cut short our planned stay and to leave when Foster and his son left for their home in Kansas.  It was clear to us that our campsite could not be defended because of the surrounding terrain and forest and we did not want to test the intruder’s intelligence and tactical ability with just two people and a pair of increasingly relaxed  horses.  If we had, indeed, been probed the night before, we were obviously under constant surveillance and it would have been readily apparent to an intelligent being(s) that it had the advantage. 8. Although no conclusive evidence was found that would support a claim that our campsite had been visited or probed by a sasquatch(es), the area warrants further, and careful,  investigation which we intend to,  systematically, accomplish.",
  "classification": "Class A",
  "county": "Conejos",
  "state": "Colorado",
  "location_details": ""
}