{
  "reportId": "7759",
  "title": "",
  "date": "",
  "observed": "This is not a sighting, but I strongly believe it would have been. It happened 40 years ago this past summer. The year was 1963. I had to go out to California with my family. I really did not want to go, but I did not have a choice. We went out for the whole summer. My uncle rented a cabin at Big Bear Lake for a week. On the last night at Big Bear Lake my aunt took my mother, sister and me to the movies in town. The movie was over around 8pm so we then headed back to the cabin.  Once we arrived at the cabin I realized I did not have my wallet. I asked my aunt to drive me back to the movie theater, and she refused to take me.  So I decided to walk to town to see if I could find my wallet. When I arrived at the movie theater, I asked the girl at the ticket booth if I could look for my wallet. She gave me permission to enter the theater to look for it.  To my surprise, I found it stuck in the seat. When I came back outside it was dark. Something I didn't think of when I left the cabin.  There was only one road back up the mountain, so off I went.  The road went up the side of a mountain, and it was a gravel road. I was walking along and started to hear something moving on my left. It was the sound of branches snapping when you step on them. Remember the road was on the side of a mountain.  The terrain on the right side of the road was a steep hill upward with a lot of thick trees and underbrush. On the left side of the road was a steep angle going down.  It would be very hard for a human to climb without slipping.  There were no trees, but a lot of bushes and underbrush.  That was where the sound was coming from. When I stopped to listen to the sound it stopped too.  So I started to walk again.  The sound of branches snapping did too. As kids back in Pennsylvania we always carried stones with us just in case we ran into trouble.  I had some nice sized rocks in my pocket.  I started to lob them into the air so they would fall on whatever it was down there. Then the breaking of branches became more vigorous.  When I stopped to listen, the thing kept on coming up the side.  The road went off to the right about 20 yards ahead of me. At the speed this thing was moving, I would not make the bend. Therefore I told myself if a car came around the bend I was going to be a hood ornament. There was no way I was going to let it go by me. God must have been with me, because a car came around the bend. I stood right in the middle of the road waving my hands up and down like jumping jacks.  My aunt was driving with my mother and sister in the car. I must have scared her, because she slammed on her brakes and stopped with only a foot to spare. I ran to the side of the car and got in. The first thing I said was lets go. I did not tell anyone about this at the time, because I was too shook up.  My sister knew something was wrong just by the look on my face. I did not tell my sister the story until we got back to good old Pennsylvania.",
  "classification": "Class B",
  "county": "San Bernardino",
  "state": "California",
  "location_details": "The name of the cabin was called Peyton Place."
}