{
  "reportId": "956",
  "title": "Two men, four wheel driving, see Sasquatch on FS road",
  "date": "1982-11-26",
  "observed": "Me and a friend were 4-wheeling in the Cascade range in the early 80s. It was near the sno-pac, slightly east of Snoqualmie Pass. We had been driving most of the day, always taking whichever path went \"up\". Around midnight or so, it started to snow lightly even though there were small blowing clouds and huge patches of night sky i.e. moon and stars. At this time I was behind the wheel of my friends big truck, and was concerned about the snow fall. We were riding along a narrow road with a huge drop-off on one side. My friend told me to keep my foot into it or we may slide off! He said there is always a place to turn around at the top of these roads. After turning around, we proceeded back down. The road went straight with a 90' type turn to the right towards the end of the incline we were coming down. To our left going down was a upward sloping bank or hill (actually the top crest of cascades) and as we turned right, a hill or upward slope on our left. As we approached at a slow rate of speed I saw what I first thought to be 3 hunters. Then I decieded it was hunter who was trying to hide behind a scrawny bush and I thought he was releiving (urinate) himself and was embarrased that we drove up. I also thought he was wearing some type of snow/winter jump suit. All of these thoughts ocurred in a flash or split second. In the next instance, we grabbed each other and said (both stuttering) \"DDDid You See That!!!\" both at the same time. It was definetly a Big Foot. Here is my description: Its face was non-descript and sunk on the shoulders with no neck. The shoulders were wide and the crotch was very high. The legs were long. It looked at us, crouched down and tried to hide behind the small shrub and then took off to the left with huge strides up the slope and out of sight. We drove to North Bend and had coffee And tried to settle down. An old man told \"He would give his eye teeth to see what we had\". With that encouragement we fueled up and went back to look for tracks. We had to drive all the way to the top again to get our bearing, so we would recognise the turn. We stopped my friend got out and went to the spot, as directed by me and the truck headlights as I wouldn't get out of the truck. He panicked, jumped in and we left.",
  "classification": "Class A",
  "county": "King",
  "state": "Washington",
  "location": "-121.4142,47.425",
  "location_details": ""
}