{
  "reportId": "6410",
  "title": "Multiple witness sighting at night, 3 miles east of Mead, Nebraska",
  "date": "1979-07-04",
  "observed": "First of all this happened in the summer of 1979 on the 4th of July. This is the first of two possible encounters I have experienced over 22 years. The second occurred on November 10th in 2001. We had just finished lighting our 4th of July fireworks and were sitting around the patio talking and relaxing. There were probably 8 adults and 6 kids at my former InLaws farm house. It was around 11pm when a friend of ours jumped up from his chair screaming for everyone to look at the bean field across the highway from the house. As we all turned to look we noticed something very large walking West to East aproximately 300 yards into the feild. It was a fairly clear and the moon was very bright that night. The animal/creature walked at a very fast pace through the beans to a point behind a hill where we lost sight of it. I have hunted my entire life and have never seen anything like this before. It walked leaning slightly forward, swinging it's arms as it moved across the field. At the distance it was from us the only thing we could notice is the size. I had been target shooting earlier that day and had a fire arm in my truck. My brother InLaw and I decided to go see if we could get a closer look at it. My 4X4 Ford truck was a former security truck so it was equiped with spotlights. We enter the field and drove to a point where we could see the trail heading to the East which we began to follow in the truck. We came to a barbed wire fence where one could tell something had crossed the fence and headed off into a tree line some 50 to 75 yards from the fence. WE sat there for maybe five minutes scanning the tree line with the spotlights and noticed nothing. I don't know if it was fear or common sense but we looked at each other and decided that whatever tore up the ground around the fence was too close for us to be sitting out in the field looking around in the dark. I put the truck into reverse and backed the entire way back out to the highway. This area is close to an old military base which stored ammo and bombs during WWII. There are numerous under ground storage bunkers a couple miles south of this area. No one at the gathering ever mentioned or talked about it again. I divorced 3 years later and have had no contact with my InLaws since then. I later heard tha tthey moved away from the old farmhouse to another town. I will submit the second occurance on a seperate report. ",
  "classification": "Class B",
  "county": "Saunders",
  "state": "Nebraska",
  "location": "-96.42668,41.2333",
  "location_details": "Location was on the South side of Highway 92, 3 miles east of Mead,Nebraska."
}