{
  "reportId": "24659",
  "title": "",
  "date": "",
  "observed": "My brother, Sister, Nephew, my daughter, and I were on our 08 archery hunt in the Kaibab national forest on the North side of the Grand Canyon. We camped down the road from where our family had a prior experience that was reported under incident #13964. On Friday night at about 9 pm my sister and I walked down the road from camp and made several vocalizations including a howl and several whoops to try and ilicit a response. After trying for about 30 minutes without any return calls we walked back to camp. When we arrived my sister took my daughter and nephew and went into the camp trailer to put them to bed. Just as they got into the trailer the excitement began. My brother and I were sitting around the camp fire talking when we heard what sounded like a large branch being broked off of a tree violently with a loud crash or something stepping on a large branch and breaking it. It was so loud that it caught both of our attentions. We acted nonchalant about what occurred and just tried to listen for anything else and talked. For the next 30 minutes or so we listened as the camp was circled by two separate unseen things. They were not being very stealthy and were actually very loud and destructive as far the trees the were hiding in. The one would pace from the north west side of camp to almost passed the north towards east and the other paced back and forth behind the camp trailer that was behind us. Sometimes we would here what sounded like a smaller tree being shaken, or heavy foot steps inside the tall grass. We could tell that there were two of them as some times we could hear both at the same time doing different things. Then the rocks and sticks started being thrown. The first the two of us heard was a stick thrown on top of a tarp being used for shade next to the trailer. then we heard almost a continous volley of small rocks and sticks being thrown at different points around the camp site. The largest rock that was thrown landed on the ground between us and the camp trailer. It was the size of a softball and when it hit the thud sound it made scared us both. Soon after this we both lost our nerve and decided to go into the camp trailer where there was more cover between us and them. When we got into the trailer my sister and nephew were still awake and told us they could hear everything we heard from inside. My sister added though that she could hear what sounded like foot steps behind the trailer the whole time and she said at one point she heard a loud heavy sigh. She also described hearing branches being broken behind the trailer and either rocks or small twigs being thrown at the camp trailer. My nephew verified her account and we all tried to go to sleep. Shortly after turning off the lights we all heard a loud metallic thud. Just outside the door of the camp trailer was a sheet metal box with food in it on a small table. The noise sounded like either something had knocked on the box or threw something hard at it. We all fell asleep quickly except for my brother who could not sleep. He stated for a good time later he continued to hear things being thrown at the camp trailer. He eventually did fall asleep but was awoken some time in the early morning to what he described as a branch object being being drug across the canvas top of the trailer over his head. Whatever it was it passed from one side of the trailer to the other. The next day was uneventful as we did not try to make any calls. My nephew had made himself sick he was so nervous from the night before. We also had rain that night and another hunting group had moved in about a mile down the road. on Sunday night my sister and I again went off down the road to try making calls. This time we went off down the opposite side. We repeated our attempts that we made on Friday and still had no response. We returned to camp and sat around the fire for about 30 minutes without any incident. We then went to bed. During the night as we slept something approached the campt trailer and shook it violently at least 6 times spread out throughout the night. I can say it was not the wind as the trailer did not sway to one side from being blown but it felt like something grabbed the side of the trailer and twisted it from side to side in both directions very violently. All of the three adults felt this go on throughout the night. My brother also described that at about 1200 midnight he heard a low growl that lasted about 10 seconds. He described it as subtle but strong as he could feel the vibrations produced by the sound and he said it felt like it was shaking him slightly. The next morning we left to go home. During the weekend we checked the camp trying to find sign or prints. The ground around the camp was covered with a thick layer of oak leaves and pine needles. The only thing we found were the small 3-4 inch sticks and small rocks that were used to pelt our trailer.",
  "classification": "Class B",
  "county": "Coconino",
  "state": "Arizona",
  "location_details": "We were camped east of Crazy Jug Point near Big Saddle."
}