{
  "reportId": "9202",
  "title": "Man remembers childhood daytime sighting along the Feather River",
  "date": "1965-07-01",
  "observed": "I’m 42 now and its been a while since I decided to tell my story about what I saw that beautiful sunny day about 11:00am if you go down to the Pasquines restaurant, take rear turn-off road and keep going till you see a road turning to the right. I lived at the house by the levee in my childhood years 1965-1968. Immigrants had a shack against the levee and always had a gather for the weekend. One day my Mom was out to show the Men how she could shoot her New 22 Ruger rifle at the tin cans. After all the fun, a man was just having an idea if he could just use the rifle on Saturday morning for cottontails, Dad and Mom was happy to let him use it !  Saturday came around and I noticed the home made rack with  cottontail and Jack Rabbit hanging upside down near the small cabins to the side of them. My brother told me to go with him and check them out! it was sad to see such a kill. That evening the men showed my Dad how beer batter makes a good rabbit roast over the fire, and we all had a share of the food with wild rice and flour tortillas. This went on for two weeks, then a problem occurred! Someone was stealing the rabbits from the rack ! Since our family was the only one in the camp, we where most likely the blame. My Dad was beat-up at a card game as beer caused a climax over the rabbit issue, and I could not stand to see it. I was not afraid of anything cause I never watched any TV in my life about scary stuff, so I had no feeling for that in that direction. I went up the levee to just to look around and I saw a rat-snake. I ran down and told Mom about the snake, Mom said not to go back up again. it could bite me!. but my curious mind took me back up the next day. I walked up the levee looking down to the right side where I may have seen it last. When I got to the top , that was it... No snake. Then in the silence of everything but the soft breeze blowing a bit in my ear, I saw something moving in front of me. this huge Monkey like creature on a cottonwood tree, looking over the levee. I noticed it in the shade of the upper branches because one of its legs was swinging back and forth below the branch. I got closer to adjust my focus on this big creature and sure enough it was some sort of ape like thing but with a smaller head and it had human like features. I looked down to see if there was a fence between us, and there was not any fence at all ! My mouth was watering over fear and I could not move my legs. I found a way to turn around and get off the levee! As I went down the levee, half way down I started to run and never looked back. I told my Mom about what I saw and she stopped cleaning and told me to just shut and lock the doors. My Mom was now thinking of the rabbits that had gone missing and told me food left-out makes animals gather for more. We never went over that levee again . Fear after that was something to remember when alone at that age. We moved almost a few years later due to the Juan Corona murders on the same farm, and never spoke about the huge monkey by the levee again.",
  "classification": "Class A",
  "county": "Sutter",
  "state": "California",
  "location": "-121.58,39.205",
  "location_details": "if you are coming from Yuba City go to Live Oak Hwy and as you get to the famous Pasquines restaurant turn off that back road , the first road to the right is it! I dont know the name of it but its very simple. Go all the way to the back up the road ramp on the levee. When you stand on top of the levee look to the left and about 50 yards there used to be cottonwood trees higher than the levee. They may still be there."
}