{
  "reportId": "1203",
  "title": "Many tracks found and terrible screams heard",
  "date": "1998-08-01",
  "observed": "A unidentifiable creature meeting the description of bigfoot has been seen in Capels, West Virginia by several different sources. Many unidentifiable tracks can be found . Terrible screams have also been heard. Capels, is right outside of Welch, West Virginia, their are many places in the mountains that are rarely visited by Man. When seen, the creature ran, everytime. I hope someone will investigate this sighting. The internet is the only way I could think of to report this situation. I wish to remain anomynous so people will not think I am crazy. The creature was spotted twice by a hunter while he he was in the woods right before dusk. Once he was sitting in his truck, and once he was setting on his 4-wheeler. The vehicles were not running. His description was black, straight hair, walking on two legs, and atleast 8 feet tall. Redish eyes. He said it scared him so much that he started his engine, blew the horn , and got the hell out of there. It took a year before he went back in the woods. He went back and found tracks on the mountain ridge. He spotted it last in August,1998. His brother came to him one day after hunting, and described the same thing, the previous hunter had not yet discussed the sighting with anyone. More information has surfaced since, a family had spotted something black, tall, walking on the mountain, during the winter while driving their car on the highway, this occured ten years ago. I am trying to investigate these sightings without getting my name involved. I don't want to cause a circus in this small town. The people who reported the sightings are church going, Christan people, no drugs or alcohol was involved. I feel that the reports are very true. I have not seen this creature myself, but I do live in Capels. The neighborhood dogs go crazy sometimes, and one night, afterdark, I got out of my car in my driveway, something was on the mountainside screaming. This was not any thing human. The sound chilled me to the bones. This was before anyone had reported the sightings. I was trying to find out what was making that terrible scream. I think it is very possible that we have a bigfoot or a coloy of bigfoots in our mountains. There is an excellent source of food and water, for such a creature. We have deer, turkey, bear, etc. The hunters claim that the tracks found are definitly not bear tracks. One hunter said he tracked it to a cliff and found two prints at the bottom of the cliff and they disappeared, as if it had jumped up to the rocks above. The reason I am so concerned about this is because one hunter is my husband, and he is trying to find this during the day hours. I feel like this might be dangerous and I don't want him to be hurt. He said he thinks it is as afraid of him as he is of it. He said when he saw this creature it was like looking at the devil, and I believe him. He always takes a friend with him when he goes in the woods. He said he will not go up there alone, again. They are proposing to build a interstate highway through this area( ridge) soon. I expect to hear about many more sightings. I have not investigated this matter enough, I don't know how. Please look into this report. I bet many more people have seen this creature but are afraid to report it. Maybe if I have some help I will come out of the closet and reveal my sources. This is my first step. I am so afaid to go public with this without having any supportive evidence. Please help. One more thing, I heard on the news that a hunter was found dead in the woods in a nearby town. They ruled his death a homocide but said they have not been able to identify what killed him due to the markings and wounds on the body. This greatly concerns me. This murder was in Beckley, WV. I don't no if these events are related, but it does concern me greatly. I guess hearing about an unexplainable death triggered me to react. I feel like this situation needs investigated. Please Help. Thank You.",
  "classification": "Class B",
  "county": "McDowell",
  "state": "West Virginia",
  "location": "-81.60155,37.46292",
  "location_details": ""
}