{
  "reportId": "5652",
  "title": "Apelike creature seen by children on a sand dune near Caseville",
  "date": "1965-07-15",
  "observed": "When I was a child we used to go to Caseville every summer and rent a cabin on the Lake Huron shore. I believe I was 12, my sister 5, which would make it 1965 when this occurred. One night there was a \"weenie roast\" on the beach, and all the families were invited to meet on the beach that night. Usually the beach was deserted at night. The moon was full that night. I was standing by the campfire with a group of kids when a boy and girl came running up, and the boy was ranting and shaking and wild eyed with fright. He said \"we were attacked by a witch-(remember as you read this these are all kids talking)\"there's a witch in the sand dunes, it had set a trap and tried to grab us\" He then proceeded to tell us that they had been walking in the dunes and had fallen into a hole that had purposely been covered with branches. Just as they were climbing out of the \"trap\", a \"witch\" came towards them and they ran. We were all laughing and refusing to believe them, but I remember looking closely at him and he was really scared, breathing hard. He was adamant he was telling the truth, so we kids decided to go into the dunes to find the witch, and to go in pairs from different points. I was climbing the path up into the dunes with another girl, and as the path was steep, I was looking down to watch my footing. Suddenly I heard a rumbling like a small motorcycle motor above me. My 1st thought was that a mini bike was coming towards us on the trail, but when I looked up, I saw this \"thing\" standing 8 feet or so in front of me, facing us, and realized the sound was growling. The full moon was lighting it up from behind and to the side. My companion let out a gasp and immediately ran away, and at 1st I froze, but then I just smirked and thought, \"I get it, this is a joke, the kid got us up here, now he's got a friend who's trying to scare us.\" The creature was about 4 feet tall, and had massive shoulders like a football player with their shoulder pads on. It was standing up right, but appeared hunched forward at the shoulders, appeared to have no neck, and a relatively small and perfectly round head. Due to the moon being behind it I could not see the lower 2/3rds of the head nor could I see the face at all. I really tried to see the face, too, but it was totally dark. From the massive shoulders, it narrowed into a relatively small waist with short (comparatively)stocky legs bent at the knees, and big feet. The chest was smooth and looked at 1st like leather, but I realised I could see muscle outlined. The arms were longer than would be proportionate for a human, hung down to it's knees, and the hands were long and large. He was facing me swinging his arms side to side, right left, and had stopped growling but was kind of grunting.( I say he as it was very masculine looking.)It was covered with orange hair. As I studied it, I realized I could see veins, tendons, hairs coming out of skin. I began to realise this thing was real not a costume. I saw what looked like about 1 inch long claws, clearly lit by the moon. I realised this thing was real, had started walking towards me, and had claws and a jolt of fear kicked me into gear and I ran. I know you say these animals don't have claws, but I saw claws, that's what made me panic. I am open to the possibility they were long fingernails. As I was running, I remember being so afraid it was going to grab me, as it was coming slowly towards me and was only about 6 feet or so away when I ran. When I got down the dune onto the beach near a group of people I immediately turned and looked up the hill, but could no longer see anything there in the darkness of the hill. I was so shocked I said nothing, and never saw any of those kids again. They must've run home. I remember thinking how grateful I was that it didn't grab me, and also wondered why it didn't,when it seemed to be coming towards me. Within a matter of minutes, my little sister (age 5) came down from the side of the same sand dune towards me, saying \"I saw Frankenstein and the wolfman.\" I ran over excited and said \"Did you see it?\" Now, years later as an adult, she swears she saw it too. What had happened was she wanted to follow the other kids into the dunes, but instead of taking the path, she climbed through the grass up the side of the dune. She says that she was at the top, just below the path, when a set of little feet ran by. (the 1st girl) A few seconds later, a second set of feet (me) and then this \"ape\" came down the path and stopped in front of her. She was viewing it from the side, which was dark as the moon was on the other side of it. She only remembers the arms swinging, the grunting, and hairy hands and feet. She felt it appeared brown, but again she wasn't seeing it from a vantage point that would illuminate it like I did. She tells me she was right next to it, and she could have touched it's ankle if she wanted to. She yelled down to our mother that there was something up there, and my Mom replied something like \"That's nice dear,\" and kept socializing. She tells me due to the yelling she's sure the thing knew she was there, right next to her, but it did not hurt her,threaten her, or touch her. When I asked her what her impression was, she felt that it seemed bewildered, confused, like it didn't know what to do. I tried to tell my parents but they wouldn't believe us. I was so afraid to sleep that night, as our cabin was mere yards from the path the encounter occurred on. However, nothing else occurred. I have a cousin who's family used to own a lake front vacation house in Caseville when she was very small. They had a swamp directly behind their house, and their housekeeper (who is now deceased) used to tell them \"There's something in that swamp.\" When I 1st started researching on the internet what I'd seen, I didn't think \"Bigfoot\",as it looked so different from the descriptions I'd heard and the photos I'd seen. However, now I know there are different varieties of \"bigfoot\", and in fact my sighting looks very similar to the drawing on the cover of the \"Legend of Boggy Creek\" video ",
  "classification": "Class A",
  "county": "Huron",
  "state": "Michigan",
  "location": "-83.27139,43.94111",
  "location_details": "in the sand dunes above the shore of lake huron, I believe we were east of town. There is swamp land immediately inland in areas of Caseville, and the mouth of the pidgeon river is in caseville also"
}