{
  "reportId": "160",
  "title": "",
  "date": "",
  "observed": "A tremendous storm came in off the Pacific.  My friend and I took shelter in a plastic \"tube tent\".  About Midnight we heard a large animal walking around our camp.  The animal had two legs, not 4.  The animal had soft feet, not hooves.  The animal was walking through brush and the forest floor.  The weight of the animal was breaking branches, that, from the sound, were at least one inch in diameter.  The animal walked around our campsite screaming for most of 4 hours.  The screams were blood curdling, and almost human, but louder and unlike any animal I am familiar with. I have hiked the Trinity Alps all my life.  I know the trails and the environment intimately.  Better than Luther Linkhart who wrote the book on the Trinity Alps.  This was not a bear, I have heard and seen dozens of them and chased lots of them out of camp.  This was not a deer, I have seen hundreds of them and had them step over me at night when I camped on a trail.  This animal had two legs, the difference between a 4 legged and 2 legged gate is easily distinguished.  This animal was very heavy and was breaking large branches as it walked, but it had no hooves.  This was not a mountain lion.  I have had them follow me and have heard them scream.  Mountain lions do not snap branches. We were in the only stand of trees for a mile in any direction.  The animal took shelter in that stand of trees and spent the night with us, walking around our camp and screaming all night.  I am certain it was frightened as the wind was breaking large branches and there was a lot of lightning and thunder.  At some moments it was no more than 20 feet away, but it was too dark to see that far, and no way were we going to turn a flashlight on it.  It was truly frightening.  I was 16 at the time, but I was used to facing down mountain lions and chasing bears out of camp with a spoon and a plate.  This animal was terrifying. I found this page as a link from an SF Chronicle article.  When I loaded up the scream sound from Ohio, that was it.  Except, when that scream is from a frightened animal 30 feet from you no recording could ever do it justice. In the morning we looked for prints or sign, but a wet forest floor over granite is the wrong surface, and we found no sign.  We headed back the 14 miles to the car at top speed. I have hiked the Trinity Alps on over 300 trips during my life.  I have never gone back to that lake.",
  "classification": "Class B",
  "county": "Trinity",
  "state": "California",
  "location_details": "Papoose Lake in the Trinity Alps Primitive Area.  14 miles from trailhead up Rattlesnake Creek.  Papoose lake is a large lake in a glacial cirque and is easily located just below Thompson peak in the Trinity Lake."
}