{
  "reportId": "8670",
  "title": "Hiker hears roar north of Alpental Ski Resort at Snow Lake",
  "date": "2004-05-25",
  "observed": "I had an experience in 1984 which closely resembles the report filed # 1385. Their report evidensed hearing a very loud scream...etc. Back in August of 1984 I was camping above the Alpental Ski resort at an alpine lake I believe is referred to as Snow Lake (not certain this is the correct name however). It is a fairly exhaustive hike with substantial elevation gain and mileage from the trailhead. I took my brothers black lab for companionship and we found a spot at the lake near the trail. As I was setting up camp that evening I met a young couple that stopped briefly to ask for camp site reccomendations..As I recall we were the only people up there that evening. As night progressed it got dark and fairly cold..I had a camp fire going and could see the other site a few hundred yards down the lakeside. At approximately 10:00 PM that evening I saw my lab sniff the air and get extremely irritated as if another dog were in the area. Within seconds the dog was up and pacing the campsite and acting very nervous (hairs were stanging on his back). At that same time I heard a very loud scream that was high pitched but also changed octives to a low gutteral roar at the end. This sound continued for at least a couple of minutes and then nothing was heard after. I realize that a lake can carry sound fairly well but this noise sounded as if it were literally just outside my camp. The following morning I got up and stirred the fire. Around 6:00 AM the same couple that I met that previous night came up to me to ask if I had heard the sound. I admitted that I heard something I couldnt describe other than a loud scream-roar. The people then described to me that they heard it right outside their campsite. As they described their experience they mentioned that the creature was passing near their site and making the sound.They could actually hear tree branches snapping outside their camp. The couple indicated to me that the 'animal' was pacing around their camp for a few minutes while it was wailing and roaring. These people were most certainly scared by something that evening..as was I.Apparently they had'nt slept the entire night and it looked like it to me. They appeared emotionally and physically exhausted to me. They never gave their name but they made the effort to come to me and inform that they were leaving immediately and I would be 'solo' up on the lake. I realize that there are several animals in the northwest that make various noises..mountain lions for example. This noise was nothing like I've ever heard. I have sampled the audio recordings you have on your site but they dont compare to what I heard. The screams are very similar but there was most certainly a change of octive as I described to a low roar. If instinct tells me anything this was a territorial 'notice' or noise...needless to say I left not long after the couple and havent returned since. I would actually like to exchange any information on audio experiences similar to mine for that area. Feel free to post this if you deem it appropriate. I always wondered if that same couple may have posted their experience. Hopefully I'll get another chance to get back there..I feel privelleged to have had the experience even though it scared the H... out of me.",
  "classification": "Class B",
  "county": "King",
  "state": "Washington",
  "location": "-121.4454,47.46312",
  "location_details": "Take I-90 east of Seattle..Alpental Ski Resort..the trailhead starts above the ski zone and travels up to the treeline where it ends at the lake."
}