{
  "reportId": "40087",
  "title": "Man recalls encounters while camping with his hunting party south of Cabool",
  "date": "1982-11-15",
  "observed": "It was a Tuesday evening at approximately 6:30 p.m. There were three of us in our deer camp, and three others had gone into town for camping supplies. It was the second week in November, and I was deer hunting with my family (Mom, Dad, & little Brother), and two close family friends in the Mark Twain National Forest approximately 7 miles south of Cabool, Mo. in Douglas County, Mo. My Mom, Dad, & little Brother had gone into town for supplies just after sundown, and left myself, and the two friends (Shawn & Dennis) at the camp site. Shortly after dark, we were all three sitting around the campfire, and heard what we thought was a deer rubbing its antlers. We got up and snuck back behind the tents in the direction of the sound.  We did not have any light source with us except for the camp fire light behind us. The conditions were partly cloudy, and moonlit. Visibility was really good. As we approached the area, what we immediately recognized to be a Bigfoot stepped out from behind a tree. My friend Shawn was 6'8\" and he had to physically lift his head to look at the creature's face. We instantly turned and ran back to our camp where our deer rifles were.The people in the camp next to us fired one shot into the darkness, and was yelling to get their things packed as we ran to the our camp site.  We grabbed our guns, reloaded them, and began piling more wood on our fire. We had three lanterns in camp, so I was elected to take them out into the woods just outside of our campsite on all sides to allow for better vision. We then all sat with our backs to the fire, and our guns in our laps. We began to hear heavy footsteps in multiple directions, and then we started seeing either four of five of these things circling our camp. There was one that was positioned just on the other side of the dirt road that was pacing back and forth, and stopping to squat down and stare for a moment. After approximately 45 minutes of being circled and watched, but never approached in any way, my parents returned. They were immediately concerned about the ENORMOUS size of our fire. We quickly explained what was happening, and my dad decided we should go stay in town for the night. While we were extinguishing the fire, the campers next to us made a hasty exit out of the woods. We grabbed a change of clothes and went to a motel for the night. The next morning, when we returned to camp, nothing had been touched at all. Everything was just as we had left it, including a deer hanging in a tree which Shawn had harvested the day before. My Dad gave us the option of going home, or staying to continue hunting. We chose to stay under the conditions that everybody hunted close to camp for a while. I decided to hunt back behind our camp, where the first sighting occurred the night before. I sat down on a sharp ridge overlooking a very deep, very steep valley. I hadn't been sitting there more than 10 minutes, when I saw a bigfoot ascending the steep slope on the other side of the valley. I couldn't believe what I was seeing. I raised my rifle to view it through my scope, and as I watched it negotiate very treacherous terrain with ease, it turned and looked directly at me, grabbed a live tree approximately 5\" in diameter, and broke it in half with one hand. It then turned and disappeared over the top of the far ridge. I hurried back to camp to tell the others, and we went to the spot where I had seen it, and next to the broken tree was a print that appeared almost human-like. Shawn placed his size 16 hunting boot inside the track, and there was a margin of space around his boot of approximately an inch to an inch and a half.",
  "classification": "Class A",
  "county": "Douglas",
  "state": "Missouri",
  "location": "-92.11988,37.02496",
  "location_details": "Due south  apprx. 15 to 20 miles of Cabool on Hwy.181 just past the county line of Texas and Douglas Co."
}