{
  "reportId": "57053",
  "title": "Fisherman has up-close daytime encounter with a hairy hominid near Clayton",
  "date": "2014-11-08",
  "observed": "I went to a favorite spot for the weekend to get some peace and quiet and hopefully a monster brown trout. Been going there for years fishing and camping. Not extremely remote but wild and beautiful none the less.Its actually an old home place that has long disappeared, nothing remains except the concrete foundation and a narrow overgrown road that was once the driveway.Was very cold the night before, mid 20s,but the sun was shining bright and it was starting to warm up. I made the relatively short hike down the old road bed to my spot by the river.I dropped my pack against a tree and went down the step embankment to the rivers edge to check out the water and soak up some sunshine to warm up.After a few minutes I heard what I thought was another fisherman or someone up above me where the old foundation was.I thought \"great,so much for peace and quiet, must be hardcore trout fisherman like me to be here in cold weather\". I walked back up the embankment expecting to see people,, what I saw in broad day light, probably 30-40yds directly in front of me was what I can only describe as what appeared to be a fully erect gorilla, except his face didn't protrude out,it was flatter,and the hair was the color of a squirrel, browns, black, silver & a slight tint of red when the sun reflected off him.He was standing there, head slightly tilted back, squinting his eyes,soaking up the sunshine, just as I was.I couldn't comprehend what I was looking at at first. My first thought was \"what am I looking at?\".. Second thought was\" God,look how big he is\". It was incredibly muscular, at least 4ft wide at shoulders, 7-8ft in height,massive animal. The skin was a dark grayish color around the face, head was extremely pointed, like a dunce hat almost, no neck,large pectorals visible under the hair. Eye color was like a shade of amber. It was squinting in the bright sun, soaking up some warmth. He didn't really see me at first I don't think.I did kinda pop up over the embankment, I think he knew I was there but didn't really know where .He could have been trying to smell me. I watched this massive beautiful animal standing there in the bright sun for probably 15-20 seconds.I had a feeling of amazement, wonder & actually privileged .I knew that what I was looking at was truly one of Gods immaculate creations. It was beautiful, big and scary as hell, but beautiful. Hair was clean, looked groomed almost. Very healthy animal. After 15-20 seconds of seeing this I actually stepped up over the embankment all the way in view and I said out loud something like \"hey big boy,ain't you a pretty thing!\" That's when it finally saw me. It dropped its head down & froze. I could tell I surprised it. It wouldn't make eye contact. I could see its whole posture change. It became very shy& acted like it was hoping that as long as it didn't look directly at me I wouldn't see him. It was like a bashful child.I took a few steps toward it and said \"hey big boy\" ,or something to that effect, and that was enough for him. He turned to his left and he was out of there. I could here the limbs & leaves rustling as he made his getaway. He moved like a deer going up the mountain, fast fast. Didn't see him but I could hear him. After probably 5 seconds the rustling stopped and it was totally silent. Then I clearly hear what sounded like someone doing a drum roll with wooden sticks on a wooden table. Three\" brat-tat-tat-tat's,very quick, very clear, definitely not a woodpecker. No doubt in my mind it was him. He had traversed the mountain side and was on the ridgeline above me in no more than 5-10 seconds. Unbelievable. I never felt threatened, never felt afraid. Was a feeling of privilege & respect. I set up camp and stayed at that spot for the night and all the next day but never saw it again. 'spent most of my life in those mountains walking feeder creeks,backpacking, fishing for brook trout.Thought I knew all there was to know.That day changed my life. Made me not only question my sanity & eye sight  (I'm not crazy & have 20/20 vision), but my understanding of the natural world .Ive been back several times but haven't seen him.",
  "classification": "Class A",
  "county": "Rabun",
  "state": "Georgia",
  "location": "-83.31311,34.8804",
  "location_details": "West fork chatooga river"
}