{
  "reportId": "16701",
  "title": "Nighttime encounter at a garbage dumpster in Hamburg, near the Delware Water Gap.",
  "date": "1997-11-15",
  "observed": "I'm reporting this approximately 10 years after the fact.  My wife had asked me to re-tell my story to her this morning and that is what prompted us to stumble across this web site. Late Fall 1997 (or possibly 1996).  I was coming out of my apartment's laundry facility, which is a seperate building not connected to the actual apartment buildings.  I must have heard something because I looked to my right and there it was, about 20 feet away.  The creture was about 5.5 to 6 feet tall. I'd guess it was aroung 200 lbs. There was no odor and it made no sound.  I saw it as it was rooting through a garbage dumpster.  In a matter of seconds my brain went through a kind of checklist to try to rationalize what I was seeing.  But it was not a bear, it was too slim in relation to its height.  It also moved in a way that was very human.  It was nighttime but there was a parking lot light on overhead.  I could see hair that was brown and about 4-7 inches in length. Unfortunately, primative survival instict and adreneline took over.  I bolted toward my apartment, running so fast that I lost my footing as I was going through a dip in the terrain.  I landed arms first and slid across a gravel covered road.  As I got to my feet I looked over my shoulder to see that it too had run and was about 200 feet from where we had met. I'm certain it was not an animal that is commonly known to people.  It was humanoid in appearence and movement.  The way it stopped what it was doing, turned its head and looked at me was freaky. Because of shadows I couldn't get a look at its face.  The incident didn't change my life or anything.  I hardly ever think about it...unless I look at my elbow.  I scraped it really bad when I fell running, and have a scar to this day.  When I first told this story to my wife she was very taken aback because she knows that I am a very rational and analytic person.",
  "classification": "Class A",
  "county": "Sussex",
  "state": "New Jersey",
  "location": "-74.59959,41.14652",
  "location_details": "I forget the name of the apartment complex, but it is on rt. 94 in Hamburg NJ and has been there for decades.  My street was called Wit's End Drive...that much I do remember."
}