{
  "reportId": "15278",
  "title": "Mid-morning sighting by soldier hunting west of Fort Carson",
  "date": "2006-05-15",
  "observed": "My son and I were turkey hunting on BLM land near Fort Carson, CO. We arrived in the area around 0930hrs. My son is only 3 and 1/2 years old, so we were moving slowly to find a good spot to set up. We were approximately 500 yards off the west side of Sate Hwy 115 in the Table Mountain area. We found a decent site to set up on and started our hunt. I called a few times with my diaphram calls and we heard one turkey gobble about 100yds away. My sun was busy playing with rocks right next to our site. At about 1030hrs I noticed a truck driving down a dirt road that runs through the area. I watched the truck drive through the area and as it turned down a left hand bend in the road, I caught some movement out the corner of my right eye. The movement was approximately 600yds away. I picked up my binoculars to get a better look, hoping it was a turkey coming in to my calls. When I got focused on the object, it definately appeared larger than a turkey, so I checked it out more and focused the lenses better. What I saw, I don't know for sure, but it appeared to be walking upright on its hind legs and and was covering a great deal of ground in a short span of time but was not running. I estimated the being to be approximately 6-7ft in height. It was walking northwest from my location. After about a minute or two it disappeared into some high brush and thickets. That terrain went up and over a little rise. I did not see anything else after that. We left the area about an hour later. I was shakin a little bit from excitement, but didn't want to hang around too much longer. I have told no one of this thinking myself to be a little crazy at the time, but I know I wasn't seeing things and it actualy hapened. I only tell this now to get it off my chest and let you guys determine if what I have said and seen is true or not. The temperature was warm and the sky was clear and sunny.",
  "classification": "Class A",
  "county": "El Paso",
  "state": "Colorado",
  "location": "-104.9426,38.5859",
  "location_details": "Area can be reached via HWY 115 from the north or south...Exit I-25 on South Academy BLVD and drive south to the intersection of Academy BLVD and HWY 155, then drive south approximately 20 minutes."
}