{
  "reportId": "2760",
  "title": "Environmental Engineer hears calling and responding screams",
  "date": "2001-07-03",
  "observed": "On Monday night (actually early Tues. morning July 3, 2001) I was performing some nighttime noise monitoring at a residence outside of Shelton, Washington.  I monitored from 2:30 am to 4:30 am.  There are a few residences where I was, but the area is surrounded by Simpson timber land.  The Washington State Penitentary is closeby.  It was perfect noise monitoring conditions, clear night with no winds at all (extremely quiet).  Right when I started my measurement I heard coyotes from the direction of the driveway, off in the distance.  A few dogs in the distance barked at the howls.  I then heard some different animals.  I heard 2 or 3 screams from one location and a single scream in response from further north.  These screams seemed to be communicating to each other.  It lasted about 30 seconds or so.  The dogs in the distance continued to bark, although the 2 dogs in the yard with me did not. I was really wondering what animal it could have been.  I would describe coyote howls as an owwwoooooooo noise.  These screams started as a howl but ended in a scream, like ooooaaaahhhcchhh.   The ending part sounded like a woman screaming, but the scream was solid-sounding and not screechy.  It sounded about a half-mile away but still very loud and clear. Now maybe you can tell me...  It could have been mountain lions, but I am not sure if those animals are 'group' animals.  Maybe it was a mother and her cubs trying to find each other.  It just did not sound cat-like to me, although I have not heard mountain lion calls specifically.",
  "classification": "Class B",
  "county": "Mason",
  "state": "Washington",
  "location": "-123.1583,47.2641",
  "location_details": "Please do not contact the people at this location, or post very specific directions.  I asked their permission to monitor at their house, but I do not know their names.  I can tell you that I was situated just off SR 102.  The prison is to the west and Highway 101 is to the east.  The noises were coming from the direction of Highway 101.  Looking at a topo map there are several lakes north of SR102, west of Hwy 101.  I believe almost all the land is Simpson timber land with clear cuts/trees of several different heights."
}