{
  "reportId": "40718",
  "title": "Hikers hear possible wood knocks and loud screams near Mount Horeb",
  "date": "2011-10-28",
  "observed": "My experience happened in early fall of 2011. It was warm that year and this happened right before Halloween. I was out walking at Douglas County Park with my boyfriend, his friend and my youngest son who was 3 at the time. We walked back past the corn field and worked our way to the bridge that crossed a creek just before you hit the heavy wooded area. I was tossing leaves in the creek on one side of the bridge and Ethan would run to the other side to look for it floating down stream. I heard a series of loud knocks from the woods, I looked at my friends and they heard it too.  It was suggested that it was probably just other people out walking. So I shrugged it off. We started back towards our car because it was starting to get dark and I heard a loud scream. It was nothing I had heard before, too clear to be human.. and too loud for coyote. It did give me the creeps, my friends acted as if it was nothing and we kept walking. A few minutes later I heard a loud scream again only this time it was closer. At that point I picked up my son looked behind me and all I could see was tall grass. Nothing there, my friends made a joke about it being a bigfoot and we worked our way back to the car. I have never heard a yell like that before and could not point it to any animal that I know of.  For the record it sounded nothing like the screams on “Finding Bigfoot” It was loud, higher pitched almost like a female scream but there was no strain to it. I believe what I heard was a Sasquatch.",
  "classification": "Class B",
  "county": "Dane",
  "state": "Wisconsin",
  "location": "-89.6816,42.95915",
  "location_details": "Donald county park has Deer Creek running through it and there is a large area of water shed land. The entrance to the park opens to a large corn field,  however if you take the trail to the left and keep going toward the high ground where the woods are, is where this happened."
}