{
  "reportId": "941",
  "title": "Sighting by a hunter on the edge of a road",
  "date": "1981-09-15",
  "observed": "My wife and I had driven to the area with our pick-up and camper and while she prepared lunch, I took my shotgun and went hunting for band tailed pigeons. I walked along a somewhat open road and not seeing any birds was on my way back to the camper. About a 100 yards or so from the camper, I heard some very heavy footsteps. Thinking it to be another hunter walking heavily to alert others that might be in the area that he was coming through the cover. I stopped on the road waiting for the person to appear so I could acknowledge his presence, and he, mine. What appeared in an opening was what I thought at first to be a bear. It was standing upright and when it came into view, it spotted me immediately, turned toward me and froze. It stood there for only a few seconds, then suddenly turned to its left and disappeared. It made absolutely no noise when it left. I later went down to where I had seen it to look for tracks. It had come up an old overgrown logging road and the ground was hard packed with tufted grass laying over. I could find no tracks and couldn't even make any myself. I was an absolute non-believer in Sasquatch and Flying Saucers and I had difficulty accepting what I had seen. I went to the camper and returned with my wife to where I had stood when I saw this thing. I asked Val to go to the spot where I had seen the animal so I could judge its size. I guess you know, that did not go over to well so I went to the place and shouted, asking my wife what she saw. She said, \"I see a hunter in a blue jacket with a shotgun in his hand\". Then she decided, if I wasn't afraid, she would go there. Judging my wife's size against what I had seen, I estimated it to be about 7 feet tall and weighed approximatly 500 to 600 pounds. I didn't tell anyone about the sighting for a few years because I thought they would think I was nuts.",
  "classification": "Class A",
  "county": "Jefferson",
  "state": "Washington",
  "location": "-122.9179,47.7079",
  "location_details": "A couple miles north of Brinnon, west of Dabob Bay on the Hood Canal."
}