{
  "reportId": "24674",
  "title": "BFRO Investigator videotapes encounter in Daniel Boone National Forest",
  "date": "2008-06-14",
  "observed": "My name is Pam Lovins. I am a BFRO investigator in West Virginia. Earlier this summer I got a call from another BFRO investigator about a situation in eastern Kentucky, not too far away from my location.  I was the closest person so I was asked to look into it -- ongoing activity near Cave Run Lake. After multiple phone conversations with the reporting witnesses, I traveled to the site to see the location and meet the people. I arrived in the afternoon and met several family members. They were a local family who frequently camped near the lake in the summer. They told me about various Class B incidents at night, and at least one Class A sighting in headlights at close range. That last incident occurred only a few days before I arrived. I arrived in the afternoon and met several family members, most of whom had witnessed or heard something at some point during the previous few weeks. As dusk approached, two of the witnesses (two young men) hiked with me to a nearby hill where most of the activity seemed to emanate from.  We had with us a Sony nite-shot infra-red camcorder and at set of gen-3 nightvision goggles. These two witnesses, Chuck and Dusty, along with a few of their friends, had hiked up this same hill several weeks earlier. On that occasion Chuck was struck in the head by a rock. He was slightly injured from it -- had a minor cut in his scalp from the rock. None of these guys had returned to go back up there until this day. The three of us worked our way to the top of the ridge, stopping periodically to check multiple broken trees and branches.  It wasn't long before something was thrown against a rock formation as we were passing by.  We stopped and decided to split up briefly. Dusty went with me, carefully flanking one side of the rocky ridge. Chuck flanked the other side of the ridge. We eventually met up at the top of the ridge. At the very top we were standing on a huge rock formation with a big cavity in the middle. The cavity was a natural formation -- creating a shallow fortress-like arrangement on top. This shallow fortress afforded a nearly 360 degree view, while providing numerous quiet routes of escape along adjoining rock formations on the ridge. There were leaves and debris matted down inside the fortress, but there were no indications that humans used this particular spot anytime recently. We were videotaping this rock formation in the dark with the Sony nite-shot and talking as it got darker. I decided to let the two young guys use my night vision goggles and camcorder to have a look around.  At that point I only had a red headlamp with me. While they were looking through the gen-3 and continuing to record video, I stepped up higher on the rock formation to look down over the other side.  When I got up there and looked over the side, my red headlamp lit up a sasquatch standing 15-20 feet away. It standing motionless between two trees, just below the back of the rock formation. I could see it from the waist up, until I turned my headlamp briefly. Then it pulled back into the shadows and slowly walked away. For as many years as I've been reading about bigfoots and wondering what an encounter would be like, I would not have predicted my reaction when I finally saw one for the first time that night.  I was completely surprised and shocked.  It was no more than 15-20 feet from me, looking up at me from just below the rock formation. I think no matter how well you prepare yourself, you will be completely surprised and shocked when it finally happens. I was pretty addled at that moment. I started walking backwards away from the edge and nearly fell off the rock formation.  I turned off my headlamp and just stood there for a few seconds. At that point Chuck calmly said \"Eyeballs\".  I stepped over toward him and asked him where and he said, \"Over your right shoulder.\" At that point I knew there were two animals up there because the eyeshine [glowing eyes] that he was videotaping were in the opposite direction of the one I illuminated only seconds before. I said out loud that there were two up there, but I didn't tell these young men that I saw one behind us, even closer than the eyeballs in front of us. I didn't want them to panic because that particular section of the rocky ridge is treacherous. It becomes more treacherous as the fog and dew moisture settle onto the rocks and make them very slippery. Chuck [one of the witnesses] continued videotaping the eyes and reacting to what he was seeing through the camera. One thing that I feel is particularly important to mention at this point.  When I tried to see the eyes I could NOT see them with my own the naked eyes.  But the eyes were not always visible to Chuck, so I may have looked at the wrong moment. A lot of my attention was in the other direction, where I saw one at closer range a moment before. My mind was racing because I knew one of them was behind us. When I looked in front of us I didn't see the eyes he was talking about, so I was trying to deny it in my mind. We stood there for a period of time, until I finally decided it was time for us to leave. We began heading back down the spine of the ridge the same general direction we had come up. As we walked in the dark I could clearly hear something else walking, following us down the hill. Then I heard other foot falls paralleling us to our left. The three of us were definitely spooked and felt threatened. Dusty had a large spotlight in his backpack and he pulled it out at this point. He lit up our way down the hill. We didn't see or hear anything else as we returned to camp. When we returned to camp we reviewed the video tape and I was happy to see that we recorded the eyeshine. The facial appearance of the one I saw with my headlight, in no way resembled what I had always imagined.  The eyes reflected the red headlamp. That looked eerie, but the rest of the face was surprisingly gentle looking -- gentle yet intelligent.  It looked surprised but yet unafraid.  The feeling I got was that it was curious but confused, confused as to what we were, and what we were doing up there after dark. There was no pronounced point to its head. It was more of a soft dome shape like a human.  The brow ridge was definitely heavier than a human.  The nose was the most surprising feature of all; it just sort of hung there.  No big flared nostrils or pronounced bridge, just sort of a bulbous lobe.  The mouth was wide, the lips rather humanlike, without the prognathism seen in other primates.",
  "classification": "Class A",
  "county": "Rowan",
  "state": "Kentucky",
  "location": "-83.46259,38.05703",
  "location_details": "[Daniel Boone National Forest; not far from Cave Run Lake]"
}