{
  "reportId": "2787",
  "title": "Horseback rider has close range sighting in jackpine forest",
  "date": "1991-08-01",
  "observed": "About 10 years ago, in the Upper Peninsula of MI in pine and hardwoods country (mixed) I was riding my white gelding, SILVER just before dusk.  I was about 1 1/2 miles from my camp, when Silver stopped dead in his tracks on the dirt road we were on, and stared into the woods.  I looked in the direction his head was turned and to my surprise, I saw a tall white animal coming towards us at a quick speed.  It almost looked like my horse, coming at us!  IF I wasn't riding him at the time, I would have thought he got lost and it was him running towards me.  All of a sudden, the animal came within about 30 yards from us, stopped and turned to go sideways... running behind some pine trees.  HE just disappeared!!!  I didn't see him come out of the other side, go back, nothing. JUST GONE.  I was quite scared at the time, and real excited, too.  I was too scared to go into the woods to find where it went, or what it was for that matter.  I had white hair, looked like a horse standing tall, looking at me, but when it turned sideways, to run, there was no large body behind it.  IT looked like an upright animal running.  IT was totally silent, with no noises even though he was running through the trees, and in a very heavey blue berry patch area.  THE area has since been logged off in that stretch, and I know my kids saw something running in the woods the same summer while 4-wheeling.  We made a big joke about our albino sasquatch, and to this day, I do believe I saw something real remarkable.  I tell my story, and they laugh at me, but I know what I saw, and my horse saw it too.  HIS reaction was quite extraordinary.  I think what ever the animal was, it thought Silver was one of them.  HE looked so similar in the woods, til he turned and there was no body behind it.  I never reported it to any officials here as there isn't anyone to report it to.  Thought of calling the DNR about it, but I swear my family teases me terrible so I know I would get ridiculed about it if I went too public.  Everyone at camp knows of this though and I do tell it often.  I know it was something unique for me to witness.  We have a large wooded area in the U.P. where our camp is, with very rugged terrain.  Many bluffs are located in this area, and one large ridge runs behind where the animal was observed.  I have not seen this since that summer, and no one other than my children and their friends have reported any such sightings that I know of.  It has always bothered me I didn't go and investigate further.  BUT the primal fear I felt in me was something I have never dealt with and I just couldn't do it.  I don't know if this is worth telling you now, since the area was logged and it was so many years ago, but I guess I am wondering if anyone else has ever reported anything so bizarre... especially it being all white like that.",
  "classification": "Class A",
  "county": "Marquette",
  "state": "Michigan",
  "location": "-87.73236,46.61183",
  "location_details": "17 M north of Ishpeming, off Deer Lake Road turning R after Steel bridge on Big Dead river"
}