{
  "reportId": "25442",
  "title": "Hunter describes powerful wood knocks at a cabin in remote wilderness south of the town of Chicken",
  "date": "2008-08-20",
  "observed": "This is an excerpt from a short story I wrote about this hunting trip for mostly my family.  I am 64 years old and have 40+ years in law enforcement, currently serving as chief of police. With hunting season not to open until the day after next, we were in no hurry and enjoyed the evening with a touch of good single malt Irish talking about our past hunts and the one we were about to have.  Loyd and Davis would not arrive until the first day of the hunt, presumably because Dave had become domesticate sometime after the previous year’s hunt and had to attend a retirement party before being allowed to leave Valdez for camp. With the evening expended and the toll the day had taken on us we were in our sleeping bags and doubtlessly turning logs into sawdust by 2300 hours.  The stove was stoked with fresh firewood and all was good.  About 0215 I awoke feeling way too warm, unzipped my bag, slinging the top off, when I heard a resounding crack of wood striking wood, similar to a Louisville Slugger solidly striking a large, sound Birch tree very close to the cabin.  There being no one within many miles of us, my attention was immediately focused on the sound.  A few seconds later, the sound was repeated, which was to be the pattern for several minutes while I attempted to evaluate it to determine its source.  I finally decided to wake Bill saying in just above a whisper, “hey Bill”.  He stirred responding with something that sounded like “what” and did not move again for twenty minutes; when he woke up and asked what was going on.  In the mean time the commotion stopped when I initially attempted to awaken Bill up and I was sitting on the bunk with my .450 in hand waiting for whatever eventuality might arise.  Nearing 0300 hours I finally returned to a sound slumber awaking well into the following morning. With a spot of coffee in our gullets and having explained to Bill the events of the previous night we explored the area of the old village, inclusive of the nearby grave yard, in an effort to find an explanation.  We found numerous paths traversing the grassy area around the cabins with a multitude of bedding sites.  Never did we find anything that would provide us with an answer to the question of the source of sounds.  Explaining this to another friend after our return, with the experience of spending many years living in numerous villages, he asked me if there was a native graveyard nearby.  It is less than 50 yards from the cabin.  Nevertheless, I named the source “Sassy”.",
  "classification": "Class B",
  "county": "Southeast Fairbanks",
  "state": "Alaska",
  "location": "-142.7691,63.98869",
  "location_details": "This is near Ketchumstock Mountain, about a 30 mile jaunt by ATV's to the west of the Taylor Highway south of Chicken Alaska."
}