{
  "reportId": "2630",
  "title": "",
  "date": "",
  "observed": "Not quite sure what to write.  I was hunting with some friends of mine outside of Addison, NY in Nov. of 1986.  I was the top man on a drive.  I crested a hill and decided to take a break. Things were pretty slow as far as hunting.  Typical fall day no overcast, dry conditions.  I just finished eating one of many Babe Ruths when something caught my attention about 50 yds. east of where I was sitting down. I looked towards the direction and noticed something that was black run very fast down the side of the hill.  It happened so fast I wasn't quite sure what I was seeing.  It appeared to be about my height.  I stand at 5'9\".  It ran with incredible speed. What is odd about the incident is that I had time to eat and sit down on a tree.  At the time I was not even in stealth mode.  I always scan the area before I stop for breaks just in case I may have missed any game. I almost felt as if whatever it was, it was observing me and had enough.  It was definitely in a hurry to leave.  I observed it for only at best, 5 seconds.  I could hear it break deadfall once I lost sight as it ran away. Their are bears in the area I hunt, but this seemed to be taller than the average black bear.  My first thought was it had to be a bear.  I remember standing up startled once I had made eye contact with the object running.  It appeared to be at eye level. My second thought was maybe it was a black angus cow that may have been loose from a farm.  I was a little spooked from the incident.  The same feeling you have when you stumble upon a grouse at close range.  I thought again and surmised if it is a bear, it is a very large one. I was not far from the end of the deer drive.  I left the area and met up with my friends at the truck.  I had asked them if they had seen a bear or any deer.  They all said no.  I did not tell them of the incident. On 08-05-95, the Corning Leader newspaper wrote an article on a possible bigfoot sighting near Rathbone, NY.  This area is not far from where I was hunting.  There were casts taken as well as hair samples by the Dept. of Enviormental Conservation.  To my knowledge they were submitted to Cornell University for testing.",
  "classification": "Class A",
  "county": "Steuben",
  "state": "New York",
  "location_details": ""
}