{
  "reportId": "930",
  "title": "Sighting by a school group on summer field trip",
  "date": "1984-07-18",
  "observed": "I was on a summer school field trip 12 day hike with both teachers and highschool students from my district. A black hairy bipedal creature emerged from the treeline at the stream. The creature was large in mass but I am unsure of height as the creature was partially bent over looking and reaching sporadically into the stream. We shouted to look at the thing to our group. As the group stopped and turned, we ran back maybe 20 feet to rejoin the group. As we all stood there and watched the creature came about half the distance of the stream towards the ocean, still looking and reaching into the water. While this was occuring, somebody started to whine as in fear, and the teachers with us began saying \"Calm down, it's not what you think. Just relax, we know what you're thinking, but trust us it's not. Just calm down.\" Nobody up to this point had said the word \"Bigfoot\" yet, but then as I remember someone saw the other group way down the beach, and tried to shout a warning to them. They yelled, \"Look! Bigfoot!!\" At this point, the creature, stood straight up, and looked directly at us for a few quick seconds. I was so scared that I do not remember how tall it was, only that I have the impression of a very tall creature. It then turned to it's left and strode back into the woodline. I do not know how many steps it took, becuase once again I was very frightened. The other group started to run towards us, and our group started to go towards them until our teachers stopped us, and made us wait there. One teacher went to the creek, and met the other teachers that were in the second group there. One of the second group teachers herded the rest of the kids to us, where we were all now very excited and wanted to go check the scene out. There were either 3 or 4 teachers now conferring at the scene, with 2 waiting with us. When the other teachers came back, they said that what we saw was not Bigfoot, but just a black man, who was camping in the treeline. They said that he was naked, and that's why he was all black. I remember someone asking if they had talked to this man, and we were all told to ignore it, forget about it, and just plain drop the subject. All the teachers then started to really sell the \"black man\" story, but we were not allowed to go and see him for ourselves. Only a few of us kids believed this at all, and this was the start of a few other incidents that happened to us along the way.",
  "classification": "Class A",
  "county": "Clallam",
  "state": "Washington",
  "location": "-124.7312,48.1609",
  "location_details": "Using USGS 7.5 minute topographical map titled: Ozette, Wash. Provisional Edition 1984 (I don't know how to use the Minute/Hour of Lat/Long system so this is an Army style grid coordinate of the incident) Grid: Aprox. 717351 on the beach across from Ozette Island"
}