{
  "reportId": "45647",
  "title": "",
  "date": "",
  "observed": "This was a girl scout camping trip to what is now the Brendan T. Byrne State Forest. Back then it was called the Lebanon State Forest. This is in the northern region of the New jersey Pine Barrens. We were a scout troop of about 20 girls ages 8-10 and 3 camp counselors. The camp counselors had prepared a huge pot of spaghetti and meat balls for our dinner the first night there. To get to this camp site you drove into the remote area on a one car wide sand road. The sand was very soft and cars would get stuck in the sand. Then you parked when that road ended and hiked through the forest to a lake, I believe it was called Cedar lake. We were to set up a camp site on the bank of the lake. This was in the month of June I believe so it was hot and very dry, clear night, moon shine everywhere after it got dark. Well, it wasn't long after we made a camp fire and started unpacking our gear that the counselor came around very upset, saying the the huge pot of spaghetti and meatballs was missing, no one had any idea where it was, she had placed it with other gear near the fire and it just disappeared. So, no dinner that night. She had us all come around the fire so she could keep an eye on us, do head counts. Then, it started, the thrashing of the bushes just past the campsite in the woods around us, it circled around and around, then tree knocking over and over again, then loud whistling, not a bird, something with a large lung capacity, long eerie sounds. They were, first on one side of the campsite then on the other, like they were communicating with each other. The counselors decided we were all to stay right near the fire where they could do head counts, everyone was very afraid. We were told to stay in our sleeping bags all around the fire and not move or leave our sleeping bags. Across the lake there was a boy scout troop camping at the same time. The counselors called across the lake, not a big lake, for them to come across and help us. The boy scouts and counselors did and sat with us at the fire and listened to the continuing knocking sounds and whistling and thrashing. It was not a prank. The boys scouts were afraid just like we were and decided we weren't to leave until daybreak because it would be too dangerous to hike back through the woods to the cars. There were no cell phones back then so everyone had to wait until we could run through the woods to the cars and get to a phone to report this. The boy scout counselor did that and the State Police were arriving as we drove away and out of the park at about 5:30am. My mother told me first that I was never going camping again, and second that the police told the girl scout counselor that they found nothing anywhere around the campsites or in the woods, the spaghetti was never found. Back then, you would attribute such things happening to the jersey devil, but in this case I would have to say after all the information today, that it was a bigfoot or a couple bigfoots who just did not want us there. It also made no sense to think that it was a human or humans who wanted us out of there, If a human had stolen the food, he would have gone far away so not to be caught, certainly not scare us so bad all night long so that we would call the police.",
  "classification": "Class B",
  "county": "Burlington",
  "state": "New Jersey",
  "location_details": "I believe the access road into the park was off Rt 70, but you can also access this park area off Rt72 which takes you to the jersey shore through the northern part of the pine barrens."
}