{
  "reportId": "1376",
  "title": "Man sees large creature while working the late shift at a mine.",
  "date": "1981-01-15",
  "observed": "My uncle was working the graveyard shift for a mine overlooking Cripple Creek. He was out on his nightly rounds checking the ponds to make sure everything was still running the way it was supposed to. Some of the places he had to check are rather secluded. He finished checking one of the buildings where the equipment to keep the ponds up and running. He locked the building up and went around the side of the building to get in the truck, when he saw the creature. My uncle stands 6'5\" and he weighed a good 220 at the time. He ran back to the bldg. unlocked the door, and used the emergency phones that they had in the bldg. ( I was 13 at that time, and I had never seen or heard my uncle cry. I am 29 now and I have never seen or heard him cry since that time.) First, he called my grandfather and asked him to come and bring the gun, crying the whole time. We lived 40 miles away from where he was calling from (near Guffey). My mother and grandfather also worked for the mine so they knew right where to go. My grandmother stayed on the phone with my uncle to try and keep him calm. He just kept repeating \"It wasn't a bear, Oh my god it was huge is pa coming?\" He spoke to my mother and grandfather about it. My grandfather said he was on drugs so he didn't speak about it very much after that. I am very close to my uncle as is my mother we are the only ones he ever spoke to about it again. At the time he was 22 and afraid of nothing. Growing up where we did we knew what a bear looked like as well as all the other wildlife in the area. EXCEPT for the thing he saw that night. When he spoke of it he said it was on two legs and taller than any animal he had ever seen. I tried to get him to send this to you, but he doesn't like to talk about it. He starts shaking every time he does.",
  "classification": "Class A",
  "county": "Teller",
  "state": "Colorado",
  "location": "-105.1598,38.753",
  "location_details": "Cripple Creek, Colorado; Teller County off of Hwy 67 North of Cripple Creek"
}