{
  "reportId": "5284",
  "title": "",
  "date": "",
  "observed": ":  This sighting occurred quite some time ago, and I haven’t told a lot of people.  I was a logger for 15 years, in and around northern California, and I was a timber faller, probably 5 years out of that period. Timber falling puts you out in the really remote areas, and we were always the first guys in there to drop the timber. I started working a real thick area, and began working my way back threw the thick woods, my plan was to reach the very back portion of the sale, and then cut my way back toward the logging road. The first day in there, I had the feeling of being watched, thinking it was just our boss spying on us, so I gave no further thought to it.  The next morning I spotted large tracks in the muddy areas.  It had rained hard that night, so the tracks were not sharp, and they were not from a bear.  Further into the woods, I came up on a flat spot in the faint trail that smelt so terrible, that I almost gagged.  It smelled like wet dog, a very filthy wet dog. Just past this spot is where I spotted what appeared to be human droppings. What was weird about the dropping is they were really huge, not trying to act like an expert on droppings, but the largest piece was about 18inches long, and 3inches in diameter. This really freaked me out, because there was no body else in the area. My partner was working over the other slope, and actually went out another way. The cruisers were out of this area about two months back.  This stuff was fresh looking, about a day or two old, tops. My partner was a Kroch Indian, and I didn’t know the guy that well, we just paired up for that season. At quitting time, I sort of approached him about the idea of bigfoot, and he said, “they have been in these woods for ever, and my people have told me many stories about them.”  “You white guys just make fun of what ever the Indian talks about, so we keep it to ourselves.” And, that was about it. I guess if I took him to a bar on Friday night, and got his tongue oiled up a bit, I’d have learned a bit more, but I dropped the subject.  We finished the sale and that was it. This area was really secluded with lots of deer sign.  I had a habit of mapping and remembering really good spots for future deer hunting, and prospecting spots that I would use during the winter lay-off. This particular spot, after logging, was strictly off limits, as it was part of the Fruit Grower Company's land, and after logging they would lock up the roads. It didn’t matter how long you logged their property after a sale it was shut down, and you had to stay out!   Well, hunting season arrived, and I breached the locked gate, and snuck in there for a day of hunting.   I took along my ever-present companion, Pappy, my hunting cow dog.  Him and I were inseparable, because he didn’t know fear, and would attack a grizzly if you didn’t keep him under control.  He had a good nose, and located many a deer that got away from me. Well, we got into the same area that I had spotted the droppings, and Pappy went on purple alert.  His fur went straight up and he acted totally weird.  He came to a halt and refused to go any further down the trail. I never saw him act quite this way!  Just 100 yards up the hill I spotted movement.  It was crouching down behind a buck-brush bush, and it just crouched there staring at us.  It was completely unnerving!  I realized I was illegally in that area, and this might be another hunter, or a DFG cop ready to bust my butt.  Note, guys were always getting busted for hunting on the California line or the Oregon line. It was just a bad spot, and it was so close to each border, it would be up to that game warded. Well, I had a Remington rifle, in a 270 caliber, with a 3x9 scope, and not really wanting to aim a rifle at another hunter, I sort of swept the total area, like I was looking for deer.  What I saw chilled me to the bone!  It was not human, and that’s about all that I can really say!  To this day, it looked like a king sized Eddy Munster, and it didn’t look ape like, but it sure as hell wasn’t human.  The eyes, were what got my leg’s going, because I wasted no time getting back to my truck and getting out of there.",
  "classification": "Class A",
  "county": "Siskiyou",
  "state": "California",
  "location_details": "Hilt, Ca. is located right off the 1-5 freeway in the most northern part of Ca. on the Oregon border. The Fruit Growers Supply Company is located there."
}