{
  "reportId": "11070",
  "title": "Fisherman sees bipedal, human-looking animal in river",
  "date": "2005-05-09",
  "observed": "In the summer of 1997 I worked on a buffalo ranch near the town of Dubois, Idaho.  The ranch itself sits about 30 miles outside of Dubois near the Continental Divide.  I am an avid fisherman and after working long days on the ranch I would spend many evenings fly-fishing along Medicine-Lodge Creek. One night as I was fishing, a rainstorm quickly moved in over the divide ( as is common in the summer months).  I decided to start walking back to the ranch, to avoid getting soaked. I had been fishing on the opposite side of the river from the ranch and therefore had to cross back through the river to return home.  I walked the banks of the river for a few minutes in order to find an ideal crossing spot.  I finally found a break in the willows and started wading across the river.  By this time it had started to rain and a cold, dreary feeling had set in over the river.  As I was wading across the river I saw a slight movement above me in the river.  I turned my head and froze immediately.  At first I thought I wall looking at a moose or even a bear which are both common to the area. The creature was probably 200 ft above me in the river. I was scared to death, and could not move.  Then the unthinkable happened.  The creature, which had previously been hunched over slightly, stood up on two legs and looked directly at me.  It was then that it occured to me that I was looking at the infamous sasquatch.  One of the things I remember that was striking was how human-like the creature's face was.  It was much darker obviously, but very much human.  It had broad shoulders, although so do I, I am 6'6\" and 300 lbs. (I have recounted this story to many people who have joked that I saw my reflection in the river).  I remember thinking that the sasquatch was not as hairy as I would have thought and that it was not as tall as I had ever imagined.  After what seemed an eternity, the sasquatch, started to walk into the willows.  As soon as I saw movement I began to run across the river (as fast as I could in waders and in water).  When I got to the bank I took a glance behind me to make sure the sasquatch hadn't circled around to come after me, after seeing that it hadn't I took my waders off and sprinted back to the ranch.  I will never forget this experience. I have had many friends try and discount it and talk me out of what I saw--I will never change my story.",
  "classification": "Class A",
  "county": "Clark",
  "state": "Idaho",
  "location": "-112.455,44.0925",
  "location_details": "Take 1-15 North aprox. 60 miles from Idaho Falls to Dubois.  Exit Dubois and take the sr that goes to Medicine Lodge Canyon. (I do not know the name of this road)"
}