{
  "reportId": "23065",
  "title": "Bowhunters report unusual encounters in the South San Juan Mountains",
  "date": "2001-09-15",
  "observed": "Preface:  The following is an excerpt from a true story my brother wrote several years ago for a hunting magazine.  I’ve edited it down to just the relevant portion of the story where he has an encounter with…something. ************************************ ….sliding on my wallet with boot heels braking, I claw to a halt beside a dense stand of willows. Parting the foliage, I see the bull is mine at last.    Snapping a few quick photos, I’m hoping to slide the his sizeable mass down to a creek side flat for field dressing, but wedged in the tangle, it’s a case of too much elk and not enough me… …Nightfall has now engulfed the landscape.  Stepping aside, by Braille I grope through my pack for a flashlight.  Successful, I turn its beam across the downed elk, only to be startled by the sounds of a heavy animal scrambling uphill from beside the carcass.   While my adrenal glands haven’t exactly been on vacation this evening, all sensory gauges are now pegged.   It appears I’m not the only one who has followed the blood trail. Shouting threats into the darkness, I’m hoping to make it clear to this interloper exactly who this elk meat belongs to. How could an animal come so close without detecting the feared human scent?   Having my share of bear-in-camp encounters, I’m confident that this creature will, as others always have, amble off in search of easier pickings.  Standing in the blackness of heavy canopy, I hear the crunching leaves from circling footfalls that tell me this time might be different.   Looking at my bow and one remaining arrow, I feel like I’m on safari with the proverbial switch.  I briefly consider building a fire to keep the animal at bay, but as I scan the surroundings I find only fresh aspen growth upon a hillside too steep to support a fire. While I’m generally a stickler for prompt field dressing, I’m hesitant to make myself vulnerable by turning my back to the night – and whatever is out there watching me. Sunrise is eight hours away and I know that if this continues much longer, my flashlight’s batteries will begin to fade.   While pondering my dilemma, I hear footsteps and trickling beads of gravel dancing down the face of a rocky overhang directly behind me. I’m not sure what I’m up against, but something tells me it’s time to back away and leave the elk to whatever it is that’s skulking in the darkness.   Scanning for eye-shine with my failing flashlight, I descend the mountain, tying surveyor’s tape to aspen limbs to help me retrace my steps in the morning, and begin following the creek back to camp.   Moments into the journey I stop and cock an ear into the night. Fifteen yards into dense willows, I again detect footfalls, seemingly paralleling me.   I shouting once more.   I’m weary of all this, and not equipped to do anything other than continue on. It’s a long, mentally exhausting hike back to camp.  As soon as I get there I reach under a nearby log and feel the cold steel of my stashed .38.   Gazing to the stars, I reflect upon my night.   Unbelievably, I again hear the pacing of heavy footsteps on the wooded flat rising behind camp.   The pistol is an enormous confidence builder, and wanting to get to the bottom of this, I rush the bench only to hear heavy footsteps dash off through breaking brush.   Now, to have an animal come to a carcass is understandable, but why in the world would it pass up a freshly killed elk to follow me back to camp? Sleep is not going to come easy tonight. Even in the darkest woods, I’ve always been comfortable; it’s just the same beautiful forest with the lights turned off, right? But tonight, I’m truly unnerved.  Contemplating the 4-mile journey to the security of the Jeep, I realize - whatever it is - it’s still out there. After wrestling the elk, I’m sure I smell like one. Slipping into fresh clothes, I have a seat in a large clearing and scan the surroundings.  As meteors race across the moonless sky all seems calm, and soon my sleeping bag beckons. At first light I eat a quick breakfast and head out, fully expecting to find my bull the subject of somebody’s midnight snack.   An hour later, I’m ascending to the site. A metallic clang of the .38-barrel striking a Sierra Cup announces my approach to any lingering scavengers. Cautiously advancing, I’m amazed to find my bull intact. Hmmm… why then, was I followed? …  …One question remains:  Why was I pressed off the downed bull – then apparently followed back to camp?   Having stood my ground for some time, did the animal and I experience synchronized cowardice, mutually backing away, only to cross paths enroute to camp?   Maybe.   Or, was I intentionally followed?   And, if so, what were its motives?....",
  "classification": "Class B",
  "county": "Conejos",
  "state": "Colorado",
  "location": "-106.541,37.2362",
  "location_details": ""
}