{
  "reportId": "14845",
  "title": "Possible vocalizations heard near Fredericksburg",
  "date": "2006-05-30",
  "observed": "I  have been reluctant to beleive what my mother says because she has always been a little squirrley, it runs in her family, but she told me several years back that my uncle was outside one night drunk as usual, another reason i was reluctant to believe her, but the story goes that something big and hairy got after him and he crawled up under the pickup truck to keep it from getting him. They live in southern Indiana in a remote area. They own about 60 acres that was my grandmothers. The area is rolling hills some big enough to be considered mountains. It lies northwest of Louisville, KY and east of Paoli Peaks, IN, a fairly well known ski resort town. I often wondered about the things they say they have seen and heard in the woods. They live about 3/4 of a mile back off the road in a trailer in the middle of a thick woods with alot of tall cedar and pine trees oaks and walnut trees also. the woods is heavy with alot of undergrowth and alot of sink holes and caves. Houses are spaced out in the area with alot of other heavily wooded properties joining theirs. Years ago my grandmother didn't know what to call it but she reported to us of being chased back the lane by 2 adults - a larger adult and a smaller adult and 2 young ones. My siblings have heard howls but not really seen anything. My brother was killed in an automobile accident on Memorial day and we went up to help them make funeral arrangements on May 30th 06. I was on my way to the truck, it was probably between 11pm and midnight, my kids and husband were already in the truck we all had colds and my son was caughing so he my daughter and my husband did not hear it. It was a howl that made the hair on the back of my neck stand up. I am a country girl, I've heard a coyote, dog and wolf howel before and this wasn't any of those. I listened to the howls on your website and that is exactly what I heard only this one was alittle higher pitched like it may have been a younger one. My husband said all he could hear was my son coughing, I didn't want to be the only one who heard it. I told my sister the next day and she said yes I've heard it many times before. You don't have to prove to me that they exist I just want to know if that is what is in their woods. I am concerned for my parents safety. They are both dissabled and don't need to be back there alone but they are too stubborn to sell it and get closer to town and when they are gone that land will go to us and I don't intend on sharing it with \"Old Hairy.\" He's gonna have to pack his family and move on. I'd like to have proof to show the world that yes, they do exist. [Edited]",
  "classification": "Class B",
  "county": "Washington",
  "state": "Indiana",
  "location": "-86.19055,38.43235",
  "location_details": "Fredricksburg,IN"
}