{
  "reportId": "4642",
  "title": "",
  "date": "",
  "observed": "In 1978, I was alone and gold hunting up behind the Hoopa Valley Indian Reservation. I had to take a side trip across the mountain to avoid some heavy snow and brush. I found this trail that was going up the mountain, where their were large steps in the trail that were throwing my climbing stride off. At this point, this side of the mountain, that I was on, was bald and it was open ground with no trees or brush close by to hide behind. Suddenly, I had this very bad feeling. Then the hair on the back of my neck stood up straight up!  I never had that happen to me before or since.  I believe this happened for no other reason except fear.  I then left this out of stride trail. Actually, I ran off the trail feeling terrified of something that was coming down this same trail.  I only got a short way off, when I went down on my knees and covered my face and eyes with both hands and tried to hide. At that moment I heard an animal on two legs come down the trail, a few yards from me, it stop and it had to gaze right at me for awhile, then it continued on down the hill.  I didn't look until after it left and continued on down the mountain out of sight. So, I never saw this animal.  I believe this creature was directing a silent feeling toward me, and I complied. At this point in my life, I had been a seasoned mountain man, and have had numerous encounters with many kinds of animals including bears and deer, day and night, but nothing like this. With no more fear I returned to the trail feeling fine. I thought of bigfoot right away. This time I paid close attention to detail.  There was no odor or smell, and the only odd thing was that the trail became fainter, as I continued to climb on up this mountain. I had expected this trail lead to somewhere, like a cave perhaps, but no, it just ended at a small meadow.  I looked all around, and I could see there was a lime stone ridge out-cropping in the distance, but no signs of a cave. This encounter was really something to remember, and it was my experience. There isn't any need for the so-called experts to tell me anything, they will just have to get they're own experience. Besides, they're just not in the loop.",
  "classification": "Class B",
  "county": "Humboldt",
  "state": "California",
  "location_details": "I was prospecting for gold on the east side of the Hoopa Valley Indian Reservation."
}