{
  "reportId": "33336",
  "title": "",
  "date": "",
  "observed": "Before the week of thanksgiving 2011 I didn’t believe in Bigfoot, Sasquatch, and ape-man whatever you want to call it.  I wasn’t afraid of the woods, or really ever shaken by anything until that day. My family is avid hunters and outdoors people; we are out in the woods more than most people, and not just during hunting season. We have wild hogs, coyotes, wolf, and have been told black bear even though we haven’t seen them in nearly 5 years at this hunting lease. I know what big game looks like and sounds like. I have been hunting from the age of 5 years old with uncles and other family members. What I saw was not a bear, large cat, deer, and elk, any of your normal big game animals and was not a man in a ghillie suit. We have laid down very strict rules at our hunting club to which I had a helping hand to write, because me and my husband are land managers. Although ghillie suits are not banned, just expressed that misidentification could get you shot while wearing one, and you have to wear blaze orange during deer season period while walking to and from your stand. If you are going to stalk hunt you have to wear blaze orange at all times and stay in the area you have been assigned to period. If caught without blaze orange you are permanently banned from the club, due to insurance purposes. I only tell you this so you know that it wasn’t someone just pulling a trick on me. I was going out on my last evening deer hunt around 1:30pm. November 25 2011. I was taking our friends Honda 350 out because she was going to watch our two kids while I went out and my husband went out to hunt as well.  Things were as normal, I made my way from deer camp to our tri-pod deer stand. Our tri-pod if you’re looking at it from the trail point of view there is a pine tree thicket north of the stand, then a creek runs parallel to the pine tree thicket. Our stand is just south of the thicket tucked in with some hardwood trees, to the west of the stand is all hard wood tress and the underbrush all cleared out the same is for the east. South of the tri-pod is more hardwood trees but we never cleared the underbrush.  So I get to the trail that leads into my stand area which is a good 400 yard to 500 yards of a walk.  I grab my .243 caliber rifle, backpack (which had deer calls, turkey calls, doe and buck urine buck rattle, walkie-talkie). I start making my way to the stand in what’s called a stalk and stand walk. You take 3 steps and stop and listen for a minute. This takes me about 30 minutes to make it to the stand. While walking to the stand I pour doe in estruses urine and buck urine on the ground to cover any human sent I might have on my boots, to lure in deer or hog. I get in and get everything ready, and wait. About an hour passes so I start with a doe bleep for a few rounds of calls then get out the young buck rattle to see if a big buck responds after a few hours. Well needless to say no deer call back or show up, not even squirrel and the birds have all but gone. At this point I have about half an hour before dark and I’m just sitting there with my rifle in hand using the scope which is a nice clear 3x9 to glass the woods. I drop it from my eye and start looking around and then notice this man like figure walking about 400 yards west of my stand headed for the thicket. It was moving fast, with long strides shoulders forward, arms swinging with a heavy step. I thought to my self no way someone is stalk hunting in a full ghille suit in my area when they know my area is clearly marked off with pvc. So I pick up my rifle, and thought I’ll just see who it is, because they are banned from this point on, I want their butts off my lease they just broke about 2 major rules in the contract they signed. So at this point it was instant anger you know I wasn’t going to shoot them but I’m going to have there you know what’s at this point as soon as I could tell which member it was. I get my gun up and get my scope up to my right eye, and was 100% in total shock and instant heart stopping bone chilling fear. To the point you don’t breath, don’t move. What I saw in my scope was a haunting sight. It was ape like with long dark almost black muddy like colored hair. The hair had to be 8 inches long; its face looked kind of like a gorilla that black leathery look but it had human structure. It was covered from head to toe in hair. I must have by this point gasped for air or hit my foot on the stand because as it was walking towards the thicket it never stopped walking but it turned its head and glanced at me and my heart was about to pound out of my chest all I could do was lower my rifle and watch this think skulk off into the pine tree thicket. I sat there shaking for a good 10 minutes, before I was able to gain my composer to get the hell out of there with out killing my self. Once I got down I ran to my atv and franticly tried to get it running and I got about half way down the trail on atv before the bike stopped working. That’s when I started to send S.O.S. with my rifle because I couldn’t get my atv to run. S.O.S. with a gun is 3 quick rounds fired. About 15 mins later a friend that hunts about ¼ or ½ a mile from me showed up on his bike. When he got there we were talking about not seeing any deer, but I never told him, and while we were there and he was looking at my atv all I wanted to do was get out of the woods and back to deer camp, we could smell wild animal kind of like wild hogs, is best I can describe it. He knew I was rattled but I played it off like I was just pissed off because I didn’t see any deer. But truth be told I didn’t go back out and hunt the last day, and haven’t even gone back. After playing out what happened and what I saw that day, the creature was around 8 to 8 ½ foot tall very muscled looking, It never growled or yelled at me, never made any threaten movements, but you could tell it was in a hurry to get where ever it was going.",
  "classification": "Class A",
  "county": "Sabine",
  "state": "Texas",
  "location_details": "The specific location has been withheld at the request of the submitter."
}