{
  "reportId": "56490",
  "title": "",
  "date": "",
  "observed": "I had the day off work so I decided to head up fishing on the Upper Priest River of the Idaho panhandle near the Canadian border. I parked by a bridge that crosses the river about four miles south of the border and started working my way up from there. I probably got a mile and a half to two miles up from the bridge when I started getting the feeling of being watched. The last time I got a feeling like that was while Elk hunting a few years prior when me and a buddy turned around and saw a cat standing on the side of the trail behind us. Feeling like that again really put me on edge so I kept working up river pretty quickly. I got probably another mile up river from there before turning around and working my way back down to the bridge. Once I got back into the same area as earlier, I started feeling like I was being watched again. I'd only gotten a few hundred yards away from that spot when I saw what I thought was a really big tree burl. I took a few steps forward when it looked like it rolled behind the tree. My first thought was that it was a bear so I ran over a few feet to the side to try and see it better. When I got to where I could see that side of the tree, there was just a big dark brownish-black human like shape standing there. I couldn't see a face or any good details on it because of the shadow from another tree on the other side of it. I always carry a side arm with me for bear protection but I still couldn't move I was so scared. It looked at me for a few seconds and just turned and walked off. It hardly made any noise at all. I immediately turned around and ran as fast as I could all the way back to my truck got out as fast as I could. I grew up in those woods and still spend my summers there every year and I know that this was not a bear or moose or any other animal that should be in there. I never went back to that area again for the rest of the summer and I don't think I want to go back at all.",
  "classification": "Class A",
  "county": "Bonner",
  "state": "Idaho",
  "location_details": "Please keep directions confidential to tourists don't try to float the river in the summer since log jams make it very dangerous"
}