{
  "reportId": "19170",
  "title": "Woman describes sighting in teen years in Tohicken Valley Park",
  "date": "2007-09-17",
  "observed": "Here goes, I guess depending upon how you look at it I am either the luckiest person where Bigfoot is concerned or unfortunate in that coming forward in some people's eyes makes me either a story teller or a nut.  My sighting occured on a 1968 family camping trip near the Delaware River in Tohickon Valley Camp Grounds in Bucks County, PA.  I was 16 yrs old. I rode by bike over to explore the newest camping area that was as yet unfinished. As I rode through a clearing down a dirt road I had the unnerving feeling I was being watched from the bushes.  I told myself that I was being silly and proceeded to ride into the entrance tree covered area. I noticed the new bathhouse, wanted to check it out and parked my bike along side a split rail fence.  After finding the door locked I turned around to go back to my bike and that is when I saw not 8 ft away the most frightening and butt ugly creature I have ever seen.  It was standing upright on the other side of the split rail fence.  It had both hands on the top railing all the while shifting its weight back and forth rocking from side to side. I could clearly see the face in the sunlight but details of the body were lost in the shadow of the shade of the trees. It had a wild eyed look upon its face with the body language being restless. I must have been in shock as I calmly decided to get the heck out of there and back on my bike. When I got back to the our camp site I wanted to tell someone but I didn't even believe what I had just saw. I had no point of reference except that it was about 5'5 and monkeyish looking but not human. After I got home I wanted to tell my Mom or Dad or neighbor but was afraid they would make fun of me or think I was crazy. I kept asking myself how I was going to sleep that it would cause me nightmares. So I decided then and there to put it out of my consciousness. Everytime I thought how frightened I was, I pushed it out of my mind. Eventually I succeeded. Fast forward to 2002 and I find your BFRO website. (It has taken me another 5 years to get up the courage to write this report). I never gave it much thought about Bigfoot and Washington/Oregon state but it was interesting to see that this research was genuine and scientifically based.  I was surprised to see so many reports here in PA. As I was reading about other sightings one night, the memory of that camping experience came flooding back with the realization that I had come face to face with a Bigfoot. Upon reflection, I now realize that I have had three more encounters (1978-Bucks,1997 and 2005-Berks County).",
  "classification": "Class A",
  "county": "Bucks",
  "state": "Pennsylvania",
  "location": "-75.06665,40.4225",
  "location_details": "Tohicken Valley Park is a public state camping facility.  It may or may not cause a problem if curiosity seekers come to check out the area and do some amateur investigating. It is near a tiny hamlet area for tourists (Pt Pleasant).  There is a rafting/canoe business, and antique store and restaurant facility."
}