{
  "reportId": "8454",
  "title": "Multiple witness sighting on Hwy. 16 near the Emanuel/Candler county line",
  "date": "2004-04-01",
  "observed": "I am mainly submitting this report to see if any one else has recently submitted a report in this location for the same date. On Thursday April 1st at around 9:00 a.m. myself wife and two sons were on our way to Hilton Head for spring break, We were also following my Parents. As we were coming down the hill on Hwy 16 East (about a mile from the Swainsboro exit) which is a four lane highway two lanes on each side seperated by a large median, most of the area in this part of middle GA is swamp or marsh. Fairly heavy traffic was around us too, which I should explain as about 3 cars right around us with about a hundred yard break and then at least 5 to 6 more. The group of cars is where this happened. The group of cars in front of us were approaching a wooded area in the median (which widens even furter at that point, and on either side of the highway was dense woods) at this point something came out of the woods on the right side of the road and sprinted across the road almost right in front of a semi. What was so strange was that this thing seem to clear 2 lanes in 2 steps. At his point I was trying to rationalize why a man would do this and not wait for a break in traffic. I watched leap in to the woods. At this point I looked at my wife and and without a word she looked back and said did you see that. I immediatley called my parents in front of us and my mom answered the phone and her first words did you see that and what was it. All i can tell you is it moved at lightening speed my wife said she saw it go across the other 2 lanes. But we all had the same conclusion it was large because you could see the comparison of its head as it seemed to run in front of a long nosed Peterbuilt semi. Another oddity is that it ws completely black from head to toe.",
  "classification": "Class A",
  "county": "Emanuel",
  "state": "Georgia",
  "location": "-82.24886,32.38575",
  "location_details": ""
}