{
  "reportId": "25719",
  "title": "Wood Knocks Heard Near Assawompsett Pond",
  "date": "2009-11-17",
  "observed": "It was a mild day and I decided to take a walk in the woods. After traveling about 5 or 10 minutes down a woods road I heard 3 deliberate and distinct knocks which emanated about 50 yards away from inside the brush off to my left, it stopped me dead in my tracks. I have read many of the incidents on BFRO and I could not believe what I was hearing. I composed my self and found what I considered a sturdy stick and struck a large pine tree close by in the same manner as I had just heard. It took about 5 seconds and a reply came back but only 2 deliberate knocks this time. A couple of seconds later  another sound came from a direction parallel  to the first but about 50 yards apart. This sound was like a tree being struck but with the stick breaking on impact. When the stick broke it sounded like it had a girth of a couple of inches. I struck my tree 3 more times but nothing more happened. Let me add that as I was strolling down this trail I was smoking a cigar and the wind was blowing into the direction that the knocks came from.  I continued down the trail which takes you to the edge of a pond. While exploring there I found an interesting thing. Lying on the ground was what looked like a 3 foot wooden club with a jagged end where the roots would be, it looked like something that you would see in a cave man picture. There were also 2 holes in the ground one next to a tree, the hole about 12 inches in diameter and close to 20 inches deep the other about 5 feet away from the tree 3 or 4 inches in diameter and only 4 or 5 inches deep with the club laying on its side and the small end partially in that hole. I believe that this club dug both holes because of the way the end was all rounded and imbedded with dirt. But I do not understand why. I decided to go back the next day for photographs and I brought a yard stick with me to get these measurements. When returning  the next day I discovered a good size pile of feces on the trail about 15 feet away from the tree I had knocked on. Nothing unusual took place this day but I did take a few pictures of various other things as well which may or may not be relevant. What or who  made those knocks I will probably never know but be clear on this they were distinct, clear, timed and deliberate, of this I am sure.",
  "classification": "Class B",
  "county": "Plymouth",
  "state": "Massachusetts",
  "location": "-70.89049,41.83664",
  "location_details": "The closest intersection would be Walnut Street and Marion Road. Head south on Marion road and it would be the 1st woods road on the right."
}