{
  "reportId": "28218",
  "title": "",
  "date": "",
  "observed": "Hi, my name is Joe, I'm 20 years old. I recently had an encounter that was definitely unexplainable. First, let me start out by telling you the story from the very beginning. I am from Albuquerque, NM and the closest camp spots to me are in the Jemez Mountains. I have a friend who frequents the Jemez Mts. to go hunting and camping. A couple years ago my buddy told me a story about an encounter he had recently had in Jemez. He said that he had recently gone on a camping trip with his uncle Mike and his family. They went to a spot in Jemez that he called \"the meadow.\" He told me that about an hour before sun down him and his family were at the camp spot and they all hear a huge shreeking sound appx 3 or 4 hundred yards away. He told me that the sound had lasted for about 30 secs to 1 min. As he told me this he asked me the question \"What kind of animal do you know that has the lung capacity to hold a call for that amount of time?\" Him and his family were sitting around the campfire at sundown. He told me he could see the sky and there was just enough light out to see in between the trees on the ridge (the meadow is in a small valley with two ridges on either side of the camp spot). As everyone was sitting around the campfire he told me that he would look up at the ridge and see something walk upright in between the trees. He told me the being would walk back and fourth in between trees until sundown. He said he didn't call attention to the being because his girlfriend and sisters were camping there and he didn't want to cause a scare. He and his family go to sleep and are awakened in the middle of the night to the shreeking sound. Only this time the shreeking sound is up on one of the ridges. He said the sound was so loud that he could literally feel the bass of the sound. This shreek lasted about a minute and a half as he described it. I was very interested in this and my friend told me that the spot was originally his uncle Mike's camp spot from when he was a little kid. I talked to his uncle Mike about the story. Uncle Mike is a backwoods hunter camper who has been all over the country to hunt. When I talked to Mike he was genuinely afraid of the campspot. He told me that he had been experiencing strange things in this campspot since he was a young boy. He recalled a time when he was seven and he was camping with his brother and his mother. He said whatever was out there scared his mother so bad that she packed camp in the middle of the night and left. He told me he wouldn't go back. My friend and I eventually persuaded him to go camping with us. So last summer my friend, Uncle Mike, my friend's Uncle Richard, and myself went to the very campspot where the noises were heard. We stayed five nights and heard nothing. There were noises but nothing definite. Well about a month ago I took my girlfriend to the campspot and we stayed a few nights and heard nothing. This past weekend was labor day and so I took my girlfriend once again to this campspot and had a very terrifying unexplainable experience. The first night was a great night with nothing out of the ordinary. The second night was something else. My friend was camping miles away so we went and visited him. It was getting dark so I told my girlfriend that we needed to get back to camp. I drove sort of hastily back to camp and when we arrived I started the fire immediately. After I started the fire my girlfriend and I sat by it and I felt extremely tense and I didn't know why. This went on for about an hour until my girlfriend got irritated with me. I told her I just wanted to go to bed. I packed a lot of wood on the fire and we crawled in the back of my Hummer and we went to sleep. Before I go on I want to give you a description of my campsite. I was parked facing away from the entrance of the site. There was a canopy directly behind the vehicle. Underneath the canopy was my backpack and the garbage bag (containing garbage). The campfire was about 15 ft away from the canopy with 2 chairs next to it. We are lying with our heads facing the back of the vehicle and my girlfriend is to the left of me. We go to sleep in the back of the vehicle. Some time later I wake up in the middle of the night and I am very groggy. Im looking up at the ceiling of the vehicle and can see a slight glow of the fire and then it goes out moments later. Immediately after the light goes out I hear something rub up against the vehicle on my side. I hear it until I can hear it knock over a shovel and 2 fishing poles. My adrenalin starts going fast. I don't wake my girlfriend up because I didn't want to scare her. I listen to this thing for about 10 min. It was very dark at this point and there was no moon out. After about 15 min total I hear the thing rub up against the vehicle again. At this point I grab my girlfriend by the back of the neck and I say in a whispering voice \"I need you to listen to me carefully, there is something outside of the hummer. I don't know what it is. I don't know how big it is. But something's out there and I'm gonna get the gun.\" She says ok and I reach for my 9mm and turn it off safety. I lie there clinching my gun and her and I listened to the thing raise hell outside. I hear what sounds like tearing of cloth ripping of the trash and big footsteps and grunts. My girlfriend tells me to calm down because she can feel me trembling. Everytime my girlfriend and I hear a noise we clinch each other because we were hearing the same thing. We lie there listening to the noises for what feels like about twenty min before I start to calm down. At this point I had accepted the fact that there was a bear outside my vehicle and it was getting what it was after. The sounds are coming from next to the campfire. I hear the chairs fall over and eventually the sounds come close to the vehicle again. A couple of times I would post up on my arm to see if I could make out any kind of figure but it is too dark to see anything. The only thing I can make out is the end of the treeline. The sky was just a little brighter than the trees. I could also see a small glowing of embers from the campfire but not enough to light anything else up. I couldn't see anything but the noises continued. I can remember saying to my girlfriend \"Our spot is gonna be a mess in the morning.\" I was trying to calm my girlfriend down because she wanted to leave. Eventually the noises started coming from her side of the vehicle. On that side was the ice chest and the dry box both full of food. It is tampering with them and it sounds like it dumped the ice chest. I turned to my girlfriend and said \"there went the ice chest.\" These noises continued for probably about five minutes. At this point I was sitting up on my heels looking out the window but could still see nothing. The next thing I hear is it touch the vehicle and a second later I hear a clang. The sound was very distinct. It was the sound of the braking of the canopy hitting the ground. I was looking out the back window and could see the sky now. It had knocked over the canopy. I say to my girlfriend \"Oh my god, it just knocked over the canopy.\" In my head I can picture a bear climb up onto the bracing of the canopy and collapse it where it stood. My girlfriend says \"did you see that thing?\" Assuming that she was asking if I could see it I said \"no I can't see anything.\" She starts crying hysterically but not to loud. She says \"I'm not ok I wanna leave now.\" I say ok and clinch my gun as I crawl into the driver seat. I sit for a couple of seconds before I started the vehicle because I didn't know what would happen when I did. I then start the vehicle and turn right to make a U turn and drive out of there. I see no kind of animal or living thing. I drive about 10 min until I hit the main rode. I park there and my girlfriend is still in the back crying. I crawl back there to console her. We \"slept\" on the main rode until sunrise. We both woke around 730 am and start talking about it and it was then that she said \"I saw the thing\" I said what? She said \"Don't you remember me saying did you see that thing?\" I said ya and she went on to tell what she saw. Keep in mind she was lying down the entire time and refused to sit up. She said she was lying down looking up at the sky which was lighter than everything else. She was looking out the side window (which was where it was at at the end). She said as soon as the canopy hit the ground she saw something black fly past the window. She said it was taller than the top of the window and headed back the direction it originally came from which just so happened to be away from all the main roads. My hummer is about six feet and if she was lying down looking up and sees something taller than the top window. Whatever it was had to have been 7 ft plus. After our conversation we agreed to go back up to the campspot to collect our things which was the canopy, the chairs, the cooler, the dry box, the shovel, the fishing polls, my backpack, and the garbage. We head back up to the campspot and finally arrive. I was chilled to the bone when I arrived. There was not a thing out of place. There were only two things visibly wrong with the campspot. The chairs were knocked over and the canopy was turned upside down about 20 feet from where it was standing. I want you to know there was no wind that night. Now if a bear got to this canopy it would have been collapsed and torn. But what this meant to me was that whatever knocked over my canopy had to have picked it up and thrown it 20 feet. I put on my shoes which I had left there the night prior and started scouring the area. The trash which was open and not tied the night before was not tampered with. My backpack was right where I left it. The cooler and the dry box were in the exact same spot and we never really took an inventory of their contents the night prior so we could not tell if there was anything missing. This scared the hell out of me because it meant that whatever was there had the dextarity to rummage through everything and do whatever it did and leave it the way it was found. We packed up and left. I want whoever reads this to know that I don't drink and I have never touched drugs. What happened to me that night was not \"just the wind\" but it was very real. I have never before in my life felt terror like that and numerous times through writing you my story I have broken out in tears because I hate to relive it. There are only certain people that I have told this story to because I don't want to sound crazy. I really hope I hear from you so I can attempt to make some sense of what I've been through. When I first heard my friend's stories I didn't doubt them and they made me very curious. But going to the campsite three times and not experiencing anything just made me think whatever was up there is no longer up there. I know better now.",
  "classification": "Class B",
  "county": "Los Alamos",
  "state": "New Mexico",
  "location_details": "The location was deep in the mnts up Ponderosa Rd. which is off the main road in Jemez."
}