{
  "reportId": "26617",
  "title": "Two bowhunters hear possible screams near Glennie",
  "date": "2011-05-19",
  "observed": "On Saturday, October 21, 2006 my brother-in-law and I were bowhunting for deer in Alcona County in an area that we had been hunting for several years when we heard a sound that neither of us can explain. I was sitting in my tree stand facing basically south with my back to a dense cedar area with a small creek and a mixed hardwood forest in front of me.  My brother-in-law was hunting in a similar situation approximately 200 yards to my east.  The time was around 5:45 in the evening and the weather was clear and relatively warm perhaps in the upper 50s – low 60s.  At this time I had a small 4-point deer come walking down a deer run from the east toward me and stop approximately 40 yards away, standing there sniffing the air around it.  The light breeze was out of the north/northeast with the deer definitely upwind of me.  The deer stood there for about a minute or two mostly looking to the north and east, then turned directly south and walked away.  Shortly after this moment I heard a screaming sound coming from the east.  The sound had a human quality to it and sounded more angry than distressed.  I immediately thought my brother-in-law was hollering for some reason as he was in that direction but chose not to contact him via radio.  There were several short 10 second screams lasting a little over a minute and then stopped.  I sat there completely perplexed having never heard a sound like that before.  After this I noticed the conspicuous absence of any sound or movement in the forest.  Prior to this the woods had been filled with the sound of twittering birds and chattering squirrels.  After this, the forest was dead quiet.  This was the most eerie part of the whole event.  After the sun went down and I met my brother-in-law on our way back to camp he asked me what I had been doing to make that strange sound.  To him, the sound came from the west where I was sitting.  For me the sound was coming from the east where he was sitting so whatever the sound was it originated between us.  At this point neither of us had any idea of what could have made that sound.  We continued to hunt for the rest of the weekend without any more incidents or anything else unusual occurring. I had forgotten all about this when one day the following April I was watching an old episode of the television series “In Search Of” that was about the search for Bigfoot.  During this episode they talked about a particular bigfoot researcher.   For fun I went on the internet to see if this researcher was still around as this episode was 20 years old at least.  This is when I found the BFRO website and looked for sightings in Michigan.  When I found the report of the hunters being harassed in the fall of 1985 in the same area we had been in it all came rushing back to me.  Since then I found and downloaded a sound file from another website of a vocalization recording in Klamath, California.  I sent this to my brother–in-law and he agreed that this was very similar to what we had heard although what we had heard was deeper in pitch. I have thought about submitting this report a number of times since then but for whatever reason haven’t.  Now that deer season is quickly approaching I have been thinking about the incident more.  I still don’t know what it was that we heard but it certainly wasn’t anything I have ever heard before or after.  It was eerie at first returning to the location with this new found thought in my head but in the years since I have not had any additional experiences although I would like to get another chance to prove to myself that it wasn’t all a dream.",
  "classification": "Class B",
  "county": "Alcona",
  "state": "Michigan",
  "location": "-83.62335,44.62",
  "location_details": "Approximately 1 mile west of Stout Road and 1/2 mile south of M-72"
}